[source::...sentinelone_ta*.log*]
sourcetype = sentineloneta:log

[activity]
EVAL-vendor_product = "SentinelOne"
KV_MODE = json
LOOKUP-activity_type = activities_list activity_type OUTPUT action AS activity_desc
MAX_TIMESTAMP_LOOKAHEAD = 100
NO_BINARY_CHECK = 1
SHOULD_LINEMERGE = 0
TIME_FORMAT = "%Y-%m-%dT%H:%M:%S.%6NZ"
category = structured

[agent]
EVAL-cpu_mhz = case(substr(cpuHz,-3,1)="G",tonumber(replace(cpuHz,"(GHz)", ""))*1000,substr(cpuHz,-3,1)="M",tonumber(replace(cpuHz,"(MHz)", "")),1=1,cpuHz)
EVAL-description = "SentinelOne Agents"
EVAL-dest = if(isnull(dest),dest_name,dest)
EVAL-ip = mvsort(mvdedup(mvappend(inet,inet6)))
EVAL-os = 'software_information.os_name'."; ".'software_information.os_revision'
EVAL-vendor_product = "SentinelOne"
FIELDALIAS-s1_agent = "network_information.interfaces{}.name" as interface "network_information.interfaces{}.physical" as mac "network_information.interfaces{}.inet{}" as inet "network_information.interfaces{}.inet6{}" as inet6 "network_information.computer_name" as dest_name  is_active as enabled agent_version as version "hardware_information.total_memory" as mem "hardware_information.cpu_count" as cpu_count "hardware_information.core_count" as cpu_cores "hardware_information.cpu_id" as cpu_id uuid AS serial "software_information.os_start_time" as time_os_start "users{}.sid" as user_id "software_information.os_arch" as family network_status as status
KV_MODE = json
MAX_TIMESTAMP_LOOKAHEAD = 100
NO_BINARY_CHECK = 1
SHOULD_LINEMERGE = 0
TIME_FORMAT = "%Y-%m-%dT%H:%M:%S.%6NZ"
category = structured

[group]
EVAL-vendor_product = "SentinelOne"
KV_MODE = json
MAX_TIMESTAMP_LOOKAHEAD = 100
NO_BINARY_CHECK = 1
SHOULD_LINEMERGE = 0
TIME_FORMAT = "%Y-%m-%dT%H:%M:%S.%6NZ"
category = structured

[policy]
EVAL-vendor_product = "SentinelOne"
KV_MODE = json
MAX_TIMESTAMP_LOOKAHEAD = 100
NO_BINARY_CHECK = 1
SHOULD_LINEMERGE = 0
TIME_FORMAT = "%Y-%m-%dT%H:%M:%S.%6NZ"
category = structured

[threat]
EVAL-action = case(marked_as_benign="true" ,"allowed",(mitigation_status="1" OR mitigation_status="5" OR mitigation_status="4" OR mitigation_status="3") AND resolved="true", "allowed", mitigation_status="0" OR mitigation_status="2", "blocked")
EVAL-classifier_name = if(classifier_name="null","LOGIC",classifier_name)
EVAL-sender = if(isnull(sender),"NA",sender)
EVAL-src_category = if(isnull(src_category), "Unknown", src_category)
EVAL-src_priority = if(isnull(src_priority), "Unknown", src_priority)
EVAL-url = "https://".console."/v2/analyze/threats/".id."/overview"
EVAL-vendor_product = "SentinelOne"
FIELDALIAS-s1_signature = "file_id.content_hash" as signature
FIELDALIAS-s1_threat_agent_version = agent_version as product_version
FIELDALIAS-s1_threat_file_details = "file_id.content_hash" AS file_hash "file_id.display_name" AS file_name "file_id.path" AS file_path "file_id.content_hash" as signature
FIELDALIAS-s1_threat_src_category = classifier_name AS src_category
KV_MODE = json
LOOKUP-dest = agents_list id as agent OUTPUT dest_name as dest dest_name as src
LOOKUP-dest_nt_domain = agents_list id as agent OUTPUT domain as dest_nt_domain domain as src_bunit
LOOKUP-mitigation_name = mitigation_status mitigation_status OUTPUT mitigation_name
MAX_TIMESTAMP_LOOKAHEAD = 100
NO_BINARY_CHECK = 1
SHOULD_LINEMERGE = 0
TIME_FORMAT = "%Y-%m-%dT%H:%M:%S.%6NZ"

