[hash_list_update]
action.email.show_password = 1
dispatch.earliest_time = -24h
dispatch.latest_time = now
schedule_window = 5
search = `tego_append_lookup(hash,100000)`
disabled = 1
cron_schedule = 2-59/5 * * * *
enableSched = 1

[url_list_update]
action.email.show_password = 1
dispatch.earliest_time = -24h
dispatch.latest_time = now
schedule_window = 5
search = `tego_append_lookup(url,100000)`
disabled = 1
cron_schedule = 4-59/5 * * * *
enableSched = 1

[ip_list_update]
action.email.show_password = 1
dispatch.earliest_time = -24h
dispatch.latest_time = now
schedule_window = 5
search = `tego_append_lookup(ip,100000)`
disabled = 1
cron_schedule = 3-59/5 * * * *
enableSched = 1

[domain_list_update]
action.email.show_password = 1
dispatch.earliest_time = -24h
dispatch.latest_time = now
search = `tego_append_lookup(domain,100000)`
disabled = 1
cron_schedule = 1-59/5 * * * *
enableSched = 1

[Tego List Reset]
action.email.show_password = 1
action.email.useNSSubject = 1
alert.track = 0
dispatch.earliest_time = 0
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","dest_ip","hash","url"]
display.general.type = statistics
display.page.search.mode = fast
display.page.search.tab = statistics
display.visualizations.charting.chart = line
display.visualizations.show = 0
request.ui_dispatch_app = tegoguardian
request.ui_dispatch_view = search
search = `tego_threat_list` \
| stats earliest(_time) AS earliest_indexed_threat by type\
| append [ | makeresults | eval type=split("domain,ip,url,hash",",") | mvexpand type ]\
| fillnull value=0\
| stats earliest(_time) AS earliest_indexed_threat by type\
| eval earliest=now(), lastrun=0\
| search type!=@missed\
| eval search_name="Tego Lookback Reset"\
| `collect_lookback`\
| map search="`reset_lookup($type$)`"


[Tego Hits Summary]
action.email.show_password = 1
action.email.useNSSubject = 1
alert.track = 0
cron_schedule = */2 * * * *
description = Scans incoming raw data in configured indexes for threats in the database.
disabled = 1
dispatch.earliest_time = -1h
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","dest_ip","hash","url","index","@lookup_field","url_lookup_field","type","threat_url","token","riskLevel","orig_host","orig_index","SPI","skullid","version","raw_count","tego_summary_hit_exists"]
display.general.timeRangePicker.show = 0
display.page.search.mode = verbose
display.visualizations.chartHeight = 787
display.visualizations.charting.chart = line
display.visualizations.show = 0
enableSched = 1
request.ui_dispatch_app = tegoguardian
request.ui_dispatch_view = search
search = ( ( `tego_index_list` ) OR ( `tego_summary_hits` ) ) (`tego_hits_lookback_lag_overlap(3600)`)\
| `tego_summary_spl_meta(0,$name$,otherfield)`\
| stats earliest(_time) AS earliest_event_time latest(_time) AS latest_event_time count as eventcount \
| eval search_name_explicit="Tego Hits Summary" \
| eval search_type="normal" \
| stats values(*) AS *\
| eval _time=now() \
| fillnull value=0 eventcount \
| eval joinfield=1\
| join type=left joinfield [ | `tego_get_threat_list_stats` | eval type_count=type.":".count\
| stats values(type_count) AS type_count\
| eval threat_db_count=mvjoin(type_count,",")\
| table threat_db_count | eval joinfield=1 ]\
| fields - joinfield\
| collect `tego_index` marker="version=`tego_summary_version`"


[Tego Hits Summary - Backfill Steps]
action.email.show_password = 1
action.email.useNSSubject = 1
alert.track = 0
cron_schedule = 1-59/5 * * * *
description = Rescans raw data in incremental steps back in time based on current threat database and Splunk search time field configuration.  Backfill to dates are automatically populated based on new first seen dates or can be manually reset using the Tego Summary Backfill - X Day Reset searches.
disabled = 1
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","dest_ip","hash","url","index","@lookup_field","url_lookup_field","type","threat_url","token","riskLevel","orig_host","orig_index","SPI","skullid","version","raw_count","tego_summary_hit_exists","orig_source","orig_sourcetype","raw_time_hash_count","Asset"]
display.general.timeRangePicker.show = 0
display.general.type = statistics
display.page.search.mode = fast
display.page.search.tab = statistics
display.visualizations.chartHeight = 787
display.visualizations.charting.chart = line
display.visualizations.show = 0
enableSched = 1
request.ui_dispatch_app = tegoguardian
request.ui_dispatch_view = search
search = ( ( `tego_index_list` ) OR ( `tego_summary_hits` ) )\
    [ | `tego_hits_summary_backfill_earliest_latest` \
    | rename *_lookup AS * \
    | table earliest latest ] ``` last number is span in hours per run ``` \
| `tego_summary_spl_meta(0,$name$,otherfield)`\
| stats earliest(_time) AS earliest_event_time latest(_time) AS latest_event_time count as eventcount \
| inputlookup append=t tego_summary_backfill_current_state.csv  \
| eval search_name_explicit="$name$" \
| eval search_type="main" \
| stats values(*) AS *\
| eval _time=now() \
| rename backfill_number_of_days AS backfill_number_of_days_runtime starting_span_hours AS starting_span_hours_runtime\
| fillnull value=0 eventcount\
| eval joinfield=1\
| join type=left joinfield [ | `tego_get_threat_list_stats` | eval type_count=type.":".count\
| stats values(type_count) AS type_count\
| eval threat_db_count=mvjoin(type_count,",")\
| table threat_db_count | eval joinfield=1 ]\
| fields - joinfield\
| collect `tego_index` marker="version=`tego_summary_version`"


[Tego Hits Summary - Backfill Reset Based on New Threats]
action.email.show_password = 1
action.email.useNSSubject = 1
alert.track = 0
cron_schedule = */15 * * * *
description = Robust backfill reset. Watches for newly arrived threats in the threat feed that were first seen in the past. Resets backfill to earliest first seen date so your raw data is scanned back to when the threat was recognized. Will only reset when state of previous run is complete.
disabled = 1
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","dest_ip","hash","url","index","@lookup_field","url_lookup_field","type","threat_url","token","riskLevel","orig_host","orig_index","SPI","skullid","version","raw_count","tego_summary_hit_exists","orig_source","orig_sourcetype","raw_time_hash_count","Asset","server_ip","client_ip","src_ip","src_translated_ip","dest_translated_ip","firstSeen_epoch_new","firstSeen_epoch","firstSeen"]
display.general.timeRangePicker.show = 0
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.chartHeight = 787
display.visualizations.charting.chart = line
display.visualizations.show = 0
display.visualizations.type = mapping
enableSched = 1
request.ui_dispatch_app = tegoguardian
request.ui_dispatch_view = search
search = | tstats count min(firstSeen_epoch) AS firstSeen_epoch min(firstEnrichedOn_epoch) AS firstEnrichedOn_epoch values(firstSeen) AS firstSeen values(firstEnrichedOn) AS firstEnrichedOn where `tego_threat_list` \
        [| inputlookup tego_summary_backfill_current_run.csv \
        | table run_start_time \
        | rename run_start_time AS earliest \
        | eval earliest=coalesce(earliest,(now()-(7*60*60*24))) ] by token _time span=1s \
    | foreach *_epoch \
        [ eval <<FIELD>>_readable=strftime('<<FIELD>>',"%Y-%m-%d %H:%M:%S") ]\
| addinfo\
| eval firstSeen_keep_epoch=if(firstEnrichedOn_epoch>info_min_time,firstSeen_epoch, null())\
| stats count min(*_epoch) AS *_epoch values(info_*) AS info_*\
| foreach *_time *_epoch\
        [ eval <<FIELD>>_readable=strftime('<<FIELD>>',"%Y-%m-%d %H:%M:%S") ]\
| append  [ | makeresults \
| inputlookup append=t tego_summary_backfill_current_run.csv \
| lookup tego_summary_backfill_current_state.csv run_start_time \
| stats latest(_time) AS _time values(*) AS * \
| eval state=case(earliest_lookup<latest_lookup and earliest_lookup>backfill_to,"in_progress", earliest_lookup=latest_lookup and earliest_lookup=backfill_to,"complete", isnull(earliest_lookup) or isnull(run_start_time) or isnull(latest_lookup), "limbo",true(),"missed") \
| eval joinfield=1 ]\
| stats latest(_time) AS _time values(*) AS *\
| eval backfill_to_new_readable=firstSeen_keep_epoch_readable\
| eval backfill_to_new=firstSeen_keep_epoch\
| eval days_back_new_calc=if((now()-backfill_to_new)/(60*60*24)<`tego_reset_max_backfill_days`,(now()-backfill_to_new)/(60*60*24),`tego_reset_max_backfill_days`) ```backfill is capped by tego_reset_max_backfill_days macro```\
| eval days_back_new=coalesce(days_back_new_calc,null()) ```new logic OR number of days in quotes```\
| table run_start_time_readable state days_back_new backfill_to_new* backfill_to* *epoch_readable *\
```Conditional outputlookup```\
| appendpipe \
    [ where state="complete" and days_back_new>(1/24) ```newer than 1 hour OR 0.0416 days```\
    | eval run_start_time=now() \
    | eval backfill_number_of_days=days_back_new \
    | eval backfill_to=run_start_time-(backfill_number_of_days*(60*60*24)) \
    | eval starting_span_hours=`tego_backfill_span_hours` \
    | table run_start_time backfill_number_of_days backfill_to starting_span_hours \
    | outputlookup override_if_empty=f tego_summary_backfill_current_run.csv ]

[Tego Summary Backfill - 30 Day Reset]
action.email.show_password = 1
action.email.useNSSubject = 1
alert.track = 0
description = Running this report will reset the Tego Hits Summary - Backfill Steps search to backfill to X days before now and a span of Y hours according to this search: | `tego_summary_backfill_restart(X,Y)`
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","dest_ip","hash","url","index","@lookup_field","url_lookup_field","type","threat_url","token","riskLevel","orig_host","orig_index","SPI","skullid","version","raw_count","tego_summary_hit_exists","orig_source","orig_sourcetype","raw_time_hash_count","Asset","server_ip","client_ip","src_ip","src_translated_ip","dest_translated_ip"]
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.chartHeight = 787
display.visualizations.show = 0
request.ui_dispatch_app = tegoguardian
request.ui_dispatch_view = search
search = | makeresults\
| eval span_hours=`tego_backfill_span_hours`\
| `tego_summary_backfill_restart(30,span_hours)`\
| foreach backfill_to run_start_time [ eval <<FIELD>>_readable=strftime('<<FIELD>>',"%Y-%m-%d %H:%M:%S") ]\
| table run_start_time_readable backfill_number_of_days backfill_to_readable starting_span_hours *\
| outputlookup override_if_empty=f tego_summary_backfill_current_run.csv\
| fields - starting_span_hours backfill_number_of_days *readable backfill_to\
| eval earliest_lookup=now(), latest_lookup=now(), last_run_time=now()\
| outputlookup tego_summary_backfill_current_state.csv

[Tego Summary Backfill - 90 Day Reset]
action.email.show_password = 1
action.email.useNSSubject = 1
alert.track = 0
description = Running this report will reset the Tego Hits Summary - Backfill Steps search to backfill to X days before now and a span of Y hours according to this search: | `tego_summary_backfill_restart(X,Y)`
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","dest_ip","hash","url","index","@lookup_field","url_lookup_field","type","threat_url","token","riskLevel","orig_host","orig_index","SPI","skullid","version","raw_count","tego_summary_hit_exists","orig_source","orig_sourcetype","raw_time_hash_count","Asset","server_ip","client_ip","src_ip","src_translated_ip","dest_translated_ip"]
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.chartHeight = 787
display.visualizations.show = 0
request.ui_dispatch_app = tegoguardian
request.ui_dispatch_view = search
search = | makeresults\
| eval span_hours=`tego_backfill_span_hours`\
| `tego_summary_backfill_restart(90,span_hours)`\
| foreach backfill_to run_start_time [ eval <<FIELD>>_readable=strftime('<<FIELD>>',"%Y-%m-%d %H:%M:%S") ]\
| table run_start_time_readable backfill_number_of_days backfill_to_readable starting_span_hours *\
| outputlookup override_if_empty=f tego_summary_backfill_current_run.csv\
| fields - starting_span_hours backfill_number_of_days *readable backfill_to\
| eval earliest_lookup=now(), latest_lookup=now(), last_run_time=now()\
| outputlookup tego_summary_backfill_current_state.csv

[Tego Summary Backfill - 180 Day Reset]
action.email.show_password = 1
action.email.useNSSubject = 1
alert.track = 0
description = Running this report will reset the Tego Hits Summary - Backfill Steps search to backfill to X days before now and a span of Y hours according to this search.
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","dest_ip","hash","url","index","@lookup_field","url_lookup_field","type","threat_url","token","riskLevel","orig_host","orig_index","SPI","skullid","version","raw_count","tego_summary_hit_exists","orig_source","orig_sourcetype","raw_time_hash_count","Asset","server_ip","client_ip","src_ip","src_translated_ip","dest_translated_ip"]
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.chartHeight = 787
display.visualizations.show = 0
request.ui_dispatch_app = tegoguardian
request.ui_dispatch_view = search
search = | makeresults\
| eval span_hours=`tego_backfill_span_hours`\
| `tego_summary_backfill_restart(180,span_hours)`\
| foreach backfill_to run_start_time [ eval <<FIELD>>_readable=strftime('<<FIELD>>',"%Y-%m-%d %H:%M:%S") ]\
| table run_start_time_readable backfill_number_of_days backfill_to_readable starting_span_hours *\
| outputlookup override_if_empty=f tego_summary_backfill_current_run.csv\
| fields - starting_span_hours backfill_number_of_days *readable backfill_to\
| eval earliest_lookup=now(), latest_lookup=now(), last_run_time=now()\
| outputlookup tego_summary_backfill_current_state.csv
