[netfort_idx]
definition = eventtype=netfort_idx

[netfort_api]
definition = eventtype=netfort_api

[netfort_error]
definition = eventtype=netfort_error

[netfort_os]
definition = eventtype=netfort_os

[netfort_user_agent]
definition = eventtype=netfort_user_agent

[netfort_user_inventory]
definition = eventtype=netfort_user_info_inventory

[netfort_user_logins]
definition = eventtype=netfort_user_login

[netfort_ip_flows]
definition = eventtype=netfort_ip_flows

[netfort_ids]
definition = eventtype=netfort_ids

[netfort_dns_mx]
definition = eventtype=netfort_dns_mx

[netfort_netscans]
definition = eventtype=netfort_netscans

[netfort_portscans]
definition = eventtype=netfort_portscan

[netfort_scan_events]
definition = eventtype=netfort_netscans OR eventtype=netfort_portscan

[netfort_smtp]
definition = eventtype=netfort_smtp

[netfort_web_access]
definition = eventtype=netfort_web_access

[netfort_proxy_flows]
definition = eventtype=netfort_proxy_flow

[netfort_windows_fs]
definition = eventtype=netfort_windows_fileshare

[netfort_nfs]
definition = eventtype=netfort_nfs

[netfort_error_panel_base]
definition = `netfort_error` | table *

[netfort_configured_inputs(1)]
args = fieldlist
#definition = rest /services/data/inputs/languardian splunk_server=local | stats count by $fieldlist$
definition = eventtype=netfort_idx NOT eventtype=netfort_error | stats count by $fieldlist$

[netfort_mc_health_check_api]
definition = eventtype=netfort_error | eval is_recent = now() - (3600 * 24 * 5), is_recent = if(_time > is_recent,"true", "false")| search is_recent="true" NOT ( action="no_report_data" ) | stats count AS total_failures, latest(message) as message values(is_recent) as ir values(_time) as time by host | eval severity_level = case(total_failures == 0, 0, total_failures > 0, 3)| rename host AS instance | fields instance total_failures message severity_level

[netfort_mc_health_check_data_not_found]
definition = eventtype=netfort_error | eval is_recent = now() - (3600 * 24 * 5), is_recent = if(_time > is_recent,"true", "false")| search is_recent="true" action="no_report_data" | stats count as total_failures by instance message severity_level

[netfort_last_checkpoint]
definition = `netfort_api` | stats latest(timestamp) by host netfort_event_type | convert timeformat="%m/%d/%Y %H:%M:%S" ctime(latest(timestamp)) AS checkpoint_time | rename checkpoint_time AS "Checkpoint Time" netfort_event_type AS "Report ID" | table host, "Report ID", "Checkpoint Time"

[netfort_last_5_checkpoints_by_event_type(2)]
args = selected_source, selected_event_type
definition = `netfort_api` source="$selected_source$" netfort_event_type="$selected_event_type$" | head 5 | convert timeformat="%m/%d/%Y %H:%M:%S" ctime(timestamp) AS checkpoint_time | eval Source_Input= source | rename checkpoint_time AS "Checkpoint Time" netfort_event_type AS "Report ID" total_events AS "Total Events" | table "Checkpoint Time", Source_Input, "Report ID", "Total Events"

[netfort_user_agent_inputs(1)]
args = selected_source
definition = `netfort_user_agent` source="$selected_source$"

[netfort_user_inventory_inputs(1)]
args = selected_source
definition = `netfort_user_inventory` source="$selected_source$"

[netfort_ip_flows_inputs(1)]
args = selected_source
definition = `netfort_ip_flows` source="$selected_source$"

[netfort_os_inputs(1)]
args = selected_source
definition = `netfort_os` source="$selected_source$"

[netfort_ids_inputs(1)]
args = selected_source
definition = `netfort_ids` source="$selected_source$" | lookup port_list_lookup port AS dest_port OUTPUT port_description

[netfort_network_events_inputs(1)]
args = selected_source
definition = `netfort_idx` signature=* source="$selected_source$"

[netfort_netscans_inputs(1)]
args = selected_source
definition = `netfort_netscans` source="$selected_source$"

[netfort_portscans_inputs(1)]
args = selected_source
definition = `netfort_portscans` source="$selected_source$"

[netfort_smtp_inputs(1)]
args = selected_source
definition = `netfort_smtp` source="$selected_source$"

[netfort_smtp_mismatched_links(1)]
args = selected_source
definition = `netfort_smtp` source="$selected_source$" "Has misdescribed Hyperlinks"=1

[netfort_web_access_inputs(1)]
args = selected_source
definition = `netfort_web_access` source="$selected_source$" | table *

[netfort_proxy_flows_inputs(1)]
args = selected_source
definition = `netfort_proxy_flows` source="$selected_source$" | table *

[netfort_windows_fs_inputs(1)]
args = selected_source
definition = `netfort_windows_fs` source="$selected_source$"

[netfort_nfs_inputs(1)]
args = selected_source
definition = `netfort_nfs` source="$selected_source$"

[netfort_dhcp_inputs(1)]
args = selected_source
definition = `netfort_ip_flows` source="$selected_source$" app="*DHCP*" | table timestamp,src_ip,dest_ip,dest_port,total_bytes,total_MB,Sensor

[netfort_dns_inputs(1)]
args = selected_source
definition = `netfort_ip_flows` source="$selected_source$" app="*DHCP*" | table timestamp,src_ip,dest_ip,dest_port,total_bytes,total_MB,Sensor

[netfort_user_login_inputs(1)]
args = selected_source
definition = `netfort_user_logins` source="$selected_source$"

[netfort_scan_details_inputs(1)]
args = selected_source
definition = `netfort_scan_events` source="$selected_source$"