
[ServiceNow Coalesce Asset Details]
disabled = 0
enableSched = 1
description = Search that consolidates basic asset information for all asset types into one KV.
cron_schedule = 0 1 * * *
search = | inputlookup servicenow_asset_details \
| lookup servicenow_asset_forwarder_details host OUTPUTNEW hostIp, guid, fwdType, fwdVersion, fwdTime, OS \
| lookup servicenow_asset_linux_hardware_details host OUTPUTNEW processorName, numberOfCores, clockSpeedMHz \
| lookup servicenow_asset_win_bios_details host OUTPUTNEW hostSerialNumber \
| lookup servicenow_asset_win_computer_details host OUTPUTNEW hostManufacturer, hostModelName, hostType, hostStatus \
| lookup servicenow_asset_linux_interface_details host OUTPUTNEW networkAdapterDiscription \
| lookup servicenow_asset_win_net_adapter_details host OUTPUTNEW networkAdapterDiscription \
| lookup servicenow_asset_win_os_details host OUTPUTNEW OS as OSNameAddon, OSArchitecture, OSVersion, OSBuidNumber \
| lookup servicenow_asset_win_processor_details host OUTPUTNEW processorName, numberOfCores, clockSpeedMHz, numberOfProcessors, processorManufacturer, processorArchitecture \
| lookup servicenow_asset_linux_os_details host OUTPUTNEW OS as OSNameAddon, OSArchitecture, OSVersion, OSServicePack, OSFamily \
| lookup servicenow_asset_linux_open_ports host OUTPUTNEW openPortsData \
| lookup servicenow_asset_win_open_ports host OUTPUTNEW openPortsData \
| lookup servicenow_asset_linux_disks host OUTPUTNEW diskData \
| lookup servicenow_asset_win_disks host OUTPUTNEW diskData \
| eval OS=if(isnull(OSNameAddon), OS, OSNameAddon) \
| stats values(hostIp) as hostIp, values(processorName) as processorName, values(numberOfCores) as numberOfCores, values(clockSpeedMHz) as clockSpeedMHz, values(processorArchitecture) as processorArchitecture, values(OSFamily) as OSFamily, values(OS) as OS, values(OSArchitecture) as OSArchitecture, latest(OSVersion) as OSVersion, values(hostSerialNumber) as hostSerialNumber, values(OSBuidNumber) as OSBuidNumber, latest(OSServicePack) as OSServicePack, values(processorManufacturer) as processorManufacturer, values(numberOfProcessors) as numberOfProcessors, values(hostManufacturer) as hostManufacturer, values(hostModelName) as hostModelName, values(hostType) as hostType, values(hostStatus) as hostStatus, values(networkAdapterDiscription) as networkAdapterDiscription, values(guid) as guid, values(fwdType) as fwdType, values(fwdVersion) as fwdVersion, values(fwdTime) as fwdTime, values(openPortsData) as openPortsData, values(diskData) as diskData, values(logonTime) as logonTime by host \
| outputlookup servicenow_coalesced_asset_details \

[ServiceNow Coalesce Asset Process Details]
disabled = 0
enableSched = 1
description = Search that consolidates process information across all asset types into one KV.
cron_schedule = 10 1 * * *
search = | inputlookup servicenow_asset_details \
| lookup servicenow_asset_linux_processes host OUTPUTNEW processData \
| lookup servicenow_asset_win_processes host OUTPUTNEW processData \
| stats values(processData) as processData by host \
| outputlookup servicenow_coalesced_asset_process_details \

[ServiceNow Coalesce Asset Service Details]
disabled = 0
enableSched = 1
description = Search that consolidates service information across all asset types into one KV.
cron_schedule = 15 1 * * *
search = | inputlookup servicenow_asset_details \
| lookup servicenow_asset_linux_services host OUTPUTNEW serviceData \
| lookup servicenow_asset_win_services host OUTPUTNEW serviceData \
| stats values(serviceData) as serviceData by host \
| outputlookup servicenow_coalesced_asset_service_details \

[ServiceNow Coalesce Asset Software Details]
disabled = 0
enableSched = 1
description = Search that consolidates software information across all asset types into one KV.
cron_schedule = 15 1 * * *
search = | inputlookup servicenow_asset_details \
| lookup servicenow_asset_linux_packages host OUTPUTNEW softwareData \
| lookup servicenow_asset_win_softwares host OUTPUTNEW softwareData \
| stats values(softwareData) as softwareData by host \
| outputlookup servicenow_coalesced_asset_software_details \

[ServiceNow Populate Basic Asset Details]
disabled = 0
enableSched = 1
description = Captures all the hosts in the instance.
cron_schedule = 0 2 * * *
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
search = `servicenow_asset_index_macro` \
| dedup host | table host \
| lookup servicenow_linux_asset_logon_details host OUTPUTNEW logonTime \
| lookup servicenow_win_asset_logon_details host OUTPUTNEW logonTime \
| outputlookup servicenow_asset_details \

[ServiceNow Populate Forwarder Details]
disabled = 0
enableSched = 1
description = Captures splunk forwarder details like guid, version, etc for each asset.
cron_schedule = 0 3 * * *
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
search = `servicenow_asset_index_macro` group=tcpin_connections (connectionType=cooked OR connectionType=cookedSSL) fwdType=* guid=* \
| dedup hostname, guid \
| eval host=hostname, fwdType = case(fwdType == "full", "Heavy Forwarder", fwdType == "uf", "Universal Forwarder", fwdType == "lwf", "Light Forwarder", true(), fwdType) \
| stats latest(sourceIp) as hostIp, latest(guid) as guid, latest(fwdType) as fwdType, latest(version) as fwdVersion, latest(_time) as fwdTime, latest(os) as OS  by host \
| outputlookup servicenow_asset_forwarder_details \

[ServiceNow Populate Linux Interface Details]
disabled = 0
enableSched = 1
description = Captures network interface details for linux assets.
cron_schedule = 0 3 * * *
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
search = `servicenow_asset_linux_index_macro` source="interfaces" sourcetype="interfaces" \
| dedup host, MAC, Name \
| eval network_adapter_data=MAC."_@_".Name \
| stats values(network_adapter_data) as networkAdapterDiscription by host \
| outputlookup servicenow_asset_linux_interface_details \

[ServiceNow Populate Linux OS Details]
disabled = 0
enableSched = 1
description = Captures OS details of linux hosts.
cron_schedule = 10 3 * * *
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
search = `servicenow_asset_linux_index_macro` source="Unix:Version" sourcetype="Unix:Version" \
| stats latest(os_name) as OS, latest(machine_architecture_name) as OSArchitecture, latest(os_version) as OSVersion, latest(os_release) as OSServicePack, latest(family) as OSFamily by host \
| outputlookup servicenow_asset_linux_os_details \

[ServiceNow Populate Linux Hardware Details]
disabled = 0
enableSched = 1
description = Captures hardware details like number of cores, cpu power, etc for linux hosts.
cron_schedule = 10 3 * * *
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
search = `servicenow_asset_linux_index_macro` source="hardware" sourcetype="hardware" \
| stats latest(cpu_type) as processorName, latest(cpu_cores) as numberOfCores, latest(cpu_mhz) as clockSpeedMHz by host \
| outputlookup servicenow_asset_linux_hardware_details \

[ServiceNow Populate Linux Software Details]
disabled = 0
enableSched = 1
description = Captures software details of linux hosts.
cron_schedule = 15 3 * * *
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
search = `servicenow_asset_linux_index_macro` source="package" sourcetype="package" \
| dedup host, NAME, VERSION, RELEASE, VENDOR \
| eval softwareData=NAME."_@_".VERSION."_@_".RELEASE."_@_".VENDOR \
| stats values(softwareData) as softwareData by host \
| outputlookup servicenow_asset_linux_packages \

[ServiceNow Populate Linux Open Port Details]
disabled = 0
enableSched = 1
description = Captures open ports of linux hosts.
cron_schedule = 15 3 * * *
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
search = `servicenow_asset_linux_index_macro` source="openPorts" sourcetype="openPorts" \
| dedup host, Port, Proto \
| eval openPortsData=Port."_@_".Proto \
| stats values(openPortsData) as openPortsData by host \
| outputlookup servicenow_asset_linux_open_ports \

[ServiceNow Populate Linux Service Details]
disabled = 0
enableSched = 1
description = Captures service related data for linux hosts.
cron_schedule = 15 3 * * *
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
search = `servicenow_asset_linux_index_macro` source="Unix:Service" sourcetype="Unix:Service" \
| dedup host, service_name \
| eval serviceData=service_name."_@_".DESCRIPTION."_@_".start_mode."_@_".status \
| stats values(serviceData) as serviceData by host \
| outputlookup servicenow_asset_linux_services \

[ServiceNow Populate Linux Process Details]
disabled = 0
enableSched = 1
description = Captures process related data of linux hosts.
cron_schedule = 30 3 * * *
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
search = `servicenow_asset_linux_index_macro` source="ps" sourcetype="ps" \
| dedup host, process_name \
| eval processData=process_name."_@_".process_id."_@_".COMMAND."_@_".ARGS."_@_".app \
| stats values(processData) as processData by host \
| outputlookup servicenow_asset_linux_processes \

[ServiceNow Populate Linux Disk Details]
disabled = 0
enableSched = 1
description = Captures disk information of linux hosts.
cron_schedule = 30 3 * * *
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
search = `servicenow_asset_linux_index_macro` source="df" sourcetype="df" \
| dedup host, mount \
| eval diskData=mount."_@_".filesystem_type."_@_".TotalMBytes."_@_".FreeMBytes \
| stats values(diskData) as diskData by host \
| outputlookup servicenow_asset_linux_disks \

[ServiceNow Populate Linux Asset Logon time]
disabled = 0
enableSched = 1
description = Captures logon date time for all the linux hosts.
cron_schedule = 30 3 * * *
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
search = `servicenow_asset_linux_index_macro` source="/var/log/secure" sourcetype="linux_secure"  (user=* OR ruser=*) ("Accepted Publickey" OR "session opened" OR "Accepted password") \
| stats latest(_time) as logonTime by host \
| eval logonTime=strftime(logonTime, "%Y-%m-%d %H:%M:%S") \
| outputlookup servicenow_linux_asset_logon_details \

[ServiceNow Populate Win Net Adapter Details]
disabled = 0
enableSched = 1
description = Captures network adapter details for windows assets.
cron_schedule = 0 4 * * *
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
search = `servicenow_asset_windows_index_macro` source="networkadapter" sourcetype="WinHostMon" \
| eval network_adapter_data=MACAddress."_@_".Name."_@_".Manufacturer \
| stats values(network_adapter_data) as networkAdapterDiscription by host \
| outputlookup servicenow_asset_win_net_adapter_details \

[ServiceNow Populate Win BIOS Details]
disabled = 0
enableSched = 1
description = Captures serial number of windows assets.
cron_schedule = 0 4 * * *
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
search = `servicenow_asset_windows_index_macro` source="Powershell" sourcetype="win:bios" \
| stats values(SerialNumber) as hostSerialNumber by host \
| outputlookup servicenow_asset_win_bios_details \

[ServiceNow Populate Win Processor Details]
disabled = 0
enableSched = 1
description = Captures hardware details like number of cores, cpu power, etc for windows hosts.
cron_schedule = 0 4 * * *
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
search = `servicenow_asset_windows_index_macro` source="processor" sourcetype="WinHostMon" \
| stats latest(Name) as processorName, latest(NumberOfCores) as numberOfCores, latest(ClockSpeedMHz) as clockSpeedMHz, latest(NumberOfProcessors) as numberOfProcessors, latest(Manufacturer) as processorManufacturer, latest(Architecture) as processorArchitecture by host \
| outputlookup servicenow_asset_win_processor_details \

[ServiceNow Populate Win OS Details]
disabled = 0
enableSched = 1
description = Captures OS details of windows hosts.
cron_schedule = 10 4 * * *
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
search = `servicenow_asset_windows_index_macro` source="operatingsystem" sourcetype="WinHostMon" \
| stats latest(OS) as OS, latest(Architecture) as OSArchitecture, latest(Version) as OSVersion, latest(BuildNumber) as OSBuidNumber by host \
| outputlookup servicenow_asset_win_os_details \

[ServiceNow Populate Win Computer Details]
disabled = 0
enableSched = 1
description = Captures host details like manufacturer, model etc for windows hosts.
cron_schedule = 10 4 * * *
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
search = `servicenow_asset_windows_index_macro` source="computer" sourcetype="WinHostMon" \
| stats latest(Manufacturer) as hostManufacturer, latest(Model) as hostModelName, latest(Type) as hostType, latest(Status) as hostStatus by host \
| outputlookup servicenow_asset_win_computer_details \

[ServiceNow Populate Win Service Details]
disabled = 0
enableSched = 1
description = Captures service related data of windows hosts.
cron_schedule = 10 4 * * *
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
search = `servicenow_asset_windows_index_macro` source="service" sourcetype="WinHostMon" \
| dedup host, DisplayName \
| eval serviceData=DisplayName."_@_".Description."_@_".StartMode."_@_".State."_@_".Path \
| stats values(serviceData) as serviceData by host \
| outputlookup servicenow_asset_win_services \

[ServiceNow Populate Win Driver Details]
disabled = 0
enableSched = 1
description = Captures driver details of windows hosts.
cron_schedule = 15 4 * * *
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
search = `servicenow_asset_windows_index_macro` source="driver" sourcetype="WinHostMon" \
| dedup host, DeviceName  \
| eval driverData=DeviceName."_@_".if(isNotNull(DriverVersion), DriverVersion, "")."_@_".if(isNotNull(Description), Description, "")."_@_".if(isNotNull(DriverProviderName), DriverProviderName, "")."_@_".if(isNotNull(Manufacturer), Manufacturer, "") \
| stats values(driverData) as driverData by host \
| outputlookup servicenow_asset_win_drivers \

[ServiceNow Populate Win Process Details]
disabled = 0
enableSched = 1
description = Captures process related data of windows hosts.
cron_schedule = 15 4 * * *
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
search = `servicenow_asset_windows_index_macro` source="process" sourcetype="WinHostMon" \
| dedup host, Name \
| eval processData=Name."_@_".ProcessId."_@_".if(isNotNull(CommandLine), CommandLine, "") \
| stats values(processData) as processData by host \
| outputlookup servicenow_asset_win_processes \

[ServiceNow Populate Win Disk Details]
disabled = 0
enableSched = 1
description = Captures disk details of windows hosts.
cron_schedule = 15 4 * * *
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
search = `servicenow_asset_windows_index_macro` source="disk" sourcetype="WinHostMon" \
| dedup host, Name \
| eval diskData=Name."_@_".FileSystem."_@_".TotalSpaceKB."_@_".FreeSpaceKB \
| stats values(diskData) as diskData by host \
| outputlookup servicenow_asset_win_disks \

[ServiceNow Populate Win Open Port Details]
disabled = 0
enableSched = 1
description = Captures open port details of windows hosts.
cron_schedule = 30 4 * * *
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
search = `servicenow_asset_windows_index_macro` source="C:\\Program Files\\SplunkUniversalForwarder\\etc\\apps\\Splunk_TA_windows\\bin\\win_listening_ports.bat" sourcetype="Script:ListeningPorts" \
| dedup host, dest_port, transport \
| eval openPortsData=dest_port."_@_".transport \
| stats values(openPortsData) as openPortsData by host \
| outputlookup servicenow_asset_win_open_ports \

[ServiceNow Populate Win Software Details]
disabled = 0
enableSched = 1
description = Captures software details of windows hosts.
cron_schedule = 30 4 * * *
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
search = `servicenow_asset_windows_index_macro` source="C:\\Program Files\\SplunkUniversalForwarder\\etc\\apps\\Splunk_TA_windows\\bin\\win_installed_apps.bat" sourcetype="Script:InstalledApps" \
| dedup host, DisplayName \
| eval softwareData=DisplayName."_@_".if(isNotNull(DisplayVersion), DisplayVersion, "")."_@_"."_@_".if(isNotNull(Publisher), Publisher, "")."_@_".if(isNotNull(InstallDate), InstallDate, "")."_@_".if(isNotNull(UninstallString), UninstallString, "") \
| stats values(softwareData) as softwareData by host \
| outputlookup servicenow_asset_win_softwares \

[ServiceNow Populate Win Asset Logon time]
disabled = 0
enableSched = 1
description = Captures logon date time for all the windows hosts.
cron_schedule = 30 4 * * *
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
search = `servicenow_asset_windows_index_macro` source="WinEventLog:Security" sourcetype="WinEventLog" EventCode=4624 \
| stats latest(_time) as logonTime by host \
| eval logonTime=strftime(logonTime, "%Y-%m-%d %H:%M:%S") \
| outputlookup servicenow_win_asset_logon_details \
