###MAIN BEYONDTRUST SOURCETYPE###
[ccx:beyondtrust:json]
KV_MODE = json
NO_BINARY_CHECK = true
SHOULD_LINEMERGE = false
LINE_BREAKER = ([\r\n]+)
disabled = false
pulldown_type = true
TRUNCATE=150000
TRANSFORMS-sourcetype = ccx:beyondtrust:privilegedremoteaccess

##BEYONDTRUST Privileged Remote Access (PRA)##
[ccx:beyondtrust:privilegedremoteaccess]
KV_MODE = json
NO_BINARY_CHECK = true
SHOULD_LINEMERGE = false
LINE_BREAKER = ([\r\n]+)
TRUNCATE=150000
category = Structured
description = CCX BeyondTrust PRA JSON
disabled = false
pulldown_type = true

####################################BeyondTrust product documentation####################################################
##Link to event codes - https://www.beyondtrust.com/docs/privileged-remote-access/documents/integrations/pra-syslog.pdf #
##SRA knowledge - https://www.beyondtrust.com/docs/remote-support/getting-started/deployment/virtual-sra/index.htm      #
#########################################################################################################################

EVAL-user = if(isnotnull(who) AND NOT match(who,"^unknown.*|UNKNOWN"),replace(who,"(.*)\s+\(.*","\1"),null()) 
EVAL-src_user = if(isnotnull(who) AND NOT match(who,"^unknown.*"),replace(who,"(.*)\s+\(.*","\1"),null()) 
EVAL-app = "beyondtrust" 
EVAL-authentication_method = if(event="login" AND match(who,".*\)\s+using\s+"),replace('who',".*\)\s+using\s+",""),null()) 
EVAL-authentication_service = case(event="login" AND match(who,".*gssapi.*"),"Kerberos") 
EVAL-action = if(isnotnull(status) AND status!="" AND event="login",'status',null()) 
EVAL-signature = coalesce('reason','event') 
EVAL-src = 'who_ip' 
EVAL-src_ip = 'who_ip' 
EVAL-dest = 'site' 
EVAL-dest_nt_host = 'site'
EVAL-dest_nt_domain = 'site'
EVAL-object = if(isnotnull('name') AND NOT event IN("login","logout"),'name',if(isnull('name') AND NOT event IN("login","logout"),'event',null()))
EVAL-privileged = if(isnotnull(who) AND event="login" AND match(who,".*using elevate.*"),"true","false") 
EVAL-vendor_product = "BeyondTrust:Privileged Remote Access"

LOOKUP-ccx_beyondtrust_events_lookup = ccx_beyondtrust_events_lookup event OUTPUTNEW action change_type dataset_name trigger AS description type
LOOKUP-ccx_beyondtrust_events_lookup_enriched = ccx_beyondtrust_events_lookup event OUTPUTNEW change_type AS object_category status trigger AS object_attrs

##BeyondInsight Password Safe##
[_json]
TRANSFORMS-ccx_beyondinsight_passwordsafe = set_beyondinsight_passwordsafe

#[source::http:beyondinsight_passwordsafe]
[ccx:beyondinsight:passwordsafe]
INDEXED_EXTRACTIONS = json
KV_MODE = none
LINE_BREAKER = ([\r\n]+)
NO_BINARY_CHECK = true
category = CCX BeyondInsight Passwordsafe HEC JSON
disabled = false
pulldown_type = 1

####################################BeyondTrust BeyondInsight Password Safe########################################################
##Link to operations feature - https://www.beyondtrust.com/docs/beyondinsight-password-safe/documents/bi/bi-ps-authentication.pdf #
###################################################################################################################################

FIELDALIAS-ccx_beyondinsight_passwordsafe_result_id = ChangeReasonCd AS result_id

EVAL-action = case('EventName'=="Login", if(like('SystemName', "%Failure%") OR like('SystemName', "%failure%"), "failure", "success"), 'Category'=="System" AND ObjectType IN("Session") AND RoleUsed IN("Administrators","Requestor"),if(Failed=="0", "allowed", "blocked"), 1==1, 'action')
EVAL-app = case('EventName' IN ("Login"), lower(coalesce(replace('extracted_Source',"^.*?[\.](.*)","\1"),"beyondtrustcloud.com")), ObjectType IN("Session"),lower(replace('Details',"Type=(.*)\s.*","\1")))
EVAL-reason = if(EventName="Login", 'Message',null())
EVAL-signature = case('EventName'=="Login", 'SystemName')
EVAL-src = if('SourceIp'=="-", null(), 'SourceIp')
EVAL-src_ip = if(match('SourceIp', "(?:(?:\d{1,3}\.){3}\d{1,3})"), 'SourceIp', null())
EVAL-user = if(((isnotnull('User') AND 'User'!="-" AND 'User'!="") OR (isnotnull('User Name') AND 'User Name'!="-" AND 'User Name'!="")),coalesce('User Name','User'),null())
EVAL-vendor = "BeyondTrust"
EVAL-vendor_product = "BeyondTrust:BeyondInsight Password Safe"
EVAL-status = case(Failed=="0" OR Result=="S","success",Failed=="1" OR Result=="F","failure")
EVAL-authentication_service = if(EventName IN ("Login"),coalesce('Authenticate Credential Platform',"BeyondInsight:Password Safe"),null())
EVAL-authentication_method = if(EventName="Login" AND SystemName="PMM Login" AND isnull('Authentication Type'),"password",'Authentication Type')
EVAL-user_agent = 'Browser Info'
EVAL-dest = if(EventName="Login" AND isnotnull('extracted_Source'),'extracted_Source',if(NOT EventName="Login" AND isnotnull('IPAddress'),'IPAddress',"beyondtrustcloud.com"))
EVAL-src_user = if(EventName="Managed" AND Category="Change",coalesce('AccountName',null())
EVAL-severity = case(EventSeverity=="0","informational",EventSeverity>"0" AND EventSeverity<="3","low",EventSeverity>"3" AND EventSeverity<="6","medium",EventSeverity>"6" AND EventSeverity<="9","high",EventSeverity>"9","critical")
EVAL-change_type = if(isnotnull('Smart Rule Name'),"rule",if(SystemName IN("User Group - Smart Rule Role"),"group",null()))
EVAL-object = if(SystemName="Smart Rule","Smart Rule",null())
EVAL-object_attrs = if(SystemName="Smart Rule",'Smart Rule Name',null())
EVAL-object_category = if(SystemName="Smart Rule","rule",null())
EVAL-dest_ip = if(NOT EventName="Login" AND isnotnull('IPAddress'),'IPAddress',null())
EVAL-protocol = case(ObjectType IN("Session"),lower(replace('Details',"Type=(.*)\s.*","\1")))
EVAL-dvc = case(ObjectType IN("Session"),lower(replace('Target',"Asset\:(.*)\s.*","\1")))
EVAL-description = if(isnotnull('Description') AND Description!="",'Description',coalesce('Message','Notes'))
EVAL-body = if(isnotnull('Description') AND Description!="",'Description',coalesce('Message','Notes'))
EVAL-file_name = if(isnotnull('FileName') AND FileName!="",'FileName',null())
EVAL-file_hash = if(isnotnull('FileHash') AND FileHash!="",'FileHash',null())
EVAL-command = if(isnotnull('ElevationCommand') AND ElevationCommand!="",'ElevationCommand',null())

LOOKUP-ccx_beyondinsight_password_safe_lookup = ccx_beyondinsight_psafe_eventname_lookup EventName OUTPUTNEW action dataset_name type
LOOKUP-ccx_beyondinsight_password_safe_vendor_result_result = ccx_beyondinsight_psafe_result_lookup result_id OUTPUT object_attrs AS result
LOOKUP-ccx_beyondinsight_password_safe_vendor_result_extended = ccx_beyondinsight_psafe_result_lookup result_id OUTPUTNEW object_attrs object object_category change_type

[source::http:beyondinsight_passwordsafe]
FIELDALIAS-ccx_beyondinsight_passwordsafe_result_id = ChangeReasonCd AS result_id

EVAL-action = case('EventName'=="Login", if(like('SystemName', "%Failure%") OR like('SystemName', "%failure%"), "failure", "success"), 'Category'=="System" AND ObjectType IN("Session") AND RoleUsed IN("Administrators","Requestor"),if(Failed=="0", "allowed", "blocked"), 1==1, 'action')
EVAL-app = case('EventName' IN ("Login"), lower(coalesce(replace('extracted_Source',"^.*?[\.](.*)","\1"),"beyondtrustcloud.com")), ObjectType IN("Session"),lower(replace('Details',"Type=(.*)\s.*","\1")))
EVAL-reason = if(EventName="Login", 'Message',null())
EVAL-signature = case('EventName'=="Login", 'SystemName')
EVAL-src = if('SourceIp'=="-", null(), 'SourceIp')
EVAL-src_ip = if(match('SourceIp', "(?:(?:\d{1,3}\.){3}\d{1,3})"), 'SourceIp', null())
EVAL-user = if(((isnotnull('User') AND 'User'!="-" AND 'User'!="") OR (isnotnull('User Name') AND 'User Name'!="-" AND 'User Name'!="")),coalesce('User Name','User'),null())
EVAL-vendor = "BeyondTrust"
EVAL-vendor_product = "BeyondTrust:BeyondInsight Password Safe"
EVAL-status = case(Failed=="0" OR Result=="S","success",Failed=="1" OR Result=="F","failure")
EVAL-authentication_service = if(EventName IN ("Login"),coalesce('Authenticate Credential Platform',"BeyondInsight Password Safe"),null())
EVAL-authentication_method = if(EventName="Login" AND SystemName="PMM Login" AND isnull('Authentication Type'),"password",'Authentication Type')
EVAL-user_agent = 'Browser Info'
EVAL-dest = if(EventName="Login" AND isnotnull('extracted_Source'),'extracted_Source',if(NOT EventName="Login" AND isnotnull('IPAddress'),'IPAddress',"beyondtrustcloud.com"))
EVAL-src_user = if(EventName="Managed" AND Category="Change",coalesce('AccountName',null())
EVAL-severity = case(EventSeverity=="0","informational",EventSeverity>"0" AND EventSeverity<="3","low",EventSeverity>"3" AND EventSeverity<="6","medium",EventSeverity>"6" AND EventSeverity<="9","high",EventSeverity>"9","critical")
EVAL-change_type = if(isnotnull('Smart Rule Name'),"rule",if(SystemName IN("User Group - Smart Rule Role"),"group",null()))
EVAL-object = if(SystemName="Smart Rule","Smart Rule",null())
EVAL-object_attrs = if(SystemName="Smart Rule",'Smart Rule Name',null())
EVAL-object_category = if(SystemName="Smart Rule","rule",null())
EVAL-dest_ip = if(NOT EventName="Login" AND isnotnull('IPAddress'),'IPAddress',null())
EVAL-protocol = case(ObjectType IN("Session"),lower(replace('Details',"Type=(.*)\s.*","\1")))
EVAL-dvc = case(ObjectType IN("Session"),lower(replace('Target',"Asset\:(.*)\s.*","\1")))
EVAL-description = if(isnotnull('Description') AND Description!="",'Description',coalesce('Message','Notes'))
EVAL-body = if(isnotnull('Description') AND Description!="",'Description',coalesce('Message','Notes'))
EVAL-file_name = if(isnotnull('FileName') AND FileName!="",'FileName',null())
EVAL-file_hash = if(isnotnull('FileHash') AND FileHash!="",'FileHash',null())
EVAL-command = if(isnotnull('ElevationCommand') AND ElevationCommand!="",'ElevationCommand',null())

LOOKUP-ccx_beyondinsight_password_safe_lookup = ccx_beyondinsight_psafe_eventname_lookup EventName OUTPUTNEW action dataset_name type
LOOKUP-ccx_beyondinsight_password_safe_vendor_result_result = ccx_beyondinsight_psafe_result_lookup result_id OUTPUT object_attrs AS result
LOOKUP-ccx_beyondinsight_password_safe_vendor_result_extended = ccx_beyondinsight_psafe_result_lookup result_id OUTPUTNEW object_attrs object object_category change_type

# BeyondTrust Privilege Management Cloud

[CIM]
TRANSFORMS-ccx_beyondtrust_privilegedmanagementcloud = set_beyondtrust_privilegedmanagementcloud

[ccx:beyondtrust:privilegedmanagementcloud]
KV_MODE = json
NO_BINARY_CHECK = true
SHOULD_LINEMERGE = false
LINE_BREAKER = ([\r\n]+)
TRUNCATE=150000
category = Structured
description = CCX BeyondTrust PAM JSON
disabled = false
pulldown_type = true

EVAL-action = case(('Processes.action'=="logon"), "allowed", ((isnotnull('All_Changes.command') AND NOT 'All_Changes.command'=="RecordUserSignIn" AND NOT 'All_Changes.object_category'=="ManagementRule" AND NOT 'All_Changes.object_category'=="Portal")), case(like('All_Changes.action', "%Update%") OR like('All_Changes.action', "%Commit%"), "updated", like('All_Changes.action', "%Edit%") OR like('All_Changes.action', "%Assign%"), "modified", like('All_Changes.action', "%Delete%") OR like('All_Changes.action', "%Purge%") OR like('All_Changes.action', "%Archive%") OR like('All_Changes.action', "%Abort%"), "deleted", like('All_Changes.action', "%Create%"), "created", like('All_Changes.action', "%Retrieve%"), "read", like('All_Changes.command', "%started%"), "started"), (isnotnull('Processes.description') AND NOT Processes.action=="logon"), 'Processes.action')
EVAL-app = case(('All_Changes.object_category'=="Portal"), 'All_Changes.vendor_product', ('Processes.action'=="logon"), 'Processes.vendor_product')
EVAL-body = case(('All_Changes.object_category'=="Portal"), 'All_Changes.command')
EVAL-change_type = case(((isnotnull('All_Changes.command') AND NOT 'All_Changes.command'=="RecordUserSignIn" AND NOT 'All_Changes.object_category'=="ManagementRule" AND NOT 'All_Changes.object_category'=="Portal")), if('All_Changes.object_category'=="User", "AAA", 'All_Changes.object_category'))
EVAL-description = case(('All_Changes.object_category'=="Portal"), 'All_Changes.command')
EVAL-dest = 'Processes.dest'
EVAL-object = case(((isnotnull('All_Changes.command') AND NOT 'All_Changes.command'=="RecordUserSignIn" AND NOT 'All_Changes.object_category'=="ManagementRule" AND NOT 'All_Changes.object_category'=="Portal")), if('All_Changes.object_category'=="User", coalesce('Processes.user', 'All_Changes.user', 'All_Changes.src_user'), 'All_Changes.object_category'))
EVAL-object_category = 'All_Changes.object_category'
EVAL-object_id = 'All_Changes.object_id'
EVAL-parent_process = 'Processes.parent_process'
EVAL-parent_process_exec = if(isnotnull('Processes.parent_process_exec') AND match('Processes.parent_process_exec',"^.*(\.)(\\\|\/).*|.*(\\\|\/).*"),replace('Processes.parent_process_exec',"^.*\.*\/(.*)","\1"),if(isnotnull('Processes.parent_process_exec{}') AND match('Processes.parent_process_exec{}',"^.*(\.)(\\\|\/).*|.*(\\\|\/).*"),replace('Processes.parent_process_exec{}',"^.*\.*\/(.*)","\1"),coalesce('Processes.parent_process_exec','Processes.parent_process_exec{}')))
EVAL-parent_process_id = 'Processes.parent_process_id'
EVAL-process = 'Processes.process'
EVAL-process_exec = if(isnotnull('Processes.process_exec') AND match('Processes.process_exec',"^.*(\.)(\\\|\/).*|.*(\\\|\/).*"),replace('Processes.process_exec',"^.*\.*\/(.*)","\1"),if(isnotnull('Processes.process_exec{}') AND match('Processes.process_exec{}',"^.*(\.)(\\\|\/).*|.*(\\\|\/).*"),replace('Processes.process_exec{}',"^.*\.*\/(.*)","\1"),coalesce('Processes.process_exec','Processes.process_exec{}')))
EVAL-process_hash = 'Processes.process_hash'
EVAL-process_id = 'Processes.process_id'
EVAL-process_name = if(isnotnull('Processes.process_name') AND 'Processes.process_name'!="" AND NOT match('Processes.process_name',".*\s.*"),'Processes.process_name',if(isnotnull('Processes.process_exec') AND match('Processes.process_exec',"^.*(\.)(\\\|\/).*|.*(\\\|\/).*"),replace('Processes.process_exec',"^.*\.*\/(.*)","\1"),if(isnotnull('Processes.process_exec{}') AND match('Processes.process_exec{}',"^.*(\.)(\\\|\/).*|.*(\\\|\/).*"),mvdedup(replace('Processes.process_exec{}',"^.*\.*\/(.*)","\1")),coalesce('Processes.process_exec',mvdedup('Processes.process_exec{}')))))
EVAL-process_path = 'Processes.process_path'
EVAL-reason = case(('Processes.action'=="logon"), 'Processes.action')
EVAL-result = case(((isnotnull('All_Changes.command') AND NOT 'All_Changes.command'=="RecordUserSignIn" AND NOT 'All_Changes.object_category'=="ManagementRule" AND NOT 'All_Changes.object_category'=="Portal")), 'All_Changes.action')
EVAL-signature = case(('All_Changes.object_category'=="Portal"), 'All_Changes.action', ('Processes.action'=="logon"), 'Processes.description')
EVAL-src_user = 'All_Changes.src_user'
EVAL-subject = case(('All_Changes.object_category'=="Portal"), 'All_Changes.command')
EVAL-type = case(('All_Changes.object_category'=="Portal"), "event")
EVAL-user = coalesce('Processes.user', 'All_Changes.user', 'All_Changes.src_user')
EVAL-user_id = 'Processes.user_id'
EVAL-vendor_product = coalesce('Processes.vendor_product', 'All_Changes.vendor_product')


# BeyondTrust Secure Remote Access

[beyondtrust:sra]
KV_MODE = json
LINE_BREAKER = ([\r\n]+)
NO_BINARY_CHECK = true
SHOULD_LINEMERGE = false
TRUNCATE = 150000
category = Structured
description = CCX BeyondTrust Secure Remote Access
disabled = false
pulldown_type = true

EVAL-action = 'status'
EVAL-app = case('event'=="login", "BeyondTrust:Secure Remote Access")
EVAL-signature = case('event'=="login", 'event'." - ".'who')
EVAL-src = case('event'=="login", 'who_ip')
EVAL-src_ip = case('event'=="login", 'who_ip')
EVAL-user = if(match('who', ".+\(([^\)]+)\).+"), replace('who', ".+\(([^\)]+)\).+", "\1"), null())
EVAL-vendor_product = "BeyondTrust:Secure Remote Access"
