[API Expiration Alert]
action.logevent = 1
action.logevent.param.event = Sophos API Expiration
alert.digest_mode = 0
alert.suppress = 0
alert.track = 0
counttype = number of events
cron_schedule = 0 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","action","category","created_at","customer_id","date","date_hour","date_mday","date_minute","date_month","date_second","date_wday","date_year","date_zone","description","dest","endpoint_id","endpoint_type","eventsource","eventtype","group","id","index","linecount","location","name","product","punct","severity","signature","splunk_server","src","src_priority","threat","timeendpos","timestartpos","type","url","url_content","user","user_id","vendor","vendor_product","appCerts","appSha256","core_remedy_items","customer_name","expiration_date","origin","timestamp","when"]
display.general.type = statistics
display.page.search.mode = fast
display.page.search.tab = statistics
display.visualizations.charting.chart = bar
enableSched = 1
quantity = 30
relation = less than
request.ui_dispatch_app = SophosAppForSplunk
request.ui_dispatch_view = search
search = sourcetype=sophos* | dedup customer_name | eval api_end_epoch=strptime(expiration_date,"%m/%d/%y")|eval days_left=round((api_end_epoch-now())/86400,0) | table customer_name  days_left | rename customer_name as "Customer Name" expiration_date as "API Expiration Date" days_left as "Days Left"
