[ioc_default_search_ipv4-addr]
disabled = 0
userid = admin

description = default search ipv4-addr addresses in src_ip and dest_ip fields. Executed every hour plus 10 minutes on the last hour.
search = earliest=@h-1h latest=@h src_ip=* OR dest_ip=* | sort 0 _time|iocsearch map="src_ip:ipv4-addr,dest_ip:ipv4-addr" | search ioc_indicators_count>0 | `parse_ioc_indicators_json`| rename _raw as raw_ | eval orig_event_time=_time | eval orig_event_time_formatted=strftime(_time, "%m/%d/%y %I:%M:%S.%3Q %p") | collect `iocs_detected_sum_index` addtime=false marker="marker=\"ioc_default_search_ipv4-addr\""

enableSched = 1
cron_schedule = 10 * * * *

counttype = number of events
relation = greater than 
quantity = 0

alert.track = 0
alert.digest_mode = False
alert.suppress = 0
action.email.inline = 1
action.rss = 0
auto_summarize.dispatch.earliest_time = -1d@h

[ioc_default_search_ipv6-addr]
disabled = 0
userid = admin

description = default search ipv6-addr addresses in src_ip and dest_ip fields. Executed every hour plus 10 minutes on the last hour.
search = earliest=@h-1h latest=@h src_ip=* OR dest_ip=* | sort 0 _time|iocsearch map="src_ip:ipv6-addr,dest_ip:ipv6-addr" | search ioc_indicators_count>0 | `parse_ioc_indicators_json`| rename _raw as raw_ | eval orig_event_time=_time | eval orig_event_time_formatted=strftime(_time, "%m/%d/%y %I:%M:%S.%3Q %p") | collect `iocs_detected_sum_index` addtime=false marker="marker=\"ioc_default_search_ipv6-addr\""

enableSched = 1
cron_schedule = 10 * * * *

counttype = number of events
relation = greater than 
quantity = 0

alert.track = 0
alert.digest_mode = False
alert.suppress = 0
action.email.inline = 1
action.rss = 0
auto_summarize.dispatch.earliest_time = -1d@h

[ioc_default_search_url]
disabled = 0
userid = admin

description = default search URL in url field. Executed every hour plus 10 minutes on the last hour.
search = earliest=@h-1h latest=@h url=* | sort 0 _time|iocsearch map="url:url" | search ioc_indicators_count>0 | `parse_ioc_indicators_json`| rename _raw as raw_ | eval orig_event_time=_time | eval orig_event_time_formatted=strftime(_time, "%m/%d/%y %I:%M:%S.%3Q %p") | collect `iocs_detected_sum_index` addtime=false marker="marker=\"ioc_default_search_url\""

enableSched = 1
cron_schedule = 10 * * * *

counttype = number of events
relation = greater than 
quantity = 0

alert.track = 0
alert.digest_mode = False
alert.suppress = 0
action.email.inline = 1
action.rss = 0
auto_summarize.dispatch.earliest_time = -1d@h

[ioc_default_search_domain]
disabled = 0
userid = admin

description = default search domain in domain field. Executed every hour plus 10 minutes on the last hour.
search = earliest=@h-1h latest=@h domain=* | sort 0 _time |iocsearch map="domain:domain" | search ioc_indicators_count>0 | `parse_ioc_indicators_json`| rename _raw as raw_ | eval orig_event_time=_time | eval orig_event_time_formatted=strftime(_time, "%m/%d/%y %I:%M:%S.%3Q %p") | collect `iocs_detected_sum_index` addtime=false marker="marker=\"ioc_default_search_domain\""

enableSched = 1
cron_schedule = 10 * * * *

counttype = number of events
relation = greater than 
quantity = 0

alert.track = 0
alert.digest_mode = False
alert.suppress = 0
action.email.inline = 1
action.rss = 0
auto_summarize.dispatch.earliest_time = -1d@h

[ioc_default_search_filename]
disabled = 0
userid = admin

description = default search filename in file_name field. Executed every hour plus 10 minutes on the last hour.
search = earliest=@h-1h latest=@h file_name=* | sort 0 _time|iocsearch map="file_name:filename" | search ioc_indicators_count>0 | `parse_ioc_indicators_json`| rename _raw as raw_ | eval orig_event_time=_time | eval orig_event_time_formatted=strftime(_time, "%m/%d/%y %I:%M:%S.%3Q %p") | collect `iocs_detected_sum_index` addtime=false marker="marker=\"ioc_default_search_filename\""

enableSched = 1
cron_schedule = 10 * * * *

counttype = number of events
relation = greater than 
quantity = 0

alert.track = 0
alert.digest_mode = False
alert.suppress = 0
action.email.inline = 1
action.rss = 0
auto_summarize.dispatch.earliest_time = -1d@h

[ioc_default_search_hash]
disabled = 0
userid = admin

description = default search file_hash in hash field. Executed every hour plus 10 minutes on the last hour.
search = earliest=@h-1h latest=@h file_hash=* | sort 0 _time|iocsearch map="file_hash:hash" | search ioc_indicators_count>0 | `parse_ioc_indicators_json`| rename _raw as raw_ | eval orig_event_time=_time | eval orig_event_time_formatted=strftime(_time, "%m/%d/%y %I:%M:%S.%3Q %p") | collect `iocs_detected_sum_index` addtime=false marker="marker=\"ioc_default_search_hash\""

enableSched = 1
cron_schedule = 10 * * * *

counttype = number of events
relation = greater than 
quantity = 0

alert.track = 0
alert.digest_mode = False
alert.suppress = 0
action.email.inline = 1
action.rss = 0
auto_summarize.dispatch.earliest_time = -1d@h

[Endpoint - Multiple IOCs related to one host - Rule]
action.email.include.results_link = 0
action.email.include.view_link = 0
action.email.reportServerEnabled = 0
action.keyindicator.invert = 0
action.summary_index = 1
action.summary_index._name = notable
action.summary_index.ttl = 1p
alert.suppress = 1
alert.suppress.fields = src_nt_host
alert.suppress.period = 86400
alert.track = 0
counttype = number of events
cron_schedule = */5 * * * *
dispatch.earliest_time = -7d@d
dispatch.latest_time = +5m@m
enableSched = 1
quantity = 0
realtime_schedule = 0
relation = greater than
search = `iocs_detected_sum_index` | stats dc(indicator_value) as unique_indicators values(indicator_value) as indicator_value values(indicator_raw_id) as indicator_raw_id values(indicator_id) as indicator_id values(ioc_raw_id) as ioc_raw_id values(ioc_id) as ioc_id values(user) as user values(src_should_update) as src_should_update values(src_should_timesync) as src_should_timesync values(src_requires_av) as src_requires_av values(src_pci_domain) as src_pci_domain values(eventtype) as eventtype values(tag) as tag values(tag::eventtype) as tag::eventtype values(orig_sourcetype) as orig_sourcetype by src_nt_host | where unique_indicators >1

[Endpoint - Multiple Hosts Related to the Same IOC - Rule]
action.email.reportServerEnabled = 0
action.keyindicator.invert = 0
action.summary_index = 1
action.summary_index._name = notable
action.summary_index.ttl = 1p
alert.suppress = 1
alert.suppress.fields = indicator_value
alert.suppress.period = 86400
alert.track = 0
counttype = number of events
cron_schedule = */5 * * * *
dispatch.earliest_time = -7d@d
dispatch.latest_time = +5m@m
enableSched = 1
quantity = 0
realtime_schedule = 0
relation = greater than
search = `iocs_detected_sum_index` | stats dc(src_nt_host) as unique_hosts values(src_nt_host) as hosts values(indicator_value_type) as indicator_value_type values(indicator_raw_id) as indicator_raw_id values(indicator_id) as indicator_id values(ioc_raw_id) as ioc_raw_id values(ioc_id) as ioc_id values(user) as user values(eventtype) as eventtype values(tag) as tag values(tag::eventtype) as tag::eventtype values(orig_sourcetype) as orig_sourcetype by indicator_value | where unique_hosts >1

