[Default Levels Collection Setup]
action.email.useNSSubject = 1
alert.track = 0
description = Outputs default level csv into KV Store. \
Should be run once during installation.
search = | inputlookup cmmc_default_levels_collection_backup.csv\
| outputlookup cmmc_default_levels\
| append [| inputlookup omb_default_levels_collection_backup.csv\
| outputlookup omb_default_levels]\
| append [| inputlookup rmf_default_levels_collection_backup.csv\
| outputlookup rmf_default_levels]\
| append [| inputlookup fisma_default_levels_collection_backup.csv\
| outputlookup fisma_default_levels]\
| append [| inputlookup dfars_default_levels_collection_backup.csv\
| outputlookup dfars_default_levels]\
| append [| inputlookup ism_default_levels_collection_backup.csv\
| outputlookup ism_default_levels]\
| append [| inputlookup e8_default_levels_collection_backup.csv\
| outputlookup e8_default_levels]\
| append [| inputlookup aescsf_default_levels_collection_backup.csv\
| outputlookup aescsf_default_levels]\
| append [| inputlookup caf_default_levels_collection_backup.csv\
| outputlookup caf_default_levels]

[Domain Family Collection Setup]
action.email.useNSSubject = 1
alert.track = 0
description = Outputs domain family csv into KV Store.\
Should be run once during installation.
search = | inputlookup cmmc_domain_family_collection_backup.csv\
| outputlookup cmmc_domain_family\
| append [| inputlookup omb_domain_family_collection_backup.csv\
| outputlookup omb_domain_family]\
| append [| inputlookup rmf_domain_family_collection_backup.csv\
| outputlookup rmf_domain_family]\
| append [| inputlookup fisma_domain_family_collection_backup.csv\
| outputlookup fisma_domain_family]\
| append [| inputlookup dfars_domain_family_collection_backup.csv\
| outputlookup dfars_domain_family]\
| append [| inputlookup ism_domain_family_collection_backup.csv\
| outputlookup ism_domain_family]\
| append [| inputlookup e8_domain_family_collection_backup.csv\
| outputlookup e8_domain_family]\
| append [| inputlookup aescsf_domain_family_collection_backup.csv\
| outputlookup aescsf_domain_family]\
| append [| inputlookup caf_domain_family_collection_backup.csv\
| outputlookup caf_domain_family]

[External Product, Categories and Audit Status Collection Setup]
action.email.useNSSubject = 1
alert.track = 0
description = Output external product csv into KV Store.\
Should be run once during installation.
search = | inputlookup ext_product_collection_backup.csv\
| outputlookup ext_product\
| append [| inputlookup categories.csv \
| outputlookup categories]\
| append [| inputlookup audit_status_collection_backup.csv\
| outputlookup audit_status]\
| append [| inputlookup effectiveness_status_collection_backup.csv\
| outputlookup effectiveness_status]\
| append [| inputlookup evidence_status_collection_backup.csv\
| outputlookup evidence_status]

[Practice Family Collection Setup]
action.email.useNSSubject = 1
alert.track = 0
description = Outputs practice family csv into KV Store.\
Should be run once during installation.
search = | inputlookup cmmc_practice_family_collection_backup.csv\
| outputlookup cmmc_practice_family\
| append [| inputlookup omb_practice_family_collection_backup.csv\
| outputlookup omb_practice_family]\
| append [| inputlookup rmf_practice_family_collection_backup.csv\
| outputlookup rmf_practice_family]\
| append [| inputlookup fisma_practice_family_collection_backup.csv\
| outputlookup fisma_practice_family]\
| append [| inputlookup dfars_practice_family_collection_backup.csv\
| outputlookup dfars_practice_family]\
| append [| inputlookup ism_practice_family_collection_backup.csv\
| outputlookup ism_practice_family]\
| append [| inputlookup e8_practice_family_collection_backup.csv\
| outputlookup e8_practice_family]\
| append [\
    | inputlookup aescsf_practice_family_collection_backup.csv\
    | makemv delim=" " level\
    | outputlookup aescsf_practice_family]\
| append [| inputlookup caf_practice_family_collection_backup.csv\
| outputlookup caf_practice_family]

[Custom Content Panels Collection Setup]
action.email.useNSSubject = 1
alert.track = 0
description = Outputs custom panels csv into KV Store.\
Should be run once during installation.
search = | inputlookup custom_content_panels_collection_backup.csv\
| outputlookup custom_content_panels\
| append [| inputlookup panel_framework_mapping_collection_backup.csv\
| outputlookup panel_framework_mapping]

[Failed Audit Changes]
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = 0 6 * * 1
dispatch.earliest_time = -1w
dispatch.latest_time = now
enableSched = 0
quantity = 0
relation = greater than
search = | tstats count from datamodel=Change where nodename=All_Changes.Auditing_Changes All_Changes.status!="success" by host, All_Changes.user,  All_Changes.result, All_Changes.status, All_Changes.action _time span=1s\
| rename All_Changes.user as user, All_Changes.action as action All_Changes.result as result, All_Changes.status as status\
| table _time, host, user, action, result, status

[Index Audit Events]
action.email.useNSSubject = 1
alert.track = 0
cron_schedule = 08 * * * *
dispatch.earliest_time = 0
dispatch.latest_time = now
enableSched = 0
search = | inputlookup audit_entries\
| eval _time = creation_date\
| table _time, capacity, creation_date, date_of_observation, description, domain, entry_title, modified_date, practice, reviewer, status\
| collect index=summary

[Hosts without Events Logged for 1 Day]
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = 0 6 * * 1
dispatch.earliest_time = -1w
dispatch.latest_time = now
enableSched = 0
quantity = 0
relation = greater than
search = | tstats count where host!=Splunk* by host _time span=1d \
| timechart count as total by host span=1d useother=false limit=0\
| fillnull value=0\
| untable _time, host, total\
| where total==0
