[FastPass_Auth_via_Suspicious_Binary]
action.email.useNSSubject = 1
action.webhook.enable_allowlist = 0
alert.track = 0
cron_schedule = 0 2 * * *
dispatch.earliest_time = 0
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.show = 0
enableSched = 1
request.ui_dispatch_app = okta_dashboards
request.ui_dispatch_view = search
schedule_window = auto
search = index=* sourcetype=OktaIM2:log debugContext.debugData.factor="SIGNED_NONCE" outcome.result="SUCCESS" authenticationContext.authenticatorContext.bindingMethod="LOOPBACK" (authenticationContext.authenticatorContext.validationStatus="NO_SIGNATURE" OR NOT (authenticationContext.authenticatorContext.binaryIdentifier="*Edge*" OR authenticationContext.authenticatorContext.binaryIdentifier="*Chrome*" OR authenticationContext.authenticatorContext.binaryIdentifier="*firefox*" OR authenticationContext.authenticatorContext.binaryIdentifier="*Safari*" OR authenticationContext.authenticatorContext.binaryIdentifier="*Brave*" OR authenticationContext.authenticatorContext.binaryIdentifier="*Microsoft*")) \
| table _time, actor.alternateId, authenticationContext.authenticatorContext.validationStatus, authenticationContext.authenticatorContext.binaryIdentifier

[ITP_Push_Bombing]
action.email.useNSSubject = 1
action.webhook.enable_allowlist = 0
alert.track = 0
cron_schedule = 0 2 * * *
dispatch.earliest_time = 0
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.show = 0
enableSched = 1
request.ui_dispatch_app = okta_dashboards
request.ui_dispatch_view = search
schedule_window = auto
search = index=* sourcetype=OktaIM2:log eventType="user.risk.detect" AND (debugContext.debugData.risk="*Brute Force Attack*" OR debugContext.debugData.risk="*MFA brute force*") \
| table _time, actor.alternateId

[Mismatch_Between_Source_and_Response_for_Verify_Push_Request]
action.email.useNSSubject = 1
action.webhook.enable_allowlist = 0
alert.track = 0
cron_schedule = 0 2 * * *
dispatch.earliest_time = 0
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.show = 0
enableSched = 1
request.ui_dispatch_app = okta_dashboards
request.ui_dispatch_view = search
schedule_window = auto
search = index=* sourcetype=OktaIM2:log (eventType="system.push.send_factor_verify_push" OR eventType="user.authentication.auth_via_mfa") debugContext.debugData.factor="OKTA_VERIFY_PUSH" \
| eval groupby='authenticationContext.externalSessionId' \
| eval group_push_time=_time \
| bin span=2s group_push_time \
| fillnull value=NULL \
| stats min(_time) as _time by authenticationContext.externalSessionId eventType debugContext.debugData.factor outcome.result actor.alternateId client.device client.ipAddress client.userAgent.rawUserAgent debugContext.debugData.behaviors group_push_time groupby \
| iplocation client.ipAddress \
| fields - lat, lon, group_push_time \
| stats min(_time) as _time dc(client.ipAddress) as dc_ip sum(eval(if(eventType="system.push.send_factor_verify_push" AND 'outcome.result'="SUCCESS",1,0))) as total_pushes sum(eval(if(eventType="user.authentication.auth_via_mfa" AND 'outcome.result'="SUCCESS",1,0))) as total_successes sum(eval(if(eventType="user.authentication.auth_via_mfa" AND 'outcome.result'="FAILURE",1,0))) as total_rejected sum(eval(if(eventType="system.push.send_factor_verify_push" AND 'debugContext.debugData.behaviors' LIKE "%New Device=POSITIVE%",1,0))) as suspect_device_from_source sum(eval(if(eventType="system.push.send_factor_verify_push" AND 'debugContext.debugData.behaviors' LIKE "%New IP=POSITIVE%",1,0))) as suspect_ip_from_source values(eval(if(eventType="system.push.send_factor_verify_push",'client.ipAddress',""))) as src values(eval(if(eventType="user.authentication.auth_via_mfa",'client.ipAddress',""))) as dest values(*) as * by groupby \
| eval ratio = round(total_successes/total_pushes,2) \
| search ((ratio < 0.5 AND total_pushes > 2) OR (total_rejected > 0)) AND dc_ip > 1 AND suspect_device_from_source > 0 AND suspect_ip_from_source > 0

[Multiple_Failed_Requests_to_Access_Okta_Applications]
action.email.useNSSubject = 1
action.webhook.enable_allowlist = 0
alert.track = 0
cron_schedule = 0 2 * * *
dispatch.earliest_time = 0
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.show = 0
enableSched = 1
request.ui_dispatch_app = okta_dashboards
request.ui_dispatch_view = search
schedule_window = auto
search = index=* sourcetype=oktaim2:log target{}.type=AppInstance (eventType=policy.evaluate_sign_on outcome.result=CHALLENGE) OR (eventType=user.authentication.sso outcome.result=SUCCESS) \
| eval targets=mvzip('target{}.type', 'target{}.displayName', ": ") \
| eval targets=mvfilter(targets LIKE "AppInstance%") \
| stats count min(_time) as _time values(outcome.result) as outcome.result dc(eval(if(eventType="policy.evaluate_sign_on",targets,NULL))) as total_challenges sum(eval(if(eventType="user.authentication.sso",1,0))) as total_successes by authenticationContext.externalSessionId targets actor.alternateId client.ipAddress \
| search total_challenges > 0 \
| stats min(_time) as _time values(*) as * sum(total_challenges) as total_challenges sum(total_successes) as total_successes values(eval(if('outcome.result'="SUCCESS",targets,NULL))) as success_apps values(eval(if('outcome.result'!="SUCCESS",targets,NULL))) as no_success_apps by authenticationContext.externalSessionId actor.alternateId client.ipAddress \
| fillnull \
| eval ratio=round(total_successes/total_challenges,2), severity="HIGH", mitre_technique_id="T1538", description='actor.alternateId'. " from " . 'client.ipAddress' . " seen opening " . total_challenges . " chiclets/apps with " . total_successes . " challenges successfully passed" \
| fields - count, targets \
| search ratio < 0.5 total_challenges > 2

[Log_Stream_Tampering]
action.email.useNSSubject = 1
action.webhook.enable_allowlist = 0
alert.track = 0
cron_schedule = 0 2 * * *
dispatch.earliest_time = 0
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.show = 0
enableSched = 1
request.ui_dispatch_app = okta_dashboards
request.ui_dispatch_view = search
schedule_window = auto
search = index=* sourcetype=OktaIM2:log eventType="system.log_stream.lifecycle*" \
| table _time, actor.alternateId, displayMessage

[New_Okta_API_Token_Created]
action.email.useNSSubject = 1
action.webhook.enable_allowlist = 0
alert.track = 0
cron_schedule = 0 2 * * *
dispatch.earliest_time = 0
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.show = 0
enableSched = 1
request.ui_dispatch_app = okta_dashboards
request.ui_dispatch_view = search
schedule_window = auto
search = index=* sourcetype=OktaIM2:log eventType="system.api_token.create" \
| table _time, actor.alternateId, displayMessage

[New_Okta_Super_Admin_Created_or_Removed]
action.email.useNSSubject = 1
action.webhook.enable_allowlist = 0
alert.track = 0
cron_schedule = 0 2 * * *
dispatch.earliest_time = 0
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.show = 0
enableSched = 1
request.ui_dispatch_app = okta_dashboards
request.ui_dispatch_view = search
schedule_window = auto
search = index=* sourcetype=OktaIM2:log eventType="user.account.privilege*" AND (debugContext.debugData.privilegeRevoked="Super administrator" OR debugContext.debugData.privilegeGranted="Super administrator") \
| table _time, actor.alternateId, displayMessage, target{}.alternateId

[OPA_Server_Account_Password_Changed_Out_of_Band]
action.email.useNSSubject = 1
action.webhook.enable_allowlist = 0
alert.track = 0
cron_schedule = 0 2 * * *
dispatch.earliest_time = 0
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.show = 0
enableSched = 1
request.ui_dispatch_app = okta_dashboards
request.ui_dispatch_view = search
schedule_window = auto
search = index=* sourcetype=OktaIM2:log eventType="pam.server_account.password_change.out_of_band" \
| table _time, actor.displayName, actor.type, displayMessage, target{}.displayName, target{}.type

[Oauth_Mismatched_Redirect_URI]
action.email.useNSSubject = 1
action.webhook.enable_allowlist = 0
alert.track = 0
cron_schedule = 0 2 * * *
dispatch.earliest_time = 0
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.show = 0
enableSched = 1
request.ui_dispatch_app = okta_dashboards
request.ui_dispatch_view = search
schedule_window = auto
search = index=* sourcetype=OktaIM2:log eventType="app.oauth2.token.grant" outcome.reason="mismatched_redirect_uri" outcome.result="FAILURE" \
| table _time, actor.alternateId, displayMessage

[Okta_AiTM_Phishing_Detection_with_FastPass]
action.email.useNSSubject = 1
action.webhook.enable_allowlist = 0
alert.track = 0
cron_schedule = 0 2 * * *
dispatch.earliest_time = 0
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.show = 0
enableSched = 1
request.ui_dispatch_app = okta_dashboards
request.ui_dispatch_view = search
schedule_window = auto
search = index=* sourcetype=OktaIM2:log eventType="user.authentication.auth_via_mfa" outcome.result="FAILURE" outcome.reason="FastPass declined phishing attempt" \
| table _time, actor.alternateId, displayMessage

[Phone_Number_Registered_to_Multiple_Users]
action.email.useNSSubject = 1
action.webhook.enable_allowlist = 0
alert.track = 0
cron_schedule = 0 2 * * *
dispatch.earliest_time = 0
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.show = 0
enableSched = 1
request.ui_dispatch_app = okta_dashboards
request.ui_dispatch_view = search
schedule_window = auto
search = index=* sourcetype=oktaim2:log eventType="system.sms.send_phone_verification_message" \
| eval targets=mvzip('target{}.type', 'target{}.id', ": ") \
| eval targets=mvfilter(targets LIKE "MobilePhone%") \
| stats dc(actor.id) as distinct_user_count values(client.ipAddress) as source_ip values(actor.alternateId) as username by targets \
| where distinct_user_count >= 2

[Rapid_Okta_Application_Access]
action.email.useNSSubject = 1
action.webhook.enable_allowlist = 0
alert.track = 0
cron_schedule = 0 2 * * *
dispatch.earliest_time = 0
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.show = 0
enableSched = 1
request.ui_dispatch_app = okta_dashboards
request.ui_dispatch_view = search
schedule_window = auto
search = index=* sourcetype=OktaIM2:log eventType="user.authentication.sso" debugContext.debugData.initiationType="IDP_INITIATED" outcome.result="SUCCESS" \
| eval targets=mvzip('target{}.type', 'target{}.alternateId', ": ") \
| eval targets=mvfilter(targets LIKE "AppInstance%") \
| bin _time span=1m \
| stats values(targets) as appname dc(targets) as app_count values(client.ipAddress) as source_ip values(client.userAgent.rawUserAgent) as UserAgent by actor.id actor.alternateId _time \
| where app_count >= 10

[Request_to_access_Admin_Console_from_new_device_or_IP]
action.email.useNSSubject = 1
action.webhook.enable_allowlist = 0
alert.track = 0
cron_schedule = 0 2 * * *
dispatch.earliest_time = 0
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.show = 0
enableSched = 1
request.ui_dispatch_app = okta_dashboards
request.ui_dispatch_view = search
schedule_window = auto
search = index=* sourcetype=OktaIM2:log eventType="policy.evaluate_sign_on" target{}.displayName="Okta Admin Console" ((debugContext.debugData.behaviors"*New Device=POSITIVE*" AND debugContext.debugData.behaviors"*New IP=POSITIVE*") OR (debugContext.debugData.logOnlySecurityData="*\"New Device\":\"POSITIVE\"*" OR debugContext.debugData.logOnlySecurityData="*\"New Device\":\"POSITIVE\"*")) \
| table _time, actor.alternateId, displayMessage, client.ipAddress, client.userAgent.rawUserAgent

[Suspicious_MFA_Abandonment]
action.email.useNSSubject = 1
action.webhook.enable_allowlist = 0
alert.track = 0
cron_schedule = 0 2 * * *
dispatch.earliest_time = 0
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.show = 0
enableSched = 1
request.ui_dispatch_app = okta_dashboards
request.ui_dispatch_view = search
schedule_window = auto
search = index=* sourcetype=OktaIM2:log eventType=user.authentication.auth_via_mfa AND outcome.result IN ("UNANSWERED", "ABANDONED") \
| stats earliest(_time) as _time values(actor.alternateId) as username dc(actor.id) as user_count values(securityContext.isProxy) as isProxy values(outcome.reason) as outcome_reason count by client.ipAddress \
| where (user_count = 1 AND count > 5) OR (user_count > 5) OR (isProxy = "true")

[Suspicious_Use_of_an_Okta_Session_Cookie]
action.email.useNSSubject = 1
action.webhook.enable_allowlist = 0
alert.track = 0
cron_schedule = 0 2 * * *
dispatch.earliest_time = 0
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.show = 0
enableSched = 1
request.ui_dispatch_app = okta_dashboards
request.ui_dispatch_view = search
schedule_window = auto
search = index=* sourcetype=OktaIM2:log eventType IN (policy.evaluate_sign_on) outcome.result IN (ALLOW, SUCCESS) \
| stats earliest(_time) as _time values(client.ipAddress) as src_ip values(client.userAgent.rawUserAgent) as user_agent values(client.userAgent.os) as userAgentOS_list values(client.userAgent.browser) as userAgentBrowser_list values(device.os_platform) as okta_device_os dc(client.userAgent.browser) as dc_userAgentBrowser dc(client.userAgent.os) as dc_userAgentOS dc(client.ipAddress) as dc_src_ip values(outcome.reason) as reason by debugContext.debugData.dtHash actor.alternateId \
| where dc_src_ip>1 AND (dc_userAgentOS>1 OR dc_userAgentBrowser>1)

[User_Denied_Access_due_to_Session_Binding]
action.email.useNSSubject = 1
action.webhook.enable_allowlist = 0
alert.track = 0
cron_schedule = 0 2 * * *
dispatch.earliest_time = 0
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.show = 0
enableSched = 1
request.ui_dispatch_app = okta_dashboards
request.ui_dispatch_view = search
schedule_window = auto
search = index=* sourcetype=OktaIM2:log eventType="security.session.detect_client_roaming" \
| table _time, actor.alternateId, client.ipAddress, client.userAgent.rawUserAgent

[Threat_Insight_Alert___Login_Failure_with_High_Unknown_Users]
action.email.useNSSubject = 1
action.webhook.enable_allowlist = 0
alert.track = 0
cron_schedule = 0 2 * * *
dispatch.earliest_time = 0
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.show = 0
enableSched = 1
request.ui_dispatch_app = okta_dashboards
request.ui_dispatch_view = search
schedule_window = auto
search = index=* sourcetype=OktaIM2:log eventType="security.threat.detected" outcome.reason="Login failures with high unknown users count" \
| table _time, client.geographicalContext.country, client.ipAddress, client.userAgent.rawUserAgent

[ThreatInsight___Password_Spray]
action.email.useNSSubject = 1
action.webhook.enable_allowlist = 0
alert.track = 0
cron_schedule = 0 2 * * *
dispatch.earliest_time = 0
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.show = 0
enableSched = 1
request.ui_dispatch_app = okta_dashboards
request.ui_dispatch_view = search
schedule_window = auto
search = index=* sourcetype=OktaIM2:log eventType="security.threat.detected" outcome.reason="Password Spray" \
| table _time, client.geographicalContext.country, client.ipAddress, client.userAgent.rawUserAgent

[User_Reported_Suspicious_Activity]
action.email.useNSSubject = 1
action.webhook.enable_allowlist = 0
alert.track = 0
cron_schedule = 0 2 * * *
dispatch.earliest_time = 0
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.show = 0
enableSched = 1
request.ui_dispatch_app = okta_dashboards
request.ui_dispatch_view = search
schedule_window = auto
search = index=* sourcetype=OktaIM2:log eventType="user.account.report_suspicious_activity_by_enduser" \
| table _time, actor.alternateId, client.ipAddress, client.userAgent.rawUserAgent

[Access_to_Admin_Console_Denied]
action.email.useNSSubject = 1
action.webhook.enable_allowlist = 0
alert.track = 0
cron_schedule = 0 2 * * *
dispatch.earliest_time = 0
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.show = 0
enableSched = 1
request.ui_dispatch_app = okta_dashboards
request.ui_dispatch_view = search
schedule_window = auto
search = index=* sourcetype=OktaIM2:log eventType="user.session.access_admin_app" outcome.result="FAILURE" | table _time,actor.displayName, outcome.reason, client.userAgent.rawUserAgent

[Authentication_Policy_MFA_Downgrade]
action.email.useNSSubject = 1
action.webhook.enable_allowlist = 0
alert.track = 0
cron_schedule = 0 2 * * *
dispatch.earliest_time = 0
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.show = 0
enableSched = 1
request.ui_dispatch_app = okta_dashboards
request.ui_dispatch_view = search
schedule_window = auto
search = index=* sourcetype=OktaIM2:log eventType="policy.rule.update" outcome.result=SUCCESS | spath target{} output=targets | eval PolicyRuleChanges=mvindex(targets,1)| spath input=PolicyRuleChanges path=displayName output=policy_changed | spath input=PolicyRuleChanges path=id output=policy_rule_id | spath input=PolicyRuleChanges path=changeDetails.from.policyRuleActionJson output=change_from | spath input=PolicyRuleChanges path=changeDetails.to.policyRuleActionJson output=change_to | spath input=change_from path="appSignOn.verificationMethod.factorMode" output=from_factor | spath input=change_to path="appSignOn.verificationMethod.factorMode" output=to_factor | where from_factor = "2FA" AND to_factor = "1FA" | stats values(actor.id) as user_id values(actor.alternateId) as username values(client.ipAddress) as src_ip values(client.userAgent.rawUserAgent) as user_agent values(from_factor) as original_factor values(to_factor) as changed_to_factor

[Creation_of_a_new_Okta_Identity_Provider]
action.email.useNSSubject = 1
action.webhook.enable_allowlist = 0
alert.track = 0
cron_schedule = 0 2 * * *
dispatch.earliest_time = 0
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.show = 0
enableSched = 1
request.ui_dispatch_app = okta_dashboards
request.ui_dispatch_view = search
schedule_window = auto
search = index=* sourcetype=OktaIM2:log eventType="system.idp.lifecycle.create" | table _time, actor.alternateId, displayMessage, target{}.displayName

[Device_Enrolled_with_Non_Standard_Hostname]
action.email.useNSSubject = 1
action.webhook.enable_allowlist = 0
alert.track = 0
cron_schedule = 0 2 * * *
dispatch.earliest_time = 0
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.show = 0
enableSched = 1
request.ui_dispatch_app = okta_dashboards
request.ui_dispatch_view = search
schedule_window = auto
search = index=* sourcetype=OktaIM2:log AND (eventType="device.user.add" OR eventType="device.enrollment.create") \
| spath "target{}.displayName" output="hostname" \
| spath "target{}.detailEntry.managed" output="managed" \
| spath "target{}.detailEntry.osPlatform" output="OS" \
| spath "target{}.detailEntry.osVersion" output="OS_Version" \
| where NOT match(hostname, "<insert your standard hostname nomenclature regex here>") \
| stats values(published) as timestamp values(displayMessage) as message values(actor.id) as actor_id values(actor.alternateId) as username values(client.ipAddress) as source_ip values(OS) as OS values(OS_Version) as OS_Version values(managed) as managed_device by hostname

[Hunt on Application Password Reveals]
action.email.useNSSubject = 1
action.webhook.enable_allowlist = 0
alert.track = 0
cron_schedule = 0 2 * * *
dispatch.earliest_time = 0
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.show = 0
enableSched = 1
request.ui_dispatch_app = okta_dashboards
request.ui_dispatch_view = search
schedule_window = auto
search = index=* sourcetype=OktaIM2:log eventType="application.user_membership.show_password" \
| table _time, actor.alternateId

[Hunt on Identity Verification Failures]
action.email.useNSSubject = 1
action.webhook.enable_allowlist = 0
alert.track = 0
cron_schedule = 0 2 * * *
dispatch.earliest_time = 0
dispatch.latest_time = now
display.general.timeRangePicker.show = 0
enableSched = 1
schedule_window = auto
search = index=* sourcetype=OktaIM2:log eventType="user.identity_verification" outcome.result="DENY" \
| table _time, actor.alternateId, displayMessage, outcome.reason, target.displayName

[OAuth_Client_Secret_Read]
action.email.useNSSubject = 1
action.webhook.enable_allowlist = 0
alert.track = 0
cron_schedule = 0 2 * * *
dispatch.earliest_time = 0
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.show = 0
enableSched = 1
request.ui_dispatch_app = okta_dashboards
request.ui_dispatch_view = search
schedule_window = auto
search = index=* sourcetype=OktaIM2:log eventType="app.oauth2.client.read_client_secret" \
| table _time, actor.alternateId, displayMessage, target{}.displayName

[Hunt on Authentication Policy Blocks]
action.email.useNSSubject = 1
action.webhook.enable_allowlist = 0
alert.track = 0
cron_schedule = 0 2 * * *
dispatch.earliest_time = 0
dispatch.latest_time = now
display.general.timeRangePicker.show = 0
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
enableSched = 1
request.ui_dispatch_view = search
schedule_window = auto
search = index=* sourcetype=OktaIM2:log eventType="policy.evaluate_sign_on" outcome.result="DENY" \
| table _time, actor.alternateId, displayMessage, outcome.reason, target.displayName

[Hunt on rejected MFA pushes]
action.email.useNSSubject = 1
action.webhook.enable_allowlist = 0
alert.track = 0
cron_schedule = 0 2 * * *
dispatch.earliest_time = 0
dispatch.latest_time = now
display.general.timeRangePicker.show = 0
enableSched = 1
schedule_window = auto
search = index=* sourcetype=OktaIM2:log eventType="user.authentication.auth_via_mfa" debugContext.debugData.pushOnlyResponseType="OV_RESPONSE_DENY"\
| table _time, actor.alternateId, displayMessage, outcome.reason, target.displayName

[Hunt on Sign-in Attempts from Anonymizer Proxies]
action.email.useNSSubject = 1
action.webhook.enable_allowlist = 0
alert.track = 0
cron_schedule = 0 2 * * *
dispatch.earliest_time = 0
dispatch.latest_time = now
display.general.timeRangePicker.show = 0
enableSched = 1
schedule_window = auto
search = index=* sourcetype=OktaIM2:log eventType="user.session.start" securityContext.isProxy="true" \
| table _time, actor.alternateId, displayMessage, outcome.reason

[Hunt on MFA Abandonment]
action.email.useNSSubject = 1
action.webhook.enable_allowlist = 0
alert.track = 0
cron_schedule = 0 2 * * *
dispatch.earliest_time = 0
dispatch.latest_time = now
display.general.timeRangePicker.show = 0
enableSched = 1
schedule_window = auto
search = index=* sourcetype=OktaIM2:log eventType eq "user.authentication.auth_via_mfa" and (outcome.result eq "UNANSWERED" or outcome.result eq "ABANDONED") \
| table _time, actor.alternateId, displayMessage, outcome.reason, target.displayName

[Hunt on Factor Resets]
action.email.useNSSubject = 1
action.webhook.enable_allowlist = 0
alert.track = 0
cron_schedule = 0 2 * * *
dispatch.earliest_time = 0
dispatch.latest_time = now
display.general.timeRangePicker.show = 0
enableSched = 1
schedule_window = auto
search = index=* sourcetype=OktaIM2:log eventType="user.mfa.factor.reset_all" \
| table _time, actor.alternateId, displayMessage, outcome.reason, target.displayName

[Hunt on Failed Number Challenge]
action.email.useNSSubject = 1
action.webhook.enable_allowlist = 0
alert.track = 0
cron_schedule = 0 2 * * *
dispatch.earliest_time = 0
dispatch.latest_time = now
display.general.timeRangePicker.show = 0
enableSched = 1
schedule_window = auto
search = index=* sourcetype=OktaIM2:log debugContext.debugData.pushWithNumberChallengeResponseType="OV_WITH_CHALLENGE_RESPONSE_INVALID"\
| table _time, actor.alternateId, displayMessage, outcome.reason, target.displayName

[Device_Registered_to_Multiple_Users]
action.email.useNSSubject = 1
action.webhook.enable_allowlist = 0
alert.track = 0
cron_schedule = 0 2 * * *
dispatch.earliest_time = 0
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.show = 0
enableSched = 1
request.ui_dispatch_app = okta_dashboards
request.ui_dispatch_view = search
schedule_window = auto
search = index=* sourcetype=OktaIM2:log eventType="device.user.add" \
| spath "target{}.detailEntry.oktaDeviceId" output="device_id" \
| spath "target{}.displayName" output="device_name" \
| stats values(device_name) as device_name dc(actor.id) as distinct_user_count values(client.ipAddress) as source_ip values(actor.alternateId) as username by device_id \
| where distinct_user_count >= 2
