[WinEvent:System or WinEvent:Application]
search = sourcetype=WinEventLog severity!=informational | rename event_id AS orig_event_id | eval tmp_entity=host |eval itsi_eventtype=eventtype | eval itsi_message=Message | eval itsi_ip=Source_Network_Address | eval itsi_fqdn=ComputerName | eval itsi_event_category=category | eval itsi_severity=case(severity=="medium", 4, severity=="high", 5, 1=1,1) | dedup host Message orig_event_id
description = Windows-based stateful events
group =

[Unix or Linux Events]
search = status=Stopped | dedup host status Description | eval itsi_severity=status | eval itsi_host=host | eval itsi_eventtype=eventtype | eval tmp_entity=host | eval itsi_severity=case(status=="Stopped", 4, 1=1,1)
description = *Nix-based stateful events
group =

[Health Rule Violations]
search = source=healthrule_violations | dedup healthrule_violations{}.affectedEntityDefinition.entityId healthrule_violations{}.deepLinkUrl | spath output=itsi_ruleViolation path=healthrule_violations{}.name  | spath output=itsi_affectedEntityDefinition path=healthrule_violations{}.affectedEntityDefinition.name | eval tmp_entity=itsi_affectedEntityDefinition | spath output=event_description path=healthrule_violations{}.description | spath output=severity path=healthrule_violations{}.severity | spath output=itsi_triggered_entity_name path=healthrule_violations{}.triggeredEntityDefinition.name | spath  output=itsi_entity_type path=healthrule_violations{}.triggeredEntityDefinition.entityType | eval eventsource="APPD" | eval svc_entity=itsi_affectedEntityDefinition | eval itsi_severity=case(severity == "CRITICAL", 5,severity == "WARNING", 3) | eval tmp_entity=svc_entity
description = Splunk AppDynamics health rule stateful violations
group = AppDynamics

[Events]
search = source=application_events | eval itsi_application=application_name | eval itsi_customer_name=account_name | eval itsi_application_id=application_id | rename application_events{}.severity as itsi_raw_severity | spath output=itsi_affectedEntities path=application_events{}.affectedEntities{}.name  | spath output=itsi_triggeredEntity path=application_events{}.triggeredEntity.name | spath output=itsi_subType path=application_events{}.subType | spath output=itsi_summary path=application_events{}.summary | eval itsi_severity=if(itsi_raw_severity=="MINOR","4",if(itsi_raw_severity=="WARN","3",if(itsi_raw_severity=="NORMAL","2",if(itsi_raw_severity=="ERROR","5","6")))) | dedup itsi_triggeredEntity itsi_application itsi_subType
description = Splunk AppDynamics stateful events
group = AppDynamics

[MuleSoft Events]
search = sourcetype=httpevent severity!=INFO | dedup source | eval tmp_entity=source | eval itsi_severity=case(severity=="WARN", 3, severity=="ERROR", 5, 1=1,1) | eval itsi_message=message | eval itsi_eventtype=logger
description = MuleSoft stateful related events
group =

[ScienceLogic EM7 Events]
search = | dedup em7_var_evententityname em7_var_alertid | eval itsi_category = em7_var_categoryname | eval itsi_message = em7_var_eventmessage | eval itsi_orig_severity = em7_var_eventseveritytext | eval itsi_host = em7_var_evententityname | eval tmp_entity = em7_var_evententityname | eval itsi_url = em7_var_eventurllink | eval itsi_ip = em7_var_ipaddress | eval itsi_location = em7_var_slsystemname | eval itsi_class = class | eval itsi_eventID = em7_var_alertid | eval itsi_supportGroup = em7_var_support_group | eval itsi_backLink = em7_var_device_back_link | eval itsi_severity=case(em7_var_eventseveritytext=="NOTICE", 3, em7_var_eventseveritytext=="MINOR", 4, em7_var_eventseveritytext=="MAJOR", 5, em7_var_eventseveritytext=="CRITICAL", 6, 1=1,1)
description = ScienceLogic EM7 stateful events
group =

[SolarWinds Events]
search = | eval itsi_host=NodeName | eval tmp_entity=NodeName | eval itsi_orig_severity=Severity | eval itsi_severity=Severity | eval itsi_alert_type=eventtype | eval itsi_NodeDescription=NodeDescription | eval itsi_vendor=Vendor | eval itsi_summary=StatusDescription | eval itsi_category=tag | eval itsi_location=Location | eval itsi_severity=case(Severity<=500, 2, Severity<=4000, 3, Severity<=9000, 4, Severity<=12000, 5 , Severity>=15000, 6, 1=1, 1) | dedup NodeName eventtype StatusDescription
description = SolarWinds stateful events
group =

[BMC TrueSight Events]
search = | eval itsi_host=alias_host | eval tmp_entity=alias_host | eval itsi_eventtype=alias_parameter | eval itsi_class=CLASS | eval itsi_message=Msg | eval itsi_incident=itsm_incident_id | eval itsi_ip=mc_host_address | eval itsi_support=support_group | eval itsi_severity=case(mc_original_severity="CRITICAL", 6, mc_original_severity="OK", 2, 1=1,1) | dedup alias_host alias_parameter Msg
description = BMC TrueSight (patrol, msend) stateful events
group =

[NewRelic Events]
search = sourcetype=newrelic* | eval tmp_entity=norm_instance | eval itsi_severity=case(health_status=="green", 2, health_status=="red", 6)  | search itsi_severity!=2 | dedup transaction_name health_status
description = NewRelic stateful events
group =

[Nagios Events]
search = sourcetype=nagiosserviceperf | eval norm_severity=case(severity=="CRITICAL",6,severity=="WARNING",4, severity="OK", 2) |  dedup consecutive=true src_host severity name | eval tmp_entity=host | eval host=src_host
description = Nagios stateful perf events
group =

[Netcool]
search = | eval itsi_host=NODE | eval itsi_eventID=ALERTID | eval itsi_alertKey = ALERTKEY | dedup consecutive=true itsi_host itsi_alertID itsi_alertKey | eval itsi_tally = TALLY | eval itsi_orig_severity = SEVERITY | eval itsi_severity = case(SEVERITY==0,2, SEVERITY==1,2, SEVERITY==2,3,SEVERITY==3,4, SEVERITY==4,5, SEVERITY==5,6, 1=1,1) | eval itsi_message = SUMMARY | eval tmp_entity = APPLICATION | eval itsi_length=len(_raw) | eval itsi_identifier = IDENTIFIER + LASTOCCURRENCE  + STATECHANGE | eval itsi_time=strftime(LASTOCCURRENCE,"%F %T")
description = Netcool stateful events
group =