[RQAware Emergency IP Threat List]
action.carbonblack_alert_action.param.delfile = 0
action.carbonblack_alert_action.param.hashban = 0
action.carbonblack_alert_action.param.isolate = 0
action.carbonblack_alert_action.param.killproc = 0
action.email.useNSSubject = 1
action.keyindicator.invert = 0
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.param.verbose = 0
action.send2uba.param.verbose = 0
action.threat_add.param.verbose = 0
alert.severity = 1
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = 30 * * * *
description = This saved search retrieves the RQAware emergency IP threatlists.
dispatch.earliest_time = -1h
dispatch.latest_time = now
display.general.type = statistics
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = rqaware
request.ui_dispatch_view = search
search = | getwatchlist https://rqa.reliaquest.com/critical/RQ_Emergency_IP_Threat_List.csv\
| rename ip_address AS _raw\
| rex "(?<Application>[^\,]*)\,(?<DataType>[^\,]*)\,(?<IOC>[^\,]*)\,(?<blank1>[^\,]*)\,(?<blank2>[^\,]*)\,(?<blank3>[^\,]*)\,(?<FeedSource>[^\,]*)\,(?<FeedCategory>[^\,]*)\,(?<LastSeenDate>[^\
,]*)\,(?<Age>[^\,]*),(?<Frequency>[^\,]*)\,(?<Score>[^\,]*)\,(?<TotalScore>[^\,]*)"\
| eval _time = Firstseen | outputlookup RQ_Emergency_IP_Threat_List.csv

[RQAware Emergency URL Threat List]
action.carbonblack_alert_action.param.delfile = 0
action.carbonblack_alert_action.param.hashban = 0
action.carbonblack_alert_action.param.isolate = 0
action.carbonblack_alert_action.param.killproc = 0
action.email.useNSSubject = 1
action.keyindicator.invert = 0
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.param.verbose = 0
action.send2uba.param.verbose = 0
action.threat_add.param.verbose = 0
alert.severity = 1
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = 30 * * * *
description = This saved search retrieves the RQAware emergency URL threatlists.
dispatch.earliest_time = -1h
dispatch.latest_time = now
display.general.type = statistics
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = rqaware
request.ui_dispatch_view = search
search = | getwatchlist https://rqa.reliaquest.com/critical/RQ_Emergency_URL_Threat_List.csv\
| rename ip_address AS _raw\
| rex "(?<Application>[^\,]*)\,(?<DataType>[^\,]*)\,(?<IOC>[^\,]*)\,(?<blank1>[^\,]*)\,(?<blank2>[^\,]*)\,(?<blank3>[^\,]*)\,(?<FeedSource>[^\,]*)\,(?<FeedCategory>[^\,]*)\,(?<LastSeenDate>[^\
,]*)\,(?<Age>[^\,]*),(?<Frequency>[^\,]*)\,(?<Score>[^\,]*)\,(?<TotalScore>[^\,]*)"\
| eval _time = Firstseen | outputlookup RQ_Emergency_URL_Threat_List.csv

[RQAware Emergency Hash Threat List]
action.carbonblack_alert_action.param.delfile = 0
action.carbonblack_alert_action.param.hashban = 0
action.carbonblack_alert_action.param.isolate = 0
action.carbonblack_alert_action.param.killproc = 0
action.email.useNSSubject = 1
action.keyindicator.invert = 0
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.param.verbose = 0
action.send2uba.param.verbose = 0
action.threat_add.param.verbose = 0
alert.severity = 1
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = 30 * * * *
description = This saved search retrieves the RQAware emergency hash threatlists.
dispatch.earliest_time = -1h
dispatch.latest_time = now
display.general.type = statistics
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = rqaware
request.ui_dispatch_view = search
search = | getwatchlist https://rqa.reliaquest.com/critical/RQ_Emergency_Hash_Threat_List.csv\
| rename ip_address AS _raw\
| rex "(?<Application>[^\,]*)\,(?<DataType>[^\,]*)\,(?<IOC>[^\,]*)\,(?<blank1>[^\,]*)\,(?<blank2>[^\,]*)\,(?<blank3>[^\,]*)\,(?<FeedSource>[^\,]*)\,(?<FeedCategory>[^\,]*)\,(?<LastSeenDate>[^\
,]*)\,(?<Age>[^\,]*),(?<Frequency>[^\,]*)\,(?<Score>[^\,]*)\,(?<TotalScore>[^\,]*)"\
| eval _time = Firstseen | outputlookup RQ_Emergency_Hash_Threat_List.csv

[RQAware Emergency Domain Threat List]
action.carbonblack_alert_action.param.delfile = 0
action.carbonblack_alert_action.param.hashban = 0
action.carbonblack_alert_action.param.isolate = 0
action.carbonblack_alert_action.param.killproc = 0
action.email.useNSSubject = 1
action.keyindicator.invert = 0
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.param.verbose = 0
action.send2uba.param.verbose = 0
action.threat_add.param.verbose = 0
alert.severity = 1
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = 30 * * * *
description = This saved search retrieves the RQAware emergency Domain threatlists.
dispatch.earliest_time = -1h
dispatch.latest_time = now
display.general.type = statistics
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = rqaware
request.ui_dispatch_view = search
search = | getwatchlist https://rqa.reliaquest.com/critical/RQ_Emergency_Domain_Threat_List.csv\
| rename ip_address AS _raw\
| rex "(?<Application>[^\,]*)\,(?<DataType>[^\,]*)\,(?<IOC>[^\,]*)\,(?<blank1>[^\,]*)\,(?<blank2>[^\,]*)\,(?<blank3>[^\,]*)\,(?<FeedSource>[^\,]*)\,(?<FeedCategory>[^\,]*)\,(?<LastSeenDate>[^\
,]*)\,(?<Age>[^\,]*),(?<Frequency>[^\,]*)\,(?<Score>[^\,]*)\,(?<TotalScore>[^\,]*)"\
| eval _time = Firstseen | outputlookup RQ_Emergency_Domain_Threat_List.csv

[RQAware Emergency Signature Threat List]
action.carbonblack_alert_action.param.delfile = 0
action.carbonblack_alert_action.param.hashban = 0
action.carbonblack_alert_action.param.isolate = 0
action.carbonblack_alert_action.param.killproc = 0
action.email.useNSSubject = 1
action.keyindicator.invert = 0
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.param.verbose = 0
action.send2uba.param.verbose = 0
action.threat_add.param.verbose = 0
alert.severity = 1
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = 30 * * * *
description = This saved search retrieves the RQAware emergency Signature threat lists.
dispatch.earliest_time = -1h
dispatch.latest_time = now
display.general.type = statistics
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = rqaware
request.ui_dispatch_view = search
search = | getwatchlist https://rqa.reliaquest.com/critical/RQ_Emergency_Signature_Threat_List.csv\
| rename ip_address AS _raw\
| rex "(?<Application>[^\,]*)\,(?<DataType>[^\,]*)\,(?<IOC>[^\,]*)\,(?<blank1>[^\,]*)\,(?<blank2>[^\,]*)\,(?<blank3>[^\,]*)\,(?<FeedSource>[^\,]*)\,(?<FeedCategory>[^\,]*)\,(?<LastSeenDate>[^\
,]*)\,(?<Age>[^\,]*),(?<Frequency>[^\,]*)\,(?<Score>[^\,]*)\,(?<TotalScore>[^\,]*)"\
| eval _time = Firstseen | outputlookup RQ_Emergency_Signature_Threat_List.csv

[RQAware Lookup]
action.email.useNSSubject = 1
action.keyindicator.invert = 0
alert.severity = 1
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = 0 2 * * *
description = This saved search retrieves the RQAware threatlists.
dispatch.earliest_time = -1d
dispatch.latest_time = now
display.general.type = statistics
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = rqaware
request.ui_dispatch_view = search
search = | getwatchlist https://rqa.reliaquest.com/cc4c11ce-e945-4df2-82ed-32791c3b715e/rqaware_all.csv\
| rename ip_address AS _raw\
| rex "(?<Application>[^\,]*)\,(?<DataType>[^\,]*)\,(?<IOC>[^\,]*)\,(?<blank1>[^\,]*)\,(?<blank2>[^\,]*)\,(?<blank3>[^\,]*)\,(?<FeedSource>[^\,]*)\,(?<FeedCategory>[^\,]*)\,(?<LastSeenDate>[^\,]*)\,(?<Age>[^\,]*),(?<Frequency>[^\,]*)\,(?<Score>[^\,]*)\,(?<TotalScore>[^\,]*)"\
| eval _time = Firstseen | outputlookup rqaware.csv

[RQAware IP - All (Tstats)]
action.email.useNSSubject = 1
action.keyindicator.invert = 0
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.param.verbose = 0
action.send2uba.param.verbose = 0
alert.track = 0
cron_schedule = */10 * * * *
dispatch.earliest_time = -30d@d
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","signature"]
display.general.timeRangePicker.show = 0
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.show = 0
enableSched = 1
request.ui_dispatch_app = rqaware
request.ui_dispatch_view = search
schedule_priority = highest
search = | tstats allow_old_summaries=t values(RQ_Aware.dm) as datamodel values(RQ_Aware.match_field) as match_field values(RQ_Aware.orig_sourcetype) as sourcetype values(RQ_Aware.app) as app values(RQ_Aware.user) as user values(RQ_Aware.protocol) as protocol sum(RQ_Aware.bytes_in) as bytes_in sum(RQ_Aware.bytes_out) as bytes_out values(RQ_Aware.Age) as age values(RQ_Aware.FeedCategory) as feed_category values(RQ_Aware.FeedSource) as feed_source values(RQ_Aware.Frequency) as frequency values(RQ_Aware.Score) as score values(RQ_Aware.TotalScore) as total_score sum(RQ_Aware.count) as count\
    from datamodel=RQ_Aware.RQ_Aware\
    where nodename=RQ_Aware.IP_Match\
    by _time, RQ_Aware.src, RQ_Aware.dest, RQ_Aware.src_ip, RQ_Aware.dest_ip, RQ_Aware.dest_port, RQ_Aware.action span=1m\
|`drop_dm_object_name(RQ_Aware)`\
| eval feed_category=split(feed_category," ")\
| eval feed_source=split(feed_source," ")

[RQAware IDS Hit]
action.email.useNSSubject = 1
action.keyindicator.invert = 0
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.param.verbose = 0
action.send2uba.param.verbose = 0
action.summary_index = 1
action.summary_index._name = rqaware
action.summary_index.match_type = ip
action.threat_add.param.verbose = 0
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
cron_schedule = */15 * * * *
description = Populates the rqaware summary index with IDS matches
dispatch.earliest_time = -15m
dispatch.latest_time = now
display.general.timeRangePicker.show = 0
display.general.type = statistics
display.page.search.mode = fast
display.page.search.tab = statistics
display.visualizations.show = 0
enableSched = 1
realtime_schedule = 0
request.ui_dispatch_app = rqaware
request.ui_dispatch_view = search
schedule_priority = highest
search = | tstats  allow_old_summaries=t values(sourcetype) as sourcetype values(IDS_Attacks.category) as category values(IDS_Attacks.user) as user values(IDS_Attacks.ids_type) as ids_type values(IDS_Attacks.severity) as severity count \
    from datamodel=Intrusion_Detection.IDS_Attacks\
    where IDS_Attacks.signature!=unknown\
    by _time, IDS_Attacks.src, IDS_Attacks.dest, IDS_Attacks.signature IDS_Attacks.action span=1m \
|`drop_dm_object_name(IDS_Attacks)`\
| eval dm="Intrusion_Detection"\
| lookup rqaware_dedup.csv IOC as src OUTPUT IOC as src_match\
| lookup rqaware_dedup.csv IOC as dest OUTPUT IOC as dest_match\
| eval match_field=coalesce(src_match,dest_match)\
| where isnotnull(match_field)\
|`rqaware_ioc_lookup(match_field)`\
| stats max(Age) as Age, values(FeedCategory) as FeedCategory, values(FeedSource) as FeedSource max(Frequency) as Frequency, last(LastSeenDate) as LastSeenDate max(Score) as Score, max(TotalScore) as TotalScore values(dm) as dm values(src_match) as src_match, values(dest_match) as dest_match by _time, src, dest, signature, action, sourcetype, category, user, ids_type, severity, count\
| eval match_field=if(isnotnull(src_match),"src","dest")\
| fields - src_match, dest_match\
| addinfo

[RQAware IP Hit]
action.email.useNSSubject = 1
action.keyindicator.invert = 0
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.param.verbose = 0
action.send2uba.param.verbose = 0
action.summary_index = 1
action.summary_index._name = rqaware
action.summary_index.match_type = ip
action.threat_add.param.verbose = 0
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1mon@d
cron_schedule = */15 * * * *
dispatch.earliest_time = -15m
dispatch.latest_time = now
display.general.timeRangePicker.show = 0
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.show = 0
enableSched = 1
realtime_schedule = 0
request.ui_dispatch_app = rqaware
request.ui_dispatch_view = search
schedule_priority = highest
search = | tstats summariesonly=t values(sourcetype) as sourcetype values(All_Traffic.app) as app values(All_Traffic.user) as user values(All_Traffic.protocol) as protocol sum(All_Traffic.bytes_in) as bytes_in sum(All_Traffic.bytes_out) as bytes_out count \
    from datamodel=Network_Traffic.All_Traffic\
    by _time, All_Traffic.src_ip, All_Traffic.dest_ip All_Traffic.dest_port All_Traffic.action span=1m \
|`drop_dm_object_name(All_Traffic)`\
| eval dm="Network_Traffic"\
| lookup rqaware_dedup.csv IOC as src_ip OUTPUT IOC as src_match\
| lookup rqaware_dedup.csv IOC as dest_ip OUTPUT IOC as dest_match\
| eval match_field=coalesce(src_match,dest_match)\
| where isnotnull(match_field)\
|`rqaware_ioc_lookup(match_field)`\
| eval match_field=if(isnotnull(src_match),"src","dest")\
| fields - src_match, dest_match\
| addinfo
