### Section for OT Security
[ot_vuln_latest(1)]
args = arg1
definition = index=cve sourcetype=cveinfo\
| eval date_epoch_now=now()\
| convert timeformat="%Y-%m-%dT%H:%MZ" mktime(lastModifiedDate) as date_epoch_lastmod\
| eval _time=date_epoch_lastmod\
| eval date_latest_cut_window=date_epoch_now-(86500*$arg1$)\
| where _time>date_latest_cut_window
iseval = 0

[get_latest_vuln(1)]
args = arg1
definition = index=cve earliest=-$arg1$d latest=now\
| dedup cve sourcetype\
| eval _time=lastModifiedDate\
| stats values(publishedDate) as publishedDate, values(lastModifiedDate) as lastModifiedDate, values(impact.baseMetricV2.cvssV2.baseScore) as base_score, values(description.description_data{}.value) as description, values(references.reference_data{}.name) as reference, values(affects.vendor.vendor_data{}.vendor_name) as vendor, values(affects.vendor.vendor_data{}.product.product_data{}.product_name) as product_name, values(affects.vendor.vendor_data{}.product.product_data{}.version.version_data{}.version_value) as version, count by cve\
| eval date_epoch_now=now() \
| convert timeformat="%Y-%m-%dT%H:%MZ" mktime(lastModifiedDate) as date_epoch_lastmod \
| eval _time=date_epoch_lastmod \
| eval date_latest_cut_window=date_epoch_now-(86500*$arg1$) \
| where _time>date_latest_cut_window\
| table _time lastModifiedDate publishedDate cve vendor product_name version base_score description reference
iseval = 0

#### Section for NERC/CIP
[get_esp_zone(1)]
args = zone
definition = makemv $zone$ delim="|"\
| mvexpand $zone$\
| search $zone$="esp:*"\
| eval $zone$=upper(replace($zone$, "esp:", ""))
iseval = 0

[get_cip_type_and_icon(3)]
args = assetField,iconField,masterField
definition = lookup asset_type_mappings.csv old_asset_type as $assetField$ OUTPUTNEW icon as $iconField$, asset_type as $masterField$, color
iseval = 0

[get_usb_datasources]
definition = index!=_internal
iseval = 0

[get_firewall_datasources]
definition = index=*
iseval = 0

[get_app_datamodel]
definition = sourcetype="script:installedapps"
iseval = 0

[get_baseline_group]
definition = join type=left host [| inputlookup group_baseline_defs | makemv delim="|" group_members | mvexpand group_members | rename group_members as host | fields host, group_name,baseline_name ]
iseval = 0

[get_baseline_os]
definition = join type=left baseline_name \
[| `get_os_baseline`  \
| eval baseline_id=_key, baseline_OS=os_name \
| rename created_date as baseline_created_date | fields baseline_created_date,baseline_OS,baseline_name,baseline_id ]
iseval = 0

[get_baseline_applications]
definition = join type=left baseline_name,value \
    [| `get_application_baseline`\
    | eval app_type=software_type, value=name.":".version.":".publisher\
    | fields baseline_name,baseline_id,value,app_type ]
iseval = 0

[get_eventreview_tags]
definition = tag=authentication OR tag=malware OR tag=update OR tag=change
iseval = 0

[get_installedapps_datasources]
definition = sourcetype="Script:InstalledApps" earliest=-1d@d latest=now
iseval = 0

[get_os_datasources]
definition = source=operatingsystem sourcetype=winhostmon OS=*
iseval = 0

[get_baseline_patches]
definition = join type=left baseline_name,kb \
    [| `get_patch_baseline` \
    | eval baseline_title=title, baseline_update_type=patch_type, baseline_severity=severity, baseline_is_declined=is_declined, baseline_approval_state=is_approved, baseline_patch_creation_date=patch_creation_date\
    | rename created_date as baseline_created_date \
    | fields baseline_*,baseline_name,kb ]
iseval = 0

[get_high_cip_assets(1)]
args = besField
definition = $besField$="*cip:high*"
iseval = 0

[get_low_cip_assets(1)]
args = besField
definition = $besField$="*cip:low*"
iseval = 0

[get_medium_cip_assets(1)]
args = besField
definition = $besField$="*cip:medium*"
iseval = 0

[get_medium_or_low_cip_assets(1)]
args = besField
definition = $besField$="*cip:medium*" OR $besField$="*cip:low*"
iseval = 0

[get_high_medium_low_cip_assets(1)]
args = besField
definition = $besField$="*cip:high*" OR $besField$="*cip:medium*" OR $besField$="*cip:low*"
iseval = 0

[get_cip_pca_assets(1)]
args = categoryField
definition = $categoryField$="*cip:PCA*"
iseval = 0

[get_cip_tca_assets(1)]
args = categoryField
definition = $categoryField$="*cip:TCA*"
iseval = 0

[get_removable_media_indexes]
definition = DeviceType="Removable Storage"
iseval = 0

[get_high_medium_cip_assets(1)]
args = besField
definition = $besField$="*cip:high*" OR $besField$="*cip:medium*"
iseval = 0

[get_baseline_app_installs]
definition = join type=left baseline_name,value \
    [ search `get_installedapps_datasources`\
    | `get_baseline_group` \
    | fillnull DisplayVersion,DisplayName,Publisher value="NA" \
    | eval DisplayName=replace(DisplayName, "\"", ""),value=DisplayName.":".DisplayVersion.":".Publisher, installed="True" \
    | search baseline_name=* \
    | fields baseline_name,value,installed,host,group_name ]
iseval = 0

[get_cip_bca_assets(1)]
args = categoryField
definition = $categoryField$="*cip:BCA*"
iseval = 0

[get_cip_asset_type(2)]
definition = eval $classificationField$=upper($classificationField$), $name$=CASE(\
match($classificationField$, ".*CIP:BCA.*"), "BCA",\
match($classificationField$, ".*CIP:PCA.*"), "PCA",\
match($classificationField$, ".*CIP:EACM.*"), "EACM",\
match($classificationField$, ".*CIP:PACS.*"), "PACS",\
match($classificationField$, ".*CIP:TCA.*"), "TCA",\
1=1, replace($classificationField$, "CIP:", ""))
args = classificationField,name
iseval = 0

[filter_ot_datasources]
definition = index=* (dest=* OR src=* OR dvc=*)
iseval = 0

[get_2fa_indexes]
definition = index=*
iseval = 0

[get_application_baseline]
definition = inputlookup baseline_defs \
| eval baseline_id=_key\
| search config_type=applications config_asset_type=computer\
| spath input=config path=configs{} output=software \
| mvexpand software\
| eval software=replace(software, ":\s\",", ": \"")\
| eval software=replace(software, ",[^\"]", " ")\
| eval software=replace(software, "\{", ""), software=replace(software, "\}", ""), software=replace(software, "\"", "") \
| eval software=split(software,","), software=TRIM(software)\
| eval software_type=mvindex(software, 0), name=mvindex(software, 1), version=mvindex(software, 2), publisher=mvindex(software, 3)\
| eval software_type=split(software_type, ":"), software_type=TRIM(mvindex(software_type, 1))\
| eval name=split(name, ":"), name=TRIM(mvindex(name, 1))\
| eval version=split(version, ":"), version=TRIM(mvindex(version, 1))\
| eval publisher=split(publisher, ":"), publisher=TRIM(mvindex(publisher, 1))\
| fields baseline_id,baseline_name,software_type,name,version,publisher,created_date
iseval = 0

[get_application_baseline_for_group(1)]
args = groupId
definition = inputlookup baseline_defs \
| eval baseline_id=_key\
| search baseline_name=$groupId$ config_type=applications config_asset_type=computer\
| sort -created_date\
| head 1\
| spath input=config path=configs{} output=software \
| mvexpand software\
| eval software=replace(software, "\{", ""), software=replace(software, "\}", ""), software=replace(software, "\"", "") \
| eval software=split(software,","), software=TRIM(software)\
| eval software_type=mvindex(software, 0), name=mvindex(software, 1), version=mvindex(software, 2), publisher=mvindex(software, 3)\
| eval software_type=split(software_type, ":"), software_type=TRIM(mvindex(software_type, 1))\
| eval name=split(name, ":"), name=TRIM(mvindex(name, 1))\
| eval version=split(version, ":"), version=TRIM(mvindex(version, 1))\
| eval publisher=split(publisher, ":"), publisher=TRIM(mvindex(publisher, 1))\
| fields baseline_id,baseline_name,software_type,name,version,publisher,created_date
iseval = 0

[get_os_baseline]
definition = inputlookup baseline_defs \
| eval baseline_id=_key \
| search config_type=os config_asset_type=computer \
| spath input=config path=configs{} output=os_name \
| mvexpand os_name| eval os_name=replace(os_name, "\{", ""), os_name=replace(os_name, "\}", ""), os_name=replace(os_name, "\"", "") \
| eval os_name=split(os_name,","), os_name=TRIM(os_name) \
| eval os_name=mvindex(os_name, 0)\
| eval os_name=split(os_name, ":"), os_name=TRIM(mvindex(os_name, 1)) \
| fields baseline_id,baseline_name,created_date,os_name
iseval = 0

[get_os_baseline_for_group(1)]
args = groupId
definition = inputlookup baseline_defs \
| eval baseline_id=_key \
| search config_type=os config_asset_type=computer baseline_name=$groupId$\
| sort -created_date\
| head 1\
| spath input=config path=configs{} output=os_name \
| mvexpand os_name| eval os_name=replace(os_name, "\{", ""), os_name=replace(os_name, "\}", ""), os_name=replace(os_name, "\"", "") \
| eval os_name=split(os_name,","), os_name=TRIM(os_name) \
| eval os_name=mvindex(os_name, 0)\
| eval os_name=split(os_name, ":"), os_name=TRIM(mvindex(os_name, 1)) \
| fields baseline_id,baseline_name,created_date,os_name
iseval = 0

[get_portconfig_baseline]
definition = inputlookup baseline_defs \
| eval baseline_id=_key \
| search config_type=port_config config_asset_type=networking \
| spath input=config path=configs{} output=port_config \
| mvexpand port_config \
| eval port_config=replace(port_config, "\{", ""), port_config=replace(port_config, "\}", ""), port_config=replace(port_config, "\"", "") \
| eval port_config=split(port_config,","), port_config=TRIM(port_config) \
| eval port_id=mvindex(port_config, 0), speed=mvindex(port_config, 1), is_duplex=mvindex(port_config, 2), is_enabled=mvindex(port_config, 3) \
| eval port_id=split(port_id, ":"), port_id=TRIM(mvindex(port_id, 1)) \
| eval speed=split(speed, ":"), speed=TRIM(mvindex(speed, 1)) \
| eval is_duplex=split(is_duplex, ":"), is_duplex=TRIM(mvindex(is_duplex, 1)) \
| eval is_enabled=split(is_enabled, ":"), is_enabled=TRIM(mvindex(is_enabled, 1)) \
| fields baseline_id,baseline_name,port_id,speed,is_duplex,is_enabled,created_date
iseval = 0

[get_portconfig_baseline_for_group(1)]
args = groupId
definition = inputlookup baseline_defs \
| eval baseline_id=_key \
| search config_type=port_config config_asset_type=networking baseline_name=$groupId$\
| spath input=config path=configs{} output=port_config \
| mvexpand port_config \
| eval port_config=replace(port_config, "\{", ""), port_config=replace(port_config, "\}", ""), port_config=replace(port_config, "\"", "") \
| eval port_config=split(port_config,","), port_config=TRIM(port_config) \
| eval port_id=mvindex(port_config, 0), speed=mvindex(port_config, 1), is_duplex=mvindex(port_config, 2), is_enabled=mvindex(port_config, 3) \
| eval port_id=split(port_id, ":"), port_id=TRIM(mvindex(port_id, 1)) \
| eval speed=split(speed, ":"), speed=TRIM(mvindex(speed, 1)) \
| eval is_duplex=split(is_duplex, ":"), is_duplex=TRIM(mvindex(is_duplex, 1)) \
| eval is_enabled=split(is_enabled, ":"), is_enabled=TRIM(mvindex(is_enabled, 1)) \
| fields baseline_id,baseline_name,port_id,speed,is_duplex,is_enabled,created_date
iseval = 0

[get_patch_baseline]
definition = inputlookup baseline_defs \
| eval baseline_id=_key \
| search config_type=patch config_asset_type=computer\
| spath input=config path=configs{} output=patch_config \
| mvexpand patch_config \
| eval patch_config=replace(patch_config, ",[^\"]", " ")\
| eval patch_config=replace(patch_config, "\{", ""), patch_config=replace(patch_config, "\}", ""), patch_config=replace(patch_config, "\"", "") \
| eval patch_config=split(patch_config,","), patch_config=TRIM(patch_config) \
| eval kb=mvindex(patch_config,0), title=mvindex(patch_config,1), patch_type=mvindex(patch_config,2), severity=mvindex(patch_config,3), is_declined=mvindex(patch_config,4), is_approved=mvindex(patch_config,5), patch_creation_date=mvindex(patch_config,6) \
| eval kb=split(kb, ":"), kb=TRIM(mvindex(kb, 1)) \
| eval title=split(title, ":"), title=TRIM(mvindex(title, 1)) \
| eval patch_type=split(patch_type, ":"), patch_type=TRIM(mvindex(patch_type, 1))\
| eval severity=split(severity, ":"), severity=TRIM(mvindex(severity, 1))\
| eval is_declined=split(is_declined, ":"), is_declined=TRIM(mvindex(is_declined, 1)) \
| eval is_approved=split(is_approved, ":"), is_approved=TRIM(mvindex(is_approved, 1)) \
| eval patch_creation_date=split(patch_creation_date, ":"), patch_creation_date=TRIM(mvindex(patch_creation_date, 1)) \
| fields baseline_id,baseline_name,created_date,kb,title,patch_type,severity,is_declined,is_approved,patch_creation_date
iseval = 0

[get_patch_baseline_for_group(1)]
args = groupId
definition = inputlookup baseline_defs \
| eval baseline_id=_key \
| search config_type=patch config_asset_type=computer baseline_name=$groupId$\
| spath input=config path=configs{} output=patch_config \
| mvexpand patch_config \
| eval patch_config=replace(patch_config, ",[^\"]", " ")\
| eval patch_config=replace(patch_config, "\{", ""), patch_config=replace(patch_config, "\}", ""), patch_config=replace(patch_config, "\"", "") \
| eval patch_config=split(patch_config,","), patch_config=TRIM(patch_config) \
| eval kb=mvindex(patch_config,0), title=mvindex(patch_config,1), patch_type=mvindex(patch_config,2), severity=mvindex(patch_config,3), is_declined=mvindex(patch_config,4), is_approved=mvindex(patch_config,5), patch_creation_date=mvindex(patch_config,6) \
| eval kb=split(kb, ":"), kb=TRIM(mvindex(kb, 1)) \
| eval title=split(title, ":"), title=TRIM(mvindex(title, 1)) \
| eval patch_type=split(patch_type, ":"), patch_type=TRIM(mvindex(patch_type, 1))\
| eval severity=split(severity, ":"), severity=TRIM(mvindex(severity, 1))\
| eval is_declined=split(is_declined, ":"), is_declined=TRIM(mvindex(is_declined, 1)) \
| eval is_approved=split(is_approved, ":"), is_approved=TRIM(mvindex(is_approved, 1)) \
| eval patch_creation_date=split(patch_creation_date, ":"), patch_creation_date=TRIM(mvindex(patch_creation_date, 1)) \
| fields baseline_id,baseline_name,created_date,kb,title,patch_type,severity,is_declined,is_approved,patch_creation_date
iseval = 0

[get_cip_training_and_members]
definition = inputlookup cip_training_materials | search is_available="TRUE" | eval last_update_epoch=strptime(last_update, "%m/%d/%Y"), last_distribution_date_epoch=strptime(last_distribution_date, "%m/%d/%Y") | eval distribution_list_name=split(distribution_list_name, "|") | mvexpand distribution_list_name | lookup cip_distribution_lists distribution_list_name OUTPUTNEW members | eval members=split(members, "|") | mvexpand members
iseval = 0

[remove_identity_prefix]
definition = rex field=identity "(?<prefix>.*)\\\\"\
| fillnull prefix value=""\
| eval identity=replace(identity, prefix, "")\
| eval identity=if(prefix="", identity, substr(identity, 2))
iseval = 0

[get_physicalaccess_records]
definition = source=badge_logs index=main sourcetype="db_connect:badge_scans"
iseval = 0

[exclude_internal_ips(1)]
args = fieldName
definition = NOT ($fieldName$="10.*" OR $fieldName$="172.*" OR $fieldName$="192.*")
iseval = 0

#### Phantom related macros ####
[get_ot_asset_info(1)]
args = arg1
definition = | makeresults \
| eval key="$argv1$" \
| lookup asset_lookup_by_str asset_id as key OUTPUT
iseval = 0

[otsec_action_check_software_new_detected(1)]
definition = inputlookup os_procs_detected_new.csv | search NOT $dvc$
iseval = 0
validation =
args = dvc

[otsec_action_check_software_not_allowed(1)]
definition = inputlookup os_procs_not_allowed.csv | search NOT $dvc$
iseval = 0
validation =
args = dvc

[otsec_action_check_web_malicious(1)]
args = dvc
definition = inputlookup web_access_by_asset.csv\
| table _time, c_ip, dest_host\
| eval threat_intel="Malicious Site"
iseval = 0

[otsec_action_check_web_malicious_artifacts(1)]
args = dvc
definition = tag=web ( jpg OR exe OR png OR jpeg OR pdf) ( cstv.com OR  yimg.com ) earliest=-2h latest=now\
| rex field=_raw "\/(?<artifact>[^\/\s]+\.[a-z]+)\s+"\
| rex field=_raw "http[s]*:\/\/(?<url>[^\/]*)"\
| rex field=_raw "\s+(?<dest>\d+\.\d+\.\d+\.\d+)"\
| stats values(dest) as dest, values(url) as url, count by artifact
iseval = 0

[otsec_action_check_access_priv_auth(1)]
args = dvc
definition = tag=authentication ( user=admin OR user=manager OR user=sys ) NOT (ComputerName=$dvc$) ComputerName=* app=* user=*\
| table ComputerName, app, user
iseval = 0

[otsec_action_check_access_jumpserver(1)]
args = dvc
definition = inputlookup system_access_jumpbox.csv \
| search ( dvc=$dvc$ OR NOT dvc=$dvc$ )\
| table dvc,user_id,term,src,day,date,time,duration
iseval = 0

[otsec_action_check_os_usb_activity(1)]
args = dvc
definition = usb dest_asset_type=hmi OR dest_asset_type=eng* OR dest_asset_type=server* OR dest_asset_type=*ws* dest=$dvc$\
| table _time, dest, Device_ID, Description
iseval = 0

[otsec_action_check_software_sandbox_status(1)]
args = dvc
definition = makeresults 1\
| eval dvc="$dvc$", wsd_status="enabled", wsd_user="operator"
iseval = 0

[otsec_action_check_endpoint_usb_activity(1)]
args = dvc
definition = usb dest_asset_type=hmi OR dest_asset_type=eng* OR dest_asset_type=server* OR dest_asset_type=*ws* dest=$dvc$\
| table _time, dest, Device_ID, Description
iseval = 0

[otsec_action_check_network_wireless_act(1)]
args = dvc
definition = | inputlookup wifi_connect_log.csv \
| search NOT ip=$dvc$\
| sample ratio=0.1
iseval = 0

#### Inherited from ES ####

[get_ksi_fields(2)]
args = curr,prev
definition = `get_ksi_fields($curr$,$prev$,"true",0)`
iseval = 0

[get_ksi_fields(4)]
args = curr,prev,convert,convert_to
definition = `convert_ksi_nonnumeric($curr$,$curr$,"$convert$",$convert_to$)` | `convert_ksi_nonnumeric($prev$,$prev$,"$convert$",$convert_to$)` | `get_ksi_direction($curr$,$prev$,"direction")` | `get_ksi_percent_change($curr$,$prev$,"delta")`
iseval = 0

[get_ksi_direction(3)]
args = curr,prev,outfield
definition = eval "$outfield$"=if(!(isnum('$curr$') and isnum('$prev$')), "undefined", if('$curr$' > '$prev$', "increasing", if('$curr$' < '$prev$', "decreasing", "unchanged")))
iseval = 0

[convert_ksi_nonnumeric(4)]
args = infield,outfield,convert,value
definition = eval "$outfield$"=if("$convert$"=="true" and !isnum('$infield$'), "$value$", '$infield$')
iseval = 0

[get_ksi_percent_change(3)]
args = curr,prev,outfield
definition = `get_ksi_percent_change($curr$,$prev$,$outfield$,"true")`
iseval = 0

[get_ksi_percent_change(4)]
args = curr,prev,outfield,convert
definition = eval "$outfield$"=case((isnull('$curr$') or isnull('$prev$')) and convert!="true", "undefined", '$curr$'=='$prev$', 0, isnum('$curr$') and '$curr$'!=0 and ('$prev$'==0 or !isnum('$prev$')), '$curr$'/abs('$curr$') * 100.00, isnum('$prev$') and '$prev$'!=0 and ('$curr$'==0 or !isnum('$curr$')), (0-'$prev$')/abs('$prev$') * 100, isnum('$curr$') and isnum('$prev$') and '$prev$'!=0 and '$curr$'!=0, ('$curr$'-'$prev$')/'$prev$' * 100.0, 1==1, 0) | eval "$outfield$"=if(isnum('$outfield$'),round('$outfield$', 2), '$outfield$')
iseval = 0

[get_percentage_qualitative(2)]
args = input,output
definition = eval "$output$"=case(!isnum('$input$'),"unknown",abs('$input$')>=90,"extremely",abs('$input$')>=75,"greatly",abs('$input$')>=50,"moderately",abs('$input$')>=25,"slightly",1=1,"minimally")
iseval = 0

[drop_dm_object_name(1)]
args = object
definition = rename "$object$.*" as *
iseval = 0

[get_visitoraccess_records]
definition = sourcetype=visitor_logs
iseval = 0

[get_backup_indexes]
definition = index!=_internal
iseval = 0

[get_notable_asset_details]
definition = eval use_index=CASE(\
dest!="", 1,\
dvc!="", 2,\
1=1, 3)\
| eval host=CASE(\
use_index=1, dest_nt_host,\
use_index=2, dvc_nt_host,\
use_index=3, src_nt_host)\
| eval ip=CASE(\
use_index=1, dest_ip,\
use_index=2, dvc_ip,\
use_index=3, src_ip)\
| eval asset_type=CASE(\
use_index=1, dest_asset_type,\
use_index=2, dvc_asset_type,\
use_index=3, src_asset_type)\
| eval site_id=CASE(\
use_index=1, dest_site_id,\
use_index=2, dvc_site_id,\
use_index=3, src_site_id)\
| eval asset_priority=CASE(\
use_index=1, dest_priority,\
use_index=2, dvc_priority,\
use_index=3, src_priority)\
| eval zone=CASE(\
use_index=1, dest_zone,\
use_index=2, dvc_zone,\
use_index=3, src_zone)
iseval = 0

[get_physical_site_classification(3)]
args = site,location,classification
definition = join type=left $site$,$location$\
 [ | inputlookup cip_site_classification\
 | rename classification as $classification$ site as $site$ location as $location$ | table $site$,$location$,$classification$ ]
iseval = 0

[get_ot_device_asset_types(1)]
args = assetType
definition = $assetType$=PLC OR $assetType$=RTU OR $assetType$="sensor*"
iseval = 0

# CC - This is different in the demo.
#(sourcetype="nozomi:alert" OR sourcetype="claroty:notable*" OR sourcetype="armis:alert" OR sourcetype="forescout:OTSM:logs:alert") ```DEMO ONLY``` OR (index=cybervision sourcetype="cisco:cybervision:events" category="Security Events") OR (index=dragos sourcetype="dragos:notification") OR ((index=otsec OR index=dragos) (sourcetype="otsec:alert" OR sourcetype="asm:event:syslog")) NOT ("*Duplicated IP*" OR "*New CIP traffic*" OR "*New Wireless*" OR "*trisis*" OR "*Potentially*" OR "*tristation*" OR signature="Agent*" OR signature="Scan*" OR signature="PolicyUpdate*" OR occurrence_description="*Virus*" OR occurrence_metric_name="Logoff" OR signature="*Connection Failure*" OR description="Removable media changed*")
# Might want to add a configuration setting and an index macro here...
[get_ot_security_alerts]
definition = sourcetype IN ("nozomi:alert", "claroty:notable*", "armis:alert", "forescout:OTSM:logs:alert", "dragos:notification", "otsec:alert", "asm:event:syslog") OR (sourcetype="cisco:cybervision:events" category="Security Events")
iseval = 0

[get_ot_sec_events]
definition = sourcetype="*dragos*" OR sourcetype="*armis*" OR sourcetype="*claroty*" OR sourcetype="*forescout*" OR sourcetype="*nozomi*" OR sourcetype="*asm*" OR sourcetype="*cybervision*"
iseval = 0

[get_ot_sec_notables]
definition = index=notable (app=Dragos OR app=Claroty OR app=Nozomi OR app=armis OR app="ot-base" OR app=forescout OR app="industrial defender" OR app=asm OR app=cybervision)
iseval = 0

[get_ot_vendors]
definition = vendor="SIEMENS*" OR vendor="ABB*" OR vendor="rockwell*" OR vendor="Schneider*" OR vendor="yokogawa" OR vendor="GE*" OR vendor="Fischer*" OR vendor="bentek*" OR vendor="kimray*" OR vendor="honeywell*"
iseval = 0

[make_asset_markers]
definition = `make_asset_markers("")`
iseval = 0

[make_asset_markers(1)]
args = prefix
definition = eval tooltip="<table cellpadding=\"3\"> <tr> <td>ip:</td> <td>" + if(isnull($prefix$ip), "", $prefix$ip) + "</td> </tr> <tr> <td>host:</td> <td>" + if(isnull($prefix$nt_host), "", $prefix$nt_host) + "</td> </tr> <tr> <td>type:</td> <td>" + if(isnull($prefix$asset_type), "", $prefix$asset_type) + "</td> </tr> <tr> <td>description:</td> <td>" + if(isnull($prefix$description), "", $prefix$description) + "</td> </tr> <tr> <td>site:</td> <td>" + if(isnull($prefix$site_id), "", $prefix$site_id) + "</td> </tr> <tr> <td>city:</td> <td>" + if(isnull($prefix$city), "", $prefix$city) + " (" + if(isnull($prefix$country), "", $prefix$country) + ")</td> </tr> </table>"
iseval = 0

[get_asset_type(1)]
args = asset_field
definition = lookup asset_type_standard_lookup old_asset_type AS $asset_field$ OUTPUT asset_type AS $asset_field$
iseval = 0

[get_perimeter_devices]
definition = `get_perimeter_devices("")`
iseval = 0

[get_perimeter_devices(1)]
args = assetPrefix
definition = ($assetPrefix$asset_type="Firewall" OR $assetPrefix$asset_type="Data-Diode" OR $assetPrefix$asset_type="IDS" OR $assetPrefix$asset_type="IPS")
iseval = 0

[get_asset_type_icon_and_color(4)]
args = assetLookupField,iconField,colorField,assetField
definition = lookup asset_type_mappings.csv old_asset_type as $assetLookupField$ OUTPUTNEW icon as $iconField$, asset_type as $assetField$, color as $colorField$
iseval = 0

[get_cve_index]
definition = index!=_internal
iseval = 0

[get_perimeter_and_networking_devices]
definition = `get_perimeter_and_networking_devices("")`
iseval = 0

[get_perimeter_and_networking_devices(1)]
args = assetPrefix
definition = `get_perimeter_devices($assetPrefix$)` OR `get_ot_networking_devices($assetPrefix$)`
iseval = 0

[get_esp_zone_asset(1)]
args = zone
definition = mvexpand $zone$\
| search $zone$="esp:*"\
| eval $zone$=upper(replace($zone$, "esp:", ""))
iseval = 0

[rba_ot_24hr_thresholds]
definition = risk_event_count>20 (severity="high" OR severity="critical")
iseval = 0

[label_internal_ips(2)]
args = newFieldName, fieldName
definition = eval $newFieldName$=CASE(match($fieldName$, "10\..*"), "true",\
match($fieldName$, "172\..*"), "true",\
match($fieldName$, "192\..*"), "true",\
1=1, "false")
iseval = 0

[prohibited_ot_network_traffic_allowed_filter]
definition = eval src=src_ip, dest=dest_ip\
| `get_asset_by("str", src)`\
| `get_asset_by("str", dest)`\
| fillnull src_category,dest_category value="unknown"\
|  `label_internal_ips(src_is_internal, src_ip)`\
|  `label_internal_ips(dest_is_internal, dest_ip)`\
| eval src_category=if(match(src_category, ".*ot.*"), "ot", if(src_is_internal="true", "internal", "external")), dest_category=if(match(dest_category, ".*ot.*"), "ot", if(dest_is_internal="true", "internal", "external"))\
| search `ot_identifier(src_category)` OR `ot_identifier(dest_category)`\
| dedup src,dest,src_category,dest_category,dest_port,action,app\
| lookup prohibited_traffic_lookup_by_category dest_port src_category dest_category OUTPUT is_prohibited, note\
| search is_prohibited=true
iseval = 0

[ot_identifier(1)]
args = fieldName
definition = $fieldName$=`ot_tag_identifier`
iseval = 0

[ot_tag_identifier]
definition = "ot"
iseval = 0

[get_asset_name(2)]
args = destinationField,sourcePrefix
definition = $destinationField$=`get_asset_name($sourcePrefix$)`
iseval = 0

[get_asset_name(1)]
args = sourcePrefix
definition = CASE(\
isnotnull($sourcePrefix$_dns) AND NOT match($sourcePrefix$_dns,"(?i)^(\s*|null|unknown)$"), upper($sourcePrefix$_dns), \
isnotnull($sourcePrefix$_nt_host) AND NOT match($sourcePrefix$_nt_host,"(?i)^(\s*|null|unknown)$"), upper($sourcePrefix$_nt_host), \
isnotnull($sourcePrefix$_ip) AND NOT match($sourcePrefix$_ip,"(?i)^(\s*|null|unknown)$"), upper($sourcePrefix$_ip), \
isnotnull($sourcePrefix$_mac) AND NOT match($sourcePrefix$_mac,"(?i)^(\s*|null|unknown)$"), upper($sourcePrefix$_mac),\
true(), $sourcePrefix$)
iseval = 0

[get_asset_name]
definition = CASE(\
isnotnull(dns), upper(dns), \
isnotnull(nt_host), upper(nt_host), \
isnotnull(ip), upper(ip), \
isnotnull(mac), upper(mac),\
1=1, "UNKNOWN")
iseval = 0

[malware_update_expiry_days]
definition = 3
disabled = 0
iseval = 0

[get_nvd_cve_index]
definition = index=cve_sum sourcetype="stash"
iseval = 0

[get_windows_os_info]
definition = sourcetype=winhostmon source=operatingsystem earliest=-1d@d latest=now
iseval = 0

[get_share_info_windows_events]
definition = sourcetype="wineventlog" source="wineventlog:security" (EventCode=5140 OR EventCode=5145)
iseval = 0

[get_mitre_enrichment]
definition = eval annotations.mitre_attack = replace(mvindex(mvdedup(technique_id),0), "T8", "T08") | eval annotations="{\"mitre_attack\":[\"" . 'annotations.mitre_attack' . "\"]}" | fields - technique_id
iseval = 0

[normalize_assets]
definition = mvexpand src\
| mvexpand dest\
| eval src = `get_asset_name("src")`\
| eval dest = `get_asset_name("dest")`\
| eval dvc = `get_asset_name("dvc")`
iseval = 0

[get_normalized_alert_message]
definition = if((isnull(signature) OR signature=="unknown" OR signature=="null") AND isnotnull(short_message), short_message, signature) . if(isnotnull(src) AND src!="", if(src != dest, " from ", " on ") . src, "") . if(isnotnull(dest) AND dest!="" AND src!=dest, " to " . dest, "") . if(isnotnull(user) AND user!="", if(match(description, "(?i)account.*created"), ", account=", " by user=") . user, "")
iseval = 0

[get_normalized_severity]
definition = rex "\"severity\":\s+\"(?<extracted_severity>.*?)\""\
| eval severity = coalesce(severity, extracted_severity)\
| fields - extracted_severity\
| replace "Informational" with "informational", "Low" with "low", "Medium" with "medium", "High" with "high", "Very High" with "critical", "Critical" with "critical" in severity\
| rangemap field=severity informational=0.0-3.9 low=4.0-5.9 medium=6.0-7.9 high=8.0-9.9 critical=10.0-10.0 default=none\
| eval severity = if(range!="none", range, severity)\
| fields - range

[get_service_states]
definition = sourcetype="WinHostMon" Type=Service
iseval = 0

[get_ot_networking_devices(1)]
args = assetPrefix
definition = ($assetPrefix$asset_type="Router" OR $assetPrefix$asset_type="Switch" OR $assetPrefix$asset_type="Gateway")
iseval = 0

[get_ot_networking_devices]
definition = `get_ot_networking_devices("")`
iseval = 0

[get_identity(2)]
args = identField, subject
definition = lookup identity_lookup_expanded identity as $identField$ OUTPUTNEW `prepend_alias_identities($subject$)`
iseval = 0

[ot_asset_index]
definition = index=*
iseval = 0

[ot_sw_asset_index]
definition = index=*
iseval = 0

[get_baseline_group(1)]
args = join_field
definition = join type=left $join_field$ [| inputlookup group_baseline_defs | makemv delim="|" group_members | mvexpand group_members | rename group_members as host | fields host, group_name,baseline_name ]
iseval = 0
