[default]
[Endpoint - Blocked Memory Injections - Rule]
action.correlationsearch.annotations = {}
action.correlationsearch.enabled = 1
action.correlationsearch.label = Blocked Memory Injections
action.customsearchbuilder.spec = {}
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable = 1
action.notable.param.rule_description = Blocked Memory Injection Attack Events
action.notable.param.rule_title = Blocked Memory Injections  for $file_path$
action.notable.param.security_domain = endpoint
action.notable.param.severity = low
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk = 1
action.risk.forceCsvResults = 1
action.risk.param._risk = [{"risk_object_field":"file_hash","risk_object_type":"hash_values","risk_score":10},{"risk_object_field":"src","risk_object_type":"system","risk_score":20}]
action.risk.param._risk_score = 0
action.risk.param.verbose = 0
action.send2uba.param.verbose = 0
action.threat_add.param.verbose = 0
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = */5 * * * *
description = Events associated with the memory injection attack which were blocked (action = blocked)
disabled = 1
dispatch.earliest_time = -60m
dispatch.latest_time = now
dispatch.rt_backfill = 1
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = SplunkEnterpriseSecuritySuite
search = | tstats summariesonly=false allow_old_summaries=true \
   count \
   from datamodel=Malware.Malware_Attacks \
   where (source="XmlWinEventLog:Harpoon-Security" OR sourcetype="XmlWinEventLog:Harpoon Security"\
      AND (Malware_Attacks.action=blocked)) \
   by _time,Malware_Attacks.src,Malware_Attacks.action,Malware_Attacks.file_path,Malware_Attacks.file_hash,Malware_Attacks.category,Malware_Attacks.user span=10m\
| rename Malware_Attacks.* as *

[Endpoint - Harpoon IDS Attack Events - Rule]
action.correlationsearch.annotations = {}
action.correlationsearch.enabled = 1
action.correlationsearch.label = Harpoon IDS Attack Events
action.customsearchbuilder.enabled = false
action.customsearchbuilder.spec = {}
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable = 1
action.notable.param.rule_title = Harpoon Attack Event Count
action.notable.param.security_domain = endpoint
action.notable.param.severity = high
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk = 1
action.risk.forceCsvResults = 1
action.risk.param._risk = [{"risk_object_field":"host","risk_object_type":"system","risk_score":33}]
action.risk.param._risk_message = Post Memory Injection Attack Risk Score Adjustment
action.risk.param._risk_score = 0
action.risk.param.verbose = 0
action.send2uba.param.verbose = 0
action.threat_add.param.verbose = 0
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = */5 * * * *
description = A count of post memory injection events detected by the Harpoon TA
disabled = 1
dispatch.earliest_time = -7d
dispatch.latest_time = now
dispatch.rt_backfill = 1
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = SplunkEnterpriseSecuritySuite
search = | tstats `summariesonly` count from datamodel=Intrusion_Detection.IDS_Attacks where earliest=-24h@h latest=+0s (IDS_Attacks.severity="critical" OR IDS_Attacks.severity="high") by _time,IDS_Attacks.src,IDS_Attacks.file_hash\
| rename IDS_Attacks.* as *\
| rename src as host count as total_events

[Endpoint - Post Memory Injection Attack Maneuvers  - Rule]
action.correlationsearch.annotations = {}
action.correlationsearch.enabled = 1
action.correlationsearch.label = Post Memory Injection Attack Maneuvers
action.customsearchbuilder.enabled = false
action.customsearchbuilder.spec = {}
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable = 1
action.notable.param.rule_description = Post Memory Injection Attack Events
action.notable.param.rule_title = Post Memory Injection Attack for $file_path$
action.notable.param.security_domain = endpoint
action.notable.param.severity = critical
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk = 1
action.risk.forceCsvResults = 1
action.risk.param._risk = [{"risk_object_field":"src","risk_object_type":"system","risk_score":100},{"risk_object_field":"user","risk_object_type":"user","risk_score":100}]
action.risk.param._risk_message = Incrementing Host Risk Score for Memory Injection Attacks
action.risk.param._risk_score = 0
action.risk.param.verbose = 0
action.send2uba.param.verbose = 0
action.threat_add.param.verbose = 0
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = */5 * * * *
description = Events associated with the post memory injection attack which were (action = allowed or unknown)
dispatch.earliest_time = -24h
dispatch.latest_time = now
dispatch.rt_backfill = 1
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = SplunkEnterpriseSecuritySuite
search = | tstats summariesonly=false allow_old_summaries=true \
   count max(_time) as event_time\
   from datamodel=Malware.Malware_Attacks \
   where (source="XmlWinEventLog:Harpoon-Security" OR sourcetype="XmlWinEventLog:Harpoon Security"\
      AND (Malware_Attacks.action=allowed OR Malware_Attacks.action=unknown)) \
   by _time,source,Malware_Attacks.src,Malware_Attacks.action,Malware_Attacks.file_path,Malware_Attacks.file_hash,Malware_Attacks.category,Malware_Attacks.user span=1s\
   | eval Malware_Attacks.category="Memory Injection"\
   | rename Malware_Attacks.* as *\
\
\
|  append \
    [ search\
index=notable source="Endpoint - Post Memory Injection Attack Maneuvers  - Rule"\
| rename event_time as _time\
| stats count as _count by _time search_name src,action,file_path,file_hash,category,user\
    ]\
| stats sum(count) as count values(search_name) as search_name values(source) as source values(event_time) as event_time by _time src,action,file_path,file_hash,category,user\
| where isnull(search_name) and isnotnull(source)\
| sort - _time

[Threat - Memory Injection Detection - Rule]
action.correlationsearch.enabled = 1
action.correlationsearch.label = Memory Injection Detection
action.customsearchbuilder.enabled = false
action.customsearchbuilder.spec = {}
action.notable = 1
action.notable.param.rule_description = A memory injection attempt has been $action$ on $dest$ for $process_path$.  Harpoon Security monitors for memory injection attempts and reports them to the Windows Event Log.
action.notable.param.rule_title = Memory Injection detected from $process_name$
action.notable.param.security_domain = threat
action.notable.param.severity = critical
action.notable.param.verbose = 0
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = */5 * * * *
description = This correlation search identified memory injection events from Harpoon Security agent.
dispatch.earliest_time = -24h
dispatch.latest_time = now
dispatch.rt_backfill = 1
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = SplunkEnterpriseSecuritySuite
search = | tstats summariesonly=false allow_old_summaries=true count values(Processes.process) as process max(_time) as lastTime from datamodel=Endpoint.Processes where (source="XmlWinEventLog:Harpoon-Security" OR sourcetype="XmlWinEventLog:Harpoon Security") by _time Processes.process_path Processes.process_name Processes.dest Processes.user Processes.action, source\
| rename "Processes.*" as * \
| lookup injection.csv process_name AS process_name dest as dest user as user OUTPUTNEW storedTime as storedTime \
| fillnull storedTime value=0\
| mvexpand storedTime\
| sort - lastTime,storedTime \
| dedup process_path,process_name,dest,user\
| where lastTime>storedTime\
| rename lastTime as storedTime\
| fields - lastTime\
| outputlookup injection.csv append=t
action.correlationsearch.annotations = {}
action.keyindicator.invert = 0
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk = 1
action.risk.forceCsvResults = 1
action.risk.param._risk = [{"risk_object_field":"dest","risk_object_type":"system","risk_score":33},{"risk_object_field":"user","risk_object_type":"user","risk_score":33}]
action.risk.param._risk_message = Increase system risk for $user$ accessing $dest$
action.risk.param._risk_score = 0
action.risk.param.verbose = 0
action.send2uba.param.verbose = 0
action.threat_add.param.verbose = 0
schedule_window = auto

