##########################
#### FIREWALL REPORTS ####
##########################
[JuniperFW Traffic trend by Device]
search = sourcetype="JuniperFW"| timechart distinct_count(session_id) by device_id

[JuniperFW Device Summary]
search = sourcetype="JuniperFW"| search evt="notification" AND action!=NULL | chart sparkline AS "Action" count(action) AS "Count" by device_id action | rename device_id AS "Firewall" | table Firewall "Action: Deny" "Count: Deny" "Action: Permit" "Count: Permit"

[JuniperFW Top 10 services]
search = sourcetype="JuniperFW" | search evt="notification" | eval service=upper(service)| top 10 service | table service count | rename count AS "Count" service AS "Service"

[JuniperFW Top 10 Talkers]
search = sourcetype="JuniperFW" | search evt="notification" | top 10 src | table src count | rename src AS "Top Talkers" count AS "Count"

[JuniperFW Top 10 destination IPs]
search = sourcetype="JuniperFW" | search evt="notification" | top 10 dst | table dst count | rename dst AS "Top Destination" count AS "Count"

[JuniperFW Get Permit Count]
search = sourcetype="JuniperFW" | search action=Permit | stats count(action)
dispatch.earliest_time = rt-1h
dispatch.latest_time = rt

[JuniperFW Get Deny Count]
search = sourcetype="JuniperFW" | search action=Deny | stats count(action)
dispatch.earliest_time = rt-1h
dispatch.latest_time = rt

[JuniperFW Get Device Count]
search = sourcetype="JuniperFW" | stats distinct_count(device_id)
dispatch.earliest_time = rt-1h
dispatch.latest_time = rt

[JuniperFW Connection Events Summary]
search = sourcetype="JuniperFW" | chart count AS "Count" by comm_type| sort -Count |rename comm_type AS "Connection"

[JuniperFW Zone trend]
search = sourcetype="JuniperFW" | search zone!=Null | eval zone=upper(zone)| timechart count by zone
is_visible = false

[JuniperFW Zone Usage]
search = sourcetype="JuniperFW" | search zone!=Null | eval zone=upper(zone)| chart count by zone
is_visible = false

[JuniperFW Log Report]
search = sourcetype="JuniperFW" | table DateTime action src src_port dst dst_port src_zone dst_zone src_nat dst_nat policy_id | rename DateTime AS "Time" action AS "Action" src AS "Client IP" src_port AS "Source Port" dst AS "Destination IP" dst_port AS "Destination Port" src_zone AS "Source Zone" dst_zone AS "Destination Zone" src_nat AS "Source NAT" dst_nat AS "Destination NAT" policy_id AS "Policy ID"

[JuniperFW Top 10 classifications]
search = sourcetype="JuniperFW" | search evt="notification"| top 10 classification

[JuniperFW Top 10 destination ports]
search = sourcetype="JuniperFW" | top 10 dst_port

[JuniperFW Top 10 Policy]
search = sourcetype="JuniperFW" | top 10 policy_id

[JuniperFW Top 10 Denied Location]
search = sourcetype="JuniperFW" | top 10 action="deny" | fields - percent

[JuniperFW Top 10 source IPs]
search = sourcetype="JuniperFW" | top 10 src

[JuniperFW Service trend]
search = sourcetype="JuniperFW" | search service!=Null | timechart count by service
is_visible = false

[JuniperFW Top 50 Signatures]
search = sourcetype="JuniperFW" | search msg_id="*-00601" | rex "(?i)-00601: (?P<sig_name>[^ ]+)" | top 50 sig_name

[JuniperFW Traffic trend by Type]
search = sourcetype="JuniperFW" | timechart count by msg_id

[JuniperFW Inbound Sessions]
search = sourcetype="JuniperFW" | search src_zone="Untrust" | timechart count by device_id

[JuniperFW Outbound Sessions]
search = sourcetype="JuniperFW" | search dst_zone="Untrust" | timechart count by device_id

[JuniperFW Event Type Summary]
search = sourcetype="JuniperFW" |chart count by evt

[JuniperFW Connection Events Trend]
search = sourcetype="JuniperFW" | search action="Permit" | timechart count by comm_type

[JuniperFW Blocked Trend by Devices]
search = sourcetype="JuniperFW" | search action="Deny" | timechart count by device_id

[JuniperFW Allowed Trend by Devices]
search = sourcetype="JuniperFW" | search action="allow" | timechart count by device_id

[JuniperFW Top 10 Countries]
search = sourcetype="JuniperFW" | search dst_zone="Untrust" |stats count(dst) AS TotalReports by dst|eval clientip=dst| geoip clientip |stats sum(TotalReports) AS "Activity" by clientip_country_name | sort 10 -Activity |rename clientip_country_name AS "Country"

[JuniperFW Top 10 Denied Destination]
search = sourcetype="JuniperFW" | search action="Deny" |chart sparkline AS "Denied Traffic" count(action) AS "Count" by dst | sort 10 -Count|rename dst as "Destination IP"

[JuniperFW Top 10 Denied Des Port]
search = sourcetype="JuniperFW" | search action="Deny" |chart sparkline AS "Denied Traffic" count(action) AS "Count" by dst_port | sort 10 -Count|rename dst_port as "Destination Ports"

[JuniperFW Top 10 Denied Source]
search = sourcetype="JuniperFW" | search action="Deny" |chart sparkline AS "Denied Traffic" count(action) AS "Count" by src| sort 10 -Count|rename src as "Source IP"

[JuniperFW Denied Log Report]
search = sourcetype="JuniperFW" | search action = deny | table DateTime action src src_port dst dst_port src_zone dst_zone src_nat dst_nat policy_id | rename DateTime AS "Time" action AS "Action" src AS "Source IP" src_port AS "Source Port" dst AS "Destination IP" dst_port AS "Destination Port" src_zone AS "Source Zone" dst_zone AS "Destination Zone" src_nat AS "Source NAT" dst_nat AS "Destination NAT" policy_id AS "Policy ID"

####################
#### DI REPORTS ####
####################
[JuniperDI Signature Event Trend by Device]
search =sourcetype="JuniperFW" | search msg_id="*-00601" AND policy!=NULL | timechart count AS "Events" by device_id

[JuniperDI Signature Trend by Policy]
search = sourcetype="JuniperFW" | search msg_id="*-00601" AND policy!=NULL |timechart count by policy

[JuniperDI Top 10 Signatures]
search = sourcetype="JuniperFW" | search msg_id="*-00601" AND policy!=NULL | top 10 sig_name | table sig_name count | rename sig_name AS "Signature"

[JuniperDI Top 10 Source IP]
search = sourcetype="JuniperFW" | search msg_id="*-00601" AND policy!=NULL | top 10 src_ip | table src_ip count | rename src_ip AS "Top Source" count AS "Count"

[JuniperDI Top 10 Destination IP]
search = sourcetype="JuniperFW" | search msg_id="*-00601" AND policy!=NULL | top 10 dst_ip | table dst_ip count | rename dst_ip AS "Top Destination" count AS "Count"

[JuniperDI Signatures Trend by Signature]
search = sourcetype="JuniperFW" | search msg_id="*-00601" AND policy!=NULL |timechart count by sig_name

[JuniperDI Signature Criticality Summary]
search = sourcetype="JuniperFW" | search msg_id="*-00601" AND policy!=NULL |stats count(evt) AS "Events" by evt | rename evt AS "Criticality" 

[JuniperDI Event Status by Device]
search = sourcetype="JuniperFW" | search msg_id="*-00601" AND policy!=NULL |eval evt=upper(evt)| chart count(evt) AS "Events" by device_id evt| rename device_id AS "Device"

[JuniperDI Log Report]
search = sourcetype="JuniperFW" | search msg_id="*-00601" AND policy!=NULL | table DateTime device_id src_ip dst_ip policy evt sig_name | rename device_id AS "Device" src_ip AS "Source IP" dst_ip AS "Destination IP" policy AS "Policy ID" evt AS "Severity" sig_name AS "Signature"

[JuniperDI Top 10 Prevalant DI Signatures]
search = sourcetype="JuniperFW" | search msg_id="*-00601" AND policy!=NULL | stats distinct_count(src_ip) AS "Affected Hosts" by sig_name | sort 10 -"Affected Hosts" | rename sig_name AS "Signature"

[JuniperDI Signatures Per Hour]
search = sourcetype="JuniperFW" | search msg_id="*-00601" AND policy!=NULL | stats count(sig_name) as di |rangemap field=di low=0-0 guarded=1-10 elevated=11-20 high=21-100 severe=101-999999
dispatch.earliest_time = rt-1h
dispatch.latest_time = rt

[JuniperDI Top 10 Countries]
search = sourcetype="JuniperFW" | search msg_id="*-00601" AND policy!=NULL |stats count(dst_ip) AS TotalReports by dst_ip|eval clientip=dst_ip| geoip clientip|stats sum(TotalReports) AS "Activity" by clientip_country_name | sort 10 -Activity |rename clientip_country_name AS "Country"

###########################
###  CHANGE MANAGEMENT  ###
###########################
[JuniperFW Change Stats]
search = sourcetype="JuniperFW" | search msg_id="system-notification-00018" | stats count by host

[JuniperFW 10 Recent changes]
search = sourcetype="JuniperFW" | search msg_id="system-notification-00018" | sort 10 -DateTime | rex "(?i)^(?:[^\-]*\-){8}\d+:\s+(?P<CHANGE>.+)" | rename host AS "Firewall IP" device_id AS "Firewall Name" CHANGE AS "Change" |table DateTime "Firewall IP" "Firewall Name" "Change"

[JuniperFW Change]
search =sourcetype="JuniperFW" | search msg_id="system-notification-00018" | top host device_id | rename host AS "Firewall IP" device_id AS "Firewall Name" |table "Firewall IP" "Firewall Name"

[JuniperFW Top 5 Users per device]
search =sourcetype="JuniperFW" | search msg_id="system-notification-00018" | rex "(?i) by (?P<Username>[^ ]+)" | top 5 Username | rename Username AS "User Name" count AS "Changes" | table "User Name" "Changes"


###########################
###  SCREENING SERVICE  ###
###########################
[Screen Events]
search = sourcetype="JuniperFW" | search msg_id="system-emergency-00005" OR msg_id="system-emergency-00006" OR msg_id="system-emergency-00007" OR msg_id="system-critical-00032" OR msg_id="system-critical-00033" OR msg_id="system-critical-004*" OR msg_id="system-alert-00005" OR msg_id="system-alert-00006"OR msg_id="system-alert-00007" OR msg_id="system-alert-00008" OR msg_id="system-alert-00009"OR msg_id="system-alert-00010" OR msg_id="system-alert-00011" OR msg_id="system-alert-00012" OR msg_id="system-alert-00016" OR msg_id="system-alert-00017" | rex "(?i)^(?:[^\-]*\-){8}\d+:\s+(?P<SCREEN_MSG>[^\!]+)" | top 10 evt SCREEN_MSG by device_id| table device_id SCREEN_MSG evt count | rename device_id as "Firewall" SCREEN_MSG as "Type" evt as "Priority" count as "No Events"

[Screen Events over time]
search = sourcetype="JuniperFW" | search msg_id="system-emergency-00005" OR msg_id="system-emergency-00006" OR msg_id="system-emergency-00007" OR msg_id="system-critical-00032" OR msg_id="system-critical-00033" OR msg_id="system-critical-004*" OR msg_id="system-alert-00005" OR msg_id="system-alert-00006"OR msg_id="system-alert-00007" OR msg_id="system-alert-00008" OR msg_id="system-alert-00009"OR msg_id="system-alert-00010" OR msg_id="system-alert-00011" OR msg_id="system-alert-00012" OR msg_id="system-alert-00016" OR msg_id="system-alert-00017" | rex "(?i)^(?:[^\-]*\-){8}\d+:\s+(?P<SCREEN_MSG>[^\!]+)" | timechart count by device_id

[Screen Security zone]
search = sourcetype="JuniperFW" | search msg_id="system-emergency-00005" OR msg_id="system-emergency-00006" OR msg_id="system-emergency-00007" OR msg_id="system-critical-00032" OR msg_id="system-critical-00033" OR msg_id="system-critical-004*" OR msg_id="system-alert-00005" OR msg_id="system-alert-00006"OR msg_id="system-alert-00007" OR msg_id="system-alert-00008" OR msg_id="system-alert-00009"OR msg_id="system-alert-00010" OR msg_id="system-alert-00011" OR msg_id="system-alert-00012" OR msg_id="system-alert-00016" OR msg_id="system-alert-00017"  | rex "(?i)^(?:[^\-]*\-){8}\d+:\s+(?P<SCREEN_MSG>[^\!]+)" |rex "(?i)\(zone (?P<zone>[^ ]+)" | top 10 zone

[Screen by Client]
search = sourcetype="JuniperFW" | search msg_id="system-emergency-00005" OR msg_id="system-emergency-00006" OR msg_id="system-emergency-00007" OR msg_id="system-critical-00032" OR msg_id="system-critical-00033" OR msg_id="system-critical-004*" OR msg_id="system-alert-00005" OR msg_id="system-alert-00006"OR msg_id="system-alert-00007" OR msg_id="system-alert-00008" OR msg_id="system-alert-00009"OR msg_id="system-alert-00010" OR msg_id="system-alert-00011" OR msg_id="system-alert-00012" OR msg_id="system-alert-00016" OR msg_id="system-alert-00017" |search proto TCP| rex "(?i)^(?:[^\-]*\-){8}\d+:\s+(?P<SCREEN_MSG>[^\!]+)" |  rex "(?i) From (?P<source_ip>.+?) to" | top 10 source_ip | table source_ip count | rename source_ip AS "Source IP Address : Port" count AS "Count"

[Screen Event Per Hour]
search = sourcetype="JuniperFW" | search msg_id="system-emergency-00005" OR msg_id="system-emergency-00006" OR msg_id="system-emergency-00007" OR msg_id="system-critical-00032" OR msg_id="system-critical-00033" OR msg_id="system-critical-004*" OR msg_id="system-alert-00005" OR msg_id="system-alert-00006"OR msg_id="system-alert-00007" OR msg_id="system-alert-00008" OR msg_id="system-alert-00009"OR msg_id="system-alert-00010" OR msg_id="system-alert-00011" OR msg_id="system-alert-00012" OR msg_id="system-alert-00016" OR msg_id="system-alert-00017" | stats count(evt) as screen |rangemap field=screen low=0-0 elevated=1-20 severe=21-9999999999999
dispatch.earliest_time = rt-1h
dispatch.latest_time = rt

######################
###  DHCP SERVICE  ###
######################
[DHCP MAC IP Assignment]
search = sourcetype="JuniperFW" | search msg_id="system-information-00527"|rex "(?i) IP address (?P<IP_Assigned>[^ ]+)"|top mac_address IP_Assigned device_id |eval ven_mac=upper(substr(mac_address,0,6))| lookup vendor-mac mac as ven_mac OUTPUT vendor as dv vendor_descr as descr |table device_id mac_address dv IP_Assigned count  |rename device_id as "Firewall" mac_address as "MAC Address" count as "Assignments" IP_Assigned as "IP Assigned"  dv as "MAC Vendor"

[DHCP MAC Activity]
search = sourcetype="JuniperFW" | search msg_id="system-information-00527"|search mac_address!="NULL"|chart sparkline as "DHCP Requests" count as "No' Requests" by device_id|sort -"No' Requests"|rename device_id as "Devices with DHCP Enabled"
dispatch.earliest_time = rt-24h
dispatch.latest_time = rt

[DHCP MAC Trend By Device]
search = sourcetype="JuniperFW"| search msg_id="system-information-00527"|search mac_address!="NULL"| timechart count by device_id

[DHCP Devices Running Service]
search = sourcetype="JuniperFW"| search msg_id="system-information-00527"|search mac_address!="NULL"| stats distinct_count(device_id)
dispatch.earliest_time = rt-24h
dispatch.latest_time = rt

[DHCP Top MAC Vendor]
search = sourcetype="JuniperFW" | search msg_id="system-information-00527" | search mac_address!="NULL" |stats distinct_count(mac_address) by mac_address|eval ven_mac=upper(substr(mac_address,0,6))| lookup vendor-mac mac as ven_mac OUTPUT vendor as dv vendor_descr as descr | top dv | rename dv as "MAC Manufacturer" count as "No' Devices"

##############################
###  EXTERNAL THREAT DATA ####
##############################
[Top 10 PHPSC Risk]
search = sourcetype="JuniperFW" | search evt="notification" AND dst != 10.* AND dst !=192.168.* AND dst!=172.16.* | stats distinct_count(dst) by dst|lookup PHPScore dst OUTPUT tscore AS ThreatScore |search ThreatScore >50 | sort 10 -ThreatScore |eval clientip=dst| geoip clientip|table dst ThreatScore clientip_country_name| rename dst AS "Destination" clientip_country_name AS Country

[PHPSC Event Per Hour]
search = sourcetype="JuniperFW" | search evt="notification" AND dst != 10.* AND dst !=192.168.* AND dst!=172.16.* | lookup PHPScore dst OUTPUT tscore AS ThreatScore | search ThreatScore>80| stats count(ThreatScore) AS "Risky Destination" |rangemap field="Risky Destination" low=0-20 elevated=21-120 severe=121-200
dispatch.earliest_time = rt-24h
dispatch.latest_time = rt