[zscalerapi-zia-audit]
FIELDALIAS-action = "Action" AS action
FIELDALIAS-category = "Category" AS category
FIELDALIAS-cloudname = "AA in Cloud" AS cloudname
FIELDALIAS-interface = "Interface" AS interface
FIELDALIAS-post_action = "Post Action" AS post_action
FIELDALIAS-pre_action = "Pre Action" AS pre_action
FIELDALIAS-resource = "Resource" AS resource
FIELDALIAS-result = "Result" AS result
FIELDALIAS-src_ip = "Client IP" AS src_ip
FIELDALIAS-sub_category = "Subcategory" AS sub_category
FIELDALIAS-time = "Time" AS time
FIELDALIAS-user = "User" AS user
KV_MODE = json
SHOULD_LINEMERGE = false
TIME_FORMAT = %d %b %Y %H:%M:%S, %Z
TIME_PREFIX = "Time": "
TRUNCATE = 0
category = Splunk App Add-on Builder
description = Zscaler ZIA Admin Audit Logs
pulldown_type = true


[zscalernss-audit]
FIELDALIAS-Action2 = action AS Action
FIELDALIAS-Category2 = category AS Category
FIELDALIAS-ClientIP2 = clientip AS "Client IP"
FIELDALIAS-Interface2 = interface AS Interface
FIELDALIAS-Subcategory2 = subcategory AS Subcategory
FIELDALIAS-Time2 = time AS Time
FIELDALIAS-post_action2 = post_action AS "Post Action"
FIELDALIAS-postaction = post_action AS postaction
FIELDALIAS-preaction = pre_action AS preaction
FIELDALIAS-preaction2 = pre_action AS "Pre Action"
FIELDALIAS-src_ip = clientip AS src_ip
FIELDALIAS-sub_category = subcategory AS sub_category
FIELDALIAS-user = adminid AS user
FIELDALIAS-user2 = adminid AS User
SHOULD_LINEMERGE = false
TIME_FORMAT = %a %b %d %H:%M:%S %Y
MAX_TIMESTAMP_LOOKAHEAD = 30
TIME_PREFIX = time":"
TZ = UTC
TRUNCATE = 0
KV_MODE = 
category = Splunk App Add-on Builder
description = Zscaler ZIA Admin Audit Logs
pulldown_type = true


[zscalerapi-zia-sandbox]
FIELDALIAS-bypass_risk = "Full Details.SecurityBypass{}.Risk"  AS bypass_risk
FIELDALIAS-bypass_sig = "Full Details.SecurityBypass{}.Signature"  AS bypass_sig
FIELDALIAS-bypass_sig_source = "Full Details.SecurityBypass{}.SignatureSources{}" AS bypass_sig_source
FIELDALIAS-category = "Full Details.Summary.Category"  AS category
FIELDALIAS-class_category = "Full Details.Classification.Category"  AS class_category
FIELDALIAS-class_detect_mal = "Full Details.Classification.DetectedMalware"  AS class_detect_mal
FIELDALIAS-class_score = "Full Details.Classification.Score"  AS class_score
FIELDALIAS-class_type = "Full Details.Classification.Type"  AS class_type
FIELDALIAS-country = "Full Details.Origin.Country"  AS country
FIELDALIAS-duration = "Full Details.Summary.Duration"  AS duration
FIELDALIAS-exploit_risk = "Full Details.Exploit{}.Risk"  AS exploit_risk
FIELDALIAS-exploit_sig = "Full Details.Exploit{}.Signature"  AS exploit_sig
FIELDALIAS-exploit_sig_source = "Full Details.Exploit{}.SignatureSources{}"  AS exploit_sig_source
FIELDALIAS-file_cert = "Full Details.FileProperties.DigitalCerificate"  AS file_cert
FIELDALIAS-file_cert_issuer = "Full Details.FileProperties.Issuer"  AS file_cert_issuer
FIELDALIAS-file_cert_root = "Full Details.FileProperties.RootCA"  AS file_cert_root
FIELDALIAS-file_hash = "Full Details.FileProperties.MD5"  AS file_hash
FIELDALIAS-file_size = "Full Details.FileProperties.FileSize"  AS file_size
FIELDALIAS-file_type = "Full Details.FileProperties.FileType"  AS file_type
FIELDALIAS-language = "Full Details.Origin.Language"  AS language
FIELDALIAS-md5 = "Full Details.FileProperties.MD5"  AS md5
FIELDALIAS-net_risk = "Full Details.Networking{}.Risk"  AS net_risk
FIELDALIAS-net_sig = "Full Details.Networking{}.Signature"  AS net_sig
FIELDALIAS-net_sig_source = "Full Details.Networking{}.SignatureSources{}"  AS net_sig_source
FIELDALIAS-orig_risk = "Full Details.Origin.Risk"  AS orig_risk
FIELDALIAS-persist_risk = "Full Details.Persistence{}.Risk"  AS persist_risk
FIELDALIAS-persist_sig = "Full Details.Persistence{}.Signature"  AS persist_sig
FIELDALIAS-persist_sig_source = "Full Details.Persistence{}.SignatureSources{}"  AS persist_sig_source
FIELDALIAS-risk = "Full Details.SystemSummary{}.Risk"  AS risk
FIELDALIAS-sha1 = "Full Details.FileProperties.SHA1"  AS sha1
FIELDALIAS-sha2 = "Full Details.FileProperties.Sha256"  AS sha2
FIELDALIAS-sha256 = "Full Details.FileProperties.Sha256"  AS sha256
FIELDALIAS-sig_source = "Full Details.SystemSummary{}.SignatureSources{}"  AS sig_source
FIELDALIAS-signature = "Full Details.SystemSummary{}.Signature"  AS signature
FIELDALIAS-ssdeep = "Full Details.FileProperties.SSDeep"  AS ssdeep
FIELDALIAS-start_time = "Full Details.Summary.StartTime"  AS start_time
FIELDALIAS-status = "Full Details.Summary.Status"  AS status
FIELDALIAS-stealth_risk = "Full Details.Stealth{}.Risk"  AS stealth_risk
FIELDALIAS-stealth_sig = "Full Details.Stealth{}.Signature"  AS stealth_sig
FIELDALIAS-stealth_sig_source = "Full Details.Stealth{}.SignatureSources{}"  AS stealth_sig_source
SHOULD_LINEMERGE = false
TRUNCATE = 0
category = Splunk App Add-on Builder
description = Zscaler Sandbox detonation reports
pulldown_type = true


[zscalerlss-zpa-app]
EVAL-app = "Zscaler"
EVAL-vendor_product = "Zscaler_ZPA"
SHOULD_LINEMERGE = false
category = Network & Security
description = Zscaler ZPA App Logs
pulldown_type = true
FIELDALIAS-app = Application AS app
FIELDALIAS-dest = Host AS dest
FIELDALIAS-dest_dns = Host AS dest_dns
FIELDALIAS-dest_ip = ServerIP AS dest_ip
FIELDALIAS-dest_port = ServicePort AS dest_port
FIELDALIAS-signature = InternalReason AS signature
FIELDALIAS-src_ip = ClientPublicIP AS src_ip
FIELDALIAS-src_port = ConnectorPort AS src_port
FIELDALIAS-user = Username ASNEW user
KV_MODE = json
LINE_BREAKER = ([\r\n]+)
MAX_TIMESTAMP_LOOKAHEAD = 25
TIME_FORMAT = %a %b %d %H:%M:%S %Y
TIME_PREFIX = LogTimestamp"\s*:\s*"
TZ = UTC


[zscalerlss-zpa-auth]
EVAL-app = "Zscaler"
SHOULD_LINEMERGE = false
category = Network & Security
description = Zscaler ZPA Auth Logs
pulldown_type = true
EVAL-action = case((SessionStatus=="ZPN_STATUS_AUTHENTICATED" OR SessionStatus=="ZPN_STATUS_CONNECTED" OR SessionStatus=="ZPN_STATUS_DISCONNECTED"), "success", SessionStatus=="ZPN_STATUS_AUTH_FAILED", "failure", 1=1, SessionStatus)
EVAL-vendor_product = "Zscaler_ZPA"
FIELDALIAS-action = SessionStatus AS action
FIELDALIAS-app = Application AS app
FIELDALIAS-dest = Host AS dest
FIELDALIAS-dest_port = ServicePort AS dest_port
FIELDALIAS-src = PublicIP AS src
FIELDALIAS-src_port = ConnectorPort AS src_port
FIELDALIAS-user = Username AS user
KV_MODE = json
LINE_BREAKER = ([\r\n]+)
MAX_TIMESTAMP_LOOKAHEAD = 25
TIME_FORMAT = %a %b %d %H:%M:%S %Y
TIME_PREFIX = LogTimestamp"\s*:\s*"
TZ = UTC


[zscalerlss-zpa-bba]
EVAL-app = "Zscaler"
EVAL-vendor_product = "Zscaler_ZPA"
SHOULD_LINEMERGE = false
category = Network & Security
description = Zscaler ZPA Browser Access Logs
pulldown_type = true
EVAL-bytes = RequestSize+ResponseSize
EVAL-url = Host+URL
FIELDALIAS-user = NameID ASNEW user
FIELDALIAS-status = StatusCode ASNEW status
FIELDALIAS-src = ClientPublicIp ASNEW src
FIELDALIAS-http_user_agent = UserAgent ASNEW http_user_agent
FIELDALIAS-http_method = Method ASNEW http_method
FIELDALIAS-bytes_out = ResponseSize ASNEW bytes_out
FIELDALIAS-bytes_in = RequestSize ASNEW bytes_in
FIELDALIAS-dest_port = ApplicationPort ASNEW dest_port
FIELDALIAS-uri_path = URL ASNEW uri_path
LINE_BREAKER = ([\r\n]+)
KV_MODE = json
MAX_TIMESTAMP_LOOKAHEAD = 25
TIME_FORMAT = %a %b %d %H:%M:%S %Y
TIME_PREFIX = LogTimestamp"\s*:\s*"
TZ = UTC


[zscalerlss-zpa-connector]
EVAL-app = "Zscaler"
SHOULD_LINEMERGE = false
category = Network & Security
description = Zscaler ZPA Connector Logs
pulldown_type = true
LINE_BREAKER = ([\r\n]+)
NO_BINARY_CHECK = true
FIELDALIAS-app = Application AS app
FIELDALIAS-dest = Host AS dest
FIELDALIAS-dest_port = ServicePort AS dest_port
FIELDALIAS-src_port = ConnectorPort AS src_port
KV_MODE = json
MAX_TIMESTAMP_LOOKAHEAD = 25
TIME_FORMAT = %a %b %d %H:%M:%S %Y
TIME_PREFIX = LogTimestamp"\s*:\s*"
TZ = UTC


[zscalernss-alerts]
category = Network & Security
description = Zscaler NSS System Alerts
pulldown_type = true


[zscalernss-casb]
LINE_BREAKER = ([\r\n]+)
NO_BINARY_CHECK = 1
category = Network & Security
description = Feeds form Zscaler SaaS Security API scanting
pulldown_type = true


[zscalernss-dns]
EVAL-vendor_product = "Zscaler_ZIA_Firewall"
FIELDALIAS-clt_sip_as_src = clt_sip AS src
FIELDALIAS-clt_sip_as_src_ip = clt_sip AS src_ip
FIELDALIAS-dns_req_as_query = dns_req AS query
FIELDALIAS-dns_reqtype_as_record_type = dns_reqtype AS record_type
FIELDALIAS-dns_resp_as_answer = dns_resp AS answer
FIELDALIAS-durationms_as_response_time = durationms AS response_time
FIELDALIAS-srv_dip_as_dest = srv_dip AS dest
FIELDALIAS-srv_dip_as_dest_ip = srv_dip AS dest_ip
FIELDALIAS-srv_dport_as_dest_port = srv_dport AS dest_port
category = Network & Security
description = Zscaler DNS Control Logs
pulldown_type = true


[zscalernss-fw]
EVAL-action = if(like(action, "%Allow%"), "allowed", action)
EVAL-app = "Zscaler"
EVAL-bytes = inbytes + outbytes
EVAL-vendor_product = "Zscaler_ZIA_Firewall"
FIELDALIAS-cdip_as_dest_ip = cdip AS dest_ip
FIELDALIAS-cdport_as_dest_port = cdport AS dest_port
FIELDALIAS-csip_as_src = csip AS src
FIELDALIAS-csip_as_src_ip = csip AS src_ip
FIELDALIAS-csport_as_src_port = csport AS src_port
FIELDALIAS-csport_as_src_translated_port = csport AS src_translated_port
FIELDALIAS-inbytes_as_bytes_in = inbytes AS bytes_in
FIELDALIAS-locationname_as_src_zone = locationname AS src_zone
FIELDALIAS-outbytes_as_bytes_out = outbytes AS bytes_out
FIELDALIAS-proto_as_protocol = proto AS protocol
FIELDALIAS-proto_as_transport = proto AS transport
FIELDALIAS-sdip_as_dest = sdip AS dest
FIELDALIAS-sdip_as_dest_translated_ip = sdip AS dest_translated_ip
FIELDALIAS-sdport_as_dest_translated_port = sdport AS dest_translated_port
FIELDALIAS-tsip_as_src_translated_ip = tsip AS src_translated_ip
category = Network & Security
description = Zscaler Firewall Logs
pulldown_type = true


[zscalernss-tunnel]
KV_MODE = none
LINE_BREAKER = ([\r\n]+)
NO_BINARY_CHECK = true
REPORT-json_pipeline = zscalernss_web_and_tunnel_json1, zscalernss_web_and_tunnel_url, zscalernss_web_and_tunnel_json2, zscalernss_web_and_tunnel_json1_strings, zscalernss_web_and_tunnel_json1_scalars, zscalernss_web_and_tunnel_json2_strings, zscalernss_web_and_tunnel_json2_scalars
REPORT-tsv_pipeline = zscalernss_web_and_tunnel_tsv, zscalernss_web_and_tunnel_tsv_fields
category = Network & Security
description = Zscaler NSS Tunnel/Network logs
pulldown_type = true


[zscalernss-web]
LINE_BREAKER = ([\r\n]+)
NO_BINARY_CHECK = true
pulldown_type = true
EVAL-action = lower(action)
EVAL-dlp_type = "Inline Gateway"
EVAL-duration = clienttranstime + servertranstime
EVAL-dvc = "Zscaler Cloud Proxy"
EVAL-dvc_zone = "Cloud Proxy"
EVAL-vendor_product = "Zscaler_ZIA_Proxy"
FIELDALIAS-appname_as_app = appname AS app
FIELDALIAS-ClientIP_as_src = ClientIP AS src
FIELDALIAS-ClientIP_as_src_ip = ClientIP AS src_ip
FIELDALIAS-aob_gen_zscalernss_web_alias_1 = protocol AS transport
FIELDALIAS-aob_gen_zscalernss_web_alias_2 = user AS src_user
FIELDALIAS-aob_gen_zscalernss_web_alias_3 = dlpengine AS severity
FIELDALIAS-aob_gen_zscalernss_web_alias_4 = threatname AS signature
FIELDALIAS-aob_gen_zscalernss_web_alias_5 = contenttype AS http_content_type
FIELDALIAS-aob_gen_zscalernss_web_alias_6 = hostname AS dest
FIELDALIAS-aob_gen_zscalernss_web_alias_8 = responsesize AS bytes_in
FIELDALIAS-aob_gen_zscalernss_web_alias_9 = requestsize AS bytes_out
FIELDALIAS-clientpublicIP_as_src_translated_ip = clientpublicIP AS src_translated_ip
FIELDALIAS-clienttranstime_as_response_time = clienttranstime AS response_time
FIELDALIAS-department_as_src_user_bunit = department AS src_user_bunit
FIELDALIAS-dlpdictionaries_as_signature = dlpdictionaries AS signature
FIELDALIAS-filename_as_file_name = filename AS file_name
FIELDALIAS-md5_as_file_hash = md5 AS file_hash
FIELDALIAS-refererURL_as_http_referrer = refererURL AS http_referrer
FIELDALIAS-requestmethod_as_http_method = requestmethod AS http_method
FIELDALIAS-serverip_as_dest_ip = serverip AS dest_ip
FIELDALIAS-threatcategory_as_category = threatcategory AS category
FIELDALIAS-transactionsize_as_bytes = transactionsize AS bytes
FIELDALIAS-urlcategory_as_category = urlcategory AS category
FIELDALIAS-useragent_as_http_user_agent = useragent AS http_user_agent
KV_MODE = none
REPORT-json_pipeline = zscalernss_web_and_tunnel_json1, zscalernss_web_and_tunnel_url, zscalernss_web_and_tunnel_json2, zscalernss_web_and_tunnel_json1_strings, zscalernss_web_and_tunnel_json1_scalars, zscalernss_web_and_tunnel_json2_strings, zscalernss_web_and_tunnel_json2_scalars
REPORT-tsv_pipeline = zscalernss_web_and_tunnel_tsv, zscalernss_web_and_tunnel_tsv_fields
category = Network & Security
description = Zscaler Web/Proxy Logs


[zscalerapi-zws]
LINE_BREAKER = ([\r\n]+)
NO_BINARY_CHECK = true
category = Network & Security
description = Events from Zscaler Workload Segmentaion
pulldown_type = true
KV_MODE = json


[zscalersmokescreen-events]
LINE_BREAKER = ([\r\n]+)
NO_BINARY_CHECK = true
category = Network & Security
pulldown_type = true
KV_MODE = json


[zscalersmokescreen-audit]
LINE_BREAKER = ([\r\n]+)
NO_BINARY_CHECK = true
category = Network & Security
pulldown_type = true
KV_MODE = json


[zscaler-dlpir]
NO_BINARY_CHECK = true
LINE_BREAKER = (ALL_ROWS_INTO_ONE_EVENT)
category = Network & Security
pulldown_type = true
KV_MODE = json


[zscalerlss-zpa-audit]
FIELDALIAS-change_type = AuditOperationType AS change_type
FIELDALIAS-user = User ASNEW user
FIELDALIAS-src_user = User ASNEW src_user
FIELDALIAS-object_id = ObjectID ASNEW object_id
FIELDALIAS-object_category = ObjectType ASNEW object_category
EVAL-action = case(AuditOperationType=="Create","created",AuditOperationType=="Delete","deleted",AuditOperationType=="Sign Out","logoff",AuditOperationType=="Update","updated",AuditOperationType=="Account Locked","lockout",AuditOperationType=="Account Unlocked","unlocked",1=1,AuditOperationType)
EVAL-vendor_product = "Zscaler_ZPA"
ANNOTATE_PUNCT = false
KV_MODE = json
MAX_TIMESTAMP_LOOKAHEAD = 28
SHOULD_LINEMERGE = false
TIME_FORMAT = %Y-%m-%dT%H:%M:%S.%3NZ
TIME_PREFIX = CreationTime"\s*:\s*"
TZ = UTC
category = Network & Security
description = Zscaler ZPA Audit Logs
pulldown_type = true


[zscalerlss-zpa-pse]
EVAL-app = "Zscaler"
FIELDALIAS-app = Application AS app
FIELDALIAS-dest = Host AS dest
FIELDALIAS-dest_port = ServicePort AS dest_port
FIELDALIAS-src_port = ConnectorPort AS src_port
KV_MODE = json
LINE_BREAKER = ([\r\n]+)
MAX_TIMESTAMP_LOOKAHEAD = 25
NO_BINARY_CHECK = true
SHOULD_LINEMERGE = false
TIME_FORMAT = %a %b %d %H:%M:%S %Y
TIME_PREFIX = LogTimestamp"\s*:\s*"
TZ = UTC
category = Network & Security
description = Zscaler ZPA Connector Logs
pulldown_type = true


[zscalerlss-zpa-web-inspection]
FIELDALIAS-zpa_web_inspection = ClientPublicIp ASNEW src Destination ASNEW dest Domain ASNEW url_domain Method ASNEW http_method StatusCode ASNEW status URL ASNEW uri_query UserAgent ASNEW http_user_agent UserID ASNEW user
EVAL-url = Host+URL
EVAL-bytes_out = ResponseHdrSize+ResponseBodySize
EVAL-bytes_in = RequestHdrSize+RequestBodySize
EVAL-bytes = RequestHdrSize+RequestBodySize+ResponseHdrSize+ResponseBodySize
FIELDALIAS-user = UserID ASNEW user
FIELDALIAS-url_domain = Domain ASNEW url_domain
FIELDALIAS-uri_path = URL ASNEW uri_path
FIELDALIAS-status = StatusCode ASNEW status
FIELDALIAS-src = ClientPublicIp ASNEW src
FIELDALIAS-http_user_agent = UserAgent ASNEW http_user_agent
FIELDALIAS-http_method = Method ASNEW http_method
FIELDALIAS-dest = Destination ASNEW dest
LINE_BREAKER = ([\r\n]+)
TZ = UTC


[zscaler-posturecontrol-alerts]
ANNOTATE_PUNCT = false
KV_MODE = json
NO_BINARY_CHECK = true
SHOULD_LINEMERGE = false
LINE_BREAKER = ([\r\n]+)
TIME_FORMAT = %a %b %d %H:%M:%S %Y
TIME_PREFIX = LogTimestamp"\s*:\s*"
MAX_TIMESTAMP_LOOKAHEAD = 25
TZ = UTC
category = Network & Security
description = Zscaler Posture Control Alerts from S3
pulldown_type = 1


[zscaler:zia:syslog]
SHOULD_LINEMERGE = false
LINE_BREAKER = ([\r\n]+)
TIME_PREFIX = ^
TIME_FORMAT = %a %b %d %H:%M:%S %Y
MAX_TIMESTAMP_LOOKAHEAD = 50
TRANSFORMS-01-zia_fw        = zscaler_zia_fw_syslog
TRANSFORMS-02-zia_web       = zscaler_zia_web_syslog
TRANSFORMS-03-zia_dns       = zscaler_zia_dns_syslog
TRANSFORMS-04-zia_audit     = zscaler_zia_audit_syslog


[zscaler:zpa:syslog]
SHOULD_LINEMERGE = false
LINE_BREAKER = ([\r\n]+)
TIME_PREFIX = ^datetime=
TIME_FORMAT = %Y-%m-%d-%H:%M:%S-GMT%z
MAX_TIMESTAMP_LOOKAHEAD = 50
TRANSFORMS-01-zpa_connector = zscaler_zpa_connector_syslog
TRANSFORMS-02-zpa_audit     = zscaler_zpa_audit_syslog
TRANSFORMS-03-zpa_bba       = zscaler_zpa_bba_syslog
TRANSFORMS-04-zpa_app       = zscaler_zpa_app_syslog
TRANSFORMS-05-zpa_auth      = zscaler_zpa_auth_syslog


[zscaler_input]
CHARSET = UTF-8
NO_BINARY_CHECK = true
LINE_BREAKER = ([\r\n]+)
SHOULD_LINEMERGE = false
TIME_PREFIX = (\"[tT]ime\":\s?\")
TIME_FORMAT = %a %b %d %H:%M:%S %Y
MAX_TIMESTAMP_LOOKAHEAD = 30

TRANSFORMS-01-workload_dns = zscaler_workload_dns_syslog
TRANSFORMS-02-workload_fw = zscaler_workload_fw_syslog
TRANSFORMS-03-workload_metrics = zscaler_workload_metrics_syslog
TRANSFORMS-04-workload_session = zscaler_workload_session_syslog
TRANSFORMS-05-workload_events = zscaler_workload_events_syslog



[zscalernss-workload-fw]
CHARSET = UTF-8
NO_BINARY_CHECK = true
LINE_BREAKER = ([\r\n]+)
SHOULD_LINEMERGE = false
TIME_PREFIX = (\"[tT]ime\":\s?\")
TIME_FORMAT = %a %b %d %H:%M:%S %Y
MAX_TIMESTAMP_LOOKAHEAD = 30
KV_MODE = json





[zscalernss-workload-dns]
CHARSET = UTF-8
NO_BINARY_CHECK = true
LINE_BREAKER = ([\r\n]+)
SHOULD_LINEMERGE = false
KV_MODE = json
TIME_PREFIX = (\"[tT]ime\":\s?\")
TIME_FORMAT = %a %b %d %H:%M:%S %Y
MAX_TIMESTAMP_LOOKAHEAD = 30

FIELDALIAS-src = event.clt_ip AS src
FIELDALIAS-dest = event.resolver AS dest
FIELDALIAS-src_host = event.vm_name AS src_host
FIELDALIAS-dest_port = event.srv_port AS dest_port
FIELDALIAS-query = event.dom_str AS query
FIELDALIAS-query_type = event.req_type AS query_type
FIELDALIAS-answers = event.resp_val_str AS answers
FIELDALIAS-answer_type = event.res_type AS answer_type
FIELDALIAS-action = event.req_action AS action
FIELDALIAS-status = event.dns_err AS status
FIELDALIAS-transport = event.protocol AS transport
EVAL-vendor = "Zscaler"
EVAL-product = "NSS for Workloads"
EVAL-object_category = "DNS"


[zscalernss-workload-events]
CHARSET = UTF-8
NO_BINARY_CHECK = true
LINE_BREAKER = ([\r\n]+)
SHOULD_LINEMERGE = false
KV_MODE = json
TIME_PREFIX = (\"[tT]ime\":\s?\")
TIME_FORMAT = %a %b %d %H:%M:%S %Y
MAX_TIMESTAMP_LOOKAHEAD = 30

FIELDALIAS-dvc = event.vm_name AS dvc
FIELDALIAS-severity = event.severity AS severity
EVAL-action = case('event.event_name' == "DHCP Lease Commit", "success", 'event.event_name' == "Control Plane", 'event.attr2_val')
EVAL-status = case('event.event_name' == "Control Plane", 'event.attr2_val', 1=1, "success")
EVAL-object = case('event.event_name' == "Control Plane", 'event.vm_name', 'event.event_name' == "DHCP Lease Commit", 'event.attr2_val')
EVAL-object_category = case('event.event_name' == "Control Plane", 'event.connector_type')
EVAL-change_details = case('event.event_name' == "Control Plane", "The " . 'event.attr1_name' . " changed from '" . 'event.attr1_val' . "' to '" . 'event.attr2_val' . "'")
EVAL-dest = case('event.event_name' == "DHCP Lease Commit", 'event.attr3_val')
EVAL-dest_mac = case('event.event_name' == "DHCP Lease Commit", 'event.attr1_val')
EVAL-dest_host = case('event.event_name' == "DHCP Lease Commit", 'event.attr2_val')
EVAL-app = case('event.event_name' == "DHCP Lease Commit", "dhcp")
EVAL-protocol = case('event.event_name' == "DHCP Lease Commit", "dhcp")
EVAL-vendor = "Zscaler"
EVAL-product = "NSS for Workloads"


[zscalernss-workload-metrics]
CHARSET = UTF-8
NO_BINARY_CHECK = true
LINE_BREAKER = ([\r\n]+)
SHOULD_LINEMERGE = false
KV_MODE = json
TIME_PREFIX = (\"[tT]ime\":\s?\")
TIME_FORMAT = %a %b %d %H:%M:%S %Y
MAX_TIMESTAMP_LOOKAHEAD = 30

FIELDALIAS-host = event.VM_Name AS host
EVAL-vendor = "Zscaler"
EVAL-product = "NSS for Workloads"



[zscalernss-workload-session]
CHARSET = UTF-8
NO_BINARY_CHECK = true
LINE_BREAKER = ([\r\n]+)
SHOULD_LINEMERGE = false
KV_MODE = json
TIME_PREFIX = (\"[tT]ime\":\s?\")
TIME_FORMAT = %a %b %d %H:%M:%S %Y
MAX_TIMESTAMP_LOOKAHEAD = 30

FIELDALIAS-src = event.clt_src_ip AS src
FIELDALIAS-src_port = event.clt_src_port AS src_port
FIELDALIAS-dest = event.clt_dst_ip AS dest
FIELDALIAS-dest_port = event.clt_dst_port AS dest_port
FIELDALIAS-duration = event.session_duration AS duration
FIELDALIAS-dvc = event.vm_name AS dvc
EVAL-vendor = "Zscaler"
EVAL-product = "NSS for Workloads"
EVAL-app = case('event.clt_dst_port'="53", "dns", 'event.clt_dst_port'="80", "http", 'event.clt_dst_port'="443", "ssl")




# Logging
[source::...TA-Zscaler_CIM*.log]
sourcetype = tazscalercim:log

[source::...ta_zscaler_cim*.log]
sourcetype = tazscalercim:log

[tazscalercim:log]
SHOULD_LINEMERGE = false
TIME_FORMAT = %Y-%m-%d %H:%M:%S,%3N
TIME_PREFIX = ^
MAX_TIMESTAMP_LOOKAHEAD = 25
LINE_BREAKER = ([\r\n]+)\d{4}-\d{2}-\d{2}\s
EVENT_BREAKER_ENABLE = true
EVENT_BREAKER = ([\r\n]+)\d{4}-\d{2}-\d{2}\s
