# Change source to path if you do not want to parse against all log4j files. 
[log4j]
REPORT-wso2carbon = WSO2_CARBON_PARSE
REPORT-wso2audit = WSO2_AUDIT_PARSE, WSO2_AUDIT_MESSAGE_PARSE, WSO2_AUDIT_TARGET_APP, WSO2_AUDIT_TARGET_USER, WSO2_LOGIN_PARSE, WSO2_INITIATOR_PARSE
REPORT-wso2audit2 = WSO2_INITIATOR_PARSE2, WSO2_AUDIT_DATA_SIMPLE, BLAKE_SIMPLE_JSON_PARSE, WSO2_AUDIT_BROKEN_SINGLE_JSON, WSO2_AUDIT_FAILED_LOGINS
EVAL-SSO_User = if(isnull(SSO_User), Initiator, SSO_User)
EVAL-Target-User = if(isint(Target)

# CIM Tagging
FIELDALIAS-user = SSO_User
FIELDALIAS-dest_bunit = SSO_Organization
FIELDALIAS-user_bunit = SSO_Organization