[syslog:beyondtrust]
EVAL-user = if(isnotnull(who) AND NOT match(who,"^unknown.*|UNKNOWN"),replace(who,"(.*)\s+\(.*","\1"),null()) 
EVAL-src_user = if(isnotnull(who) AND NOT match(who,"^unknown.*"),replace(who,"(.*)\s+\(.*","\1"),null()) 
EVAL-app = "beyondtrust" 
EVAL-authentication_method = if(event="login" AND match(who,".*\)\s+using\s+"),replace('who',".*\)\s+using\s+",""),null()) 
EVAL-authentication_service = case(event="login" AND match(who,".*gssapi.*"),"Kerberos") 
EVAL-action = if(isnotnull(status) AND status!="" AND event="login",'status',null()) 
EVAL-signature = coalesce('reason','event') 
EVAL-src = 'who_ip' 
EVAL-src_ip = 'who_ip' 
EVAL-dest = 'site' 
EVAL-dest_nt_host = 'site'
EVAL-dest_nt_domain = 'site'
EVAL-object = if(isnotnull('name') AND NOT event IN("login","logout"),'name',if(isnull('name') AND NOT event IN("login","logout"),'event',null()))
EVAL-privileged = if(isnotnull(who) AND event="login" AND match(who,".*using elevate.*"),"true","false") 
EVAL-vendor_product = "BeyondTrust:Privileged Remote Access"

LOOKUP-beyondtrust_events_lookup = beyondtrust_events_lookup event OUTPUTNEW action change_type dataset_name trigger AS description type
LOOKUP-beyondtrust_events_lookup_enriched = beyondtrust_events_lookup event OUTPUTNEW change_type AS object_category status trigger AS object_attrs