[OPD - Newly opened ports]
action.email = 1
action.email.message.alert = OPD has discovered a port open on $result.dest_ip$ which has been closed for 30 days or more.\
\
Customer: $result.customer$\
IP: $result.dest_ip$\
Port: $result.dest_port$\
Host: $result.dest_host$\
\
Click the link below to see the full OPD history for this port.\
\
https://splunk.hurricanedefense.rsoc/en-US/app/opd_alert/search?q=%7C%20savedsearch%20%22OPD%20-%20Port%20History%22%20ip%3D$result.dest_ip$%20port%3D$result.dest_port$&earliest=1&latest=now
action.email.reportServerEnabled = 0
action.email.subject = Security: OPD: Newly opened port detected - Host: $result.dest_ip$, Port: $result.dest_port$
alert.digest_mode = False
alert.suppress = 1
alert.suppress.fields = dest_ip,dest_port
alert.suppress.period = 1d
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
counttype = number of events
cron_schedule = 0 */4 * * *
description = Alerts if a port opened in the past 7 days which hasn't been seen open for at least 30 days. Ignores events tagged as "baseline" - used to define baseline ports.
dispatch.earliest_time = -37d@d
dispatch.latest_time = now
enableSched = 1
quantity = 0
relation = greater than
search = sourcetype=opd (NOT tag="baseline") | stats earliest(time) AS earliest_time latest(time) AS latest_time by dest_ip dest_port | where latest_time > relative_time(now(), "-4h@h") AND earliest_time > relative_time(now(), "-7d")
disabled = 

[OPD Shodan Lookup Populator]
action.email.useNSSubject = 1
alert.track = 0
cron_schedule = 15 0 * * *
description = Populates KV Store of devices from OPD. This lookup will be used to search against Shodan. Should only be enabled if SA-Shodan app is installed and configured.
disabled = 1
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
enableSched = 1
request.ui_dispatch_app = search
request.ui_dispatch_view = search
schedule_window = 30
search = sourcetype=opd:* dest_port_state="open" | stats count latest(time) as time values(dest_port) as port values(dest_svc) as dest_svc by dest_ip, label, transport | fields - count | outputlookup opd_shodan