[symantec:ep:syslog]
EXTRACT-Agent Behavior logs = (?i)(?:([^,]*))?,(?<IP_Address>\d*\.\d*\.\d*\.\d*)?,(?<vendor_action>[^,]*),(?<Description>[^,]*)?,(?<API>[^,]*),(?:Begin:\s*(?<Begin_Time>[^,]*)),(?:End:\s*(?<End_Time>[^,]*)),(?:Rule:\s*(?<rule>[^,]*)),*(?<Caller_Process_ID>\d*),(?<Caller_Process_Name>[^,]*),(?<Return_Address>[^,]*),(?<Return_Module>[^,]*),(?<Parameter>[^,]*),(?:User:\s*(?<user>[^,]*)),(?:Domain:\s*(?<Domain_Name>[^,]*)),(?:Action\sType:\s*(?<Action_Type>[^,]*)),(?:File\ssize\s\(bytes\):\s*(?<File_Size>[^,]*)),(?:Device\sID:\s*(?<Device_ID>[^,]*))
EXTRACT-Agent Scan logs = (?i)(?:Scan\sID:\s*(?<Scan_ID>[^,]*)),(?:Begin:\s*(?<Begin_Time>[^,]*)),(?:End:\s*(?<End_Time>[^,]*)),(?<Status>[^,]*),(?:Duration\s\(seconds\):\s*(?<Duration>[^,]*)),(?:User1:\s*(?<Client_User_1>.*)),(?:User2:\s*(?<Client_User_2>.*)),(?<Start_Message>[^,]*),(?<Stop_Message>[^,]*),(?:Command:\s*(?<Command>[^,]*)),(?:Threats:\s*(?<Threats>[^,]*)),(?:Infected:\s*(?<Infected_Files>[^,]*)),(?:Total\sFiles:\s*(?<Total_Files>[^,]*)),(?:Omitted:\s*(?<Omitted_Files>[^,]*)),(?:Computer:\s*(?<Computer_Name>[^,]*)),(?:IP\sAddress:\s*(?<IP_Address>[^,]*)),(?:Domain:\s*(?<Domain_Name>[^,]*)),(?:Group:\s*(?<Group_Name>[^,]*)),(?:Server:\s*(?<Server_Name>.*))$
EXTRACT-Agent Activity logs = (?i)(?:Site:\s*(?P<Site_Name>\s*'[^']*'|\s*"[^"]*"|\s*[^,]*)),(?:Server:\s*(?P<Server_Name>\s*'[^']*'|\s*"[^"]*"|\s*[^,]*)),(?:Domain:\s*(?P<Domain>\s*'[^']*'|\s*"[^"]*"|\s*[^,]*)),(?P<Event_Description>\s*'[^']*'|\s*"[^"]*"|\s*[^,]*),(?P<Host_Name>\s*'[^']*'|\s*"[^"]*"|\s*[^,]*),(?P<user>\s*'[^']*'|\s*"[^"]*"|\s*[^,]*),(?P<Domain_Name>\s*'[^']*'|\s*"[^"]*"|\s*[^,]*)
EXTRACT-Agent System logs = (?i)(?:([^,]*)),(?:Category:\s*(?<Category>[^,]*)),(?<Event_Source>[^,]*),(?<Event_Description>.*),Event time:(?<Event_time>.*)$
EXTRACT-System logs = (?i)(?:Site:\s*(?P<Site_Name>\s*'[^']*'|\s*"[^"]*"|\s*[^,]*))?,(?:Server:\s*(?P<Server_Name>\s*[^,]*)),(?<Event_Description>[^,]*).$
EXTRACT-Agent Security logs = (?i)(?:Event\sDescription:\s*(?<Event_Description>[^,]*)),(?:Local:\s*(?<Local_Host_IP>[^,]*)),(?:Local\sHost\sMAC:\s*(?<Local_Host_MAC>[^,]*)),(?:Remote\sHost\sName:\s*(?<Remote_Host_Name>[^,]*)),(?:Remote\sHost\sIP:\s*(?<Remote_Host_IP>[^,]*)),(?:Remote\sHost\sMAC:\s*(?<Remote_Host_MAC>[^,]*)),(?<Traffic_Direction>[^,]*),(?<Network_Protocol>[^,]*),(?<Hack_Type>[^,]*),(?:Begin:\s*\s*(?<Begin_Time>[^,]*)),(?:End:\s*(?<End_Time>[^,]*)),(?:Occurrences:\s*(?<Occurrences>[^,]*)),(?:Application:\s*(?<Application_Name>[^,]*)),(?:Location:\s*(?<Location>[^,]*)),(?:(User:|"User:)\s*(?<user>.*)),(?:Domain:\s*(?<Domain_Name>[^,]*)),(?:Local\sPort:\s*(?<Local_Port>[^,]*)),(?:Remote\sPort:\s*(?<Remote_Port>[^,]*)),(?:CIDS\sSignature\sID:\s*(?<CIDS_Signature_ID>[^,]*)),(?:CIDS\sSignature\sstring:\s*(?<CIDS_Signature_String>[^,]*)),(?:CIDS\sSignature\sSubID:\s*(?<CIDS_Signature_SubID>[^,]*)),(?:Intrusion\sURL:\s*(?<Intrusion_URL>[^,]*)),(?:Intrusion\sPayload\sURL:\s*(?<Intrusion_Payload_URL>[^,]*)),(?<Other_details>[^,]*),MD-5:(?<MD5>.*)$
EXTRACT-Policy logs = (?i)(?:Site:\s*(?<Site_Name>[^,]*)),(?:Server:\s(?<Server_Name>[^,]*)),(?:Domain:\s*(?<Domain_Name>[^,]*)),(?:Admin:\s*(?<Admin_Name>[^,]*)),(?<Event_Description>[^,]*),(?<Policy_Name>[^,]*)
EXTRACT-Admin logs = (?i)(Site:\s*(?<Site_Name>[^,]*)),(Server:\s(?<Server_Name>[^,]*)),(Domain:\s*(?<Domain_Name>[^,]*)),(Admin:\s*(?<Admin_Name>[^,]*)),(?<Event_Description>[^,]*)$
EXTRACT-Agent Proactive Detection logs (SONAR) = (?i)(:\s(?P<Risk_Action>[^,]*)),(?:Computer\sname:\s*(?<Computer_Name>[^,]*)),(?:IP\sAddress:\s*(?<IP_Address>[^,]*)),(?:Detection\s*type:\s*(?<Detection_type>[^,]*)),(?:First\sseen:\s*(?<First_Seen>[^,]*)),(?:Application\sname:\s*(?<Application_Name>[^,]*)),(?:Application\stype:\s*(?<Application_Type>[^,]*)),(?:Application\sversion:\s*(?<Application_Version>[^,]*)),(?:Hash\stype:\s*(?<Hash_Type>[^,]*)),(?:Application\shash:\s*(?<Application_Hash>[^,]*)),(?:Company\sname:\s*(?<Company_Name>.*)),(?:File\ssize\s\(bytes\):\s*(?<File_Size>[^,]*)),(?:Sensitivity:\s*(?<Sensitivity>[^,]*)),(?:Detection\s*score:\s*(?<Detecetion_Score>[^,]*)),(?:COH\s*Engine\s*Version:\s*(?<COH_Engine_Version>)[^,]*),(?<Submission_Recommendation>[^,]*),(?:Permitted\s*application\s*reason:\s*(?<Permitted_Application_Reason>.*)),(?:Disposition:\s*(?<Disposition>[^,]*)),(?:Download\ssite:\s*(?<Download_Site>.*)),(?:Web\sdomain:\s*(?<Web_Domain>.*)),(?:Downloaded\sby:\s*(?<Downloaded_By>[^,]*)),(?:Prevalence:\s*(?<Prevalence>.*)),(?:Confidence:\s*(?<Confidence>)[^,]*),(?:URL\sTracking\sStatus:\s*(?<URL_Tracking_Status>[^,]*)),(?:Risk\sLevel:\s*(?<Risk_Level>[^,]*)),(?:Risk\stype:\s*(?<Risk_Type>[^,]*)),(?:Source:\s*(?<Source>[^,]*)),(?:Risk\sname:\s*(?<Risk_Name>[^,]*)),(?:Occurrences:\s*(?<Occurrences>[^,]*)),(?<file_path>[^,]*),(?<Description>[^,]*),(?:Actual\saction:\s*(?<vendor_action>[^,]*)),(?:Requested\saction:\s*(?<Requested_Action>[^,]*)),(?:Secondary\saction:\s*(?<Secondary_Action>[^,]*)),(?:Event\stime:\s*(?<Event_Time>[^,]*)),(?:Inserted:\s*(?<Event_Insert_Time>[^,]*)),(?:End:\s*(?<End_Time>[^,]*)),(?:Domain:\s*(?<Domain_Name>[^,]*)),(?:Group:\s*(?<Group_Name>[^,]*)),(?:Server:\s*(?<Server_Name>[^,]*)),(?:User:\s*(?<user>.*)),(?:Source\scomputer:\s*(?<Source_Computer_Name>[^,]*)),(?:Source\sIP:\s*(?<Source_Computer_IP>[^,]*)),(?:Intensive\sProtection\sLevel:\s*(?<Intensive_Protection_Level>[^,]*)),(?:Certificate\sissuer:\s*(?<Certificate_Issuer>[^,]*)),(?:Certificate\ssigner:\s*(?<Certificate_Signer>[^,]*)),(?:Certificate\sthumbprint:\s*(?<Certificate_Thumbprint>[^,]*)),(?:Signing\stimestamp:\s*(?<Signing_Timestamp>[^,]*)),(?:Certificate\sserial\snumber:\s*(?<Certificate_Serial_Number>.*))$
EXTRACT-Agent Packet logs = (?i)(:\s(?P<Host_Name>[^,]*)),(?:Local\s*Host:\s*(?<Local_Host_IP>[^,]*)),(?:Local\s*port:\s*(?<Local_Port>[^,]*)),(?:Remote\s*Host\s*IP:\s*(?<Remote_Host_IP>[^,]*)),(?:Remote\sHost\sName:\s*(?<Remote_Host_Name>[^,]*)),(Remote\s*port:\s*(?<Remote_Port>[^,]*)),(?<Traffic_Direction>[^,]*),(?:Application:\s*(?<Application_Name>[^,]*)),(?:Action:\s*(?<vendor_action>.*))$
EXTRACT-Agent Traffic logs = (?i)(:\s(?P<Host_Name>[^,]*)),(?:Local\s*Host:\s*(?<Local_Host_IP>[^,]*)),(?:Local\s*port:\s*(?<Local_Port>[^,]*)),(?:Local\sHost\sMAC:\s*(?<Local_Host_MAC>[^,]*)),(?:Remote\s*Host\s*IP:\s*(?<Remote_Host_IP>[^,]*)),(?:Remote\sHost\sName:\s*(?<Remote_Host_Name>[^,]*)),(Remote\s*port:\s*(?<Remote_Port>[^,]*)),(?:Remote\sHost\sMAC:\s*(?<Remote_Host_MAC>[^,]*)),(?<Network_Protocol>[^,]*),(?<Traffic_Direction>[^,]*),(?:Begin:\s*\s*(?<Begin_Time>[^,]*)),(?:End:\s*(?<End_Time>[^,]*)),(?:Occurrences:\s*(?<Occurrences>[^,]*)),(?:Application:\s*(?<Application_Name>[^,]*)),(?:Rule:\s*(?<rule>.*)),(?:Location:\s*(?<Location>[^,]*)),(?:User:\s*(?<user>.*)),(?:Domain:\s*(?<Domain_Name>[^,]*)),(?:Action:\s*(?<vendor_action>[^,]*)),(?:SHA-256:\s*(?<SHA_256>[^,]*)),(?:MD-5:\s*(?<MD_5>[^,]*))$
EXTRACT-Agent Risk logs = (?i)(:\s(?P<Risk_Action>[^,]*)),(?:IP\sAddress:\s*(?<IP_Address>\d*\.\d*\.\d*\.\d*)),(?:Computer\sname:\s*(?<Computer_Name>[^,]*)),(?:Source:\s*(?<Scan_source>[^,]*)),(?:Risk\sname:\s*(?<Risk_Name>[^,]*)),(?:Occurrences:\s*(?<Occurrences>[^,]*)),(?<file_path>[^,]*),(?<Description>[^,]*),(?:Actual\saction:\s*(?<vendor_action>[^,]*)),(?:Requested\saction:\s*(?<Requested_Action>[^,]*)),(?:Secondary\saction:\s*(?<Secondary_Action>[^,]*)),(?:Event\stime:\s*(?<Event_Time>[^,]*)),(?:Inserted:\s*(?<Event_Insert_Time>[^,]*)),(?:End:\s*(?<End_Time>[^,]*)),(?:Last\supdate\stime:\s*(?<Last_update_time>[^,]*)),(?:Domain:\s*(?<Domain_Name>[^,]*)),(?:Group:\s*(?<Group_Name>[^,]*)),(?:Server:\s*(?<Server_Name>[^,]*)),(?:User:\s*(?<user>.*)),(?:Source\scomputer:\s*(?<Source_Computer_Name>[^,]*)),(?:Source\sIP:\s*(?<Source_Computer_IP>[^,]*)),(?:Disposition:\s*(?<Disposition>[^,]*)),(?:Download\ssite:\s*(?<Download_Site>[^,]*)),(?:Web\sdomain:\s*(?<Web_Domain>.*)),(?:Downloaded\sby:\s*(?<Downloaded_By>[^,]*)),(?:Prevalence:\s*(?<Prevalence>[^,]*)),(?:Confidence:\s*(?<Confidence>[^,]*)),(?:URL\sTracking\sStatus:\s*(?<URL_Tracking_Status>[^,]*)),(?:First\sseen:\s*(?<First_Seen>[^,]*)),(?:Sensitivity:\s*(?<Sensitivity>[^,]*)),(?<Permitted_Application_Reason>[^,]*),(?:Application\shash:\s*(?<Application_Hash>[^,]*)),(?:Hash\stype:\s*(?<Hash_Type>[^,]*)),(?:Company\sname:\s*(?<Company_Name>.*)),(?:Application\sname:\s*(?<Application_Name>[^,]*)),(?:Application\sversion:\s*(?<Application_Version>[^,]*)),(?:Application\stype:\s*(?<Application_Type>[^,]*)),(?:File\ssize\s\(bytes\):\s*(?<File_Size>[^,]*)),(?:Category\sset:\s*(?<Category_set>[^,]*)),(?:Category\stype:\s*(?<Detection_type>[^,]*)),(?:Location:\s*(?<Location>[^,]*)),(?:Intensive\sProtection\sLevel:\s*(?<Intensive_Protection_Level>[^,]*)),(?:Certificate\sissuer:\s*(?<Certificate_Issuer>[^,]*)),(?:Certificate\ssigner:\s*(?<Certificate_Signer>[^,]*)),(?:Certificate\sthumbprint:\s*(?<Certificate_Thumbprint>[^,]*)),(?:Signing\stimestamp:\s*(?<Signing_Timestamp>[^,]*)),(?:Certificate\sserial\snumber:\s*(?<Certificate_Serial_Number>.*))$
EXTRACT-lre = Server:\s*(?<Symt_server>[^(,|:)]*)

EVAL-vendor_product = "Symantec Endpoint Protection"
EVAL-dvc = case((Symt_server=="Scan ID" OR isnotnull(Computer_Name)),Computer_Name,Symt_server=="Site" AND isnull(Computer_Name),Server_Name, true(),Symt_server)
EVAL-dest_port = case(Traffic_Direction=="Inbound", Local_Port, Traffic_Direction=="Outbound", Remote_Port, 1=1, dest_port)
EVAL-src_port = case(Traffic_Direction=="Outbound", Local_Port, Traffic_Direction=="Inbound", Remote_Port, 1=1, src_port)
EVAL-direction = lower(Traffic_Direction)
EVAL-dest_ip = case(Traffic_Direction=="Inbound", Local_Host_IP, Traffic_Direction=="Outbound", Remote_Host_IP, 1=1, dest_ip)
EVAL-src_ip = case(Traffic_Direction=="Outbound", Local_Host_IP, Traffic_Direction=="Inbound", Remote_Host_IP, 1=1, src_ip)
FIELDALIAS-signature = Application_Type ASNEW signature
FIELDALIAS-src = Source_Computer_Name ASNEW src
FIELDALIAS-src_ip = Source_Computer_IP ASNEW src_ip
EVAL-dest = case((Symt_server=="Scan ID" OR isnotnull(Computer_Name)),Computer_Name,Symt_server=="Site" AND isnull(Computer_Name),Server_Name, true(),Symt_server)
FIELDALIAS-dest_nt_domain = Domain_Name ASNEW dest_nt_domain
FIELDALIAS-file_hash = Application_Hash ASNEW file_hash
FIELDALIAS-file_hash_type = Hash_Type ASNEW file_hash_type
FIELDALIAS-signature_risk = Risk_Name ASNEW signature
FIELDALIAS-dest_ip = IP_Address ASNEW dest_ip
FIELDALIAS-src_HN = Host_Name ASNEW src
FIELDALIAS-signature_CIDS = CIDS_Signature_String ASNEW signature
FIELDALIAS-Category = Detection_Type ASNEW Category
EVAL-signature = if(vendor_action =="Blocked", if(match(Description, "Block\saccess\sto\sautorun\.inf"), if(isnotnull(Caller_MD5), "Drive Autorun (Caller MD5=" + Caller_MD5+")", "Drive Autorun"), nullif(trim(Description, "\"'"), "")), signature)
EVAL-Category =  if(Traffic_Direction=="Inbound" AND match(vendor_action, "[Bb]lock"), "traffic", Category)


################### For segrigation in multiple sourcetypes#########
[symantec_ep_syslog]
category = endpoint
pulldown_type = true
description = Output produced by symantec EP Server
SHOULD_LINEMERGE=false
TRANSFORMS-set_sourcetype= set_Agent_Behavior_logs, set_Agent_Scan_logs, set_Agent_Activity_logs, set_Agent_System_logs, set_System_logs, set_Agent_Security_logs, set_Policy_logs, set_Agent_Proactive_Detection_logs_SONAR, set_server_admin_logs, set_Agent_Packet_logs,  set_Agent_Traffic_logs, set_Agent_Risk_logs

[symantec_ep_Agent_Behavior_logs]
KV_MODE = none
pulldown_type = true
category = Network & Security
description = Symantec Endpoint Protection client agent Behavior events
MAX_TIMESTAMP_LOOKAHEAD = 32
SHOULD_LINEMERGE = false
REPORT-field_extraction_for_agent_Behavior = field_extraction_for_agent_Behavior
FIELDALIAS-vendor_action_SEP_behavior_vendor_action = vendor_action as SEP_behavior_vendor_action

# For the case: "User Name: user1,user2"
EVAL-user = nullif(split(trim(replace(user, "[^:]+:\s*(.*)", "\1"), "\"'"), ","), "")

# For the case: "Rule: Allow ping, pong and tracert"
EVAL-rule = nullif(trim(replace(rule, "[^:]+:\s*(.*)", "\1"), "\"'"), "")
EVAL-Description = nullif(trim(Description, "\"'"), "")

###### For CIM mapping #########
EVAL-vendor_product = "Symantec Endpoint Protection"
FIELDALIAS-Host_Name_dest = Host_Name as dest
EVAL-signature = if(vendor_action =="Blocked", if(match(Description, "Block\saccess\sto\sautorun\.inf"), if(isnotnull(Caller_MD5), "Drive Autorun (Caller MD5=" + Caller_MD5+")", "Drive Autorun"), nullif(trim(Description, "\"'"), "")), null)
FIELDALIAS-Device_ID_dvc = Device_ID as dvc
FIELDALIAS-Domain_Name_dest_nt_domain = Domain_Name as dest_nt_domain


[symantec_ep_Agent_Scan_logs]
KV_MODE = none
pulldown_type = true
category = Network & Security
description = Symantec Endpoint Protection client agent Scan events
MAX_TIMESTAMP_LOOKAHEAD = 32
SHOULD_LINEMERGE = false
REPORT-field_extraction_for_agent_scan = field_extraction_for_agent_scan
LOOKUP-vendor_action_to_action = symantec_ep_action_lookup vendor_action as SEP_behavior_vendor_action OUTPUT action action as SEP_behavior_action
LOOKUP-vendor_severity_to_severity = symantec_ep_severity_lookup vendor_severity OUTPUT severity
FIELDALIAS-SEP_Scan_Infected_Files = Infected_Files as SEP_Scan_Infected_Files
EVAL-Start_Message = nullif(trim(Start_Message, "\"'"), "")
EVAL-Stop_Message = nullif(trim(Stop_Message, "\"'"), "")
EVAL-dvc = Computer_Name

##### For CIM mapping ######
EVAL-vendor_product = "Symantec Endpoint Protection"
FIELDALIAS-dest = Computer_Name as dest
FIELDALIAS-dest_ip = IP_Address as dest_ip
FIELDALIAS-dest_nt_domain = Domain_Name as dest_nt_domain

[symantec_ep_Agent_Activity_logs]
KV_MODE = none
pulldown_type = true
category = Network & Security
description = Symantec Endpoint Protection client agent activity events
MAX_TIMESTAMP_LOOKAHEAD = 32
SHOULD_LINEMERGE = false
REPORT-field_extraction_for_agent_Activity = field_extraction_for_agent_Activity
LOOKUP-vendor_action_for_agent_act = symantec_ep_admin_action_lookup vendor_action as Event_Description OUTPUT action, change_type
EVAL-user = nullif(trim(user, "\"'"), "")

######## For CIM Mapping ##########
FIELDALIAS-src = Host_Name as src
FIELDALIAS-dest = Server_Name as dest
FIELDALIAS-dvc = Server_Name as dvc
EVAL-vendor_product = "Symantec Endpoint Protection"


[symantec_ep_Agent_System_logs]
KV_MODE = none
pulldown_type = true
category = Network & Security
description = Symantec Endpoint Protection client agent system events
MAX_TIMESTAMP_LOOKAHEAD = 32
SHOULD_LINEMERGE = false
REPORT-field_extraction_for_agent_System = field_extraction_for_agent_System
LOOKUP-vendor_severity_to_severity = symantec_ep_severity_lookup vendor_severity OUTPUT severity
EVAL-Event_Description = nullif(trim(Event_Description, "\"'"), "")
EVAL-vendor_product = "Symantec Endpoint Protection"


[symantec_ep_System_logs]
KV_MODE = none
pulldown_type = true
category = Network & Security
description = Symantec Endpoint Protection system events
MAX_TIMESTAMP_LOOKAHEAD = 32
SHOULD_LINEMERGE = false
REPORT-field_extraction_for_System = field_extraction_for_System
EVAL-Event_Description = nullif(trim(Event_Description, "\"'"), "")
EVAL-vendor_product = "Symantec Endpoint Protection"

###CIM Compliance##
EVAL-dest = Server_Name
EVAL-dvc = Server_Name


[symantec_ep_Agent_Security_logs]
KV_MODE = none
pulldown_type = true
category = Network & Security
description = Symantec Endpoint Protection agent security events
MAX_TIMESTAMP_LOOKAHEAD = 32
SHOULD_LINEMERGE = false
REPORT-field_extraction_for_agent_security = field_extraction_for_agent_security


##### For CIM mappimng ######## 
EVAL-direction = lower(Traffic_Direction)
EVAL-dest = if(Traffic_Direction=="Inbound", Local_Host_IP, Remote_Host_IP)
EVAL-src = if(Traffic_Direction=="Outbound", Local_Host_IP, Remote_Host_IP)
EVAL-vendor_product = "Symantec Endpoint Protection"
FIELDALIAS-signature = CIDS_Signature_String as signature
EVAL-ids_type = "host"
EVAL-action = case(match(Event_Description, "block"), "blocked", 1==1, "allowed")
LOOKUP-vendor_severity_to_severity = symantec_ep_severity_lookup vendor_severity OUTPUT severity

[symantec_ep_Policy_logs]
KV_MODE = none
pulldown_type = true
category = Network & Security
description = Symantec Endpoint Protection server policy events
MAX_TIMESTAMP_LOOKAHEAD = 32
SHOULD_LINEMERGE = false
REPORT-field_extraction_for_policy = field_extraction_for_policy
EVAL-vendor_product = "Symantec Endpoint Protection"
EVAL-Policy_Name = nullif(trim(Policy_Name, "\"'"), "")
EVAL-dvc = Server_Name

[symantec_ep_Agnt_Proactive_Detection_logs]
KV_MODE = none
pulldown_type = true
category = Network & Security
description = Symantec Endpoint Protection agent proactive events
MAX_TIMESTAMP_LOOKAHEAD = 32
SHOULD_LINEMERGE = false
REPORT-field_extraction_for_agent_proactive = field_extraction_for_agent_proactive
EVAL-Detection_Source = if(Detection_Source=="" OR Detection_Source=="N/A", null, Detection_Source)
EVAL-Web_Domain = if(Web_Domain=="" OR Web_Domain=="null", null, Web_Domain)
EVAL-Downloaded_By = if(Downloaded_By=="null" OR Downloaded_By=="", null, Downloaded_By)
EVAL-Download_Site = if(Download_Site=="null" OR Download_Site=="", null, Download_Site)
EVAL-url = if(Download_Site=="null" OR Download_Site=="", null, Download_Site)
EVAL-category = Detection_Type
EVAL-dvc = Computer_Name

##### For CIM mapping #######
EVAL-date = nullif(replace(Event_Time, "\s*(\S+)\s.*", "\1"), "")
FIELDALIAS-signature = Application_Type as signature
EVAL-vendor_product = "Symantec Endpoint Protection"
FIELDALIAS-src = Source_Computer_Name as src
EVAL-src_ip = Source_Computer_IP
EVAL-dest = Computer_Name
FIELDALIAS-dest_nt_domain = Domain_Name as dest_nt_domain
FIELDALIAS-file_hash = Application_Hash as file_hash
FIELDALIAS-file_hash_type = Hash_Type as file_hash_type
LOOKUP-proactive_vendor_action_to_action = symantec_ep_action_lookup vendor_action OUTPUT action

[symantec_ep_server_admin_logs]
KV_MODE = none
pulldown_type = true
category = Network & Security
description = Symantec Endpoint Protection server admin events
MAX_TIMESTAMP_LOOKAHEAD = 32
SHOULD_LINEMERGE = false
REPORT-field_extraction_for_admin = field_extraction_for_admin
EVAL-vendor_product = "Symantec Endpoint Protection"
EVAL-dvc = Server_Name

[symantec_ep_Agent_Packet_logs]
KV_MODE = none
pulldown_type = true
category = Network & Security
description = Symantec Endpoint Protection client packet events
MAX_TIMESTAMP_LOOKAHEAD = 32
SHOULD_LINEMERGE = false
REPORT-field_extraction_for_agent_packet = field_extraction_for_agent_packet
EVAL-vendor_product = "Symantec Endpoint Protection"
Eval-dvc = Host_Name

[symantec_ep_Agent_Traffic_logs]
KV_MODE = none
pulldown_type = true
category = Network & Security
description = Symantec Endpoint Protection agent traffic events
MAX_TIMESTAMP_LOOKAHEAD = 32
SHOULD_LINEMERGE = false
REPORT-field_extraction_for_Agent_traffic = field_extraction_for_Agent_traffic
FIELDALIAS-SEP_Traffic_Direction = Traffic_Direction as SEP_Traffic_Direction
FIELDALIAS-SEP_traffic_vendor_action = vendor_action as SEP_traffic_vendor_action
LOOKUP-symantec_ep_vendor_action_lookup_for_traffic_file = symantec_ep_action_lookup vendor_action as SEP_traffic_vendor_action OUTPUT action action as SEP_traffic_action


######## fields for 'Network Traffic' model ##########
EVAL-direction = lower(Traffic_Direction)
EVAL-dest_ip = if(Traffic_Direction=="Inbound", Local_Host_IP, Remote_Host_IP)
EVAL-src_ip = if(Traffic_Direction=="Outbound", Local_Host_IP, Remote_Host_IP)

EVAL-dest = if(Traffic_Direction=="Inbound", if(Host_Name=="" OR isnull(Host_Name), Local_Host_IP, Host_Name), if(Remote_Host_Name=="" OR isnull(Remote_Host_Name), Remote_Host_IP, Remote_Host_Name))
EVAL-src = if(Traffic_Direction=="Outbound", if(Host_Name=="" OR isnull(Host_Name), Local_Host_IP, Host_Name), if(Remote_Host_Name=="" OR isnull(Remote_Host_Name), Remote_Host_IP, Remote_Host_Name))

EVAL-dest_port = if(Traffic_Direction=="Inbound", Local_Port, Remote_Port)
EVAL-src_port = if(Traffic_Direction=="Outbound", Local_Port, Remote_Port)

EVAL-dest_mac = if(Traffic_Direction=="Outbound", lower(replace(Remote_Host_MAC, "(\w{2})(\w{2})(\w{2})(\w{2})(\w{2})(\w{2})", "\1:\2:\3:\4:\5:\6")), lower(replace(Local_Host_MAC, "(\w{2})(\w{2})(\w{2})(\w{2})(\w{2})(\w{2})", "\1:\2:\3:\4:\5:\6")))
EVAL-src_mac = if(Traffic_Direction=="Inbound", lower(replace(Remote_Host_MAC, "(\w{2})(\w{2})(\w{2})(\w{2})(\w{2})(\w{2})", "\1:\2:\3:\4:\5:\6")), lower(replace(Local_Host_MAC, "(\w{2})(\w{2})(\w{2})(\w{2})(\w{2})(\w{2})", "\1:\2:\3:\4:\5:\6")))

EVAL-vendor_product = "Symantec Endpoint Protection"
EVAL-protocol = if(Network_Protocol=="ICMP" OR isint(Network_Protocol), "icmp", "ip")
EVAL-icmp_type_code = if(isint(Network_Protocol), Network_Protocol, null)
EVAL-transport = if(Network_Protocol=="TCP", "tcp", if(Network_Protocol=="UDP", "udp", "unknown"))
EVAL-duration = strptime(End_Time, "%Y-%m-%d %H:%M:%S")-strptime(Begin_Time, "%Y-%m-%d %H:%M:%S")
LOOKUP-symantec_ep_icmp_type = symantec_ep_icmp_type_lookup icmp_type_code OUTPUT icmp_type_name

##### fields for IDS model (The inbound blocked events is mapped to IDS) #####
EVAL-category =  if(Traffic_Direction=="Inbound" AND match(vendor_action, "[Bb]lock"), "traffic", null)
EVAL-ids_type = if(Traffic_Direction=="Inbound" AND match(vendor_action, "[Bb]lock"), "host", null)
EVAL-signature = if(Traffic_Direction=="Inbound" AND match(vendor_action, "[Bb]lock"), nullif(replace(rule, "[^:]+:\s*(.*)", "\1"), ""), null)
LOOKUP-symantec_ep_severity_lookup_for_traffic_file = symantec_ep_severity_lookup vendor_severity OUTPUT severity

[symantec_ep_Agent_Risk_logs]
KV_MODE = none
pulldown_type = true
category = Network & Security
description = Symantec Endpoint Protection agent risk events
MAX_TIMESTAMP_LOOKAHEAD = 32
SHOULD_LINEMERGE = false
REPORT-field_extraction_for_Agent_risk = field_extraction_for_Agent_risk
FIELDALIAS-SEP_risk_signature = Risk_Name as SEP_risk_signature


# For the case "Field: null" set the field to be null.
EVAL-Web_Domain = if(Web_Domain=="" OR Web_Domain=="null", null, Web_Domain)
EVAL-Downloaded_By = if(Downloaded_By=="null" OR Downloaded_By=="", null, Downloaded_By)
EVAL-Download_Site = if(Download_Site=="null" OR Download_Site=="", null, Download_Site)
EVAL-url = if(Download_Site=="null" OR Download_Site=="", null, Download_Site)

###### For CIM mapping #######
EVAL-date = nullif(replace(Event_Time, "\s*(\S+)\s.*", "\1"), "")
FIELDALIAS-signature = Risk_Name as signature
FIELDALIAS-file_hash = Application_Hash as file_hash
FIELDALIAS-file_hash_type = Hash_Type as file_hash_type
EVAL-vendor_product = "Symantec Endpoint Protection"
FIELDALIAS-src = Source_Computer_Name as src
FIELDALIAS-src_ip = Source_Computer_IP as src_ip
FIELDALIAS-dest = Computer_Name as dest
FIELDALIAS-dest_nt_domain = Domain_Name as dest_nt_domain
FIELDALIAS-dest_ip = IP_Address as dest_ip
LOOKUP-risk_vendor_action_to_action = symantec_ep_action_lookup vendor_action OUTPUT action
LOOKUP-risk_category_lookup = symantec_ep_malware_category_lookup title as SEP_risk_signature OUTPUT type as category  riskLevel as Risk_Level type as SEP_risk_category riskLevel as SEP_Risk_Level
