[DA-ITSI-OS-OS_Hosts_Search]
description = Search for discovering OS Hosts
search = `itsi_os_module_indexes` tag=inventory tag=oshost | eval role="operating_system_host" | stats latest(family) as family, latest(version) as version, latest(vendor_product) as vendor_product, latest(role) as itsi_role, latest(cpu_cores) as cpu_cores, latest(mem) as memory, latest(cpu_architecture) as cpu_architecture by host | fields + host, family, version, vendor_product, itsi_role, cpu_cores, memory, cpu_architecture
dispatch.earliest_time = -4h
dispatch.latest_time = now
request.ui_dispatch_app = itsi
request.ui_dispatch_view = search

[DA-ITSI-OS-Inventory_Search]
search = `itsi_os_module_indexes` host=$host$ tag=oshost tag=inventory (tag=memory OR tag=cpu OR tag=storage) (cpu_cores=* OR cpu_mhz=* OR mem=* OR storage=* OR mount=* OR family=* OR version=* OR vendor_product=*) | stats latest(cpu_cores) as "CPU Cores", latest(cpu_architecture) as "CPU Architecture", latest(cpu_mhz) as "CPU Speed (mhz)", latest(mem) as mem, latest(storage) as storage, values(mount) as mounts, latest(family) as "OS Family", latest(version) as "Version", latest(vendor_product) as "Vendor Product" by host | `get-closest-disk-unit(storage)` | eval "File Systems" = mvjoin(mounts,", "), "Memory" = tostring(round(mem/1024, 2))." GB", "Storage" = tostring(round(storage/divisor, 1))." ".unit_to_use | eval "Memory" = if(Memory="Null GB", "", Memory), "Storage" = if(substr(Storage,0,4)=="Null", "", Storage) | table "OS Family" "Version" "Memory" "CPU Cores" "CPU Architecture" "CPU Speed (mhz)" "Storage" "File Systems" "Vendor Product"
request.ui_dispatch_app = itsi
request.ui_dispatch_view = search

[DA-ITSI-OS-Context_Chart_CPU_Queue_Length_Search]
search = `itsi_os_module_indexes` host=$host$ tag=oshost tag=performance tag=cpu wait_threads_count=* | timechart avg(wait_threads_count) as wait_threads_count | eventstats avg(wait_threads_count) as average | eval _stats = "Average: ".round(average, 1)."%" | fields - average
request.ui_dispatch_app = itsi
request.ui_dispatch_view = search

[DA-ITSI-OS-Context_Chart_Processes_Running_Search]
search = `itsi_os_module_indexes` host=$host$ tag=oshost tag=performance tag=process process_name=* | timechart dc(process_name) as "No. of Processes", values(process_name) as processes_name | eventstats dc(processes_name) as _total | eval _total = "Total: ".tostring(_total, "commas")." processes"
request.ui_dispatch_app = itsi
request.ui_dispatch_view = search

[DA-ITSI-OS-Context_Chart_CPU_Usage_Search]
search = `itsi_os_module_indexes` host=$host$ tag=oshost tag=performance tag=cpu cpu_load_percent=* | timechart avg(cpu_load_percent) as cpu_pct | eventstats avg(cpu_pct) as average | eval _stats = "Average: ".round(average, 1)."%" | fields - average
request.ui_dispatch_app = itsi
request.ui_dispatch_view = search

[DA-ITSI-OS-Context_Chart_Memory_Usage_Search]
search = `itsi_os_module_indexes` host=$host$ tag=oshost tag=performance tag=memory mem_free_percent=* | eval mem_used_percent = 100 - mem_free_percent | timechart avg(mem_used_percent) as mem_pct | eventstats avg(mem_pct) as average | eval _stats = "Average: ".round(average, 1)."%" | fields - average
request.ui_dispatch_app = itsi
request.ui_dispatch_view = search
