[Bandwidth Usage]
search = sourcetype=barracuda | `calc_bandwidth_MB(chart, _time)`

[Bandwidth by Hour of Day]
search = sourcetype=barracuda | bucket _time span=24h | `calc_bandwidth_MB(chart, date_hour)`

[Bandwidth by Day of Week]
search = sourcetype=barracuda | bucket _time span=24h | `calc_bandwidth_MB(chart, date_wday)`

[Users by Requests]
search = sourcetype=barracuda action_type="0" | fields + login_id | top limit=0 login_id | rename login_id AS "User ID", count AS "# of Requests", percent AS "% of Requests"

[Bandwidth by User]
search = sourcetype=barracuda | fields + login_id, request_size | `calc_bandwidth_MB(stats, login_id)` | `rename_bandwidth` | rename login_id AS "User ID" | sort - "Bandwidth Consumed"

[Bandwidth by Source IP]
search = sourcetype=barracuda | fields + src_ip, request_size | `calc_bandwidth_MB(stats, src_ip)` | `rename_bandwidth` | rename src_ip AS "Source IP Address" | sort - "Bandwidth Consumed"

[Source IPs By Requests]
search = sourcetype=barracuda action_type="0" | fields + src_ip | top limit=0 src_ip | sort - count | rename src_ip AS "Source IP Address", count as "# of Requests", percent as "% of Requests"

[Dest IPs by Requests]
search = sourcetype=barracuda action_type="0" | fields + dst_ip | top limit=0 dst_ip | sort - count | rename dst_ip AS "Dest. IP Address", count as "# of Requests", percent as "% of Requests"

[Bandwidth by Dest IP]
search = sourcetype=barracuda | fields + dst_ip, request_size | `calc_bandwidth_MB(stats, dst_ip)` | `rename_bandwidth` | rename dst_ip AS "Dest. IP Address" | sort - "Bandwidth Consumed"

[Users by Spyware Type]
search = sourcetype=barracuda | `spyware` | fields + spy_id, login_id | top limit=0 login_id, spy_id | rename login_id AS "User ID", spy_id AS "Spyware Type", count AS "# of Requests", percent AS "% of Requests"

[Spyware Types]
search = sourcetype=barracuda | `spyware` | fields + spy_id | top limit=0 showperc=false spy_id | rename spy_id AS "Spyware Type", count AS "# of Requests"

[Domains by Spyware Type]
search = sourcetype=barracuda | `spyware` | top limit=0 showperc=false matched_part, spy_id | rename matched_part AS "Domain Name", spy_id AS "Spyware Type", count AS "# of Requests"

[Source IPs by Spyware Type]
search = sourcetype=barracuda | `spyware` | top limit=0 showperc=false src_ip, spy_id | rename src_ip AS "Source IP", spy_id AS "Spyware Type", count AS "# of Requests"

[Content Types]
search = sourcetype=barracuda content_type!="-" action_type="0" | fields + content_type | top limit=0 content_type | rename content_type AS "Content Type", count as "# of Requests", percent AS "% of Requests"

[Domains by Content Type]
search = sourcetype=barracuda (content_type!="-" AND matched_part!="-") action_type="0" | fields + content_type, matched_part | top limit=1 showcount=false showperc=false matched_part by content_type | sort - count | rename content_type AS "Content Type", matched_part AS "Domain"

[Domains by Category]
search = sourcetype=barracuda (matched_category!="-" AND matched_part!="-") action_type="0" | fields + matched_category, matched_part | top limit=1 showcount=false showperc=false matched_part by matched_category | sort - count | rename matched_part AS "Domain", matched_category AS "Category Name"

[Bandwidth by Content Type]
search = sourcetype=barracuda content_type!="-" | fields + content_type, request_size | `calc_bandwidth_MB(stats, content_type)` | `rename_bandwidth` | rename content_type AS "Content Type" | sort - "Bandwidth Consumed"

[Bandwidth by Domain]
search = sourcetype=barracuda matched_part!="-" | fields + matched_part, request_size | `calc_bandwidth_MB(stats, matched_part)` | `rename_bandwidth` | rename matched_part AS "Domain Name" | sort - "Bandwidth Consumed"

[Domains by Request]
search = sourcetype=barracuda matched_part!="-" action_type="0"  | fields + matched_part | top matched_part | rename matched_part AS "Domain Name", count AS "# of Requests", percent AS "% of Requests"

[Requests by Hour of Day]
search = sourcetype=barracuda action_type="0" | chart count by date_hour

[Requests by Day of Week]
search = sourcetype=barracuda action_type="0" | chart count by date_wday

[Categories by Request]
search = sourcetype=barracuda matched_category!="-" action_type="0" | fields + matched_category | top limit=0 showperc=false matched_category | rename matched_category AS "Category Name", count as "# of Requests"

[Bandwidth by Category]
search = sourcetype=barracuda matched_category!="-" | fields + matched_category, request_size | `calc_bandwidth_MB(stats, content_type)` | `rename_bandwidth` | rename matched_category as "Category Name" | sort - "Bandwidth Consumed"

[Categories by User]
search = sourcetype=barracuda matched_category!="-" action_type="0" | fields + matched_category, login_id | top limit=1 showperc=false matched_category by login_id | rename login_id AS "User ID", count AS "# of Requests", matched_category AS "Category"

[Domains by User]
search = sourcetype=barracuda matched_part!="-" action_type="0" | fields + matched_part, login_id | top limit=1 showperc=false matched_part by login_id | rename login_id AS "User ID", count AS "# of Requests", matched_part AS "Domain Name"

[Blocked Users By Requests]
search = sourcetype=barracuda action_type="1" | fields + login_id | top limit=0 login_id | rename login_id AS "User ID", count AS "# of Requests", percent AS "% of Requests"

[Blocked Source IPs By Requests]
search = sourcetype=barracuda action_type="1" | fields + src_ip | top limit=0 src_ip | sort - count | rename src_ip AS "Source IP Address", count as "# of Requests", percent as "% of Requests"

[Blocked Dest IPs by Requests]
search = sourcetype=barracuda action_type="1" | fields + dst_ip | top limit=0 dst_ip | sort - count | rename dst_ip AS "Dest. IP Address", count as "# of Requests", percent as "% of Requests"

[Blocked Content Types]
search = sourcetype=barracuda content_type!="-" action_type="1" | fields + content_type | top limit=0 content_type | rename content_type AS "Content Type", count as "# of Requests", percent AS "% of Requests"

[Blocked Domains by Content Type]
search = sourcetype=barracuda (content_type!="-" AND matched_part!="-") action_type="1" | fields + content_type, matched_part | top limit=1 showcount=false showperc=false matched_part by content_type | sort - count | rename content_type AS "Content Type", matched_part AS "Domain"

[Blocked Domains by Category]
search = sourcetype=barracuda (matched_category!="-" AND matched_part!="-") action_type="0" | fields + matched_category, matched_part | top limit=1 showcount=false showperc=false matched_part by matched_category | sort - count | rename matched_part AS "Domain", matched_category AS "Category Name"

[Blocked Domains by Request]
search = sourcetype=barracuda matched_part!="-" action_type="1"| fields + matched_part | top limit=10 matched_part | rename matched_part AS "Domain Name", count AS "# of Requests", percent AS "% of Requests"

[Blocked Requests by Hour of Day]
search = sourcetype=barracuda action_type="1" | chart count by date_hour

[Blocked Requests by Day of Week]
search = sourcetype=barracuda action_type="1" | chart count by date_wday

[Blocked Categories by Request]
search = sourcetype=barracuda matched_category!="-" action_type="1" | fields + matched_category | top limit=0 showperc=false matched_category | rename matched_category AS "Category Name", count as "# of Requests"

[Blocked Categories by User]
search = sourcetype=barracuda matched_category!="-" action_type="1" | fields + matched_category, login_id | top limit=1 showperc=false matched_category by login_id | rename login_id AS "User ID", count AS "# of Requests", matched_category AS "Category"

[Blocked Domains by User]
search = sourcetype=barracuda matched_part!="-" action_type="1" | fields + matched_part, login_id | top limit=1 showperc=false matched_part by login_id | rename login_id AS "User ID", count AS "# of Requests", matched_part AS "Domain Name"

[Phishtank Matches]
search = sourcetype=barracuda | lookup phishtank url AS dst_url | search phish_id!="" | table _time, submission_time, login_id, phish_id, dst_url, phish_detail_url | rename _time AS "Event Date", submission_time AS "Phishtank Submission Date", login_id AS "User ID", phish_id AS "Phishtank ID", dst_url AS "Destintion URL", phish_detail_url AS "Phishtank Details URL"
