[bluecoat:proxysg:console:syslog]
SHOULD_LINEMERGE = false
TIME_PREFIX = ^
TIME_FORMAT = %b %d %H:%M:%S
MAX_TIMESTAMP_LOOKAHEAD = 16
LINE_BREAKER = ([\r\n]+)\w{3}\s+\d+\s+\d{2}:\d{2}:\d{2}\s+

EXTRACT-access_log = E[0-9A-F]+\s+Access Log\s*\w*\s*\((?P<access_log>([^\)]+))\)
EXTRACT-auth_failed = Authentication\s+(?<vendor_action>[^ ]+)\s+from\s+(?<src_ip>[0-9.]+):
EXTRACT-auth_success = (?<login_protocol>[^: ]+):\s+(?<vendor_action>\w+), login-authentication "(?<auth_type>[^"]+)", user "(?<user>[^"]+)", realm "(?<realm>[^"]+)", from (?<src_ip>[0-9.]+), port "(?<src_port>[0-9]+)", protocol "(?<ssh_protocol>[^"]+)"
EXTRACT-configuration_event = (?<access_type>\w+) admin at (?<src_ip>[0-9.]{7,15}) '(?:(?<dest_nt_domain>[A-Z0-9]+)\\)?(?<user>[^']+)', (?<vendor_action>[^(]+)\(
EXTRACT_dest_ip_access = Connecting to primary ([^ ]+ )?server (?<dest_ip_access>[0-9.]+):(?<dest_port>[0-9]+)\.
EXTRACT-log_type = (?<log_type>[A-Z]+_(?:ERROR|EVENT))
EXTRACT-normal_src_ip = from\s(?<src_ip>[0-9.]{7,15}):
EXTRACT-normal_user = user\s'(?:(?<dest_nt_domain>[A-Z0-9]+)\\)?(?<user>[^']+)'
EXTRACT-signature_id = ProxySG:\s+(?<signature_id>[0-9A-F]+)\s

REPORT-object = extract_object_from_vendor_action

EVAL-app = "bluecoat"
EVAL-dest = coalesce(dest_ip_access,dest)
EVAL-object = if(isnull(object),"system",object)
EVAL-product = "ProxySG"
EVAL-src = if(!isnull(dest_ip_access),host,src)
EVAL-vendor = "Blue Coat"
EVAL-vendor_product = "Blue Coat ProxySG"

FIELDALIAS-src = src_ip AS src
FIELDALIAS-dest = host AS dest
FIELDALIAS-dvc = host AS dvc

LOOKUP-action = bluecoat_console_action_lookup vendor_action OUTPUT action change_type,status
LOOKUP-object_category = bluecoat_console_object_category_lookup object OUTPUT object_category
