[User Activity Report v3.x]
description = A report for the User Activity over the last 30d. Reports on Success and Failure to login by User. Sorted by overall Total Operations.
dispatch.earliest_time = -30d@d
dispatch.latest_time = now
display.general.type = statistics
display.page.search.tab = statistics
request.ui_dispatch_view = search
search = `hsm_idx` ("Cryptography" OR "ProtocolJCE" OR "ProtocolMSCNG" OR "ProtocolPKCS PKCS#11") ("Login Successful" OR "Login Failed")\
| rex field=_raw "Login (?<Status>.*?): User: (?<User>.*?),"\
| search User=*\
| chart count latest(_time) as _time by User Status\
| fields - "VALUE_time: failed"\
| rename "VALUE_time: successful" as "Last_Successful_Logins" "count: *" as *\
| eval Last_Successful_Logins=strftime(Last_Successful_Logins,"%d-%m-%Y")\
| append [search index=primushsm "Cryptography Usage statistics" "Total key usage count" \
| rex field=_raw "Cryptography Usage statistics: User: (?<User>.*?),.*?, Total key usage count: (?<Usage>\d+)"  \
| stats sum(Usage) as Usage by  User] \
| stats values(Last_Successful_Logins) as "Last Successful Logins" sum(successful) as "Sum of Successful Logins" sum(failed) as "Sum of Failed Logins" sum(Usage) as "Total no. of Operations" by User \
| fillnull\
| sort -"Total no. of Operations"

[Billing Report v3.x]
description = A Billing Report over the last 30d. Reports on types of Key operations. Sorted by Total number of operations per User.
dispatch.earliest_time = -30d@d
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","index"]
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.show = 0
request.ui_dispatch_app = PrimusHSM
request.ui_dispatch_view = search
search = index="*" "Cryptography" "used" "Sign:" OR "Verify:" OR "Encrypt:" OR "Decrypt:" OR "Wrap:" OR "Derive:"\
| rex field=_raw "Cryptography .*?used:\sUser:\s(?<User>.*?),.*?\sProtocol:.*?\s(?<Action>Sign|Verify|Encrypt|Decrypt|Wrap|Derive):\s(?<ActionCount>\d+)"\
| search User="*"\
| chart sum(ActionCount) as Count by User Action\
| fillnull \
| addtotals fieldname="Total # Operations"\
| sort -"Total # Operations"

[Billing Report v2.x]
description = Intended only for Primus HSM between version 2.6.x and 2.11.x.\
Run on the cloudhsm index by default.
dispatch.earliest_time = -30d@d
dispatch.latest_time = now
display.general.type = statistics
display.page.search.tab = statistics
request.ui_dispatch_view = search
search = index=cloudshsm "Crypto Process: Usage statistics"  \
| rex field=_raw "(?<Host>[A-Za-z0-9-_]+) Crypto Process: Usage statistics:\sUser:\s(?<User>.*?),\sClient:\s(?<Client>.*?),\sProtocol:\s(?<Protocol>.*?),\s(Key:)*(?<Key>.*?),\sOperation:\s(?<Operation>.*?),\sCount:\s(?<Count>.*)"  \
| chart sum(Count) as Count by User Operation \
| fillnull \
| addtotals fieldname="Total # Operations"

[User Activity Report v2.x]
description = Intended only for Primus HSM between version 2.6.x and 2.11.x. \
dispatch.earliest_time = -30d@d
dispatch.latest_time = now
display.general.type = statistics
display.page.search.tab = statistics
request.ui_dispatch_view = search
search = `hsm_idx` ("Crypto Process" OR "PKCS Process" OR "JCE Process" OR "MSCNG Process") ("Login Successful" OR "Login Failed") \
| rex field=_raw "Process: Login (?<Status>.*?)[:|\s]*User: (?<User>.*?)\s(ID|Client)" \
| search User=* | chart count latest(_time) as _time by User Status \
| fields - "VALUE_time: failed" \
| rename "VALUE_time: successful" as "Last_Successful_Logins" "count: *" as * \
| eval Last_Successful_Logins=strftime(Last_Successful_Logins,"%d-%m-%Y") \
| append [search `hsm_idx` "Crypto Process: Usage statistics" "Total key usage count" \
| rex field=_raw "(?<Host>[A-Za-z0-9-_]+) Crypto Process: Usage statistics:\sUser:\s(?<User>.*?),\sClient:\s(?<Client>.*?),\sProtocol:\s(?<Protocol>.*?),\sTotal key usage count:\s(?<Usage>\d+)" \
| stats sum(Usage) as Usage by  User] \
| stats values(Last_Successful_Logins) as Last_Successful_Logins sum(successful) as "Sum of Successful Logins" sum(failed) as "Sum of Failed Logins" sum(Usage) as "Total no. of Operations" by User \
| fillnull

[Primus HSM Operations Alerts]
action.email = 1
action.email.message.alert = The alert condition for '$name$' was triggered.\
Please open "View results" below for details
action.email.show_password = 1
action.email.to = username@example.com
action.email.useNSSubject = 1
action.webhook.enable_allowlist = 0
alert.digest_mode = 0
alert.expires = 8h
alert.suppress = 0
alert.track = 0
counttype = number of events
cron_schedule = */5 * * * *
description = A group of alerts to capture the operation related events that users will be interested in.
dispatch.earliest_time = -5m
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","index"]
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = PrimusHSM
request.ui_dispatch_view = search
search = index="primushsm" sourcetype="primushsm"\
|search ("System will reboot") OR ("Maximum protocol connection count reached") OR ("License update failed") OR ("HighAvailability Error for high availability command") OR ("connection to" (master OR clone) "is" (up OR down)) OR ("HighAvailability Connection to Clone" "is down") OR ("CPU Status: DOWN") OR ("license error") OR ("System startup failed") OR (("Update" OR "Rollback") ("to version" OR "signature type")) OR ("Error initializing") OR ("DMU Event" ("Fan" OR "RPM")) OR ("DMU Event" "Startup Failure Alert") OR ("DMU Event" "CPU hardware watchdog fired") OR ("BAT Status:" ("UP" OR "DOWN")) OR ("Hardware self test failed") OR ("Transition to error state") OR ("Wrong system state detected")

[Primus HSM Security Alerts]
action.email = 1
action.email.message.alert = The alert condition for '$name$' was triggered.\
Please open "View results" below for details
action.email.show_password = 1
action.email.to = username@example.com
action.email.useNSSubject = 1
action.webhook.enable_allowlist = 0
alert.digest_mode = 0
alert.expires = 8h
alert.suppress = 0
alert.track = 0
counttype = number of events
cron_schedule = */5 * * * *
description = A group of alerts to capture the security related events that users will be interested in.
dispatch.earliest_time = -5m
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","index"]
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_view = search
search = index="primushsm" sourcetype="primushsm"\
|search ("Imported network configuration") OR ("Configuration" "changed" "from" "to") OR ("DMU Event" "Tamper Event Alert") OR ("USB device inserted") OR ("DMU Event" "SELFTEST" "FAILED") OR ("DMU Event" "Tilt Alert") OR ("Software integrity check failed") OR ("DMU Event" "Security log" "NEAR FULL") OR ("Restore backup from another device") OR ("Cryptography" ("Device" OR "Decanus") ("added to" OR "removed from") "high availability cluster") OR (("Cryptography" OR "Crypto Process") "Create User:") OR (("Cryptography" OR "Crypto Process") "Delete User") OR (("FSM Process" OR "FiniteStateMachine") "User credentials modified") OR ("Transferring file" "partition manager") OR (("FSM Process" OR "FiniteStateMachine") "Create SO") OR (("Config Process:*Update to version*" OR "Configuration Update to version*")) OR ("Interaction" "Retrieved permanent login credentials") OR ("User credentials modified:" "Type: ("User secret" OR "Setup password")") OR ("Factory reset") OR (("FSM Process" OR "FiniteStateMachine") "Activate security officer successful") OR (("Cryptography" OR "Crypto Process") "self test failed") OR ("Customization updated")
