[Alarmas del dia]
action.email.reportServerEnabled = 0
alert.track = 0
dispatch.earliest_time = @d
dispatch.latest_time = now
display.general.type = visualizations
display.page.pivot.dataModel = /servicesNS/admin/ossim/datamodel/model/AlarmasOssim
display.visualizations.charting.axisTitleY.text = Número de Alarmas del día
display.visualizations.charting.chart.stackMode = stacked100
request.ui_dispatch_app = ossim
request.ui_dispatch_view = pivot
search = | pivot AlarmasOssim ossimevent count(ossimevent) AS "Número de Alarmas del día" SPLITROW alarm AS "alarm" SPLITCOL src_ip LIMIT alarm BY top 10 count(alarm) TOP 10 count(ossimevent) NUMCOLS 50

[AlarmaRiesgoMayor2Ordenada]
action.email = 1
action.email.inline = 1
action.email.reportServerEnabled = 0
action.email.sendresults = 1
action.email.subject = SOC Spluk Alert  $name$ en Consubanco
action.email.to = daniel.vite@a3sec.com,israel.gutierrez@a3sec.com
alert.digest_mode = True
alert.suppress = 1
alert.suppress.period = 5m
alert.track = 1
counttype = number of events
cron_schedule = * * * * *
description = AlarmaRiesgoMayor2
dispatch.earliest_time = rt-5m
dispatch.latest_time = rt-0m
display.general.type = statistics
display.visualizations.charting.chart = bar
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = ossim
request.ui_dispatch_view = search
search = sourcetype="ossim_action" RIESGO>=2 "SEN=10.128.1.28" | table _time,RIESGO,ALARMA,SubAlarma,NOMBRESRC,SRCIP,NOMBREDST,DSTIP

[Events by DataSource&Type]
action.email.reportServerEnabled = 0
alert.track = 0
dispatch.earliest_time = 0
display.general.type = visualizations
display.page.pivot.dataModel = /servicesNS/admin/ossim/datamodel/model/AvLogger
display.visualizations.charting.axisTitleY.text = Count of Logger
display.visualizations.charting.chart.stackMode = stacked
request.ui_dispatch_app = ossim
request.ui_dispatch_view = pivot
search = | pivot AvLogger Logger count(Logger) AS "Count of Logger" SPLITROW plugin_id AS "Plugin ID" SPLITCOL plugin_sid TOP 10 count(Logger) NUMCOLS 40
