[default]

[client_log_count]
definition = `sep_index` `sep_agt_system_sourcetype` | stats count

[client_log_event_information_table]
definition = `sep_index` `sep_agt_system_sourcetype` | rename dest_nt_host as "Host" event_source as "Event Source" agt_info as "Log Entry" | table "Host" "Event Source" "Log Entry"

[client_log_most_active]
definition = `sep_index` `sep_agt_system_sourcetype` | top dest_nt_host

[client_log_most_failures]
definition = `sep_index` `sep_agt_system_sourcetype` Failed | dedup dest_nt_host | stats count

[client_log_systems_with_failures]
definition = `sep_index` `sep_agt_system_sourcetype` Failed | rename dest_nt_host as "Host" | stats count as "Failures" by "Host"

[client_log_trends]
definition = `sep_index` `sep_agt_system_sourcetype` | rename dest_nt_host as "Host" event_source as "Event Source" agt_info as "Log Entry" | timechart count by "Log Entry"

[firewall_event_inbound_count]
definition = `sep_index` `sep_traffic_sourcetype` direction=inbound | stats count

[firewall_event_inbound_table]
definition = `sep_index` `sep_traffic_sourcetype` direction=Inbound OR sep_action="Active Response*" | fillnull value="N/A" direction | rename dest_nt_host as "Host" direction as "Direction" dest_ip as "Host IP" src_ip as "Remote IP" user as "User" sep_action as "Firewall Action" | table "Host" "Direction" "Host IP" "Remote IP" "User" "Firewall Action"

[firewall_event_most_blocked_ip]
definition = `sep_index` `sep_traffic_sourcetype` sep_action="The client will*" | top limit=1 src_ip

[firewall_event_outbound_count]
definition = `sep_index` `sep_traffic_sourcetype` direction=outbound | stats count

[firewall_event_outbound_table]
definition = `sep_index` `sep_traffic_sourcetype` direction=outbound | rename dest_nt_host as "Host" direction as "Direction" dest_ip as "Host IP" src_ip as "Remote IP" user as "User" sep_action as "Firewall Action" | table "Host" "Direction" "Host IP" "Remote IP" "User" "Firewall Action"

[firewall_ids_event_count]
definition = `sep_index` `sep_ids_sourcetype` | stats count

[firewall_ids_table]
definition = `sep_index` `sep_ids_sourcetype` | fillnull value="N/A" user | rename dest_nt_host as "Host" dest_ip as "Host IP" user as "User" signature as "Intrusion Attempt" application as "Application" | table "Host" "Host IP" "User" "Intrusion Attempt" "Application"

[firewall_overview_events_month]
definition = `sep_index` `sep_traffic_sourcetype` | timechart span=1d count

[firewall_overview_events_today]
definition = `sep_index` `sep_traffic_sourcetype` | stats count

[firewall_overview_ids_month]
definition = `sep_index` `sep_ids_sourcetype` | timechart span=1d count

[firewall_overview_ids_today]
definition = `sep_index` `sep_ids_sourcetype` | stats count

[host_overview_allrisks_today]
definition = `sep_index` `sep_risk_sourcetype` OR `sep_proactive_sourcetype` OR `sep_behavior_sourcetype` | stats count

[host_overview_behavior_month]
definition = `sep_index` `sep_behavior_sourcetype` | timechart span=1d count

[host_overview_most_viruses_last_24hours]
definition = `sep_index` `sep_risk_sourcetype` action=allowed OR action=deferred AND risk_type="Virus found" | rename actual_action as "Action" dest_nt_host as "Host" dest_ip as "Host IP" user as "User" risk_type as "Detection Type" signature as "Malware Name" | stats count by Host "Host IP" User | sort -count

[host_overview_mostrisks_today]
definition = `sep_index` `sep_risk_sourcetype` OR `sep_proactive_sourcetype` OR `sep_behavior_sourcetype` | stats count by dest_nt_host | sort -count | head 1

[host_overview_proactive_month]
definition = `sep_index` `sep_proactive_sourcetype` | timechart span=1d count

[host_overview_risks_month]
definition = `sep_index` `sep_risk_sourcetype` | timechart span=1d count

[host_overview_scans_month]
definition = `sep_index` `sep_scan_sourcetype` status=completed | timechart span=1d count

[host_overview_scans_today]
definition = `sep_index` `sep_scan_sourcetype` status=completed | stats count

[malware_search_sourcetypes]
definition = `sep_index` `sep_risk_sourcetype` OR `sep_proactive_sourcetype`

[malware_search_table]
definition = rename dest_nt_host as "Host" process as "Process" hash_type as "Hash Type" hash_value as "Hash Value" signature as "Malware Name" file_size as "File Size" | table "Host" "Process" "Malware Name" "File Size" "Hash Type" "Hash Value"

[proactive_count]
definition = `sep_index` `sep_proactive_sourcetype` | stats count

[proactive_detection_types]
definition = `sep_index` `sep_proactive_sourcetype` | stats count by name

[proactive_table]
definition = `sep_index` `sep_proactive_sourcetype` | rename actual_action as "Action" dest_nt_host as "Host" user as "User" name as "Detection Type" application_name as "Application" | table "Detection Type" "Action" "Host" "User" "Application"

[process_blocking_api_actions]
definition = `sep_index` `sep_behavior_sourcetype` action=Blocked | fillnull value="N/A" api | stats count by api

[process_blocking_count]
definition = `sep_index` `sep_behavior_sourcetype` | stats count

[process_blocking_table]
definition = `sep_index` `sep_behavior_sourcetype` | fillnull value="N/A" | rename dest_nt_host as "Host" user as "User" action as "Action" api as "API" process as "Process" parameter as "Parameter"| table "Host" "User" "Action" "API" "Process" "Parameter"

[risk_malware_information_table]
definition = `sep_index` `sep_risk_sourcetype` | rename "dest_nt_host" as "Host" signature as "Malware Name" process as "Process" hash_type as "Hash Type" hash_value as "Hash Value" | table "Host" "Process" "Malware Name" "Hash Type" "Hash Value"

[risk_mitigated_table]
definition = `sep_index` `sep_risk_sourcetype` action != allowed AND action!=deferred | rename actual_action as "Action" dest_nt_host as "Host" dest_ip as "Host IP" user as "User" risk_type as "Detection Type" signature as "Malware Name" | table "Host" "Host IP" "User" "Detection Type" "Action" "Malware Name"

[risk_scan_type]
definition = `sep_index` `sep_risk_sourcetype` | stats count by scan_type

[risk_suspicious_count]
definition = `sep_index` `sep_risk_sourcetype` "Security risk found" | stats count

[risk_total_count]
definition = `sep_index` `sep_risk_sourcetype` | stats count

[risk_unmitigated_table]
definition = `sep_index` `sep_risk_sourcetype` action=allowed OR action=deferred | rename actual_action as "Action" dest_nt_host as "Host" dest_ip as "Host IP" user as "User" risk_type as "Detection Type" signature as "Malware Name" | table "Host" "Host IP" "User" "Detection Type" "Action" "Malware Name"

[risk_virus_count]
definition = `sep_index` `sep_risk_sourcetype` "Virus found" | stats count

[scan_distinct_hosts]
definition = `sep_index` `sep_scan_sourcetype` | stats dc(dest_nt_host)

[scan_infected_table]
definition = `sep_index` `sep_scan_sourcetype` infected_count > 0 | rename dest_nt_host as "Host" src_ip as "Host IP" user as "User"  infected_count as "Risks Detected" begin_time as "Scan Start Time" end_time as "Scan End Time" | table "Host" "Host IP" "User" "Risks Detected" "Scan Start Time" "Scan End Time"

[scan_num_infected_files]
definition = `sep_index` `sep_scan_sourcetype` | stats sum(infected_count)

[scm_count]
definition = `sep_index` `sep_scm_system_sourcetype` | stats count

[scm_table]
definition = `sep_index` `sep_scm_system_sourcetype` | rename dest_nt_host as "Host" user_name as "User" event_description as "Log Entry" | table "Host" "User" "Log Entry"

[scm_trends]
definition = `sep_index` `sep_scm_system_sourcetype` | rename dest_nt_host as "Host" event_source as "Event Source" event_description as "Log Entry" | timechart count by "Log Entry"

[sep_admin_sourcetype]
definition = sourcetype=`sep_version`:admin

[sep_agt_system_sourcetype]
definition = sourcetype=`sep_version`:agt_system

[sep_behavior_sourcetype]
definition = sourcetype=`sep_version`:behavior

[sep_ids_sourcetype]
definition = sourcetype=`sep_version`:ids

[sep_index]
definition = index=`sep_index_name`

[sep_index_name]
disabled = 0
definition = symantec

[sep_policy_sourcetype]
definition = sourcetype=`sep_version`:policy

[sep_proactive_sourcetype]
definition = sourcetype=`sep_version`:proactive

[sep_risk_sourcetype]
definition = sourcetype=`sep_version`:risk

[sep_scan_sourcetype]
definition = sourcetype=`sep_version`:scan

[sep_scm_system_sourcetype]
definition = sourcetype=`sep_version`:scm_system

[sep_traffic_sourcetype]
definition = sourcetype=`sep_version`:traffic

[sep_version]
disabled = 0
definition = sep*

