[Collector Service Down in Last day]
alert.digest_mode = True
alert.expires = 2d
cron_schedule = 0 0 * * *
dispatch.earliest_time = -1d@h
schedule_window = 30
action.email = 1
action.email.sendcsv = 1
action.email.sendresults = 1
action.email.useNSSubject = 1
alert.suppress = 0
alert.track = 1
auto_summarize.dispatch.earliest_time = -1d@h
counttype = number of events
description = This Alert gives information about collector service going down
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","service","centrifyEventID","client","command","system","date_hour","date_mday","date_minute","date_month","date_second","date_wday","date_year","date_zone","env","eventname","centrifyEventID","index","linecount","pid","punct","reason","role","runas","splunk_server","status","timeendpos","timestartpos","tty","user","utc"]
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = Centrify
request.ui_dispatch_view = search
search = (eventtype=centrify_unix_audit_trail_logs OR eventtype=centrify_windows_audit_trail_logs) `get_collector_down_event_codes` |rename system as System eventname as EventName installation as Installation | table _time System EventName Installation


[Multiple Login Failures in Last day]
action.email = 1
action.email.sendcsv = 1
action.email.sendresults = 1
action.email.useNSSubject = 1
alert.suppress = 0
alert.digest_mode = True
alert.expires = 2d
alert.track = 1
auto_summarize.dispatch.earliest_time = -1d@h
counttype = number of events
cron_schedule = 0 0  * * *
description = This Alert gives count of Login attempt failures by user on machines in last one day
dispatch.earliest_time = -1d@h
dispatch.latest_time = now
schedule_window = 30
display.events.fields = ["host","source","sourcetype","service","centrifyEventID","client","command","system","date_hour","date_mday","date_minute","date_month","date_second","date_wday","date_year","date_zone","env","eventname","centrifyEventID","index","linecount","pid","punct","reason","role","runas","splunk_server","status","timeendpos","timestartpos","tty","user","utc"]
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = Centrify
request.ui_dispatch_view = search
search = (eventtype=centrify_unix_audit_trail_logs OR eventtype=centrify_windows_audit_trail_logs) `get_authorization_failure_event_codes` |rename system as System user as User | stats count by System,User | where count > 2

[Privileged Activity Failures in Last day]
action.email = 1
action.email.sendcsv = 1
action.email.sendresults = 1
action.email.useNSSubject = 1
alert.expires = 2d
alert.suppress = 0
alert.digest_mode = True
alert.track = 1
auto_summarize.dispatch.earliest_time = -1d@h
counttype = number of events
cron_schedule = 0 0 * * *
dispatch.earliest_time = -1d@h
schedule_window = 30
description = This Alert gives list of Privileged Activity denied  in last one day.
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","service","centrifyEventID","client","command","system","date_hour","date_mday","date_minute","date_month","date_second","date_wday","date_year","date_zone","env","eventname","centrifyEventID","index","linecount","pid","punct","reason","role","runas","splunk_server","status","timeendpos","timestartpos","tty","user","utc"]
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = Centrify
request.ui_dispatch_view = search
search = (eventtype=centrify_unix_audit_trail_logs OR eventtype=centrify_windows_audit_trail_logs) `get_privilege_activity_failure_event_codes`|rename system as System user as User eventname as EventName reason as Reason | table _time System User EventName Reason


[Privileged Command Failures in Last day]
action.email = 1
action.email.sendcsv = 1
action.email.sendresults = 1
action.email.useNSSubject = 1
alert.suppress = 0
alert.digest_mode = True
alert.track = 1
auto_summarize.dispatch.earliest_time = -1d@h
counttype = number of events
cron_schedule = 0 */24 * * *
description = This Alert gives list of Privileged Command failures in last one day.
dispatch.earliest_time = -1d@h
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","service","centrifyEventID","client","command","system","date_hour","date_mday","date_minute","date_month","date_second","date_wday","date_year","date_zone","env","eventname","centrifyEventID","index","linecount","pid","punct","reason","role","runas","splunk_server","status","timeendpos","timestartpos","tty","user","utc"]
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = Centrify
request.ui_dispatch_view = search
search = (eventtype=centrify_unix_audit_trail_logs OR eventtype=centrify_windows_audit_trail_logs)  `get_privilege_activity_failure_event_codes` command=* |rename system as System user as User command as Command reason as Reason | table _time System User Command Reason

[Machine Login activity - Lookup Gen]
alert.digest_mode = True
enableSched = 1
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
cron_schedule = 0 0 * * *
dispatch.earliest_time = -1d
dispatch.latest_time = now
search = (eventtype=centrify_windows_audit_trail_logs OR eventtype=centrify_unix_audit_trail_logs) `get_authorization_success_event_codes` | stats max(_time) as latest_login_time by system | inputlookup  append=t machine_login_activity | dedup system | outputlookup machine_login_activity
is_visible = false

[Most Privileged Users over the week]
alert.digest_mode = True
alert.expires = 2d
alert.suppress = 0
auto_summarize.dispatch.earliest_time = -1d@h
cron_schedule = 0 0 * * 6
action.email = 1
action.email.sendpdf = 1
action.email.sendresults = 1
action.email.useNSSubject = 1
alert.track = 0
dispatch.earliest_time = -7d@h
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","service","centrifyEventID","client","command","system","date_hour","date_mday","date_minute","date_month","date_second","date_wday","date_year","date_zone","env","eventname","centrifyEventID","index","linecount","pid","punct","reason","role","runas","splunk_server","status","timeendpos","timestartpos","tty","user","utc","activity","authMechanism","Category","eventstatus","eventtype","EventType","Keywords","LogName","Message","OpCode","RecordNumber","Sid","SidType","SourceName","sshRights","start_time","TaskCategory","Type","User"]
display.general.timeRangePicker.show = 0
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.show = 0
enableSched = 1
request.ui_dispatch_app = Centrify
request.ui_dispatch_view = search
schedule_window = 30
search = (eventtype=centrify_windows_audit_trail_logs OR eventtype=centrify_unix_audit_trail_logs) `get_privilege_activity_success_event_codes` | stats count by user,eventname | sort - count | rename user as Privileged_User count as Privileged_activity_count

[Most Actively used Servers over the week]
alert.digest_mode = True
alert.expires = 2d
cron_schedule = 0 0 * * 6
action.email = 1
action.email.sendpdf = 1
action.email.sendresults = 1
action.email.useNSSubject = 1
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
dispatch.earliest_time = -7d@h
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","service","centrifyEventID","client","command","system","date_hour","date_mday","date_minute","date_month","date_second","date_wday","date_year","date_zone","env","eventname","centrifyEventID","index","linecount","pid","punct","reason","role","runas","splunk_server","status","timeendpos","timestartpos","tty","user","utc","activity","authMechanism","Category","eventstatus","eventtype","EventType","Keywords","LogName","Message","OpCode","RecordNumber","Sid","SidType","SourceName","sshRights","start_time","TaskCategory","Type","User"]
display.general.timeRangePicker.show = 0
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.show = 0
enableSched = 1
request.ui_dispatch_app = Centrify
request.ui_dispatch_view = search
schedule_window = 30
search = (eventtype=centrify_windows_audit_trail_logs OR eventtype=centrify_unix_audit_trail_logs)  `get_authorization_success_event_codes` | stats count by system | sort - count | rename count as Login_Counts,system as System


[Anomalies happened over the week]
alert.digest_mode = True
alert.expires = 2d
cron_schedule = 0 0 * * 6
action.email = 1
action.email.sendpdf = 1
action.email.sendresults = 1
action.email.useNSSubject = 1
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
dispatch.earliest_time = -7d@h
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","service","centrifyEventID","client","command","system","date_hour","date_mday","date_minute","date_month","date_second","date_wday","date_year","date_zone","env","eventname","centrifyEventID","index","linecount","pid","punct","reason","role","runas","splunk_server","status","timeendpos","timestartpos","tty","user","utc","activity","authMechanism","Category","eventstatus","eventtype","EventType","Keywords","LogName","Message","OpCode","RecordNumber","Sid","SidType","SourceName","sshRights","start_time","TaskCategory","Type","User"]
display.general.timeRangePicker.show = 0
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.show = 0
enableSched = 1
request.ui_dispatch_app = Centrify
request.ui_dispatch_view = search
schedule_window = 30
search = (eventtype=centrify_windows_audit_trail_logs OR eventtype="centrify_unix_audit_trail_logs") `get_privilege_activity_failure_event_codes` OR (service=dz* status=DENIED) OR `get_authorization_failure_event_codes` |rename system as System user as User eventname as EventName reason as Reason | table _time System User EventName Reason

[User Login activity- Lookup Gen]
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
cron_schedule = 0 0 * * *
dispatch.earliest_time = -1d
dispatch.latest_time = now
enableSched = 1
search = (eventtype=centrify_windows_audit_trail_logs OR eventtype=centrify_unix_audit_trail_logs) `get_authorization_success_event_codes` | stats max(_time) as latest_login_time by user | inputlookup  append=t user_login_activity | dedup user | outputlookup user_login_activity
is_visible = false

[Audited Node Down in Last day]
alert.digest_mode = True
alert.expires = 2d
alert.track = 1
cron_schedule = 0 0 * * *
dispatch.earliest_time = -1d@h
schedule_window = 30
action.email = 1
action.email.sendcsv = 1
action.email.sendresults = 1
action.email.useNSSubject = 1
alert.suppress = 0
auto_summarize.dispatch.earliest_time = -1d@h
counttype = number of events
description = This Alert gives information about Audit Agent machine going down.
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","service","centrifyEventID","client","command","system","date_hour","date_mday","date_minute","date_month","date_second","date_wday","date_year","date_zone","env","eventname","centrifyEventID","index","linecount","pid","punct","reason","role","runas","splunk_server","status","timeendpos","timestartpos","tty","user","utc"]
display.general.type = statistics
display.page.search.mode = fast
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = Centrify
request.ui_dispatch_view = search
search = (eventtype=centrify_unix_audit_trail_logs OR eventtype=centrify_windows_audit_trail_logs)  `get_audit_agent_down_event_codes` |rename system as System eventname as EventName| table _time System EventName

[Machines not logged in over the week]
alert.digest_mode = True
alert.expires = 2d
alert.suppress = 0
auto_summarize.dispatch.earliest_time = -1d@h
cron_schedule = 0 0 * * 6
dispatch.earliest_time = -7d@h
dispatch.latest_time = now
action.email = 1
action.email.sendpdf = 1
action.email.sendresults = 1
action.email.useNSSubject = 1
alert.track = 0
display.general.timeRangePicker.show = 0
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.show = 0
enableSched = 1
request.ui_dispatch_app = Centrify
request.ui_dispatch_view = search
schedule_window = 30
search = |inputlookup machine_login_activity| eval tnow=now()| eval diff = tnow - latest_login_time | where diff > 604800 | dedup system|rename system as System| eval last_login_time=strftime(latest_login_time, "%Y-%d-%m %H:%M") | table System, last_login_time

[Users not logged in over the week]
action.email = 1
alert.digest_mode = True
alert.expires = 2d
alert.suppress = 0
action.email.sendpdf = 1
action.email.sendresults = 1
action.email.useNSSubject = 1
alert.track = 0
display.general.timeRangePicker.show = 0
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.show = 0
enableSched = 1
auto_summarize.dispatch.earliest_time = -1d@h
cron_schedule = 0 0 * * 6
dispatch.earliest_time = -7d@h
dispatch.latest_time = now
request.ui_dispatch_app = Centrify
request.ui_dispatch_view = search
schedule_window = 30
search = | inputlookup user_login_activity| eval tnow=now()| eval diff = tnow - latest_login_time | where diff > 604800 | dedup user | eval last_login_time=strftime(latest_login_time, "%Y-%d-%m %H:%M") | table user, last_login_time
