[Generate initial empty lookups]
disabled = 1
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = 0 0 * * *
description = Use this savedsearch to generate empty lookups.\
See documentation for more details.
dispatch.earliest_time = -24h
dispatch.latest_time = now
display.general.type = statistics
display.page.search.mode = fast
display.page.search.tab = statistics
display.visualizations.charting.chart = line
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = InternalBilling
request.ui_dispatch_view = search
search = | makeresults\
| eval index=""\
| eval team=""\
| fields index team\
| fields - _time\
| outputlookup indexes_mapped_to_teams_lookup\
| outputlookup indexes_mapped_to_teams_lookup_base\
| fields - index\
| eval contact=""\
| eval quota=""\
| fields team quota contact\
| outputlookup quotas_assigned_to_teams_lookup\
| outputlookup quotas_assigned_to_teams_lookup_base

[Generate lookup base to map teams to indexes]
disabled = 1
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = 0 0 * * *
description = This savedsearch can be used to generate a lookup base to help building the lookup that links teams to indexes.\
See documentation for more details.
dispatch.earliest_time = -24h
dispatch.latest_time = now
display.general.type = statistics
display.page.search.mode = fast
display.page.search.tab = statistics
display.visualizations.charting.chart = line
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = InternalBilling
request.ui_dispatch_view = search
search = | tstats summariesonly=true values("License_Usage.idx") as "index" from datamodel="Meta_Woot_License_Usage"\
| mvexpand index\
| eval team="TBD"\
| outputlookup indexes_mapped_to_teams_lookup_base

[Generate lookup base to attribute quotas to teams]
disabled = 1
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = 0 0 * * *
description = This savedsearch can be used to generate a lookup base to help building the lookup that assign license quotas to teams.\
See App documentation for more details.
dispatch.earliest_time = -24h
dispatch.latest_time = now
display.general.type = statistics
display.page.search.mode = fast
display.page.search.tab = statistics
display.visualizations.charting.chart = line
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = InternalBilling
request.ui_dispatch_view = search
search = | inputlookup indexes_mapped_to_teams.csv\
| dedup team\
| fields team \
| eval quota="TBD"\
| eval contact="TBD"\
| fields team quota contact\
| outputlookup quotas_assigned_to_teams_lookup_base

[Exceeded quota]
disabled = 1
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = 25 0 * * *
description = Allowed quota has been exceeded yesterday for the following team(s).
dispatch.earliest_time = -1d@d
dispatch.latest_time = @d
display.general.type = statistics
display.page.search.mode = fast
display.page.search.tab = statistics
display.visualizations.charting.chart = line
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = InternalBilling
request.ui_dispatch_view = search
search = | tstats summariesonly=true sum("License_Usage.gb") AS "totalGB" from datamodel="Meta_Woot_License_Usage" groupby "License_Usage.idx" "_time"\
| eval usage=totalGB\
| rename "License_Usage.idx" as index\
| eval index=lower(index)\
| fields index usage _time\
| join index [|inputlookup indexes_mapped_to_teams_lookup | fields index team]\
| timechart span=1d sum(usage) as usage by team useother=false\
| fields - _*\
| transpose\
| rename "row 1" as "usage_yesterday" column as team\
| join type=left team [|inputlookup quotas_assigned_to_teams_lookup | fields team quota contact]\
| eval gap_yesterday=round(usage_yesterday-quota,1)\
| search gap_yesterday>0\
| eval gap=gap_yesterday."/".quota\
| fields team gap contact\
| sort - gap

[Index(es) without team]
disabled = 1
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = 35 0 * * *
description = The following index(es) has not been mapped to any team.
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.charting.chart = line
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = InternalBilling
request.ui_dispatch_view = search
search = | inputlookup indexes_mapped_to_teams_lookup | search NOT team="*" OR team="TBD"\
| fields index

[Unlisted index(es)]
disabled = 1
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = 45 0 * * *
description = The following index(es) has not been yet listed despite being filled.
dispatch.earliest_time = -1d@d
dispatch.latest_time = @d
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.charting.chart = line
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = InternalBilling
request.ui_dispatch_view = search
search = | tstats summariesonly=true sum("License_Usage.gb") AS "totalGB" from datamodel="Meta_Woot_License_Usage" groupby "License_Usage.idx"\
| eval totalGB=round(totalGB,3)\
| rename License_Usage.idx as index\
| eval index=lower(index)\
| dedup index\
| fields index\
| search NOT [|inputlookup indexes_mapped_to_teams_lookup\
| fields index] | dedup index

[Index(es) with multiple teams]
disabled = 1
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = 55 0 * * *
description = The following index(es) has been mapped to multiple teams.
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.charting.chart = line
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = InternalBilling
request.ui_dispatch_view = search
search = | inputlookup indexes_mapped_to_teams_lookup | search [| inputlookup indexes_mapped_to_teams_lookup\
| stats count(team) as count by index\
| where count>1\
| fields index]\
| stats values(team) as teams by index

[Team(s) without quota]
disabled = 1
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = 05 1 * * *
description = Not quota has been assigned for the following team(s).
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.charting.chart = line
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = InternalBilling
request.ui_dispatch_view = search
search = | inputlookup indexes_mapped_to_teams_lookup | dedup team\
| fields team\
| search NOT [| inputlookup quotas_assigned_to_teams_lookup\
| fields team]
