[qintel_index]
definition = index="main"
description = "This macro is used to configure where Qintel QSentry Feed add-on for Splunk stores enriched data."

[qintel_source_indexes]
definition = ()

[qsentry_feed_geo_lookup]
definition = iplocation

[qintel_fields]
definition = qintel_asn, qintel_asn_name, qintel_tags, qintel_last_seen, qintel_descriptions, qintel_risk

iseval = 0

[qintel_shrink_threat_fields]
definition = eval qintel_tags=mvjoin(qintel_tags, ",") \
| eval qintel_descriptions=mvjoin(qintel_descriptions, ",")

iseval = 0

[qintel_expand_threat_fields]
definition = eval qintel_tags=split(qintel_tags, ",") \
| eval qintel_descriptions=split(qintel_descriptions, ",")

iseval = 0

[qintel_intel_friendly_fields]
definition = \
rename src_ip as "Selector", qintel_tags as "Tags", \
qintel_last_seen as "Last Observed", qintel_risk as "Risk"

[qintel_threat_table]
definition = spath input=qintel_raw \
| rename qintel_data{}.first_at as qintel_first_at, qintel_data{}.last_at as qintel_last_at , qintel_data{}.tags as qintel_tags \
| eval qintel_data=mvzip(qintel_first_at, mvzip(qintel_last_at, qintel_tags, "|"), "|") \
| mvexpand qintel_data \
| eval qintel_data=split(qintel_data,"|") \
| eval qintel_first_at=mvindex(qintel_data,0), qintel_last_at=mvindex(qintel_data,1), qintel_tags=mvindex(qintel_data,2) \
| fields - qintel_data \
| table _time, sourcetype, indicator, qintel_first_at, qintel_last_at, qintel_tags

iseval = 0
