[adaudit:syslog]
REPORT-ccx_adaudit_transform = ccx_adaudit_transform

FIELDALIAS-ccx_mod_eventnumber_to_eventcode = EVENT_NUMBER AS EventCode
FIELDALIAS-ccx_mod_logontype_to_logon_type = LOGON_TYPE AS Logon_Type

EVAL-action = if((isnotnull('GROUP_TYPE') AND 'GROUP_TYPE'!="null" AND 'GROUP_TYPE'!="") OR (isnotnull('LOGON_SERVICE') AND 'LOGON_SERVICE'!="null" AND 'LOGON_SERVICE'!="") OR ('EventCode' IN("5140","4699","7036","5139","7045","7040","4697")), lower('EVENT_TYPE_TEXT'),if('Category' = "ADAPTechnicianAudit" AND 'ACTION_CATEGORY'="Logon", case(match('FORMAT_MESSAGE',"^.*logged\sin"),"success",1=1,"failure"),null()))
EVAL-app = if(('Category'="ADAPTechnicianAudit" AND ACTION_CATEGORY IN("Logon","Admin")) OR (EventCode IN("2887")),"ADAuditPlus",null())
EVAL-description = if(('Category'="ADAPTechnicianAudit" AND ACTION_CATEGORY IN("Logon","Admin")) OR (EventCode IN("2887")),'FORMAT_MESSAGE',null())
EVAL-body = if(('Category'="ADAPTechnicianAudit" AND ACTION_CATEGORY IN("Logon","Admin")) OR (EventCode IN("2887")),'FORMAT_MESSAGE',null())
EVAL-severity_id = 'SEVERITY'
EVAL-type = if('Category'="ADAPTechnicianAudit" AND ACTION_CATEGORY IN("Admin"),"event",if(EventCode IN("2887"),"warning",null()))
EVAL-Source_Network_Address = if('CLIENT_IP_ADDRESS'="127.0.0.1" OR 'CLIENT_IP_ADDRESS'="::1",'CLIENT_IP_ADDRESS',null())
EVAL-src_ip = 'CLIENT_IP_ADDRESS'
EVAL-src = 'CLIENT_HOST_NAME'
EVAL-src_port = 'CLIENT_PORT'
EVAL-src_nt_domain = if(isnotnull('CLIENT_HOST_DOMAIN_NAME') AND 'CLIENT_HOST_DOMAIN_NAME'!="null" AND 'CLIENT_HOST_DOMAIN_NAME'!="",'CLIENT_HOST_DOMAIN_NAME',null())
EVAL-signature = if(isnotnull('ERROR_CODE_TEXT') AND 'ERROR_CODE_TEXT'!="-" AND 'ERROR_CODE_TEXT'!="",'ERROR_CODE_TEXT','REMARKS')
EVAL-result = if(isnotnull('ERROR_CODE_TEXT') AND 'ERROR_CODE_TEXT'!="-" AND 'ERROR_CODE_TEXT'!="",'ERROR_CODE_TEXT','REMARKS')
EVAL-signature_id = 'EventCode'
EVAL-reason = if(isnotnull('EXTRA_COLUMN1') AND 'EXTRA_COLUMN1'!="null" AND 'EXTRA_COLUMN1'!="",'EXTRA_COLUMN1',if(isnotnull('REPORT_PROFILE') AND 'REPORT_PROFILE'!="null" AND 'REPORT_PROFILE'!="" AND match('Category',"^.*Logon.*"),'REPORT_PROFILE',if('Category'="ADAPTechnicianAudit" AND ACTION_CATEGORY="Logon",'FORMAT_MESSAGE',null())))
EVAL-log_subtype = if(isnotnull('GROUP_TYPE') AND 'GROUP_TYPE'!="null" AND 'GROUP_TYPE'!="",'GROUP_TYPE',if((isnull('GROUP_TYPE') OR 'GROUP_TYPE'="null" OR 'GROUP_TYPE'="") AND ((isnotnull('LOGON_SERVICE') AND 'LOGON_SERVICE'!="null" AND 'LOGON_SERVICE'!="") OR (match('Category',"^.*Logon.*"))),"Logon",null()))
EVAL-Computer = 'SOURCE'
EVAL-dvc = 'SOURCE'
EVAL-dest = 'SOURCE'
EVAL-dest_ip = if(isnotnull('EXTRA_COLUMN5') AND 'EXTRA_COLUMN5'!="null" AND 'EXTRA_COLUMN5'!="",'EXTRA_COLUMN5',null())
EVAL-dest_nt_domain = 'DOMAIN'
EVAL-src_user = if(isnotnull('CALLER_USER_NAME') AND 'CALLER_USER_NAME'!="null" AND 'CALLER_USER_NAME'!="",'CALLER_USER_NAME',null())
EVAL-user = if((isnotnull('MEMBER_DISPLAY_NAME') AND 'MEMBER_DISPLAY_NAME'!="null" AND 'MEMBER_DISPLAY_NAME'!="") OR (isnotnull('USERNAME') AND 'USERNAME'!="null" AND 'USERNAME'!="") OR (isnotnull('CALLER_USER_NAME') AND 'CALLER_USER_NAME'!="null" AND 'CALLER_USER_NAME'!="") OR (isnotnull('LOGIN_NAME') AND 'LOGIN_NAME'!="null" AND 'LOGIN_NAME'!=""),coalesce('MEMBER_DISPLAY_NAME','USERNAME','CALLER_USER_NAME','LOGIN_NAME'),null())
EVAL-object = if((isnotnull('FILE_NAME') AND 'FILE_NAME'!="null" AND 'FILE_NAME'!="") OR (isnotnull('ACCOUNT_NAME') AND 'ACCOUNT_NAME'!="null" AND 'ACCOUNT_NAME'!="") OR (isnotnull('ACCOUNT_DISPLAY_NAME') AND 'ACCOUNT_DISPLAY_NAME'!="null" AND 'ACCOUNT_DISPLAY_NAME'!=""),coalesce('FILE_NAME','ACCOUNT_NAME','ACCOUNT_DISPLAY_NAME'),null())
EVAL-object_path = 'FILE_LOCATION'
EVAL-Error_Code = 'ERROR_CODE'
EVAL-vendor_product = "ManageEngine:ADAudit Plus"
EVAL-status = case('EventCode'=="7036" AND (match('ERROR_CODE_TEXT',"^.*running.*") OR match('REMARKS',"^.*running.*")),"started",'EventCode'=="7036" AND (match('ERROR_CODE_TEXT',"^.*stopped.*") OR match('REMARKS',"^.*stopped.*")),"stopped",'EventCode' IN("104","5139"),"success")
EVAL-Logon_Type = if(isnotnull('LOGON_TYPE'),'LOGON_TYPE',"-")
EVAL-file_name = if(isnotnull('FILE_NAME') AND 'FILE_NAME'!="null" AND 'FILE_NAME'!="",'FILE_NAME',null())
EVAL-file_path = if(isnotnull('FILE_LOCATION') AND 'FILE_LOCATION'!="null" AND 'FILE_LOCATION'!="",'FILE_LOCATION',null())

LOOKUP-ccx_adaudit_windows_wineventlog_change_object_fields = ccx_adaudit_windows_wineventlog_change_object_fields EventCode OUTPUTNEW change_type object_attrs object_category result
LOOKUP-ccx_adaudit_security_change_audit_and_account_management = ccx_adaudit_security_change_audit_and_account_management EventCode OUTPUT object_attrs
LOOKUP-ccx_adaudit_windows_audit_changes = ccx_adaudit_windows_audit_changes EventCode OUTPUTNEW action change_type object_category
LOOKUP-ccx_adaudit_windows_wineventlog_change_action = ccx_adaudit_windows_wineventlog_change_action EventCode OUTPUTNEW action status
LOOKUP-ccx_adaudit_security_eventcode_action1 = ccx_adaudit_security_eventcode_action EventCode OUTPUTNEW action message os
LOOKUP-ccx_adaudit_security_eventcode_action2 = ccx_adaudit_security_eventcode_action EventCode OUTPUTNEW action AS status
LOOKUP-ccx_adaudit_windows_apps1 = ccx_adaudit_windows_apps EventCode OUTPUTNEW app
LOOKUP-ccx_adaudit_windows_apps2 = ccx_adaudit_windows_apps EventCode Source_Network_Address OUTPUTNEW app
LOOKUP-ccx_adaudit_windows_apps3 = ccx_adaudit_windows_apps log_subtype Logon_Type OUTPUTNEW app
LOOKUP-ccx_adaudit_eventcode_errorcode_action = ccx_adaudit_eventcode_errorcode_action EventCode OUTPUTNEW action

[ccx:adaudit:syslog]
REPORT-ccx_adaudit_transform = ccx_adaudit_transform

FIELDALIAS-ccx_mod_eventnumber_to_eventcode = EVENT_NUMBER AS EventCode
FIELDALIAS-ccx_mod_logontype_to_logon_type = LOGON_TYPE AS Logon_Type

EVAL-action = if((isnotnull('GROUP_TYPE') AND 'GROUP_TYPE'!="null" AND 'GROUP_TYPE'!="") OR (isnotnull('LOGON_SERVICE') AND 'LOGON_SERVICE'!="null" AND 'LOGON_SERVICE'!="") OR ('EventCode' IN("5140","4699","7036","5139","7045","7040","4697")), lower('EVENT_TYPE_TEXT'),if('Category' = "ADAPTechnicianAudit" AND 'ACTION_CATEGORY'="Logon", case(match('FORMAT_MESSAGE',"^.*logged\sin"),"success",1=1,"failure"),null()))
EVAL-app = if(('Category'="ADAPTechnicianAudit" AND ACTION_CATEGORY IN("Logon","Admin")) OR (EventCode IN("2887")),"ADAuditPlus",null())
EVAL-description = if(('Category'="ADAPTechnicianAudit" AND ACTION_CATEGORY IN("Logon","Admin")) OR (EventCode IN("2887")),'FORMAT_MESSAGE',null())
EVAL-body = if(('Category'="ADAPTechnicianAudit" AND ACTION_CATEGORY IN("Logon","Admin")) OR (EventCode IN("2887")),'FORMAT_MESSAGE',null())
EVAL-severity_id = 'SEVERITY'
EVAL-type = if('Category'="ADAPTechnicianAudit" AND ACTION_CATEGORY IN("Admin"),"event",if(EventCode IN("2887"),"warning",null()))
EVAL-Source_Network_Address = if('CLIENT_IP_ADDRESS'="127.0.0.1" OR 'CLIENT_IP_ADDRESS'="::1",'CLIENT_IP_ADDRESS',null())
EVAL-src_ip = 'CLIENT_IP_ADDRESS'
EVAL-src = 'CLIENT_HOST_NAME'
EVAL-src_port = 'CLIENT_PORT'
EVAL-src_nt_domain = if(isnotnull('CLIENT_HOST_DOMAIN_NAME') AND 'CLIENT_HOST_DOMAIN_NAME'!="null" AND 'CLIENT_HOST_DOMAIN_NAME'!="",'CLIENT_HOST_DOMAIN_NAME',null())
EVAL-signature = if(isnotnull('ERROR_CODE_TEXT') AND 'ERROR_CODE_TEXT'!="-" AND 'ERROR_CODE_TEXT'!="",'ERROR_CODE_TEXT','REMARKS')
EVAL-result = if(isnotnull('ERROR_CODE_TEXT') AND 'ERROR_CODE_TEXT'!="-" AND 'ERROR_CODE_TEXT'!="",'ERROR_CODE_TEXT','REMARKS')
EVAL-signature_id = 'EventCode'
EVAL-reason = if(isnotnull('EXTRA_COLUMN1') AND 'EXTRA_COLUMN1'!="null" AND 'EXTRA_COLUMN1'!="",'EXTRA_COLUMN1',if(isnotnull('REPORT_PROFILE') AND 'REPORT_PROFILE'!="null" AND 'REPORT_PROFILE'!="" AND match('Category',"^.*Logon.*"),'REPORT_PROFILE',if('Category'="ADAPTechnicianAudit" AND ACTION_CATEGORY="Logon",'FORMAT_MESSAGE',null())))
EVAL-log_subtype = if(isnotnull('GROUP_TYPE') AND 'GROUP_TYPE'!="null" AND 'GROUP_TYPE'!="",'GROUP_TYPE',if((isnull('GROUP_TYPE') OR 'GROUP_TYPE'="null" OR 'GROUP_TYPE'="") AND ((isnotnull('LOGON_SERVICE') AND 'LOGON_SERVICE'!="null" AND 'LOGON_SERVICE'!="") OR (match('Category',"^.*Logon.*"))),"Logon",null()))
EVAL-Computer = 'SOURCE'
EVAL-dvc = 'SOURCE'
EVAL-dest = 'SOURCE'
EVAL-dest_ip = if(isnotnull('EXTRA_COLUMN5') AND 'EXTRA_COLUMN5'!="null" AND 'EXTRA_COLUMN5'!="",'EXTRA_COLUMN5',null())
EVAL-dest_nt_domain = 'DOMAIN'
EVAL-src_user = if(isnotnull('CALLER_USER_NAME') AND 'CALLER_USER_NAME'!="null" AND 'CALLER_USER_NAME'!="",'CALLER_USER_NAME',null())
EVAL-user = if((isnotnull('MEMBER_DISPLAY_NAME') AND 'MEMBER_DISPLAY_NAME'!="null" AND 'MEMBER_DISPLAY_NAME'!="") OR (isnotnull('USERNAME') AND 'USERNAME'!="null" AND 'USERNAME'!="") OR (isnotnull('CALLER_USER_NAME') AND 'CALLER_USER_NAME'!="null" AND 'CALLER_USER_NAME'!="") OR (isnotnull('LOGIN_NAME') AND 'LOGIN_NAME'!="null" AND 'LOGIN_NAME'!=""),coalesce('MEMBER_DISPLAY_NAME','USERNAME','CALLER_USER_NAME','LOGIN_NAME'),null())
EVAL-object = if((isnotnull('FILE_NAME') AND 'FILE_NAME'!="null" AND 'FILE_NAME'!="") OR (isnotnull('ACCOUNT_NAME') AND 'ACCOUNT_NAME'!="null" AND 'ACCOUNT_NAME'!="") OR (isnotnull('ACCOUNT_DISPLAY_NAME') AND 'ACCOUNT_DISPLAY_NAME'!="null" AND 'ACCOUNT_DISPLAY_NAME'!=""),coalesce('FILE_NAME','ACCOUNT_NAME','ACCOUNT_DISPLAY_NAME'),null())
EVAL-object_path = 'FILE_LOCATION'
EVAL-Error_Code = 'ERROR_CODE'
EVAL-vendor_product = "ManageEngine:ADAudit Plus"
EVAL-status = case('EventCode'=="7036" AND (match('ERROR_CODE_TEXT',"^.*running.*") OR match('REMARKS',"^.*running.*")),"started",'EventCode'=="7036" AND (match('ERROR_CODE_TEXT',"^.*stopped.*") OR match('REMARKS',"^.*stopped.*")),"stopped",'EventCode' IN("104","5139"),"success")
EVAL-Logon_Type = if(isnotnull('LOGON_TYPE'),'LOGON_TYPE',"-")

LOOKUP-ccx_adaudit_windows_wineventlog_change_object_fields = ccx_adaudit_windows_wineventlog_change_object_fields EventCode OUTPUTNEW change_type object_attrs object_category result
LOOKUP-ccx_adaudit_security_change_audit_and_account_management = ccx_adaudit_security_change_audit_and_account_management EventCode OUTPUT object_attrs
LOOKUP-ccx_adaudit_windows_audit_changes = ccx_adaudit_windows_audit_changes EventCode OUTPUTNEW action change_type object_category
LOOKUP-ccx_adaudit_windows_wineventlog_change_action = ccx_adaudit_windows_wineventlog_change_action EventCode OUTPUTNEW action status
LOOKUP-ccx_adaudit_security_eventcode_action1 = ccx_adaudit_security_eventcode_action EventCode OUTPUTNEW action message os
LOOKUP-ccx_adaudit_security_eventcode_action2 = ccx_adaudit_security_eventcode_action EventCode OUTPUTNEW action AS status
LOOKUP-ccx_adaudit_windows_apps1 = ccx_adaudit_windows_apps EventCode OUTPUTNEW app
LOOKUP-ccx_adaudit_windows_apps2 = ccx_adaudit_windows_apps EventCode Source_Network_Address OUTPUTNEW app
LOOKUP-ccx_adaudit_windows_apps3 = ccx_adaudit_windows_apps log_subtype Logon_Type OUTPUTNEW app
LOOKUP-ccx_adaudit_eventcode_errorcode_action = ccx_adaudit_eventcode_errorcode_action EventCode OUTPUTNEW action