[User Bruteforce Incident Alert]
alert.severity = 3
alert.suppress = 0
alert.track = 1
cron_schedule = */15 * * * *
dispatch.earliest_time = -15m
dispatch.latest_time = now
enableSched = 1
search = index="silverfort" \
| rex "CEF:\\d+\\|(?<vendor>[^\\|]*)\\|(?<product>[^\\|]*)\\|(?<version>[^\\|]*)\\|(?<signature_id>[^\\|]*)\\|(?<name>[^\\|]*)\\|(?<severity>[^\\|]*)\\|(?<extension>.*)" \
| rex field=extension "msg=\"(?<msg>\\{.*?\})\"" \
| eval msg=mvindex(split(extension, "msg=\""), 1) \
| eval msg=replace(msg, "\"$", "") \
| where signature_id="NewIncident" AND like(msg, "%UserBruteforce%") \
| table _time, vendor, product, version, signature_id, name, severity, syslog_id, msg
counttype = number of events
quantity = 0
relation = greater than

[NoPacBreach Incident Alert]
alert.severity = 3
alert.suppress = 0
alert.track = 1
cron_schedule = */15 * * * *
dispatch.earliest_time = -15m
dispatch.latest_time = now
enableSched = 1
search = index="silverfort" \
| rex "CEF:\\d+\\|(?<vendor>[^\\|]*)\\|(?<product>[^\\|]*)\\|(?<version>[^\\|]*)\\|(?<signature_id>[^\\|]*)\\|(?<name>[^\\|]*)\\|(?<severity>[^\\|]*)\\|(?<extension>.*)" \
| rex field=extension "msg=\"(?<msg>\\{.*?\})\"" \
| eval msg=mvindex(split(extension, "msg=\""), 1) \
| eval msg=replace(msg, "\"$", "") \
| where signature_id="NewIncident" AND like(msg, "%NoPacBreach%") \
| table _time, vendor, product, version, signature_id, name, severity, syslog_id, msg
counttype = number of events
quantity = 0
relation = greater than

[Log4Shell Incident Alert]
alert.severity = 3
alert.suppress = 0
alert.track = 1
cron_schedule = */15 * * * *
dispatch.earliest_time = -15m
dispatch.latest_time = now
enableSched = 1
search = index="silverfort" \
| rex "CEF:\\d+\\|(?<vendor>[^\\|]*)\\|(?<product>[^\\|]*)\\|(?<version>[^\\|]*)\\|(?<signature_id>[^\\|]*)\\|(?<name>[^\\|]*)\\|(?<severity>[^\\|]*)\\|(?<extension>.*)" \
| rex field=extension "msg=\"(?<msg>\\{.*?\})\"" \
| eval msg=mvindex(split(extension, "msg=\""), 1) \
| eval msg=replace(msg, "\"$", "") \
| where signature_id="NewIncident" AND like(msg, "%Log4Shell%") \
| table _time, vendor, product, version, signature_id, name, severity, syslog_id, msg
counttype = number of events
quantity = 0
relation = greater than

[Certifried Incident Alert]
alert.severity = 3
alert.suppress = 0
alert.track = 1
cron_schedule = */15 * * * *
dispatch.earliest_time = -15m
dispatch.latest_time = now
enableSched = 1
search = index="silverfort" \
| rex "CEF:\\d+\\|(?<vendor>[^\\|]*)\\|(?<product>[^\\|]*)\\|(?<version>[^\\|]*)\\|(?<signature_id>[^\\|]*)\\|(?<name>[^\\|]*)\\|(?<severity>[^\\|]*)\\|(?<extension>.*)" \
| rex field=extension "msg=\"(?<msg>\\{.*?\})\"" \
| eval msg=mvindex(split(extension, "msg=\""), 1) \
| eval msg=replace(msg, "\"$", "") \
| where signature_id="NewIncident" AND like(msg, "%Certifried%") \
| table _time, vendor, product, version, signature_id, name, severity, syslog_id, msg
counttype = number of events
quantity = 0
relation = greater than
