[mbbr_scan]
display_location = both
fields = src_ip
label = Malwarebytes Scan: $src_ip$
search.app = malwarebytes
search.preserve_timerange = 1
search.search_string = | stats count as src_ip | eval src_ip = "$src_ip$" | sendalert "mbbr" param.remaction="scan" | eval "Malwarebytes Scan Started" = "Search 'sourcetype=mwb:mbbr $src_ip$' for more informaiton..."
search.target = blank
type = search

[mbbr_remove]
display_location = both
fields = src_ip
label = Malwarebytes Remediation: $src_ip$
search.app = malwarebytes
search.preserve_timerange = 1
search.search_string = | stats count as src_ip | eval src_ip = "$src_ip$" | sendalert "mbbr" param.remaction="remove" | eval "Malwarebytes Remediation Started" = "Search 'sourcetype=mwb:mbbr $src_ip$' for more informaiton..."
search.target = blank
type = search