[update_team_cymru_foundation_ip_indicator_master_lookup]
cron_schedule = */30 * * * *
description = Update Foundation IP Indicators from index to team_cymru_indicators_foundation_ip
dispatch.earliest_time = -40m
dispatch.latest_time = now
enableSched = 1
realtime_schedule = 0
request.ui_dispatch_app = TeamCymruScoutAppForSplunk
request.ui_dispatch_view = search
search = `team_cymru_indicator_indices` sourcetype="*team_cymru_foundation_ip" | dedup ip | rex field=_raw "(?<as_info>\"as_info\".*?), (?<insights>\"insights\".*?), (?<tags>\"tags\".*)\}" | eval as_info="{"+as_info+"}", insights="{"+insights+"}", tags="{"+tags+"}", timestamp=strftime(_time, "%Y-%m-%dT%H:%M:%S.%6N"), _key=md5(ip) | table _key, timestamp, as_info, insights, tags, ip, country_code | outputlookup team_cymru_indicators_foundation_ip key_field=_key append=true

[update_team_cymru_details_ip_indicator_master_lookup]
cron_schedule = */30 * * * *
description = Update Details IP Indicators from index to team_cymru_indicators_details_ip
dispatch.earliest_time = -40m
dispatch.latest_time = now
enableSched = 1
realtime_schedule = 0
request.ui_dispatch_app = TeamCymruScoutAppForSplunk
request.ui_dispatch_view = search
search = `team_cymru_indicator_indices` sourcetype="*team_cymru_details_ip" \
| dedup ip \
| spath output=identity path="identity"\
| spath output=whois path="whois"\
| spath output=summary path="summary"\
| spath output=open_ports path="open_ports"\
| spath output=pdns path="pdns"\
| spath output=fingerprints path="fingerprints"\
| spath output=x509 path="x509"\
| eval quot="\"", colon=":"\
| eval timestamp=strftime(_time, "%Y-%m-%dT%H:%M:%S.%6N"), _key=md5(ip) \
| eval identity="{"+ quot + "identity" + quot + colon + identity + "}"\
| eval whois="{"+ quot + "whois" + quot + colon + whois + "}"\
| eval summary="{"+ quot + "summary" + quot + colon + summary + "}"\
| eval open_ports="{"+ quot + "open_ports" + quot + colon + open_ports + "}"\
| eval pdns="{"+ quot + "pdns" + quot + colon + pdns + "}"\
| eval fingerprints="{"+ quot + "fingerprints" + quot + colon + fingerprints + "}"\
| eval x509="{"+ quot + "x509" + quot + colon + x509 + "}"\
| table _key, timestamp, identity, summary, whois, ip, start_date, end_date, open_ports, pdns, fingerprints, x509\
| outputlookup team_cymru_indicators_details_ip key_field=_key append=true

[update_team_cymru_details_domain_indicator_master_lookup]
cron_schedule = */30 * * * *
description = Update Details Domain Indicators from index to team_cymru_indicators_details_domain
dispatch.earliest_time = -40m
dispatch.latest_time = now
enableSched = 1
realtime_schedule = 0
request.ui_dispatch_app = TeamCymruScoutAppForSplunk
request.ui_dispatch_view = search
search = `team_cymru_indicator_indices` sourcetype="*team_cymru_details_domain" | dedup domain, ip | rex field=_raw "(?<as_info>\"as_info\".*?), (?<summary>\"summary\".*), (?<tags>\"tags\".*)\}" | eval country_codes = 'country_codes{}', as_info="{"+as_info+"}", summary="{"+summary+"}", tags="{"+tags+"}", timestamp=strftime(_time, "%Y-%m-%dT%H:%M:%S.%6N"), _key=md5(domain+"_"+ip) | table _key, timestamp, domain, ip, start_date, end_date, as_info, country_codes, summary, tags | outputlookup team_cymru_indicators_details_domain key_field=_key append=true

[team_cymru_correlate_Domains_indicators]
cron_schedule = */30 * * * *
description = Match Indicators of type Domains from the master_lookup against Splunk events.
dispatch.earliest_time = -30m
dispatch.latest_time = now
enableSched = 1
realtime_schedule = 0
request.ui_dispatch_app = TeamCymruScoutAppForSplunk
request.ui_dispatch_view = search
disabled = 1
search =  `team_cymru_domains_target_query` | fillnull value="-" `team_cymru_domains_target_indicator_fields`,index | stats count by `team_cymru_domains_target_indicator_fields`,index | teamcymrumatchindicators indicator_type="domain"

[team_cymru_correlate_IPs_indicators]
cron_schedule = */30 * * * *
description = Match Indicators of type IPs from the master_lookup against Splunk events.
dispatch.earliest_time = -30m
dispatch.latest_time = now
enableSched = 1
realtime_schedule = 0
request.ui_dispatch_app = TeamCymruScoutAppForSplunk
request.ui_dispatch_view = search
disabled = 1
search =  `team_cymru_ips_target_query` | fillnull value="-" `team_cymru_ips_target_indicator_fields`,index | stats count by `team_cymru_ips_target_indicator_fields`,index | teamcymrumatchindicators indicator_type="ip"

[team_cymru_correlate_IPs_indicators_network_traffic]
disabled = 1
cron_schedule = */30 * * * *
description = Match indicators from the IPs master_lookup against Network_Traffic events
dispatch.earliest_time = -30m
dispatch.latest_time = now
enableSched = 1
realtime_schedule = 0
request.ui_dispatch_app = TeamCymruScoutAppForSplunk
request.ui_dispatch_view = search
allow_skew = 50%
search = | datamodel Network_Traffic All_Traffic search | fillnull value="" All_Traffic.src | stats count by All_Traffic.src | teamcymrumatchindicators indicator_type="ip"

[team_cymru_correlate_IPs_indicators_malware]
disabled = 1
cron_schedule = 1-59/30 * * * *
description = Match indicators from the IPs master_lookup against Malware events
dispatch.earliest_time = -30m
dispatch.latest_time = now
enableSched = 1
realtime_schedule = 0
request.ui_dispatch_app = TeamCymruScoutAppForSplunk
request.ui_dispatch_view = search
allow_skew = 50%
search = | datamodel Malware Malware_Attacks search | fillnull value="" Malware_Attacks.file_name, Malware_Attacks.file_hash, Malware_Attacks.signature, Malware_Attacks.sender, Malware_Attacks.src, Malware_Attacks.user | stats count by Malware_Attacks.file_name, Malware_Attacks.file_hash, Malware_Attacks.signature, Malware_Attacks.sender, Malware_Attacks.src, Malware_Attacks.user | teamcymrumatchindicators indicator_type="ip"

[team_cymru_correlate_IPs_indicators_intrusion_detection]
disabled = 1
cron_schedule = 6-59/30 * * * *
description = Match indicators from the IPs master_lookup against Intrusion_Detection events
dispatch.earliest_time = -30m
dispatch.latest_time = now
enableSched = 1
realtime_schedule = 0
request.ui_dispatch_app = TeamCymruScoutAppForSplunk
request.ui_dispatch_view = search
allow_skew = 50%
search = | datamodel Intrusion_Detection IDS_Attacks search | fillnull value="" IDS_Attacks.src, IDS_Attacks.signature, IDS_Attacks.user | stats count by IDS_Attacks.src, IDS_Attacks.signature, IDS_Attacks.user | teamcymrumatchindicators indicator_type="ip"

[team_cymru_correlate_IPs_indicators_authentication]
disabled = 1
cron_schedule = 7-59/30 * * * *
description = Match indicators from the IPs master_lookup against Authentication events
dispatch.earliest_time = -30m
dispatch.latest_time = now
enableSched = 1
realtime_schedule = 0
request.ui_dispatch_app = TeamCymruScoutAppForSplunk
request.ui_dispatch_view = search
allow_skew = 50%
search = | datamodel Authentication Authentication search | fillnull value="" Authentication.src_user, Authentication.user | stats count by Authentication.src_user, Authentication.user | teamcymrumatchindicators indicator_type="ip"

[team_cymru_correlate_IPs_indicators_certificates]
disabled = 1
cron_schedule = 8-59/30 * * * *
description = Match indicators from the IPs master_lookup against Certificates events
dispatch.earliest_time = -30m
dispatch.latest_time = now
enableSched = 1
realtime_schedule = 0
request.ui_dispatch_app = TeamCymruScoutAppForSplunk
request.ui_dispatch_view = search
allow_skew = 50%
search = | datamodel Certificates SSL search | fillnull value="" All_Certificates.SSL.ssl_hash, All_Certificates.SSL.ssl_issuer_email, All_Certificates.SSL.ssl_subject_email, All_Certificates.SSL.ssl_subject_common_name, All_Certificates.SSL.ssl_issuer_common_name, All_Certificates.SSL.ssl_subject_organization, All_Certificates.SSL.ssl_issuer_organization, All_Certificates.SSL.ssl_serial, All_Certificates.SSL.ssl_subject_unit, All_Certificates.SSL.ssl_issuer_unit | stats count by All_Certificates.SSL.ssl_hash, All_Certificates.SSL.ssl_issuer_email, All_Certificates.SSL.ssl_subject_email, All_Certificates.SSL.ssl_subject_common_name, All_Certificates.SSL.ssl_issuer_common_name, All_Certificates.SSL.ssl_subject_organization, All_Certificates.SSL.ssl_issuer_organization, All_Certificates.SSL.ssl_serial, All_Certificates.SSL.ssl_subject_unit, All_Certificates.SSL.ssl_issuer_unit | teamcymrumatchindicators indicator_type="ip"

[team_cymru_correlate_IPs_indicators_endpoint_filesystem]
disabled = 1
cron_schedule = 9-59/30 * * * *
description = Match indicators from the IPs master_lookup against Endpoint (Filesystem dataset) events
dispatch.earliest_time = -30m
dispatch.latest_time = now
enableSched = 1
realtime_schedule = 0
request.ui_dispatch_app = TeamCymruScoutAppForSplunk
request.ui_dispatch_view = search
allow_skew = 50%
search = | datamodel Endpoint Filesystem search | fillnull value="" Filesystem.file_name, Filesystem.file_hash | stats count by Filesystem.file_name, Filesystem.file_hash | teamcymrumatchindicators indicator_type="ip"

[team_cymru_correlate_IPs_indicators_endpoint_services]
disabled = 1
cron_schedule = 10-59/30 * * * *
description = Match indicators from the IPs master_lookup against Endpoint (Services dataset) events
dispatch.earliest_time = -30m
dispatch.latest_time = now
enableSched = 1
realtime_schedule = 0
request.ui_dispatch_app = TeamCymruScoutAppForSplunk
request.ui_dispatch_view = search
allow_skew = 50%
search = | datamodel Endpoint Services search | fillnull value="" Services.service | stats count by Services.service | teamcymrumatchindicators indicator_type="ip"

[team_cymru_correlate_IPs_indicators_endpoint_processes]
disabled = 1
cron_schedule = 11-59/30 * * * *
description = Match indicators from the IPs master_lookup against Endpoint (Processes dataset) events
dispatch.earliest_time = -30m
dispatch.latest_time = now
enableSched = 1
realtime_schedule = 0
request.ui_dispatch_app = TeamCymruScoutAppForSplunk
request.ui_dispatch_view = search
allow_skew = 50%
search = | datamodel Endpoint Processes search | fillnull value="" Processes.process_name | stats count by Processes.process_name | teamcymrumatchindicators indicator_type="ip"

[team_cymru_correlate_IPs_indicators_email]
disabled = 1
cron_schedule = 12-59/30 * * * *
description = Match indicators from the IPs master_lookup against Email events
dispatch.earliest_time = -30m
dispatch.latest_time = now
enableSched = 1
realtime_schedule = 0
request.ui_dispatch_app = TeamCymruScoutAppForSplunk
request.ui_dispatch_view = search
allow_skew = 50%
search = | datamodel Email All_Email search | fillnull value="" All_Email.file_name, All_Email.file_hash, All_Email.subject, All_Email.src_user | stats count by All_Email.file_name, All_Email.file_hash, All_Email.subject, All_Email.src_user | teamcymrumatchindicators indicator_type="ip"

[team_cymru_correlate_IPs_indicators_compute_inventory]
disabled = 1
cron_schedule = 13-59/30 * * * *
description = Match indicators from the IPs master_lookup against Compute_Inventory events
dispatch.earliest_time = -30m
dispatch.latest_time = now
enableSched = 1
realtime_schedule = 0
request.ui_dispatch_app = TeamCymruScoutAppForSplunk
request.ui_dispatch_view = search
allow_skew = 50%
search = | datamodel Compute_Inventory User search | fillnull value="" All_Inventory.User.user | stats count by All_Inventory.User.user | teamcymrumatchindicators indicator_type="ip"

[team_cymru_correlate_IPs_indicators_network_resolution]
disabled = 1
cron_schedule = 14-59/30 * * * *
description = Match indicators from the IPs master_lookup against Network_Resolution events
dispatch.earliest_time = -30m
dispatch.latest_time = now
enableSched = 1
realtime_schedule = 0
request.ui_dispatch_app = TeamCymruScoutAppForSplunk
request.ui_dispatch_view = search
allow_skew = 50%
search = | datamodel Network_Resolution DNS search | fillnull value="" DNS.query, DNS.answer | stats count by DNS.query, DNS.answer | teamcymrumatchindicators indicator_type="ip"

[team_cymru_correlate_IPs_indicators_updates]
disabled = 1
cron_schedule = 15-59/30 * * * *
description = Match indicators from the IPs master_lookup against Updates events
dispatch.earliest_time = -30m
dispatch.latest_time = now
enableSched = 1
realtime_schedule = 0
request.ui_dispatch_app = TeamCymruScoutAppForSplunk
request.ui_dispatch_view = search
allow_skew = 50%
search = | datamodel Updates Updates search | fillnull value="" Updates.file_name, Updates.file_hash | stats count by Updates.file_name, Updates.file_hash | teamcymrumatchindicators indicator_type="ip"

[team_cymru_correlate_IPs_indicators_web]
disabled = 1
cron_schedule = 16-59/30 * * * *
description = Match indicators from the IPs master_lookup against Web events
dispatch.earliest_time = -30m
dispatch.latest_time = now
enableSched = 1
realtime_schedule = 0
request.ui_dispatch_app = TeamCymruScoutAppForSplunk
request.ui_dispatch_view = search
allow_skew = 50%
search = | datamodel Web Web search | fillnull value="" Web.user, Web.http_referrer, Web.url, Web.http_user_agent, Web.src, Web.dest | rex field=Web.url "^([A-Za-z]*:\/\/)?(?<url>(.*))" | eval Web.url=url | stats count by Web.user, Web.http_referrer, Web.url, Web.http_user_agent, Web.src, Web.dest | teamcymrumatchindicators indicator_type="ip"

[team_cymru_correlate_Domains_indicators_network_traffic]
disabled = 1
cron_schedule = */30 * * * *
description = Match indicators from the Domains master_lookup against Network_Traffic events
dispatch.earliest_time = -30m
dispatch.latest_time = now
enableSched = 1
realtime_schedule = 0
request.ui_dispatch_app = TeamCymruScoutAppForSplunk
request.ui_dispatch_view = search
allow_skew = 50%
search = | datamodel Network_Traffic All_Traffic search | fillnull value="" All_Traffic.src | stats count by All_Traffic.src | teamcymrumatchindicators indicator_type="domain"

[team_cymru_correlate_Domains_indicators_malware]
disabled = 1
cron_schedule = 1-59/30 * * * *
description = Match indicators from the Domains master_lookup against Malware events
dispatch.earliest_time = -30m
dispatch.latest_time = now
enableSched = 1
realtime_schedule = 0
request.ui_dispatch_app = TeamCymruScoutAppForSplunk
request.ui_dispatch_view = search
allow_skew = 50%
search = | datamodel Malware Malware_Attacks search | fillnull value="" Malware_Attacks.file_name, Malware_Attacks.file_hash, Malware_Attacks.signature, Malware_Attacks.sender, Malware_Attacks.src, Malware_Attacks.user | stats count by Malware_Attacks.file_name, Malware_Attacks.file_hash, Malware_Attacks.signature, Malware_Attacks.sender, Malware_Attacks.src, Malware_Attacks.user | teamcymrumatchindicators indicator_type="domain"

[team_cymru_correlate_Domains_indicators_intrusion_detection]
disabled = 1
cron_schedule = 6-59/30 * * * *
description = Match indicators from the Domains master_lookup against Intrusion_Detection events
dispatch.earliest_time = -30m
dispatch.latest_time = now
enableSched = 1
realtime_schedule = 0
request.ui_dispatch_app = TeamCymruScoutAppForSplunk
request.ui_dispatch_view = search
allow_skew = 50%
search = | datamodel Intrusion_Detection IDS_Attacks search | fillnull value="" IDS_Attacks.src, IDS_Attacks.signature, IDS_Attacks.user | stats count by IDS_Attacks.src, IDS_Attacks.signature, IDS_Attacks.user | teamcymrumatchindicators indicator_type="domain"

[team_cymru_correlate_Domains_indicators_authentication]
disabled = 1
cron_schedule = 7-59/30 * * * *
description = Match indicators from the Domains master_lookup against Authentication events
dispatch.earliest_time = -30m
dispatch.latest_time = now
enableSched = 1
realtime_schedule = 0
request.ui_dispatch_app = TeamCymruScoutAppForSplunk
request.ui_dispatch_view = search
allow_skew = 50%
search = | datamodel Authentication Authentication search | fillnull value="" Authentication.src_user, Authentication.user | stats count by Authentication.src_user, Authentication.user | teamcymrumatchindicators indicator_type="domain"

[team_cymru_correlate_Domains_indicators_certificates]
disabled = 1
cron_schedule = 8-59/30 * * * *
description = Match indicators from the Domains master_lookup against Certificates events
dispatch.earliest_time = -30m
dispatch.latest_time = now
enableSched = 1
realtime_schedule = 0
request.ui_dispatch_app = TeamCymruScoutAppForSplunk
request.ui_dispatch_view = search
allow_skew = 50%
search = | datamodel Certificates SSL search | fillnull value="" All_Certificates.SSL.ssl_hash, All_Certificates.SSL.ssl_issuer_email, All_Certificates.SSL.ssl_subject_email, All_Certificates.SSL.ssl_subject_common_name, All_Certificates.SSL.ssl_issuer_common_name, All_Certificates.SSL.ssl_subject_organization, All_Certificates.SSL.ssl_issuer_organization, All_Certificates.SSL.ssl_serial, All_Certificates.SSL.ssl_subject_unit, All_Certificates.SSL.ssl_issuer_unit | stats count by All_Certificates.SSL.ssl_hash, All_Certificates.SSL.ssl_issuer_email, All_Certificates.SSL.ssl_subject_email, All_Certificates.SSL.ssl_subject_common_name, All_Certificates.SSL.ssl_issuer_common_name, All_Certificates.SSL.ssl_subject_organization, All_Certificates.SSL.ssl_issuer_organization, All_Certificates.SSL.ssl_serial, All_Certificates.SSL.ssl_subject_unit, All_Certificates.SSL.ssl_issuer_unit | teamcymrumatchindicators indicator_type="domain"

[team_cymru_correlate_Domains_indicators_endpoint_filesystem]
disabled = 1
cron_schedule = 9-59/30 * * * *
description = Match indicators from the Domains master_lookup against Endpoint (Filesystem dataset) events
dispatch.earliest_time = -30m
dispatch.latest_time = now
enableSched = 1
realtime_schedule = 0
request.ui_dispatch_app = TeamCymruScoutAppForSplunk
request.ui_dispatch_view = search
allow_skew = 50%
search = | datamodel Endpoint Filesystem search | fillnull value="" Filesystem.file_name, Filesystem.file_hash | stats count by Filesystem.file_name, Filesystem.file_hash | teamcymrumatchindicators indicator_type="domain"

[team_cymru_correlate_Domains_indicators_endpoint_services]
disabled = 1
cron_schedule = 10-59/30 * * * *
description = Match indicators from the Domains master_lookup against Endpoint (Services dataset) events
dispatch.earliest_time = -30m
dispatch.latest_time = now
enableSched = 1
realtime_schedule = 0
request.ui_dispatch_app = TeamCymruScoutAppForSplunk
request.ui_dispatch_view = search
allow_skew = 50%
search = | datamodel Endpoint Services search | fillnull value="" Services.service | stats count by Services.service | teamcymrumatchindicators indicator_type="domain"

[team_cymru_correlate_Domains_indicators_endpoint_processes]
disabled = 1
cron_schedule = 11-59/30 * * * *
description = Match indicators from the Domains master_lookup against Endpoint (Processes dataset) events
dispatch.earliest_time = -30m
dispatch.latest_time = now
enableSched = 1
realtime_schedule = 0
request.ui_dispatch_app = TeamCymruScoutAppForSplunk
request.ui_dispatch_view = search
allow_skew = 50%
search = | datamodel Endpoint Processes search | fillnull value="" Processes.process_name | stats count by Processes.process_name | teamcymrumatchindicators indicator_type="domain"

[team_cymru_correlate_Domains_indicators_email]
disabled = 1
cron_schedule = 12-59/30 * * * *
description = Match indicators from the Domains master_lookup against Email events
dispatch.earliest_time = -30m
dispatch.latest_time = now
enableSched = 1
realtime_schedule = 0
request.ui_dispatch_app = TeamCymruScoutAppForSplunk
request.ui_dispatch_view = search
allow_skew = 50%
search = | datamodel Email All_Email search | fillnull value="" All_Email.file_name, All_Email.file_hash, All_Email.subject, All_Email.src_user | stats count by All_Email.file_name, All_Email.file_hash, All_Email.subject, All_Email.src_user | teamcymrumatchindicators indicator_type="domain"

[team_cymru_correlate_Domains_indicators_compute_inventory]
disabled = 1
cron_schedule = 13-59/30 * * * *
description = Match indicators from the Domains master_lookup against Compute_Inventory events
dispatch.earliest_time = -30m
dispatch.latest_time = now
enableSched = 1
realtime_schedule = 0
request.ui_dispatch_app = TeamCymruScoutAppForSplunk
request.ui_dispatch_view = search
allow_skew = 50%
search = | datamodel Compute_Inventory User search | fillnull value="" All_Inventory.User.user | stats count by All_Inventory.User.user | teamcymrumatchindicators indicator_type="domain"

[team_cymru_correlate_Domains_indicators_network_resolution]
disabled = 1
cron_schedule = 14-59/30 * * * *
description = Match indicators from the Domains master_lookup against Network_Resolution events
dispatch.earliest_time = -30m
dispatch.latest_time = now
enableSched = 1
realtime_schedule = 0
request.ui_dispatch_app = TeamCymruScoutAppForSplunk
request.ui_dispatch_view = search
allow_skew = 50%
search = | datamodel Network_Resolution DNS search | fillnull value="" DNS.query, DNS.answer | stats count by DNS.query, DNS.answer | teamcymrumatchindicators indicator_type="domain"

[team_cymru_correlate_Domains_indicators_updates]
disabled = 1
cron_schedule = 15-59/30 * * * *
description = Match indicators from the Domains master_lookup against Updates events
dispatch.earliest_time = -30m
dispatch.latest_time = now
enableSched = 1
realtime_schedule = 0
request.ui_dispatch_app = TeamCymruScoutAppForSplunk
request.ui_dispatch_view = search
allow_skew = 50%
search = | datamodel Updates Updates search | fillnull value="" Updates.file_name, Updates.file_hash | stats count by Updates.file_name, Updates.file_hash | teamcymrumatchindicators indicator_type="domain"

[team_cymru_correlate_Domains_indicators_web]
disabled = 1
cron_schedule = 16-59/30 * * * *
description = Match indicators from the Domains master_lookup against Web events
dispatch.earliest_time = -30m
dispatch.latest_time = now
enableSched = 1
realtime_schedule = 0
request.ui_dispatch_app = TeamCymruScoutAppForSplunk
request.ui_dispatch_view = search
allow_skew = 50%
search = | datamodel Web Web search | fillnull value="" Web.user, Web.http_referrer, Web.url, Web.http_user_agent, Web.src, Web.dest | rex field=Web.url "^([A-Za-z]*:\/\/)?(?<url>(.*))" | eval Web.url=url | stats count by Web.user, Web.http_referrer, Web.url, Web.http_user_agent, Web.src, Web.dest | teamcymrumatchindicators indicator_type="domain"

[Delete Older Domains from `team_cymru_matched_indicators_domain` and `team_cymru_indicators_details_domain`]
action.email.useNSSubject = 1
action.webhook.enable_allowlist = 0
alert.track = 0
cron_schedule = 0 0 * * *
description = Domains older than specified time will be deleted from `team_cymru_indicators_details_domain` and `team_cymru_matched_indicators_domain` lookups.
disabled = 1
dispatch.earliest_time = -30d
dispatch.latest_time = now
enableSched = 1
search = | inputlookup team_cymru_indicators_details_domain \
| eval event_time=strptime(timestamp, "%Y-%m-%dT%H:%M:%S.%3f") \
| eval value=md5(domain) \
| join type=left value \
    [| inputlookup team_cymru_matched_indicators_domain \
    | addinfo \
    | where lastMatchTime > info_min_time \
    | eval value=md5(domain) \
    | fillnull value="-" correlationIndices \
    | fields _key count, domain, lastMatchTime, correlationIndices, value \
    | outputlookup team_cymru_matched_indicators_domain \
    | table value lastMatchTime] \
| addinfo \
| where event_time > info_min_time OR lastMatchTime!="" \
| table _key, as_info, domain, end_date, ip, start_date, summary, tags, country_codes, timestamp \
| outputlookup team_cymru_indicators_details_domain

[Delete Older IPs from `team_cymru_matched_indicators_ip` and `team_cymru_indicators_details_ip`]
action.email.useNSSubject = 1
action.webhook.enable_allowlist = 0
alert.track = 0
cron_schedule = 0 0 * * *
description = IPs older than specified time will be deleted from `team_cymru_indicators_details_ip` and `team_cymru_matched_indicators_ip` lookups.
disabled = 1
dispatch.earliest_time = -30d
dispatch.latest_time = now
enableSched = 1
search = | inputlookup team_cymru_indicators_details_ip \
| eval event_time=strptime(timestamp, "%Y-%m-%dT%H:%M:%S.%3f") \
| eval value=md5(ip) \
| join type=left value \
    [| inputlookup team_cymru_matched_indicators_ip \
    | addinfo \
    | where lastMatchTime > info_min_time \
    | eval value=md5(ip) \
    | fillnull value="-" correlationIndices \
    | fields _key count, ip, lastMatchTime, correlationIndices, value \
    | outputlookup team_cymru_matched_indicators_ip \
    | table value lastMatchTime] \
| addinfo \
| where event_time > info_min_time OR lastMatchTime!="" \
| table _key, timestamp, identity, summary, open_ports, pdns, fingerprints, x509, whois, ip, start_date, end_date \
| outputlookup team_cymru_indicators_details_ip

[Delete Older IPs from `team_cymru_matched_indicators_ip` and `team_cymru_indicators_foundation_ip`]
action.email.useNSSubject = 1
action.webhook.enable_allowlist = 0
alert.track = 0
cron_schedule = 0 0 * * *
description = IPs older than specified time will be deleted from `team_cymru_indicators_foundation_ip` and `team_cymru_matched_indicators_ip` lookups.
disabled = 1
dispatch.earliest_time = -30d
dispatch.latest_time = now
enableSched = 1
search = | inputlookup team_cymru_indicators_foundation_ip \
| eval event_time=strptime(timestamp, "%Y-%m-%dT%H:%M:%S.%3f") \
| eval value=md5(ip) \
| join type=left value \
    [| inputlookup team_cymru_matched_indicators_ip \
    | addinfo \
    | where lastMatchTime > info_min_time \
    | eval value=md5(ip) \
    | fillnull value="-" correlationIndices \
    | fields _key count, ip, lastMatchTime, correlationIndices, value \
    | outputlookup team_cymru_matched_indicators_ip \
    | table value lastMatchTime] \
| addinfo \
| where event_time > info_min_time OR lastMatchTime!="" \
| table _key, timestamp, as_info, insights, tags, ip, country_code  \
| outputlookup team_cymru_indicators_foundation_ip
