[Work From Home IPs]
alert.track = 0
cron_schedule = 0 0 * * *
description = This takes VPN client ips from Network_Session.VPN CIM data model and gets ips related data from BitSight WFH endpoint
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
display.events.fields = ["host","is_Missing_Extractions_Network_Sessions","is_not_Missing_Extractions_Network_Sessions","source","sourcetype"]
display.general.type = statistics
display.page.search.mode = fast
display.page.search.tab = statistics
display.visualizations.charting.chart = line
display.visualizations.custom.type = Splunk_ML_Toolkit.ForecastViz
display.visualizations.show = 0
enableSched = 1
request.ui_dispatch_app = TA-bitsight
request.ui_dispatch_view = search
search = | tstats values(All_Sessions.src_ip) AS src_ip from datamodel=Network_Sessions| stats count by src_ip | table src_ip |eval is_ip = if(match(src_ip, "^\d{1,3}\.\d{1,3}\.\d{1,3}\.\d{1,3}$"), 1, 0) |where is_ip = 1| table src_ip,is_ip| wfh
