# savedsearches.conf

# Base Search
[asset_discovery]
search = index=asset_discovery
is_visible = false

######################
# Overview dashboard
######################

[scan points]
search = | metadata index=asset_discovery type=hosts | rename host as scan_point totalCount as scan_results lastTime as last_scan | sort -last_scan | fieldformat last_scan = strftime(last_scan, "%Y-%m-%d %H:%M:%S") | table scan_point, scan_results, last_scan

[asset change state down]
search = eventtype=ping_scan | `get_state_changes("Up (?:Down\s?){1,20}$")`
#dispatch.rt_backfill = true

[asset change state up]
search = eventtype=ping_scan | `get_state_changes("Down (?:Up\s?){1,3}$")`
#dispatch.rt_backfill = true

[asset os signatures]
search = eventtype=port_scan | fillnull value=unknown os_signature | stats dc(dest_ip) as count by os_signature
#dispatch.rt_backfill = true

[asset top ports]
search = eventtype=port_scan | dedup dest_ip | top port_signature showperc=f
#dispatch.rt_backfill = true

[asset rare ports]
search = eventtype=port_scan | dedup dest_ip | rare port_signature showperc=f
#dispatch.rt_backfill = true

[asset availability]
search = eventtype=ping_scan | eval state = if(status == "Up", 1, -1) | timechart sum(state) by status
#dispatch.rt_backfill = true

#[map available assets]
#search = eventtype=ping_scan | dedup dest_ip | search status=Up | lookup geoip_internal dest_ip | geoip dest_ip
#dispatch.earliest_time = -24h@h
#dispatch.latest_time = now
#request.ui_dispatch_app = asset_discovery
#displayview = map
#
#[map assets running splunkd]
#search = eventtype=port_scan | dedup dest_ip | search app_version="Splunkd httpd" | lookup geoip_internal dest_ip | geoip dest_ip
#dispatch.earliest_time = -24h@h
#dispatch.latest_time = now
#request.ui_dispatch_app = asset_discovery
#displayview = map
