[default]
[Dtex_Count_Summary]
enableSched = 1
alert.track = 0
auto_summarize.dispatch.earliest_time = 0
dispatch.latest_time = now
auto_summarize = 1
search = `dtexubi_index` `get_dtex_activities`  Activity_Type=* $settokenvalue$ | fields Device_Name User_Name | stats count as "Raw Dtex Activities" dc(Device_Name) as "Endpoint Devices" dc(User_Name) as "User Accounts" | fieldformat "Raw Dtex Activities" = tostring('Raw Dtex Activities',"commas") | fieldformat "Endpoint Devices" = tostring('Endpoint Devices',"commas") | fieldformat "User Accounts" = tostring('User Accounts',"commas")
dispatch.earliest_time = 0
cron_schedule = */10 * * * *

[get_domain_alerts]
request.ui_dispatch_view = search
alert.track = 0
alert.digest_mode = 0
alert.suppress = 0
display.page.search.mode = verbose
display.general.type = statistics
request.ui_dispatch_app = dtexubi
action.dtex_custom_alerts.param.category = Data Loss Risk (File Sharing Applications)
action.dtex_custom_alerts.param.risk_score = 10
action.dtex_custom_alerts = 1
auto_summarize.dispatch.earliest_time = -1d@h
disabled = 1
relation = greater than
action.dtex_custom_alerts.param.triggertime = $trigger_time$
quantity = 0
search = | tstats `dtex_summariesonly` count(activities.Website_Domain) as Domain from datamodel=dtex_activities where activities.Website_Domain="www.msn.com" by _time,activities.User_Name |eval Time = strptime(_time,"%Y-%m-%dT%H:%M:%S") | rename activities.User_Name as user_name | where Domain > 50
display.page.search.tab = statistics
cron_schedule = 0 * * * *
action.dtex_custom_alerts.param.severity = Medium
dispatch.latest_time = now
counttype = number of events
display.events.fields = ["host","source","sourcetype","tag","tag::eventtype","Website_Domain","severity","Activity_Group","Activity_Type","user_risk_score","category_id","user_name","Website_Query","Category_ID","lexons{}.name","Process_Parameters"]
action.dtex_custom_alerts.param.time = Time
display.visualizations.charting.legend.labelStyle.overflowMode = ellipsisEnd
enableSched = 1
dispatch.earliest_time = -24h@h
action.email.useNSSubject = 1
action.dtex_custom_alerts.param.username = user_name

[get_rare_hash_alerts]
request.ui_dispatch_view = search
alert.track = 0
alert.digest_mode = 0
alert.suppress = 0
display.page.search.mode = verbose
display.general.type = statistics
request.ui_dispatch_app = dtexubi
action.dtex_custom_alerts.param.category = Unusual Privilege Escalation
action.dtex_custom_alerts.param.risk_score = 15
action.dtex_custom_alerts = 1
auto_summarize.dispatch.earliest_time = -1d@h
disabled = 1
relation = greater than
action.dtex_custom_alerts.param.triggertime = $trigger_time$
quantity = 0
search = | tstats count from datamodel=dtex_activities where activities.Activity_Type="ProcessStarted" AND activities.Process_Checksum_SHA256 != "" by activities.User_Name,activities.Process_Checksum_SHA256,_time | rename activities.User_Name as User_Name activities.Process_Checksum_SHA256 as Process_Checksum_SHA256 | fields _time User_Name Process_Checksum_SHA256 | tail
display.page.search.tab = statistics
cron_schedule = 0 * * * *
display.visualizations.charting.chart = line
action.dtex_custom_alerts.param.severity = High
dispatch.latest_time = now
counttype = number of events
display.events.fields = ["host","source","sourcetype","tag","tag::eventtype","Website_Domain","severity","Activity_Group","Activity_Type","user_risk_score","category_id","user_name","Website_Query","Category_ID","lexons{}.name","Process_Parameters","Process_Name"]
action.dtex_custom_alerts.param.time = _time
display.visualizations.charting.legend.labelStyle.overflowMode = ellipsisEnd
enableSched = 1
dispatch.earliest_time = -24h@h
action.email.useNSSubject = 1
action.dtex_custom_alerts.param.username = User_Name

[get_threshold_alerts]
request.ui_dispatch_view = search
alert.track = 0
alert.digest_mode = 0
alert.suppress = 0
display.page.search.mode = verbose
display.general.type = statistics
request.ui_dispatch_app = dtexubi
action.dtex_custom_alerts.param.category = Data Loss Risk (Personal Webmail)
action.dtex_custom_alerts.param.risk_score = 5
action.dtex_custom_alerts = 1
auto_summarize.dispatch.earliest_time = -1d@h
disabled = 1
relation = greater than
action.dtex_custom_alerts.param.triggertime = $trigger_time$
quantity = 0
search = | tstats count(activities.Website_Domain) as Domain from datamodel=dtex_activities where activities.Website_Domain="inbox.google.com" by activities.User_Name,_time | rename activities.User_Name as user_name | join [ |rest /services/properties/dtexubi/configuration/threshold splunk_server=local | fields value] | where Domain > value
display.page.search.tab = statistics
cron_schedule = 0 * * * *
display.visualizations.charting.chart = line
action.dtex_custom_alerts.param.severity = Low
dispatch.latest_time = now
counttype = number of events
display.events.fields = ["host","source","sourcetype","tag","tag::eventtype","Website_Domain","severity","Activity_Group","Activity_Type","user_risk_score","category_id","user_name","Website_Query","Category_ID","lexons{}.name","Process_Parameters","Process_Name"]
action.dtex_custom_alerts.param.time = _time
display.visualizations.charting.legend.labelStyle.overflowMode = ellipsisEnd
enableSched = 1
dispatch.earliest_time = -1h
action.email.useNSSubject = 1
action.dtex_custom_alerts.param.username = user_name

[get_unusual_network_transfers]
request.ui_dispatch_view = search
alert.track = 0
alert.digest_mode = 0
alert.suppress = 0
display.page.search.mode = verbose
display.general.type = statistics
request.ui_dispatch_app = dtexubi
action.dtex_custom_alerts.param.category = Unusual Privilege Escalation
action.dtex_custom_alerts.param.risk_score = 20
action.dtex_custom_alerts = 1
disabled = 1
relation = greater than
action.dtex_custom_alerts.param.triggertime = $trigger_time$
quantity = 0
search = | tstats count from datamodel=dtex_activities by activities.User_Name,activities.Network_Activity_Details.BytesIn,activities.Network_Activity_Details.BytesOut,_time span=1d | rename activities.User_Name as User_Name ,activities.Network_Activity_Details.BytesIn as BytesIn ,activities.Network_Activity_Details.BytesOut as BytesOut | eval TotalBytes = BytesIn + BytesOut | eval MB = TotalBytes / (1024*1024) | eventstats stdev(MB) as MBCount by User_Name | where MBCount > 3 | fields User_Name _time MBCount
display.page.search.tab = statistics
cron_schedule = 0 * * * *
display.visualizations.charting.chart = line
action.dtex_custom_alerts.param.severity = High
dispatch.latest_time = now
counttype = number of events
display.events.fields = ["host","source","sourcetype","tag","tag::eventtype","Website_Domain","severity","Activity_Group","Activity_Type","user_risk_score","category_id","user_name","Website_Query","Category_ID","lexons{}.name","Process_Parameters","Process_Name","Network_Activity_Details.BytesIn","Network_Activity_Details.BytesOut"]
action.dtex_custom_alerts.param.time = _time
display.visualizations.charting.legend.labelStyle.overflowMode = ellipsisEnd
enableSched = 1
dispatch.earliest_time = 0
action.email.useNSSubject = 1
action.dtex_custom_alerts.param.username = User_Name

[get_zscore_alert]
request.ui_dispatch_view = search
alert.track = 0
alert.digest_mode = 0
alert.suppress = 0
display.page.search.mode = verbose
display.general.type = statistics
request.ui_dispatch_app = dtexubi
action.dtex_custom_alerts.param.category = Data Loss Risk (Unusual Access to Sensitive Data)
action.dtex_custom_alerts.param.risk_score = 10
action.dtex_custom_alerts = 1
disabled = 1
relation = greater than
action.dtex_custom_alerts.param.triggertime = $trigger_time$
quantity = 0
search = | tstats count from datamodel=dtex_activities where activities.Activity_Type=FileCopied by activities.User_Name,_time span=1d | rename activities.User_Name as User_Name | eventstats stdev(count) as stdev by User_Name | eventstats avg(count) as avg by User_Name | eval zscore = ((count - avg)/stdev) |join [| rest /services/properties/dtexubi/configuration/zscore splunk_server=local | fields value]| where zscore > value AND stdev > 0
display.page.search.tab = statistics
cron_schedule = 0 * * * *
display.visualizations.charting.chart = line
action.dtex_custom_alerts.param.severity = Medium
dispatch.latest_time = now
counttype = number of events
display.events.fields = ["host","source","sourcetype","tag","tag::eventtype","Website_Domain","severity","Activity_Group","Activity_Type","user_risk_score","category_id","user_name","Website_Query","Category_ID","lexons{}.name","Process_Parameters","Process_Name"]
action.dtex_custom_alerts.param.time = _time
display.visualizations.charting.legend.labelStyle.overflowMode = ellipsisEnd
enableSched = 1
dispatch.earliest_time = 0
action.email.useNSSubject = 1
action.dtex_custom_alerts.param.username = User_Name

