[hunt_io_update_c2_feed_lookup]
search = | huntioc2feedupdate
dispatch.earliest_time = -24h
dispatch.latest_time = now
disabled = 0
cron_schedule = 0 9 * * *
enableSched = 1

[hunt_io_update_active_c2_lookup]
search = | huntioactivec2update
dispatch.earliest_time = -24h
dispatch.latest_time = now
disabled = 0
cron_schedule = 0 7 * * *
enableSched = 1

[hunt_io_update_ioc_hunter_lookup]
search = | huntioiochunterupdate
dispatch.earliest_time = -24h
dispatch.latest_time = now
disabled = 0
cron_schedule = 0 8 * * *
enableSched = 1

[hunt_io_delete_c2_feed_alerts_older_than_7_days]
search = | inputlookup c2_alerts_ip_lookup \
| eval current_time=now() \
| eval alert_time_epoch=strptime(alert_time, "%Y-%m-%dT%H:%M:%S") \
| eval time_diff_seconds=current_time-alert_time_epoch \
| eval time_diff_days=time_diff_seconds/86400 \
| where time_diff_days <= 7 \
| fields - current_time alert_time_epoch time_diff_seconds time_diff_days \
| outputlookup c2_alerts_ip_lookup
dispatch.earliest_time = -24h
dispatch.latest_time = now
disabled = 0
cron_schedule = 0 8 * * *
enableSched = 1

[hunt_io_delete_ioc_hunter_alerts_older_than_7_days]
search = | inputlookup ioc_hunter_alerts_ip_lookup \
| eval current_time=now() \
| eval alert_time_epoch=strptime(alert_time, "%Y-%m-%dT%H:%M:%S") \
| eval time_diff_seconds=current_time-alert_time_epoch \
| eval time_diff_days=time_diff_seconds/86400 \
| where time_diff_days <= 7 \
| fields - current_time alert_time_epoch time_diff_seconds time_diff_days \
| outputlookup ioc_hunter_alerts_ip_lookup
dispatch.earliest_time = -24h
dispatch.latest_time = now
disabled = 0
cron_schedule = 0 8 * * *
enableSched = 1

[hunt_io_delete_ioc_hunter_alerts_domain_older_than_7_days]
search = | inputlookup ioc_hunter_alerts_domain_lookup \
| eval current_time=now() \
| eval alert_time_epoch=strptime(alert_time, "%Y-%m-%dT%H:%M:%S") \
| eval time_diff_seconds=current_time-alert_time_epoch \
| eval time_diff_days=time_diff_seconds/86400 \
| where time_diff_days <= 7 \
| fields - current_time alert_time_epoch time_diff_seconds time_diff_days \
| outputlookup ioc_hunter_alerts_domain_lookup
dispatch.earliest_time = -24h
dispatch.latest_time = now
disabled = 0
cron_schedule = 0 8 * * *
enableSched = 1

[hunt_io_detect_c2_feed_match_src_ip]
search = | tstats count from datamodel=Network_Traffic by All_Traffic.action All_Traffic.bytes All_Traffic.bytes_in All_Traffic.bytes_out All_Traffic.dest All_Traffic.dest_ip All_Traffic.dest_port All_Traffic.direction All_Traffic.src All_Traffic.src_ip All_Traffic.src_port All_Traffic.transport All_Traffic.user All_Traffic.vendor_product \
| rename All_Traffic.* as * \
| eval alert_time=now() \
| convert timeformat="%Y-%m-%dT%H:%M:%S" ctime(alert_time) \
| lookup c2_feed_lookup ip as src_ip OUTPUT ip hostname country_code malware_name malware_subsystem timestamp confidence \
| eval matched = if(isnotnull(malware_name), 1, 0) \
| search matched = 1 \
| outputlookup append=true c2_alerts_ip_lookup 
dispatch.earliest_time = -24h
dispatch.latest_time = now
disabled = 1
cron_schedule = 0 7 * * *
enableSched = 1

[hunt_io_detect_c2_feed_match_dest_ip]
search = | tstats count from datamodel=Network_Traffic by All_Traffic.action All_Traffic.bytes All_Traffic.bytes_in All_Traffic.bytes_out All_Traffic.dest All_Traffic.dest_ip All_Traffic.dest_port All_Traffic.direction All_Traffic.src All_Traffic.src_ip All_Traffic.src_port All_Traffic.transport All_Traffic.user All_Traffic.vendor_product \
| rename All_Traffic.* as * \
| eval alert_time=now() \
| convert timeformat="%Y-%m-%dT%H:%M:%S" ctime(alert_time) \
| lookup c2_feed_lookup ip as dest_ip OUTPUT ip hostname country_code malware_name malware_subsystem timestamp confidence \
| eval matched = if(isnotnull(malware_name), 1, 0) \
| search matched = 1 \
| outputlookup append=true c2_alerts_ip_lookup 
dispatch.earliest_time = -24h
dispatch.latest_time = now
disabled = 1
cron_schedule = 0 7 * * *
enableSched = 1

[hunt_io_detect_ioc_hunter_feed_match_src_ip]
search = | tstats count from datamodel=Network_Traffic by All_Traffic.action All_Traffic.bytes All_Traffic.bytes_in All_Traffic.bytes_out All_Traffic.dest All_Traffic.dest_ip All_Traffic.dest_port All_Traffic.direction All_Traffic.src All_Traffic.src_ip All_Traffic.src_port All_Traffic.transport All_Traffic.user All_Traffic.vendor_product \
| rename All_Traffic.* as * \
| eval alert_time=now() \
| convert timeformat="%Y-%m-%dT%H:%M:%S" ctime(alert_time) \
| lookup ioc_hunter_lookup value as src_ip OUTPUT ioc_type value publication_name publication_title published_at \
| eval matched = if(isnotnull(ioc_type), 1, 0) \
| search matched = 1 \
| outputlookup append=true ioc_hunter_alerts_ip_lookup
dispatch.earliest_time = -24h
dispatch.latest_time = now
disabled = 1
cron_schedule = 0 7 * * *
enableSched = 1

[hunt_io_detect_ioc_hunter_feed_match_dest_ip]
search = | tstats count from datamodel=Network_Traffic by All_Traffic.action All_Traffic.bytes All_Traffic.bytes_in All_Traffic.bytes_out All_Traffic.dest All_Traffic.dest_ip All_Traffic.dest_port All_Traffic.direction All_Traffic.src All_Traffic.src_ip All_Traffic.src_port All_Traffic.transport All_Traffic.user All_Traffic.vendor_product \
| rename All_Traffic.* as * \
| eval alert_time=now() \
| convert timeformat="%Y-%m-%dT%H:%M:%S" ctime(alert_time) \
| lookup ioc_hunter_lookup value as dest_ip OUTPUT ioc_type value name description country_code category victims \
| eval matched = if(isnotnull(ioc_type), 1, 0) \
| search matched = 1 \
| outputlookup append=true ioc_hunter_alerts_ip_lookup
dispatch.earliest_time = -24h
dispatch.latest_time = now
disabled = 1
cron_schedule = 0 7 * * *
enableSched = 1

[hunt_io_detect_ioc_hunter_feed_match_hostname]
search = | tstats count from datamodel=Web by Web.src, Web.dest, Web.http_user_agent, Web.url, Web.status Web.vendor_product Web.user \
| rename Web.* as * \
| eval alert_time=now() \
| convert timeformat="%Y-%m-%dT%H:%M:%S" ctime(alert_time) \
| lookup ioc_hunter_lookup value as dest OUTPUT ioc_type value publication_name publication_title published_at \
| eval matched = if(isnotnull(ioc_type), 1, 0) \
| search matched = 1 \
| outputlookup append=true ioc_hunter_alerts_domain_lookup
dispatch.earliest_time = -24h
dispatch.latest_time = now
disabled = 1
cron_schedule = 0 7 * * *
enableSched = 1



