[Threat - PSNC Tactic Threshold Exceeded For Object Over Previous 7 Days - Rule]
action.correlationsearch.enabled = 1
action.correlationsearch.label = PSNC Tactic Threshold Exceeded For Object Over Previous 7 Days
action.email.inline = false
action.email.sendpdf = false
action.email.sendresults = false
action.email.track_alert = true
action.email.use_ssl = false
action.email.use_tls = true
action.email.width_sort_columns = true
action.keyindicator.invert = 0
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable = 1
action.notable.param.drilldown_name = View the individual Risk Attributions
action.notable.param.drilldown_search = | from datamodel:"Risk.All_Risk" | search risk_object="$risk_object$" risk_object_type="$risk_object_type$" annotations.mitre_attack.mitre_tactic_id=* | `get_correlations` | rename annotations.mitre_attack.mitre_tactic_id as mitre_tactic_id, annotations.mitre_attack.mitre_tactic as mitre_tactic, annotations.mitre_attack.mitre_technique_id as mitre_technique_id, annotations.mitre_attack.mitre_technique as mitre_technique
action.notable.param.extract_artifacts = {"asset":["src","dest","dvc","orig_host","_risk_system"],"identity":["src_user","user","_risk_user"]}
action.notable.param.nes_fields = risk_object,risk_object_type
action.notable.param.rule_description = PSNC tactic threshold exceeded for an object over the previous 7 days
action.notable.param.rule_title = PSNC tactic threshold exceeded over previous 7 days for $risk_object_type$=$risk_object$
action.notable.param.security_domain = threat
action.notable.param.severity = high
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.populate_lookup.track_alert = false
action.risk.forceCsvResults = 1
action.risk.param._risk = [{"risk_object_field":"","risk_object_type":"","risk_score":1}]
action.risk.param._risk_score = 0
action.risk.param.verbose = 0
action.rss.track_alert = false
action.script.track_alert = true
action.send2uba.param.verbose = 0
action.summary_index.inline = true
action.summary_index.track_alert = false
action.threat_add.param.verbose = 0
action.webhook.enable_allowlist = 0
alert.digest_mode = true
alert.suppress = true
alert.suppress.fields = source_count,mitre_tactic_id_count,mitre_technique_id_count,risk_object,risk_object_type
alert.suppress.period = 21600s
alert.track = true
auto_summarize = false
counttype = number of events
cron_schedule = */10 * * * *
description = ATT&CK tactic threshold exceeded for an object within the previous 7 days.
disabled = true
dispatch.allow_partial_results = true
dispatch.earliest_time = -10090m@m
dispatch.latest_time = -10m@m
dispatch.lookups = true
dispatch.rt_backfill = true
dispatch.spawn_process = true
enableSched = true
is_visible = false
quantity = 0
realtime_schedule = true
relation = greater than
restart_on_searchpeer_add = true
run_on_startup = false
search = | tstats `summariesonly` mode(All_Risk.risk_object) as risk_object, sum(All_Risk.calculated_risk_score) as risk_score, count(All_Risk.calculated_risk_score) as risk_event_count, values(All_Risk.annotations.PSNC) as annotations.PSNC, dc(All_Risk.annotations.PSNC) as PSNC_count, values(All_Risk.tag) as tag, values(source) as source, dc(source) as source_count, values(All_Risk.risk_object) as all_risk_objects, values(All_Risk.cim_entity_zone) as cim_entity_zone from datamodel=Risk.All_Risk where All_Risk.annotations.PSNC=* by All_Risk.normalized_risk_object,All_Risk.risk_object_type | `drop_dm_object_name("All_Risk")` | eval "annotations.PSNC"='annotations.PSNC' | where PSNC_count >= 3 and source_count >= 4
