[default]
[OI_LOG_events]
iseval = 0
disabled = 0
definition = index=main

[OI_SPS_events]
iseval = 0
disabled = 0
definition = index=sps_events sourcetype=oneidentity:sps:siem:syslog

[OI_SPS_latest_severity(1)]
iseval = 0
args = severity_value
definition = `OI_SPS_scored_sessions`| eval latest_severity=mvindex(severity, -1)  | search latest_severity=$severity_value$ | stats count

[OI_SPS_monitored_hosts]
iseval = 0
definition = `OI_SPS_events` event_name=ServerAuthenticationSuccess | lookup dnslookup ip as dest_ip OUTPUTNEW host as dest_host | dedup dest_host | fields dest_host | rename dest_host as host

[OI_SPS_scored_sessions]
iseval = 0
definition = `OI_SPS_events` | where eventtype = "oneidentity_sps_session_scored" | eventstats latest(_time) | transaction session_id mvlist=true

[OI_SPS_sessions]
iseval = 0
definition = `OI_SPS_events` | transaction session_id mvlist=true

[OI_SSH_logins]
iseval = 0
definition = `OI_LOG_events` tag=communicate tag=connect sourcetype=linux_messages_syslog

[OI_WIN_interactive_logins]
iseval = 0
definition = `OI_LOG_events` tag=authentication tag=success Logon_Type=10 sourcetype=WinEventLog OR sourcetype=wineventlog

[OI_gap_details(2)]
iseval = 0
args = protocol, logins_macro_name
definition = `OI_SPS_events` event_name=ServerAuthenticationSuccess app=$protocol$\
| bucket span=1day _time\
| stats count by _time\
| rename count as sps_count\
| rename _time as "Time"\
| appendcols override=true [search `$logins_macro_name$` [search `OI_SPS_monitored_hosts` ] | bucket span=1day _time | stats count by _time | rename count as log_count | rename _time as "Time" ] \
| fillnull value=0 sps_count\
| eval gap=log_count - sps_count\
| convert timeformat="%Y-%m-%d" ctime(Time)\
| table Time sps_count log_count gap\
| rename sps_count as "Audited Events"\
| rename log_count as "Logged Events"\
| rename gap as "Audit Gap"
