[netskope_idx]
definition = eventtype=netskope_idx

[netskope_connection]
definition = eventtype=netskope_connection

[netskope_audit]
definition = eventtype=netskope_audit

[netskope_application]
definition = eventtype=netskope_application

[netskope_alert]
definition = eventtype=netskope_alert

[netskope_infrastructure]
definition = eventtype=netskope_infrastructure

[netskope_error]
definition = eventtype=netskope_error OR eventtype=netskope_error_internal

[netskope_error_internal]
definition = eventtype=netskope_error_internal

[netskope_web]
definition = eventtype=netskope_web

[netskope_api]
definition = eventtype=netskope_api

[netskope_error_panel_base]
definition = `netskope_error` | table *

# NET-87
[netskope_configured_inputs]
definition = tstats count where sourcetype=netskope:* by host | fields host

[netskope_application_detail(8)]
args = selected_activity, selected_host, selected_user, selected_ccl, selected_device, selected_browser, selected_os, selected_method
definition = `netskope_application` activity="$selected_activity$" host="$selected_host$" user="$selected_user$" ccl="$selected_ccl$" device="$selected_device$" browser="$selected_browser$" os="$selected_os$" access_method="$selected_method$" | table _time, user, userip, access_method, activity, os, browser, device, device_classification, ccl, traffic_type, app_session_id, connection_id, app_session_key

[netskope_application_detail_search_by_app_session(1)]
args = key
definition = (`netskope_application` OR `netskope_connection`) app_session_key=$key$ | table _time, app, appcategory, activity, alert, src_ip, src_location, src_region, dest_ip, dst_location, dst_region, url, client_bytes, server_bytes, app_session_id, connection_id

[netskope_connection_detail(6)]
args = selected_host, selected_user, selected_ccl, selected_device, selected_access_method, selected_browser
definition = `netskope_connection` host="$selected_host$" user="$selected_user$" ccl="$selected_ccl$" device="$selected_device$" access_method="$selected_access_method$" browser="$selected_browser$" | table _time, user, userip, src_location, app, appcategory, device, access_method, os, browser, ccl, client_bytes, server_bytes,

[netskope_alert_detail_dlp(8)]
args = selected_host, selected_user, selected_app, selected_policy, selected_alert_type, selected_dlp_rule, selected_dlp_profile, selected_method
definition = `netskope_alert` host="$selected_host$" user="$selected_user$" app="$selected_app$" policy="$selected_policy$" alert_type="$selected_alert_type$" dlp_rule="$selected_dlp_rule$" dlp_profile="$selected_dlp_profile$" method="$selected_method$" | table _time, user, userip, access_method, app, appcategory, traffic_type, activity, alert_type, alert_name, dlp_rule, dlp_profile, dlp_rule_severity, dlp_file, file_size, file_type

[netskope_alert_detail(5)]
args = selected_host, selected_user, selected_app, selected_alert_type, selected_method
definition = `netskope_alert` host="$selected_host$" user="$selected_user$" app="$selected_app$" alert_type="$selected_alert_type$" access_method="$selected_method$" | eval policy_type = policy | eval dlprule = dlp_rule | eval dlpprofile = dlp_profile | eval dlpruleseverity = dlp_rule_severity| eval dlpfile = dlp_file | eval filesize = file_size | eval filetype = file_type | rename user AS User userip AS "User IP" access_method AS "Access Method" app AS App appcategory AS "App Category" traffic_type AS "Traffic Type" activity AS Activity alert_type AS "Alert Type" alert_name AS "Alert Name" dlprule AS "DLP Rule" dlpprofile AS "DLP Profile" dlpruleseverity AS "DLP Severity" dlpfile AS "DLP File" filesize AS "File_Size" filetype AS "File Type" policy_type AS Policy | table _time, User, "User IP", "Access Method", App, "App Category", "Traffic Type", Activity, "Alert Type", "Alert Name", Policy, "DLP Rule", "DLP Profile", "DLP Severity", "DLP File", "File Size", "File Type"

[netskope_last_checkpoint]
definition = `netskope_api` | stats latest(timestamp) by host netskope_event_type | convert timeformat="%m/%d/%Y %H:%M:%S" ctime(latest(timestamp)) AS checkpoint_time | rename checkpoint_time AS "Checkpoint Time" netskope_event_type AS "Event Type" | table host, "Event Type", "Checkpoint Time"

[netskope_last_5_checkpoints_by_event_type(2)]
args = selected_host, selected_event_type
definition = `netskope_api` host="$selected_host$" netskope_event_type="$selected_event_type$" | head 5 | convert timeformat="%m/%d/%Y %H:%M:%S" ctime(timestamp) AS checkpoint_time | rename checkpoint_time AS "Checkpoint Time" netskope_event_type AS "Event Type" total_events AS "Total Events" | table "Checkpoint Time", host, "Event Type", "Total Events"

# NET-27
[netskope_mc_health_check_api]
definition = `netskope_error_panel_base` | eval is_recent = now() - (3600 * 24 * 5), is_recent = if(_time > is_recent,"true", "false")| search is_recent="true"| stats count AS total_failures, latest(message) as message values(is_recent) as ir values(_time) as time by host | eval severity_level = case(total_failures == 0, 0, total_failures > 0, 3)| rename host AS instance | fields instance total_failures message severity_level

[netskope_infrastructure_detail(3)]
args = selected_host, selected_device, selected_severity
definition = `netskope_infrastructure` severity="$selected_severity$" device="$selected_device$" host="$selected_host$" | table _time, host, device, serial, alarm_name, severity, alarm_description

# NET-101
[netskope_error_invalid_token]
definition = eventtype=netskope_invalid_token

[netskope_error_invalid_host]
definition = eventtype=netskope_invalid_host 

[netskope_no_host_connection]
definition = eventtype=netskope_no_host_connection

[netskope_mc_health_check_invalid_token]
definition = `netskope_error_invalid_token` | eval is_recent = now() - (3600 * 24 * 5), is_recent = if(_time > is_recent,"true", "false")| search is_recent="true"| stats count AS total_failures, latest(exception_type) as exception_type latest(additional_info) as message values(is_recent) as ir values(_time) as time by host | eval severity_level = case(total_failures == 0, 0, total_failures > 0, 3)| rename host AS instance | fields instance total_failures exception_type message severity_level

[netskope_mc_health_check_invalid_host]
definition = `netskope_error_invalid_host` OR `netskope_no_host_connection` | eval is_recent = now() - (3600 * 24 * 5), is_recent = if(_time > is_recent,"true", "false")| search is_recent="true"| stats count AS total_failures, latest(exception_type) as exception_type latest(exception) as message values(is_recent) as ir values(_time) as time by host | eval severity_level = case(total_failures == 0, 0, total_failures > 0, 3)| rename host AS instance | fields instance total_failures exception_type message severity_level


