[sp6_cmmc_ad_index]
definition = index=main
iseval = 0

[sp6_cmmc_linux_index]
definition = (index=main OR index=os OR index=osnix)
iseval = 0

[sp6_time_sync]
definition = tag=time tag=synchronize
iseval = 0

[sp6_security_training_data]
definition = index=main sourcetype=kb4:status:report
iseval = 0

[sp6_aws_sg_data]
definition = index=main sourcetype="aws:sg:metadata"
iseval = 0

[sp6_career_training_data]
definition = index=main sourcetype=acg:status:report
iseval = 0

[sp6_cmmc_internal_ip_ranges(1)]
args = field
definition = ($field$="10.*" OR $field$="192.168.*" OR $field$="172.16.*" OR $field$="172.17.*" OR $field$="172.18.*" OR $field$="172.19.*" OR $field$="172.20.*" OR $field$="172.21.*" OR $field$="172.22.*" OR $field$="172.23.*" OR $field$="172.24.*" OR $field$="172.25.*" OR $field$="172.26.*" OR $field$="172.27.*" OR $field$="172.28.*" OR $field$="172.29.*" OR $field$="172.30.*" OR $field$="172.31.*")
iseval = 0

[sp6_internal_ip_ranges(1)]
args = field
definition = ($field$="10.*" OR $field$="192.168.*" OR $field$="172.16.*" OR $field$="172.17.*" OR $field$="172.18.*" OR $field$="172.19.*" OR $field$="172.20.*" OR $field$="172.21.*" OR $field$="172.22.*" OR $field$="172.23.*" OR $field$="172.24.*" OR $field$="172.25.*" OR $field$="172.26.*" OR $field$="172.27.*" OR $field$="172.28.*" OR $field$="172.29.*" OR $field$="172.30.*" OR $field$="172.31.*")
iseval = 0

[sp6_cmmc_backup_index]
definition = index=*
iseval = 0

[sp6_cmmc_firewall_index]
definition = (index=netfw OR index=netproxy OR index=idps)
iseval = 0

[sp6_cmmc_incident_index]
definition = index=* OR index=defender_endpoint
iseval = 0

[sp6_cmmc_physical_access_index]
definition = index=*
iseval = 0

[sp6_dm_summariesonly]
definition = summariesonly=true
iseval = 0

[sp6_cmmc_voip_sources]
definition = search app=*skype* OR app=*teams* OR app=*zoom* OR app=*webex* OR app=*cucm* app=*cisco*
iseval = 0

[sp6_cmmc_ad_events]
definition = `sp6_cmmc_ad_index` sourcetype=activedirectory
iseval = 0

[sp6_removable_storage_data]
definition = index=main source=wineventlog:security EventCode=4663 TaskCategory="Removable Storage"
iseval = 0

[sp6_cmmc_ad_user_group_mapping(1)]
args = user
definition = ldapsearch search="(&(objectClass=user)(!(objectClass=computer)))" | search sAMAccountName = "$user$"  | table sAMAccountName userAccountControl  memberOf  | mvexpand memberOf | rename memberOf as group_dn sAMAccountName as user | join group_dn type=left max=0  [| ldapsearch search="(&(objectClass=group)(!(objectClass=computer)))" | table sAMAccountName description  dn | rename dn as group_dn sAMAccountName as ad_group_name description as ad_group_description] | stats values(ad_group_name) as ad_group_name values(ad_group_description) as ad_group_description by user
iseval = 0

[sp6_remote_access_ports(1)]
args = field
definition = $field$=3389 OR $field$=22 OR $field$=443 OR $field$=8502
iseval = 0

[sp6_cmmc_azure_index]
definition = index=azure
iseval = 0

[sp6_cmmc_aws_index]
definition = index=aws
iseval = 0

[sp6_permitted_functions]
definition = search *
iseval = 0

[sp6_description_data(2)]
args = field_name,field_friendly_name
definition = if(num_of_$field_name$<=9,"$field_friendly_name$: " + mvjoin($field_name$,", "),"$field_friendly_name$: " + mvjoin(mvindex($field_name$,0,8),", ") + ", and others")
iseval = 0

[sp6_wireless_authentication]
definition = index=* sourcetype=* ```Configure this macro with a sourcetype, source, or tag that points Splunk to your authentication logs sourcing from your wireless access controllers.```
iseval = 0

[sp6_audit_tool_data]
definition = index=_* user=* NOT (sourcetype=audittrail action=search)
iseval = 0

[sp6_malware_scans]
definition = makeresults count=30\
| streamstats count \
| eval _time=_time-(count*86400)\
| eval sourcetype="crowdstrike:event:streams:json"
iseval = 0

[sp6_malware_updates]
definition = makeresults\
| eval last_modified=now()-86400\
| convert ctime(last_modified)\
| eval sourcetype="crowdstrike:event:streams:json"
iseval = 0

[sp6_external_connections]
definition = ()
iseval = 0

[sp6_automatable_controls]
definition = ("AC.L1-3.1.1",\
"AC.L1-3.1.2",\
"AC.L1-3.1.20",\
"AC.L2-3.1.10",\
"AC.L2-3.1.11",\
"AC.L2-3.1.12",\
"AC.L2-3.1.13",\
"AC.L2-3.1.14",\
"AC.L2-3.1.15",\
"AC.L2-3.1.16",\
"AC.L2-3.1.17",\
"AC.L2-3.1.18",\
"AC.L2-3.1.6",\
"AC.L2-3.1.4",\
"AC.L2-3.1.5",\
"AC.L2-3.1.7",\
"AC.L2-3.1.8",\
"AT.L2-3.2.3",\
"AU.L2-3.3.1",\
"AU.L2-3.3.2",\
"AU.L2-3.3.4",\
"AU.L2-3.3.7",\
"AU.L2-3.3.8",\
"AU.L2-3.3.9",\
"CM.L2-3.4.7",\
"CM.L2-3.4.8",\
"IA.L1-3.5.1",\
"IA.L2-3.5.3",\
"IA.L2-3.5.6",\
"IR.L2-3.6.2",\
"MA.L2-3.7.1",\
"MA.L2-3.7.5",\
"RA.L2-3.11.2",\
"SC.L1-3.13.1",\
"SC.L1-3.13.5",\
"SC.L2-3.13.7",\
"SC.L2-3.13.9",\
"SC.L2-3.13.13",\
"SC.L2-3.13.14",\
"SI.L1-3.14.2",\
"SI.L1-3.14.4",\
"SI.L1-3.14.5",\
"SI.L2-3.14.6")
iseval = 0



[sp6_cmmc_traffic_data]
definition = index = main sourcetype = opsec:vpn
iseval = 0

[sp6_cmmc_windows_index]
definition = index=main
iseval = 0

[sp6_audit_filter]
definition = host=*

[system_macro(1)]
args = system_macro_name
definition = `$system_macro_name$`
iseval = 0

[default_system_macro]
definition = index=*
iseval = 0

[user_lookup(1)]
args = user_field
definition = lookup update=true identity_lookup_expanded identity as "$user_field$" OUTPUTNEW _key as "$user_field$_identity_id",bunit as "$user_field$_bunit",category as "$user_field$_category",email as "$user_field$_email",endDate as "$user_field$_endDate",first as "$user_field$_first",identity as "$user_field$_identity",identity_tag as "$user_field$_identity_tag",last as "$user_field$_last",managedBy as "$user_field$_managedBy",nick as "$user_field$_nick",phone as "$user_field$_phone",prefix as "$user_field$_prefix",priority as "$user_field$_priority",startDate as "$user_field$_startDate",suffix as "$user_field$_suffix",watchlist as "$user_field$_watchlist",work_city as "$user_field$_work_city",work_country as "$user_field$_work_country",work_lat as "$user_field$_work_lat",work_long as "$user_field$_work_long" \
| eval "tag"=mvdedup(mvappend('tag',NULL,'$user_field$_identity_tag')),"$user_field$_startDate"=case(isnum('$user_field$_startDate'),'$user_field$_startDate',isnum(strptime('$user_field$_startDate',"%m/%d/%Y %H:%M")),strptime('$user_field$_startDate',"%m/%d/%Y %H:%M"),isnum(strptime('$user_field$_startDate',"%m/%d/%y %H:%M")),strptime('$user_field$_startDate',"%m/%d/%y %H:%M"),1=1,'$user_field$_startDate'),"$user_field$_endDate"=case(isnum('$user_field$_endDate'),'$user_field$_endDate',isnum(strptime('$user_field$_endDate',"%m/%d/%Y %H:%M")),strptime('$user_field$_endDate',"%m/%d/%Y %H:%M"),isnum(strptime('$user_field$_endDate',"%m/%d/%y %H:%M")),strptime('$user_field$_endDate',"%m/%d/%y %H:%M"),1=1,'$user_field$_endDate')
iseval = 0

[asset_lookup(1)]
args = asset_field
definition = lookup update=true asset_lookup_by_str asset as "$asset_field$" OUTPUTNEW _key as "$asset_field$_asset_id",asset as "$asset_field$_asset",asset_tag as "$asset_field$_asset_tag",bunit as "$asset_field$_bunit",category as "$asset_field$_category",city as "$asset_field$_city",country as "$asset_field$_country",dns as "$asset_field$_dns",ip as "$asset_field$_ip",is_expected as "$asset_field$_is_expected",lat as "$asset_field$_lat",long as "$asset_field$_long",mac as "$asset_field$_mac",nt_host as "$asset_field$_nt_host",owner as "$asset_field$_owner",pci_domain as "$asset_field$_pci_domain",priority as "$asset_field$_priority",requires_av as "$asset_field$_requires_av",should_timesync as "$asset_field$_should_timesync",should_update as "$asset_field$_should_update" | lookup update=true asset_lookup_by_cidr asset as "$asset_field$" OUTPUTNEW _key as "$asset_field$_asset_id",asset as "$asset_field$_asset",asset_tag as "$asset_field$_asset_tag",bunit as "$asset_field$_bunit",category as "$asset_field$_category",city as "$asset_field$_city",country as "$asset_field$_country",dns as "$asset_field$_dns",ip as "$asset_field$_ip",is_expected as "$asset_field$_is_expected",lat as "$asset_field$_lat",long as "$asset_field$_long",mac as "$asset_field$_mac",nt_host as "$asset_field$_nt_host",owner as "$asset_field$_owner",pci_domain as "$asset_field$_pci_domain",priority as "$asset_field$_priority",requires_av as "$asset_field$_requires_av",should_timesync as "$asset_field$_should_timesync",should_update as "$asset_field$_should_update" | eval "$asset_field$_ip"=case(match('$asset_field$_ip', "^\d{1,3}\.\d{1,3}\.\d{1,3}\.\d{1,3}$"),'$asset_field$_ip',match('$asset_field$', "^\d{1,3}\.\d{1,3}\.\d{1,3}\.\d{1,3}$"),"$asset_field$",1=1,null()),"tag"=mvdedup(mvappend('tag',NULL,'$asset_field$_asset_tag'))
iseval = 0

[sp6_group_management_events]
definition = index=* tag=account tag=change signature=*group*
iseval = 0

[sp6_lockout_configuration_events]
definition = ldapsearch domain=default search="(objectClass=Domain)" attrs="name,lockoutThreshold,whenCreated,whenChanged" \
| eval cui_system_splunk_id="default_system"\
| table name lockoutThreshold, whenCreated, whenChanged, cui_system_splunk_id
iseval = 0

[sp6_group_policy_configuration]
definition = ldapsearch search="(&(objectclass=groupPolicyContainer))"
iseval = 0

[sp6_wineventlog_index]
definition = index=wineventlog
iseval = 0

[filter_system_tags]
definition = eval cui_system_splunk_id=mvfilter([| inputlookup sp6_control_status | stats count by cui_system_splunk_id | rename cui_system_splunk_id AS tag | table tag | format])
iseval = 0

[sp6_log_retention_period]
definition = 180
iseval = 0

[sp6_user_inactivity_period]
definition = 90
iseval = 0

[sp6_user_duration_maximum]
definition = 24
iseval = 0

[sp6_vulnerability_scanning_period]
definition = 30
iseval = 0

[sp6_system_flaws_id_period]
definition = 30
iseval = 0

[sp6_system_flaw_correction_period_critical]
definition = 7
iseval = 0

[sp6_system_flaw_correction_period_high]
definition = 15
iseval = 0

[sp6_system_flaw_correction_period_medium]
definition = 90
iseval = 0

[sp6_system_flaw_correction_period_low]
definition = 180
iseval = 0

[append_mv_lookup(1)]
args = lookup
definition = append [ | inputlookup $lookup$ | foreach * [ | rex mode=sed field=<<FIELD>> "s/\n/|/g" | makemv delim="|" <<FIELD>> ] ]
iseval = 0

[cui_system_domain]
definition = default
iseval = 0

[sp6_group_map_events]
definition = index=saas sourcetype=azure:aad:group
iseval = 0

[sp6_invalid_login_attempts]
definition = 3
iseval = 0

[sp6_invalid_login_attempts_time_threshold]
definition = 30
iseval = 0

[index_system_filter(1)]
args = cui_system_splunk_id
definition = eval cui_system_splunk_id="$cui_system_splunk_id$"\
| lookup ascera_index_system_map index AS idxName cui_system_splunk_id OUTPUT index\
| search NOT idxName=_* NOT idxName=cim_modactions NOT idxName=history NOT idxName=splunklogger NOT idxName=summary\
| where isnotnull(index)\
| fields - index
iseval = 0

[ascera_identity_exclusions]
definition = search user=*
iseval = 0
