[default]
display.visualizations.custom.cisco-sdwan-app.sankey_diagram.showLabels = true
display.visualizations.custom.cisco-sdwan-app.sankey_diagram.showLegend = true
display.visualizations.custom.cisco-sdwan-app.sankey_diagram.showTooltip = true
display.visualizations.custom.cisco-sdwan-app.sankey_diagram.useColors = true
display.visualizations.custom.cisco-sdwan-app.sankey_diagram.colorMode = categorical
display.visualizations.custom.cisco-sdwan-app.sankey_diagram.minColor = #d93f3c
display.visualizations.custom.cisco-sdwan-app.sankey_diagram.maxColor = #3fc77a
display.visualizations.custom.cisco-sdwan-app.sankey_diagram.numOfBins = 6
display.visualizations.custom.cisco-sdwan-app.sankey_diagram.showSelf = false
display.visualizations.custom.cisco-sdwan-app.sankey_diagram.showBackwards = false
display.visualizations.custom.cisco-sdwan-app.sankey_diagram.styleBackwards = false


[cisco_sdwan_netflow]
cron_schedule = 0 */24 * * *
description = To populate the lookup table with app and app_tag mapping
dispatch.earliest_time = -3d@d
dispatch.latest_time = now
display.page.search.mode = fast
enableSched = 1
run_on_startup = 1
search = | tstats `summariesonly` count from datamodel=Cisco_SDWAN_Netflow by Cisco_SDWAN_Netflow.app, Cisco_SDWAN_Netflow.app_tag \
| rename Cisco_SDWAN_Netflow.app as app, Cisco_SDWAN_Netflow.app_tag as "app_tag" \
| fillnull value="unclassified" app \
| eval key=app_tag \
| outputlookup cisco_sdwan_app_mapping key_field=key append=true


[cisco_sdwan_policy]
cron_schedule = 0 */24 * * *
description = Savedsearch to populate the lookup cisco_sdwan_policy_mapping
dispatch.earliest_time = -3d@d
dispatch.latest_time = now
display.page.search.mode = fast
enableSched = 1
run_on_startup = 1
search = | tstats `summariesonly` count as "Count" from datamodel=Cisco_SDWAN_Netflow \
    where Cisco_SDWAN_Netflow.FW_Policy != "00000000" by Cisco_SDWAN_Netflow.FW_Policy, Cisco_SDWAN_Netflow.FW_Policy_Rule \
| rename Cisco_SDWAN_Netflow.FW_Policy as "policy" , Cisco_SDWAN_Netflow.FW_Policy_Rule as "policy_rule"\
| append \
    [| tstats `summariesonly` count as "Count" from datamodel=Cisco_SDWAN_Netflow \
        by Cisco_SDWAN_Netflow.cisco_hsl_fw_class_id, Cisco_SDWAN_Netflow.cisco_hsl_fw_class_name \
    | rename Cisco_SDWAN_Netflow.cisco_hsl_fw_class_id as "policy" , Cisco_SDWAN_Netflow.cisco_hsl_fw_class_name as "policy_rule"] \
| eval key=policy\
| outputlookup cisco_sdwan_policy_mapping key_field=key append=true

[cisco_sdwan_action]
cron_schedule = 0 */24 * * *
description = Savedsearch to populate the lookup cisco_sdwan_action_mapping
dispatch.earliest_time = -3d@d
dispatch.latest_time = now
display.page.search.mode = fast
enableSched = 1
run_on_startup = 1
search = | tstats `summariesonly` count as "Count" from datamodel=Cisco_SDWAN_Netflow \
    by Cisco_SDWAN_Netflow.FW_Action, Cisco_SDWAN_Netflow.FW_Action_Rule \
| rename Cisco_SDWAN_Netflow.FW_Action as "action" , Cisco_SDWAN_Netflow.FW_Action_Rule as "action_rule"\
| eval key=action\
| outputlookup cisco_sdwan_action_mapping key_field=key append=true

[cisco_sdwan_username]
cron_schedule = 0 */24 * * *
description = To populate the lookup table with src_ip and FW_Username mapping
dispatch.earliest_time = -3d@d
dispatch.latest_time = now
display.page.search.mode = fast
enableSched = 1
run_on_startup = 1
search = | tstats latest(Cisco_SDWAN_Netflow.FW_Username) as "username" from datamodel=Cisco_SDWAN_Netflow \
    by Cisco_SDWAN_Netflow.src_ip | where username!="" \
| rename Cisco_SDWAN_Netflow.src_ip as "source_ip" \
| eval key=source_ip \
| outputlookup cisco_sdwan_username_mapping key_field=key append=true
