[Index nearly full]
disabled = 1
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = 0 0 * * *
description = Index reaches more than 90% of its configured maximum size.
dispatch.earliest_time = -7d
dispatch.latest_time = @d
display.general.type = statistics
display.page.search.mode = fast
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = IndexUsage
request.ui_dispatch_view = search
search = | tstats summariesonly=true sum("License_Usage.gb") as "consumed7daysGB" from datamodel="Meta_Woot_License_Usage" groupby "License_Usage.idx"\
| rename "License_Usage.idx" as index\
| eval consumedDailyGB=consumed7daysGB/7\
| fields index consumedDailyGB\
| join index[| rest /services/data/indexes\
| fields title maxDataSize maxTotalDataSizeMB frozenTimePeriodInSecs\
| eval frozenTimePeriodDays=frozenTimePeriodInSecs/86400\
| eval configuredIndexSizeGB=maxTotalDataSizeMB/1024\
| rename title as index maxDataSize as bucketSizeMB\
| replace auto with 750 in bucketSizeMB\
| replace auto_high_volume with 10000 in bucketSizeMB\
| eval bucketSizeGB=bucketSizeMB/1000]\
| eval numberOfIndexers=[| rest /servicesNS/-/-/search/distributed/peers | stats dc(title) as numberOfIndexers | return $numberOfIndexers]\
| eval consumedDailyPerIndexerGB=consumedDailyGB/numberOfIndexers\
| eval consumedDailyGB=round(consumedDailyGB,2)\
| eval expectedIndexSizeGB=consumedDailyPerIndexerGB*0.5*frozenTimePeriodDays\
| eval expectedVsConfiguredRatio=round((expectedIndexSizeGB/configuredIndexSizeGB)*100,1)\
| fields index consumedDailyGB consumedDailyPerIndexerGB bucketSizeGB configuredIndexSizeGB expectedIndexSizeGB expectedVsConfiguredRatio numberOfIndexers frozenTimePeriodDays\
| join index [| rest /services/data/indexes | stats sum(currentDBSizeMB) as currentDBSizeMB by title | eval currentIndexSizeGB=currentDBSizeMB/1024 | rename title as index | fields - currentDBSizeMB]\
| eval currentIndexSizePerIndexerGB=currentIndexSizeGB/numberOfIndexers\
| eval indexFillRatio=round((currentIndexSizePerIndexerGB/configuredIndexSizeGB)*100,1)\
| eval indexUsage=round(currentIndexSizePerIndexerGB,2)." / ".round(configuredIndexSizeGB,2)." GB"\
| eval finalUsage=round(expectedIndexSizeGB,2)." / ".round(configuredIndexSizeGB,2)." GB"\
| eval frozenTimePeriodDays=round(frozenTimePeriodDays,0)\
| eval consumedDailyPerIndexerGB=round(consumedDailyPerIndexerGB,2)\
| table index consumedDailyGB frozenTimePeriodDays consumedDailyPerIndexerGB bucketSizeGB indexUsage indexFillRatio finalUsage expectedVsConfiguredRatio\
| rename consumedDailyGB as "daily avg indexed vol." consumedDailyPerIndexerGB as "daily avg indexed vol. / indexer" bucketSizeGB as "bucket size" expectedVsConfiguredRatio as "expected final fill ratio" indexFillRatio as "fill ratio" indexUsage as "current index size / configured max size" finalUsage as "expected final index size / configured max size" frozenTimePeriodDays as retention\
| sort - "fill ratio"\
| where 'fill ratio'>90