[vmware_inframon:inv:datastore]
KV_MODE = json

[vmware_inframon:inv:hostsystem]
KV_MODE = json

[vmware_inframon:inv:vm]
KV_MODE = json

[vmware_inframon:inv:clustercomputeresource]
KV_MODE = json

[vmware_inframon:inv:hierarchy]
KV_MODE = json

[vmware_inframon:events]
LOOKUP-vmware_event = vmware_event_lookup source AS eventClass OUTPUT belong, eventClassification
FIELDALIAS-authmanag = Message AS signature, vc AS src, vc AS dest, vc AS dest_nt_domain, vc AS src_nt_domain, userName AS src_user, principal AS user

[vmware_inframon:tasks]
LOOKUP-vmware_task = vmware_task_lookup entitytype OUTPUT group