[Message size by relay]
action.email.sendresults = 0
dispatch.ttl = 3600
relation = None
request.ui_dispatch_view = search
search = index=sample from | timechart avg(size) by relay
alert.track = 0
display.general.type = statistics
display.page.search.tab = statistics

[Mail delivery time]
action.email.sendresults = 0
dispatch.ttl = 3600
relation = None
request.ui_dispatch_view = search
search = index=sample | transaction fields=qid | timechart avg(duration)
alert.track = 0
display.general.type = statistics
display.page.search.tab = statistics

[Top recipients by mailer]
action.email.sendresults = 0
dispatch.ttl = 3600
relation = None
search = index=sample | timechart count(to) by mailer
alert.track = 0
display.general.type = statistics
display.page.search.tab = statistics
request.ui_dispatch_view = search

[Top recipients]
action.email.sendresults = 0
dispatch.ttl = 3600
relation = None
search = index=sample | top to
alert.track = 0
display.general.type = statistics
display.page.search.tab = statistics
request.ui_dispatch_view = search

[Sendmail transactions]
action.email.sendresults = 0
dispatch.ttl = 3600
relation = None
request.ui_dispatch_view = search
search = index=sample | transaction msgid pid maxpause=48h | search linecount > 1

[Number of "from" messages]
action.email.sendresults = 0
dispatch.ttl = 3600
relation = None
request.ui_dispatch_view = search
search = index=sample |stats count(from)
alert.track = 0
display.general.type = statistics
display.page.search.tab = statistics

[Number of "to" messages]
action.email.sendresults = 0
dispatch.ttl = 3600
displayview = search
relation = None
request.ui_dispatch_view = search
search = index=sample |stats count(to)
alert.track = 0
display.general.type = statistics
display.page.search.tab = statistics

[Top recipients - pie chart]
action.email.sendresults = 0
dispatch.ttl = 3600
displayview = search
relation = None
request.ui_dispatch_view = search
search = index=sample | top to limit=10
alert.track = 0
display.general.type = statistics
display.page.search.tab = statistics

[Top recipients by mailer - area chart]
action.email.sendresults = 0
dispatch.ttl = 3600
displayview = search
relation = None
request.ui_dispatch_view = search
search = index=sample | timechart count(to) by mailer
alert.track = 0
display.general.type = statistics
display.page.search.tab = statistics

[Number of reject events by relay]
action.email.sendresults = 0
dispatch.ttl = 3600
displayview = search
relation = None
request.ui_dispatch_view = search
search = index=sample reject |stats count by relay
alert.track = 0
display.general.type = statistics
display.page.search.tab = statistics

[Histogram of delay in seconds]
action.email.sendresults = 0
dispatch.ttl = 3600
displayview = search
relation = None
request.ui_dispatch_view = search
search = index=sample | fields + delay, count | convert dur2sec(delay) | sort - delay | top delay limit=10
alert.track = 0
display.general.type = statistics
display.page.search.tab = statistics

[esp_alarms]
action.lookup = 1
action.lookup.append = 1
action.lookup.filename = esp_alarms.csv
action.webhook.enable_allowlist = 0
alert.digest_mode = 0
alert.suppress = 0
alert.track = 0
counttype = number of events
cron_schedule = */5 * * * *
dispatch.earliest_time = -5m
dispatch.latest_time = now
enableSched = 1
quantity = 0
relation = greater than
search = `oil_gas_base_search`\
| eval metrics_raw = `extract_alert_esp_metrics_raw`\
| mvexpand metrics_raw\
| rex field=metrics_raw "(?<metric>[^=]+)=(?<value>.*)"\
| eval value = tonumber(value)\
| lookup esp_thresholds.csv esp_metric as metric OUTPUT min, max\
| eval alert_reason = `form_alert_reason(value, min, max)`\
| where isnotnull(alert_reason)\
| table _time, WELL_BORE_CODE, metric, value, min, max, alert_reason

[well_alarms]
action.lookup = 1
action.lookup.append = 1
action.lookup.filename = well_alarms.csv
action.webhook.enable_allowlist = 0
alert.digest_mode = 0
alert.suppress = 0
alert.track = 0
counttype = number of events
cron_schedule = */5 * * * *
dispatch.earliest_time = -5m
dispatch.latest_time = now
enableSched = 1
quantity = 0
relation = greater than
search = `oil_gas_base_search`\
| eval metrics_raw = `extract_alert_well_metrics_raw`\
| mvexpand metrics_raw\
| rex field=metrics_raw "(?<metric>[^=]+)=(?<value>.*)"\
| eval value = tonumber(value)\
| lookup well_thresholds.csv well_metric as metric OUTPUT min, max\
| eval alert_reason = `form_alert_reason(value, min, max)`\
| where isnotnull(alert_reason)\
| table _time, WELL_BORE_CODE, metric, value, min, max, alert_reason

[OILGAS AI analysis current vs motor T by well]
action.email.useNSSubject = 1
action.webhook.enable_allowlist = 0
alert.track = 0
dispatch.earliest_time = 0
display.general.type = statistics
display.page.search.mode = fast
display.page.search.tab = statistics
display.visualizations.show = 0
request.ui_dispatch_app = oilgas_splunk_app
request.ui_dispatch_view = search
search = | tstats sum(Main_Data.AVG_DOWNHOLE_PRESSURE) as "Current (Amps)", \
         sum(Main_Data.AVG_DOWNHOLE_TEMPERATURE) as "Motor Temperature (°F)" \
  FROM datamodel=OilGas.Main_Data\
  BY _time Main_Data.WELL_BORE_CODE\
| timechart\
            sum("Current (Amps)") as "Current (Amps)",\
            sum("Motor Temperature (°F)") as "Motor Temperature (°F)" by Main_Data.WELL_BORE_CODE
