[source::...ta-radiflow-addon-for-splunk*.log*]
sourcetype = taradiflowaddonforsplunk:log
TRUNCATE = 350000

[source::...ta_radiflow_addon_for_splunk*.log*]
sourcetype = taradiflowaddonforsplunk:log
TRUNCATE = 350000

[Radiflow:SoftwareAssets]
KV_MODE = json
SHOULD_LINEMERGE = 0
category = Splunk App Add-on Builder
pulldown_type = 1
TRUNCATE = 350000
DATETIME_CONFIG = CURRENT
EXTRACT-operating_system = "Windows Version":\s*"(?<operating_system>[\\[(A-Z_a-z\d);:."'\/\]{\s-]*)"
EVAL-asset_name = if(isnotnull(operating_system), operating_system, "")
EVAL-site_id = site_id
EVAL-asset_id = (site_id+":"+asset_id)
EVAL-asset_criticality = "Unknown"
EVAL-asset_status = "Unknown"
EXTRACT-asset_type_1 = "type":\s*"(?<asset_type_1>\w+\d*\s*\w*)"
EVAL-asset_type = case(asset_type_1=="Engineering Station","Engineering Workstation",asset_type_1=="Camera","ip_camera",asset_type_1=="IOT","iot_device",asset_type_1=="Historian","historian",asset_type_1=="L2 Device","switch",asset_type_1=="Multicast","Broadcast",asset_type_1=="IED","ied",asset_type_1=="OPC Server","Server",asset_type_1=="Printer","iot_device",1==1,asset_type_1)
EXTRACT-asset_vendor = \"vendor\":\s*"(?<asset_vendor>[\\[(A-Z_a-z,\d);:."'\/\]{\s-]*)",\s*"unitid"
EXTRACT-ip = \"ip\":\s*"(?<ip>\d+.\d+.\d+.\d+)"
EXTRACT-mac = "mac":\s*"(?<mac>\d*\w*:\d*\w*:\d*\w*:\d*\w*:\d*\w*:\d*\w*)"
# EVAL-category = "ot" + if(isnotnull(operating_system), "|" + "operatingSystem", "")
EVAL-asset_system = if(isnull(osDetails) OR osDetails="","Unknown",osDetails)
EVAL-serial = if(sourcetype="Radiflow:SoftwareAssets","",serial)
EVAL-bunit = "organization"
EVAL-software_version = "Unknown"
EVAL-country = if(isnull(country),"Unknown",country)
EXTRACT-zone = "zone":\s*(?<zone>\d+)
EVAL-zone = if(isnull(zone),"Unknown",zone)
EVAL-type = if(isnull(type) OR type="","asset",type)
EVAL-dns = asset_id
EVAL-priority = case(asset_criticality == "Low","low",asset_criticality == "Medium","medium",asset_criticality == "High","high", asset_criticality == "Critical","critical",asset_criticality == "","unknown")
EXTRACT-model_name = "Model Name":\s*"(?<model_name>[\\[(A-Z_a-z\d);:."'\/\]{\s-]*)"
EXTRACT-product_name = "Product Name":\s*"(?<product_name>[\\[(A-Z_a-z\d);:."'\/\]{\s-]*)"
EXTRACT-plc_family = "PLC Family":\s*"(?<plc_family>[\\[(A-Z_a-z\d);:."'\/\]{\s-]*)"
EXTRACT-plc_type = "PLC Type":\s*"(?<plc_type>[\\[(A-Z_a-z\d);:."'\/\]{\s-]*)"
EXTRACT-module = "Module":\s*"(?<module>[\\[(A-Z_a-z\d);:."'\/\]{\s-]*)"
EXTRACT-ied_name = "IED Name"::\s*"(?<ied_name>[\\[(A-Z_a-z\d);:."'\/\]{\s-]*)"
EVAL-asset_model = case(model_name != "",model_name,product_name != "", product_name,plc_type != "", plc_type,module!="",module,ied_name!="",ied_name,plc_family != "" AND asset_vendor == "Schneider Electric", plc_family,1==1,"Unknown")
# EXTRACT-firmware_version ="Firmware Version":\s*"(?<firmware_version>[\\[(A-Z_a-z\d);:."'\/\]{\s-]*)"
# EXTRACT-firmware_revision ="Firmware Revision":\s*"(?<firmware_revision>[\\[(A-Z_a-z\d);:."'\/\]{\s-]*)"
# EXTRACT-firmware_number ="Firmware Number"":\s*"(?<firmware_number>[\\[(A-Z_a-z\d);:."'\/\]{\s-]*)"
# EXTRACT-firmware ="Firmware":\s*"(?<firmware>[\\[(A-Z_a-z\d);:."'\/\]{\s-]*)"
EVAL-asset_version = case(firmware_version!="",firmware_version,firmware_revision!="",firmware_revision,firmware_number!="",firmware_number,firmware!="",firmware)
EXTRACT-product_details = "Serial Number":\s*"(?<product_details>[\\[(A-Z_a-z\d);:."'\/\]{\s-]*)"
EXTRACT-vendor = \"vendor\":\s*"(?<vendor>[\\[(A-Z_a-z,\d);:."'\/\]{\s-]*)",\s*"unitid"
EVAL-version = "Unknown"
#EXTRACT-Operating_System_1 = "Windows Version":\s*"[\\[(A-Z_a-z\d);:."'\/\]{\s-]*;(?<Operating_System_1>[\\[(A-Z_a-z\d);:."'\/\]{\s-]*)"
#EXTRACT-Operating_System_2 = "Windows Version":\s"(<Operating_System_2>\w*\s\d*)"
EXTRACT-asset_name_1 = "device1_display_name":\s*"(?<asset_name_1>.*?)"
EXTRACT-asset_name_2 = "device2_display_name":\s*"(?<asset_name_2>.*?)"
EVAL-nt_host = if(isnotnull(asset_name_1),asset_name_1,asset_name_2)
# EVAL-asset_name = if(isnotnull(asset_name_1),asset_name_1,asset_name_2)
EVAL-host_category = "ot"
EVAL-category = if(isnotnull(operating_system), "OperatingSystem", "ot")
# EVAL-category = "ot" + if(isnotnull(operating_system), "|" + "OperatingSystem", "")

[Radiflow:Assets]
KV_MODE = json
SHOULD_LINEMERGE = 0
category = Splunk App Add-on Builder
pulldown_type = 1
TRUNCATE = 350000
DATETIME_CONFIG = CURRENT
EXTRACT-asset_id = "id":\s*(?<asset_id>\d+)
EXTRACT-asset_criticality = "risk":\s*(?<asset_criticality>\d*),
EXTRACT-asset_status = "active":\s(?<asset_status>\d*),\s"protocol"
EXTRACT-asset_type_1 = "type":\s*"(?<asset_type_1>\w+\d*\s*\w*)"
EVAL-asset_type = case(asset_type_1=="Engineering Station","Engineering Workstation",asset_type_1=="Camera","ip_camera",asset_type_1=="IOT","iot_device",asset_type_1=="Historian","historian",asset_type_1=="L2 Device","switch",asset_type_1=="Multicast","Broadcast",asset_type_1=="IED","ied",asset_type_1=="OPC Server","Server",asset_type_1=="Printer","iot_device",1==1,asset_type_1)
EXTRACT-asset_vendor = \"vendor\":\s*"(?<asset_vendor>[\\[(A-Z_a-z,\d);:."'\/\]{\s-]*)",\s*"unitid"
EXTRACT-ip = \"ip\":\s*"(?<ip>\d+.\d+.\d+.\d+)"
EXTRACT-mac = "mac":\s*"(?<mac>\d*\w*:\d*\w*:\d*\w*:\d*\w*:\d*\w*:\d*\w*)"
# EVAL-category = "ot" + if(isnotnull(operating_system), "|" + "operatingSystem", "")
EVAL-asset_system = if(isnull(osDetails) OR osDetails="","Unknown",osDetails)
EVAL-serial = if(sourcetype="Radiflow:Assets","",serial)
EVAL-bunit = "organization"
EVAL-site_id = site_id
EVAL-asset_id = (site_id+":"+asset_id)
EVAL-software_version = "Unknown"
EVAL-country = if(isnull(country),"Unknown",country)
EXTRACT-zone = "zone":\s*(?<zone>\d+)
EVAL-zone = if(isnull(zone),"Unknown",zone)
EVAL-type = if(isnull(type) OR type="","asset",type)
EVAL-dns = asset_id
EVAL-priority = case(asset_criticality == "Low","low",asset_criticality == "Medium","medium",asset_criticality == "High","high", asset_criticality == "Critical","critical",asset_criticality == "","unknown")
EXTRACT-model_name = "Model Name":\s*"(?<model_name>[\\[(A-Z_a-z\d);:."'\/\]{\s-]*)"
EXTRACT-product_name = "Product Name":\s*"(?<product_name>[\\[(A-Z_a-z\d);:."'\/\]{\s-]*)"
EXTRACT-plc_family = "PLC Family":\s*"(?<plc_family>[\\[(A-Z_a-z\d);:."'\/\]{\s-]*)"
EXTRACT-plc_type = "PLC Type":\s*"(?<plc_type>[\\[(A-Z_a-z\d);:."'\/\]{\s-]*)"
EXTRACT-module = "Module":\s*"(?<module>[\\[(A-Z_a-z\d);:."'\/\]{\s-]*)"
EXTRACT-ied_name = "IED Name"::\s*"(?<ied_name>[\\[(A-Z_a-z\d);:."'\/\]{\s-]*)"
EVAL-asset_model = case(model_name != "",model_name,product_name != "", product_name,plc_type != "", plc_type,module!="",module,ied_name!="",ied_name,plc_family != "" AND asset_vendor == "Schneider Electric", plc_family,1==1,"Unknown")
EXTRACT-firmware_version = "Firmware Version":\s*"(?<firmware_version>[\\[(A-Z_a-z\d);:."'\/\]{\s-]*)"
EXTRACT-firmware_revision = "Firmware Revision":\s*"(?<firmware_revision>[\\[(A-Z_a-z\d);:."'\/\]{\s-]*)"
EXTRACT-firmware_number = "Firmware Number"":\s*"(?<firmware_number>[\\[(A-Z_a-z\d);:."'\/\]{\s-]*)"
EXTRACT-firmware = "Firmware":\s*"(?<firmware>[\\[(A-Z_a-z\d);:."'\/\]{\s-]*)"
EVAL-asset_version = case(firmware_version!="",firmware_version,firmware_revision!="",firmware_revision,firmware_number!="",firmware_number,firmware!="",firmware)
EXTRACT-product_details = "Serial Number":\s*"(?<product_details>[\\[(A-Z_a-z\d);:."'\/\]{\s-]*)"
EXTRACT-vendor = \"vendor\":\s*"(?<vendor>[\\[(A-Z_a-z,\d);:."'\/\]{\s-]*)",\s*"unitid"
EVAL-version = "Unknown"
#EXTRACT-Operating_System_1 = "Windows Version":\s*"[\\[(A-Z_a-z\d);:."'\/\]{\s-]*;(?<Operating_System_1>[\\[(A-Z_a-z\d);:."'\/\]{\s-]*)"
#EXTRACT-Operating_System_2 = "Windows Version":\s"(<Operating_System_2>\w*\s\d*)"
EXTRACT-asset_name_1 = "device1_display_name":\s*"(?<asset_name_1>.*?)"
EXTRACT-asset_name_2 = "device2_display_name":\s*"(?<asset_name_2>.*?)"
EVAL-nt_host = if(isnotnull(asset_name_1),asset_name_1,asset_name_2)
EVAL-asset_name = if(isnotnull(asset_name_1),asset_name_1,asset_name_2)
EXTRACT-operating_system = "Windows Version":\s*"(?<operating_system>[\\[(A-Z_a-z\d);:."'\/\]{\s-]*)"
EVAL-host_category = "ot"
EVAL-category = if(isnotnull(operating_system), "OperatingSystem", "ot")
# EVAL-category = "ot" + if(isnotnull(operating_system), "|" + "OperatingSystem", "")

[Radiflow:Alerts]
KV_MODE = json
SHOULD_LINEMERGE = 0
category = Splunk App Add-on Builder
pulldown_type = 1
DATETIME_CONFIG = CURRENT
EXTRACT-title = "msg":\s*"(?<title>[^"]+)"
EXTRACT-description = "msg":\s*"(?<description>[^"]+)"
EXTRACT-dest = "dst_device_display_name":\s*"(?<dest>\d+.\d+.\d+.\d+)"
EVAL-dest = if(isnull(dest) OR dest="","Unknown",dest)
EXTRACT-dest_type = "packagename":\s*"(?<dest_type>[A-Za-z\d,;'\s]*)"
EXTRACT-dest_category = "enginename":\s*"(?<dest_category>\w*\s\w*)"
EXTRACT-id = "\$id":\s(?<id>\d*)
EXTRACT-severity = "severity":\s*"(?<severity>\w*)"
EXTRACT-event_id = "eventid":\s*(?<event_id>\d*)
EXTRACT-src = "src_device_display_name":\s*"(?<src>\d*.\d*.\d*.\d*)"
EXTRACT-src_type = "packagename":\s*"(?<src_type>\w*\s\w*)"
EVAL-src_category = if(isnull(src_category) OR src_category="","ot",src_category)
EVAL-src_bunit = "organization"
EVAL-src_site_id = site_id
LOOKUP-asset_type = ot_asset_lookup ip AS src_ip OUTPUT asset_type
LOOKUP-src_asset_id = ot_asset_lookup ip AS src_ip OUTPUT asset_id AS src_asset_id
LOOKUP-src_asset_type = ot_asset_lookup ip AS src_ip OUTPUT asset_type AS src_asset_type
LOOKUP-src_asset_system = ot_asset_lookup ip AS src_ip OUTPUT asset_system AS src_asset_system
EVAL-src_asset_system = src_asset_system
EVAL-asset_type = asset_type
EVAL-src_asset_type = src_asset_type
EVAL-dest_bunit = "Unknown"
EVAL-dest_priority = "Unknown"
EVAL-mitre_technique_id = "Unknown"
EVAL-type = "packagename":\s*"(?<src_type>\w*\s\w*)"
EVAL-dest_ip = dest

[Radiflow:Syslog]
DATETIME_CONFIG = CURRENT
LINE_BREAKER = ([\r\n]+)
NO_BINARY_CHECK = true
category = Splunk App Add-on Builder
pulldown_type = 1
EXTRACT-action = action=(?<action>[(A-Z_a-z\d),;:.'\s]*)
EXTRACT-status = status=(?<status>\w*)
EXTRACT-username = username=(?<username>\w*)
EXTRACT-role = role=(?<role>\w*)
EVAL-format = "CEF|LEEF"
# EXTRACT-server_ip = \bip-\d{1,3}-\d{1,3}-\d{1,3}-\d{1,3}\b
EXTRACT-server_ip = ip-(?<ip>\d{1,3}-\d{1,3}-\d{1,3}-\d{1,3})
EVAL-site_id = "radiflow|isid:"+ip
EVAL-src_site_id = "radiflow|isid:"+ip
# EXTRACT-description,serverity,id = <\d*>\d*\s*\d{4}-\d{2}-\d{2}T\d{2}:\d{2}:\d{2}.\d{1,6}\+\d{2}:\d{2}\s*[(A-Z_a-z\d)\-,;:.']*\s[(A-Z_a-z\d)\-,;:.']*\s-\w*\s*-\w*\s*-\s*(\w*):\d*\|\w*\|(\w*)\|\d*.\d*.\d*.\d*\|\d*\|(?<description>[(A-Z_a-z\d)\/,;:.'\s=-]*)\|(?<serverity>\w*)\|cat='(?<type>\w*)'\s*id=(?<id>\d*)
EXTRACT-description,serverity,id = <\d+>\d+\s+\d{4}-\d{2}-\d{2}T\d{2}:\d{2}:\d{2}.\d{1,6}\+\d{2}:\d{2}\s+\S+\s+\S+\s+-\s+-\s+-\s+CEF:\d+\|[\w.-]+\|[\w.-]+\|\d+(?:\.\d+){3}\|\d+\|(?<description>[^|]+)\|(?<severity>\w+)\|cat='(?<type>[^']+)'\sid=(?<id>\d+)
EVAL-title = if(action=='' OR isnull(action),description,action)
EXTRACT-src_ip = SrcName=(?<src_ip>\d{1,3}.\d{1,3}.\d{1,3}.\d{1,3})
EXTRACT-dest = DstName=(?<dest>\d{1,3}.\d{1,3}.\d{1,3}.\d{1,3})
EXTRACT-dest_type = DstType=(?<dest_type>\w*)
EXTRACT-dest_category = cat='(?<dest_category>\w*)'
EXTRACT-event_id = id=(?<event_id>\d*)
EXTRACT-src = SrcName=(?<src>\d{1,3}.\d{1,3}.\d{1,3}.\d{1,3})
EXTRACT-src_type = SrcType=(?<src_type>\w*)
EVAL-src_category = if(isnull(src_category) OR src_category="","ot",src_category)
# EVAL-category=if(cat=='' OR isnull(cat),"User Activity", cat)
EVAL-categories = if(cat=='' OR isnull(cat),"User Activity", cat)
EVAL-src_bunit = "organization"
LOOKUP-asset_type = ot_asset_lookup ip AS src_ip OUTPUT asset_type
LOOKUP-src_asset_id = ot_asset_lookup ip AS src_ip OUTPUT asset_id AS src_asset_id
LOOKUP-src_asset_type = ot_asset_lookup ip AS src_ip OUTPUT asset_type AS src_asset_type
LOOKUP-src_asset_system = ot_asset_lookup ip AS src_ip OUTPUT asset_system AS src_asset_system
EVAL-src_asset_system = src_asset_system
EVAL-asset_type = asset_type
EVAL-src_asset_type = src_asset_type
EVAL-dest_bunit = "Unknown"
EVAL-dest_priority = "Unknown"
EVAL-mitre_technique_id = "Unknown"
EVAL-type = cat='(?<type>\w*)'
EVAL-dest_ip = dest


