# savedsearches.conf

[DA-ITSI-METRICATOR-NMON-OS_Hosts_Search]
description = Search for discovering NMON Hosts
search = | tstats latest(Nmon_Config.OStype) as family, latest(Nmon_Config.vendor_product) as vendor_product, latest(Nmon_Config.OSversion) as version, latest(Nmon_Config.Processor) as processor, latest(Nmon_Config.cpu_logicalcores) as cpu_cores from datamodel=metricator-nmon-config where (nodename = Nmon_Config) (sourcetype=nmon_config) groupby host prestats=false\
| eval itsi_role="nmon_host"\
| rex field=host "(?<short_host>[^.]*).{0,1}"\
| join host type=outer [ | mcatalog values(metric_name) as metrics where `nmon_metrics_index` metric_name="os.unix.nmon.storage.disk*" OR metric_name="os.unix.nmon.storage.dg*" by host\
| rename metrics as metric_name\
| eval disk_group=if(match(metric_name, "os.unix.nmon.storage.dg"), "true", "false") | table host, disk_group ]\
| join host type=outer [ | mcatalog values(metric_name) as metrics where `nmon_metrics_index` metric_name="os.unix.nmon.cpu.lpar.virtual_cpus" by host\
| rename metrics as metric_name\
| eval lpar=case(match(metric_name, "os\.unix\.nmon.cpu\.lpar"), "true") | table host, lpar ]\
| fillnull value="false" lpar\
| join host type=outer [ mstats latest(_value) as value where `nmon_metrics_index` (metric_name="os.unix.nmon.memory.mem.memtotal" OR metric_name="os.unix.nmon.memory.mem.Real_total_MB" OR metric_name="os.unix.nmon.memory.mem.swaptotal" OR metric_name="os.unix.nmon.memory.mem.Virtual_total_MB") host=* groupby host, metric_name\
| eval memtotal=case(isnum(value) AND metric_name="os.unix.nmon.memory.mem.memtotal", value, isnum(value) AND metric_name="os.unix.nmon.memory.mem.Real_total_MB", value)\
| eval swaptotal=case(isnum(value) AND metric_name="os.unix.nmon.memory.mem.swaptotal", value, isnum(value) AND metric_name="os.unix.nmon.memory.mem.Virtual_total_MB", value)\
| stats first(memtotal) as memory, first(swaptotal) as swap by host\
| foreach memory swap [ eval <<FIELD>> = if(isnum('<<FIELD>>'), round('<<FIELD>>', 0), "0") ] ]\
| where family!="Unknown"\
| rex field=version mode=sed "s/Q$//g"\
| rex field=vendor_product mode=sed "s/Q$//g"\
| fields + host, short_host, family, version, vendor_product, itsi_role, cpu_cores, memory, swap, processor, disk_group, lpar
dispatch.earliest_time = -4h
dispatch.latest_time = now
request.ui_dispatch_app = itsi
request.ui_dispatch_view = search

[DA-ITSI-METRICATOR-NMON-Inventory_Search]
search = | tstats latest(Nmon_Config.OStype) as "OS Family", latest(Nmon_Config.OSversion) as "OS Version", latest(Nmon_Config.Processor) as "Processor", latest(Nmon_Config.cpu_logicalcores) as cpu_cores from datamodel=metricator-nmon-config where (nodename = Nmon_Config) (sourcetype=nmon_config) (host=$host$) groupby host prestats=false\
| sort limit=0 host\
| join host type=outer [ | mcatalog values(metric_name) as metrics where `nmon_metrics_index` metric_name="os.unix.nmon.storage.disk*" OR metric_name="os.unix.nmon.storage.dg*" by host\
| rename metrics as metric_name\
| eval disk_group=if(match(metric_name, "os\.unix\.nmon\.storage\.dg"), "true", "false") | table host, disk_group ]\
| join host type=outer [ mstats latest(_value) as value where `nmon_metrics_index` (metric_name="os.unix.nmon.memory.mem.memtotal" OR metric_name="os.unix.nmon.memory.mem.Real_total_MB" OR metric_name="os.unix.nmon.memory.mem.swaptotal" OR metric_name="os.unix.nmon.memory.mem.Virtual_total_MB") host=* groupby host, metric_name\
| eval memtotal=case(isnum(value) AND metric_name="os.unix.nmon.memory.mem.memtotal", value, isnum(value) AND metric_name="os.unix.nmon.memory.mem.Real_total_MB", value)\
| eval swaptotal=case(isnum(value) AND metric_name="os.unix.nmon.memory.mem.swaptotal", value, isnum(value) AND metric_name="os.unix.nmon.memory.mem.Virtual_total_MB", value)\
| stats first(memtotal) as memory, first(swaptotal) as swap by host\
| foreach memory swap [ eval <<FIELD>> = if(isnum('<<FIELD>>'), round('<<FIELD>>', 0), "0") ] ]\
| eval memory = tostring(round(memory), "commas") . " MB", swap = tostring(round(swap), "commas") . " MB", "CPU / Memory" = cpu_cores . " cores / " . memory\
| rex field="OS Version" mode=sed "s/Q$//g"\
| eval entity_summary="machine: " . host . "|family: " . "OS Family" . "|OS: " . 'OS Version' . "|cpus: " . cpu_cores . "|memory: " . memory . "|swap: " . swap\
| fields entity_summary\
| makemv delim="|" entity_summary
request.ui_dispatch_app = itsi
request.ui_dispatch_view = search

[DA-ITSI-METRICATOR-NMON-Context_Chart_CPU_Search]
search = | mstats avg(_value) as value where `nmon_metrics_index` metric_name=os.unix.nmon.cpu.cpu_all.Sys_PCT OR metric_name=os.unix.nmon.cpu.cpu_all.User_PCT OR metric_name=os.unix.nmon.cpu.cpu_all.Wait_PCT OR metric_name=os.unix.nmon.cpu.cpu_all.Idle_PCT OR metric_name=os.unix.nmon.cpu.lpar.VP_Sys_PCT OR metric_name=os.unix.nmon.cpu.lpar.VP_User_PCT OR metric_name=os.unix.nmon.cpu.lpar.VP_Wait_PCT OR metric_name=os.unix.nmon.cpu.lpar.VP_Idle_PCT OR metric_name=os.unix.nmon.cpu.lpar.entitled OR metric_name=os.unix.nmon.cpu.lpar.virtualCPUs host=$host$ groupby metric_name, OStype, host span=1m\
| rex field="metric_name" ".(?<metric>[\w|\-|\_]*)$" \
| eval {metric}=value \
| stats values(Sys_PCT) as Sys_PCT, values(User_PCT) as User_PCT, values(Wait_PCT) as Wait_PCT, values(VP_User_PCT) as VP_User_PCT, values(VP_Sys_PCT) as VP_Sys_PCT, values(VP_Wait_PCT) as VP_Wait_PCT, values(VP_Idle_PCT) as VP_Idle_PCT, values(PhysicalCPU) as PhysicalCPU, values(virtualCPUs) as virtualCPUs values(partition_active_processors) as partition_active_processors by _time, OStype, host \
| fillnull value=0 Sys_PCT,User_PCT,Wait_PCT,VP_User_PCT,VP_Sys_PCT,VP_Wait_PCT,VP_Idle_PCT,PhysicalCPU,partition_active_processors \
| eval cpu_load_percent=(Sys_PCT+User_PCT+Wait_PCT), lpar_load_percent = case(OStype=="AIX", round((VP_User_PCT+VP_Sys_PCT+VP_Wait_PCT+VP_Idle_PCT),2), OStype=="Linux", round((PhysicalCPU/partition_active_processors*100),2)) \
| eval cpu_load_percent=if(isnum(lpar_load_percent), lpar_load_percent, cpu_load_percent) \
| fields _time, host, cpu_load_percent \
| stats avg(cpu_load_percent) AS avg | eval avg=round(avg, 2) | rename avg as "avg % cpu"
request.ui_dispatch_app = itsi
request.ui_dispatch_view = search

[DA-ITSI-METRICATOR-NMON-Context_Chart_Memory_Search]
search = | mstats avg(_value) as value where `nmon_metrics_index` metric_name=os.unix.nmon.memory.mem.memtotal OR metric_name=os.unix.nmon.memory.mem.active OR metric_name=os.unix.nmon.memory.mem.inactive OR metric_name=os.unix.nmon.memory.mem.buffers OR metric_name=os.unix.nmon.memory.mem.cached OR metric_name=os.unix.nmon.memory.mem.memfree OR metric_name=os.unix.nmon.memory.mem.Real_Free_PCT OR metric_name=os.unix.nmon.memory.mem.Real_free_MB OR metric_name=os.unix.nmon.memory.mem.Real_total_MB OR metric_name=os.unix.nmon.memory.mem.swapcached OR metric_name=os.unix.nmon.memory.mem.swaptotal OR metric_name=os.unix.nmon.memory.mem.swapfree OR metric_name=os.unix.nmon.memory.mem.Virtual_total_MB OR metric_name=os.unix.nmon.memory.mem.Virtual_free_MB ( ( host="$host$" ) ) groupby OStype, host, metric_name span=1m\
| rex field="metric_name" ".(?<metric>[\w|\-|\_]*)$" \
| eval {metric}=value \
| stats values(Real_total_MB) as Real_total_MB, values(Real_free_MB) as Real_free_MB, values(memtotal) as memtotal, values(buffers) as buffers, values(cached) as cached, values(memfree) as memfree, values(Virtual_total_MB) as Virtual_total_MB, values(Virtual_free_MB) as Virtual_free_MB, values(swapcached) as swapcached, values(swaptotal) as swaptotal, values(swapfree) as swapfree by _time, OStype, host \
| fillnull value=0 Real_total_MB Real_free_MB memtotal buffers cached memfree Virtual_total_MB Virtual_free_MB swapcached swaptotal swapfree \
| eval mem_used_effective_PCT=case((OStype == "AIX"),round((((Real_total_MB - Real_free_MB) / Real_total_MB) * 100),2),(OStype == "Linux"),round(((((memtotal - (buffers + cached)) - memfree) / memtotal) * 100),2),(OStype == "Solaris"),round((((memtotal - memfree) / memtotal) * 100),2)) \
| fields + mem_used_effective_PCT \
| stats avg(mem_used_effective_PCT) AS avg | eval avg=round(avg, 2) | rename avg as "avg % mem"
request.ui_dispatch_app = itsi
request.ui_dispatch_view = search

[DA-ITSI-METRICATOR-NMON-Context_Chart_Disk_Usage_Search]
search = | mstats latest(_value) as value where `nmon_metrics_index` metric_name="os.unix.nmon.storage.df_storage.*" host=$host$ `devices_mount_exclusions` groupby metric_name, dimension_mount\
| rex field="metric_name" ".(?<metric>[\w|\-|\_]*)$" \
| eval {metric}=value\
| rename dimension_mount as mount\
| stats first(Available) as available, first(Used) as used by mount\
| eval total=available+used, free=total-used\
| stats sum(*) as "*"\
| eval pct_used = used*100.0/total\
| `get-closest-disk-unit(total)` | eval used_space = round(used/divisor, 1)." ".unit_to_use." / ".round(total/divisor, 1)." ".unit_to_use | fields pct_used | eval pct_used = round(pct_used, 2) | rename pct_used as "% disk used"
request.ui_dispatch_app = itsi
request.ui_dispatch_view = search
