[ts_index_filter]
definition = (index=main)
description = The index filter to be used in the Datamodel and in the drilldown filter

[ts_lookup_remote]
definition = lookup local=true
description = Determines whether lookups should be run on the indexers or the local splunk search head. If you want to run remotely, please look at Splunk documentation to share the KVStore data with the indexers

[ts_lookup_details]
definition = `ts_lookup_all` | rename src_port as src0_port | rename dest_port as dest0_port | `ts_eval_all(src, dest, ts)` | fields - src_*, dest_* | rename src0_port as src_port | rename dest0_port as dest_port

[ts_get_time_offset(2)]
args = event_time, date_last
definition = eval my_time=mvindex(split(mvjoin($date_last$, ";"), ";"), 0) | eval my_time=if(like(my_time, "%Z"), my_time, my_time+"Z") | eval ioc_time=strptime(my_time, "%Y-%m-%dT%T.%3N%Z") | eval Age = floor(abs($event_time$ - ioc_time)/3600/24)

[ts_lookup_details(1)]
args = field
definition = `ts_lookup_all($field$)` | search $field$_lookup_key_value="*" | rename $field$_port as $field$0_port | `ts_eval_all($field$, ts)` | fields - $field$_* | rename $field$0_port as $field$_port

[ts_eval_victim(2)]
args = matched, victim
definition = eval victim=if(isnotnull($matched$), mvappend(victim, $victim$), victim)

[ts_severity_sort]
description = Sorts the severity to the correct order
definition = eval severity_num = case(severity="low", 1 ,severity="medium",2,severity="high",3,severity="very-high",4) | sort - severity_num | fields - severity_num
[ts_eval_all(2)]
args = f1, f3
definition = foreach $f1$_* [eval $f3$_<<MATCHSTR>>=if(isnull($f3$_<<MATCHSTR>>), <<FIELD>>, mvappend($f3$_<<MATCHSTR>>, <<FIELD>>))]

[ts_eval_all(3)]
args = f1, f2, f3
definition = foreach $f1$_* [eval $f3$_<<MATCHSTR>>=if(<<FIELD>>=$f2$_<<MATCHSTR>>, <<FIELD>>, mvappend(<<FIELD>>, null, $f2$_<<MATCHSTR>>))]

[ts_join_mv]
definition = foreach * [eval <<FIELD>>=mvdedup(<<FIELD>>) | eval <<FIELD>>=mvjoin(<<FIELD>>, ";")]

[ts_make_mv]
definition = foreach ts_* [eval <<FIELD>>=split(<<FIELD>>, ";")]

[ts_make_all_mv]
definition = foreach * [eval <<FIELD>>=split(<<FIELD>>, ";")]

[ts_ioc_search_str(2)]
args = ioc_type, search_str
definition = if ("$search_str$"=="*", "", "AND ($ioc_type$ = *$search_str$* OR detail = *$search_str$*)")
iseval = 1

[ts_ioc_search(4)]
args = ioc_type, search_str, itype, confidence
definition = inputlookup append=true ts_lookup_$ioc_type$_2 where itype=$itype$ `ts_ioc_search_str($ioc_type$,$search_str$)` \
 | search confidence>=$confidence$ \
 | addinfo \
 | eval info_max_time=if(info_max_time=="+Infinity", info_search_time, info_max_time) \
 | where strptime(date_last, "%Y-%m-%dT%H:%M:%S")>=info_min_time AND strptime(date_last, "%Y-%m-%dT%H:%M:%S")<=info_max_time \
 | eval indicator=$ioc_type$ \
 | table date_last, date_first, itype, indicator, confidence, country, source, classification, severity, org, detail, _time, resource_uri | fields - _raw \
 | rename date_last as "Last Modified", date_first as "First Identified", itype as Type, indicator as Indicator, confidence as Confidence, country as Country, source as Source, classification as Classification, severity as Severity, org as Organization, detail as Tag, resource_uri as "URI" \
 | sort - _time | fields - _time

[ts_ioc_search_histogram(4)]
args = ioc_type, search_str, itype, confidence
definition = inputlookup append=true ts_lookup_$ioc_type$_2 where itype=$itype$ `ts_ioc_search_str($ioc_type$,$search_str$)` \
 | search confidence>=$confidence$ \
 | addinfo \
 | eval info_max_time=if(info_max_time=="+Infinity", info_search_time, info_max_time) \
 | where strptime(date_last, "%Y-%m-%dT%H:%M:%S") >= info_min_time AND strptime(date_last, "%Y-%m-%dT%H:%M:%S") <= info_max_time \
 | eval indicator=$ioc_type$ \
 | table date_last, itype, indicator, confidence, country, source, classification, severity, detail, _time

[ts_ioc_overview_time]
definition= inputlookup ts_lookup_srcip_1 \
 | inputlookup append=t ts_lookup_domain_1 \
 | inputlookup append=t ts_lookup_md5_1 \
 | inputlookup append=t ts_lookup_url_1 \
 | inputlookup append=t ts_lookup_email_1 \
 | addinfo \
 | eval info_max_time=if(info_max_time=="+Infinity", info_search_time, info_max_time) \
 | where _time >= info_min_time AND _time <= info_max_time

[ts_where_time(3)]
args = etime, earliest, latest
definition = "where $etime$>$earliest$ AND $etime$<$latest$"
iseval = 1

[ts_ioc_overview_time(2)]
args = earliest, latest
definition= inputlookup ts_lookup_srcip_1 `ts_where_time(etime,$earliest$,$latest$)` | inputlookup append=t ts_lookup_domain_1 `ts_where_time(etime,$earliest$,$latest$)` | inputlookup append=t ts_lookup_md5_1 `ts_where_time(etime,$earliest$,$latest$)` | inputlookup append=t ts_lookup_url_1 `ts_where_time(etime,$earliest$,$latest$)` | inputlookup append=t ts_lookup_email_1 `ts_where_time(etime,$earliest$,$latest$)` | eval _time=etime

[ts_ioc_overview_drilldown_1(2)]
args = earliest, latest
definition= inputlookup ts_lookup_srcip `ts_where_time(etime,$earliest$,$latest$)` | inputlookup append=t ts_lookup_domain `ts_where_time(etime,$earliest$,$latest$)` | inputlookup append=t ts_lookup_md5 `ts_where_time(etime,$earliest$,$latest$)` | inputlookup append=t ts_lookup_url `ts_where_time(etime,$earliest$,$latest$)` | inputlookup append=t ts_lookup_email `ts_where_time(etime,$earliest$,$latest$)`

[ts_ioc_count(1)]
args = timespan
definition = inputlookup ts_lookup_ioc_count | eval latest = relative_time(now(), "$timespan$") | eval last_modified = tonumber(last_modified) | where last_modified < latest | stats max(last_modified) as last_modified, sum(count) as count | eval last_modified = strftime(last_modified, "%b %d, %Y %I:%M %p")

[ts_ioc_count_since(1)]
args = timespan
definition = inputlookup ts_lookup_ioc_count | eval latest = relative_time(now(), "$timespan$") | eval last_modified = tonumber(last_modified) | where last_modified >= latest | stats max(last_modified) as last_modified, sum(count) as count | eval last_modified = strftime(last_modified, "%b %d, %Y %I:%M %p")

[remove_unknown(1)]
args = value
definition = if ("$value$"=="unknown", "", "$value$")
iseval = 1

[remove_unknown_term(2)]
args = key, value
definition = if ("$value$"=="unknown", "", "$key$=$value$")
iseval = 1

[ts_lookup_tm_4_et_page(1)]
args = tm
definition = if ("$tm$"=="all_ioc_matched", "noop", "inputlookup tm_$tm$")
iseval = 1

[ts_index_summary_et_page(1)]
args = tm
definition = if ("$tm$"=="all_ioc_matched", "search `ts_summary_data(\"\")` ", "search `ts_summary_data(\"has_$tm$=hard\")` ")
iseval = 1

[ts_left_right(3)]
args = tm, left, right
definition = if ("$tm$"=="all_ioc_matched", "", "$left$=$right$")
iseval = 1

[ts_lookup_tm_4_tm_page(1)]
args = tm
definition = if ("$tm$"=="*", "inputlookup append=true tm_actor | inputlookup append=t tm_tipreport", "inputlookup append=true tm_$tm$")
iseval = 1

[ts_eval_port(2)]
args = s_port, d_port
definition = if ("$s_port$"=="*", if ("$d_port$"=="*", "", "dest_port=$d_port$"), if ("$d_port$"=="*", "src_port=$s_port$", "src_port=$s_port$ dest_port=$d_port$"))
iseval = 1

[ts_eval_action(1)]
args = action
definition = if ("$action$"=="*", "", "action=$action$")
iseval = 1

[ts_event_action_gen]
definition = `ioc_match_display("", "","")` | dedup event.action | table event.action | rename event.action as action | eval _key = action | outputlookup append=true  ts_event_action

[ts_eval_lookup_details(1)]
args = type
definition = if ("$type$"=="ip" OR "$type$"=="domain", "`ts_lookup_details`", "`ts_lookup_$type$_details`")
iseval = 1

[ts_summary_data(1)]
# Last used in v6.4: Only kept in for compatability, please use iocmetafilter_match_display(2) instead
args = ioc_meta
definition = index=threatstream_summary | fields orig_*, action, anomali_results, src, dest, url, file_hash, domain, user, src_user, src_port, dest_port, recipient, user, count, sourcetype, event.*, _time, tipreport, indicator, actor, whitelist_at_match, event_time\
 | fillnull whitelisted_at_match value="no" \
 | search whitelisted_at_match="no" \
 | iocmetafilter $ioc_meta$ anomali_results \
 | eval victim=case( type="ip" OR type="domain", if(indicator=src, dest, src), type="email", if(indicator=src_user,recipient, src_user), type="url", if(indicator=src, dest, src) , type="hash", src ) \
 | convert mktime(event_time) \
 | `ts_get_time_offset(event_time, date_last)` \
 | makemv tokenizer="([^,;]+),?;?" actor \
 | makemv tokenizer="([^,;]+),?;?" tipreport \
 | makemv tokenizer="([^,;]+),?;?" itype

[ts_summary_data_search(2)]
# Last used in v6.4: Only kept in for compatability, please use iocmetafilter_match_display(2) instead
args = data_search, ioc_meta
definition = index=threatstream_summary  $data_search$ | fields orig_*, action, anomali_results, src, dest, url, file_hash, domain, user, src_user, src_port, dest_port, recipient, user, count, sourcetype, event.*, _time, tipreport, indicator, actor, whitelist_at_match, event_time\
 | fillnull whitelisted_at_match value="no" \
 | search whitelisted_at_match="no" \
 | iocmetafilter $ioc_meta$ anomali_results \
 | eval victim=case( type="ip" OR type="domain", if(indicator=src, dest, src), type="email", if(indicator=src_user,recipient, src_user), type="url", if(indicator=src, dest, src) , type="hash", src ) \
 | convert mktime(event_time) \
 | `ts_get_time_offset(event_time, date_last)` \
 | makemv tokenizer="([^,;]+),?;?" actor \
 | makemv tokenizer="([^,;]+),?;?" tipreport \
 | makemv tokenizer="([^,;]+),?;?" itype


[ts_whitelist(2)]
args = indicator_field, field_prefix
definition = lookup ts_whitelist indicator AS $field_prefix$$indicator_field$, source AS $field_prefix$source, host AS $field_prefix$host, src AS $field_prefix$src, dest AS $field_prefix$dest OUTPUT _key as whitelist_key, disabled AS whitelist_rule_disabled, indicator AS whitelist_indicator, source AS whitelist_source, host AS whitelist_host, src AS whitelist_src, dest AS whitelist_dest \
| fillnull value=no whitelist_rule_disabled \
| eval whitelisted_at_match = if(isnotnull(whitelist_key) AND whitelist_rule_disabled!="yes", "yes", "no") \
| eval whitelist_rule = "whitelist_source=".whitelist_source.",whitelist_host=".whitelist_host.",whitelist_indicator=".whitelist_indicator.",whitelist_src=".whitelist_src.",whitelist_dest=".whitelist_dest


[cim_drilldown_filter]
definition = `ts_index_filter` ((tag=network tag=communicate) OR (tag=ids tag=attack) OR (tag=web) OR (tag=network tag=resolution tag=dns) OR (tag=email) OR (tag=malware tag=attack))

[cim_index_filter]
definition = `cim_Certificates_indexes` OR `cim_Email_indexes` OR `cim_Endpoint_indexes` OR `cim_Intrusion_Detection_indexes` OR `cim_Malware_indexes` OR` `cim_Network_Resolution_indexes` OR `cim_Network_Traffic_indexes` OR `cim_Web_indexes`

[cim_common_match_prep(1)]
args=datamodel_name
definition = rename $datamodel_name$.* AS * | fillnull value="unknown" | eval cim_datamodel="$datamodel_name$"

# TS_Optic Datamodel searches <- itype centric
[ts_drilldown_filter]
definition = `ts_index_filter` (sourcetype=pan_traffic OR sourcetype=cisco:asa OR sourcetype=cisco:pix OR sourcetype=checkpoint OR sourcetype=netscreen:firewall OR sourcetype=bluecoat OR  sourcetype=websense OR sourcetype=squid OR sourcetype=squid:access OR sourcetype=MWGaccess3 OR sourcetype=snort OR sourcetype=juniper:idp OR sourcetype=juniper:nsm OR sourcetype=junos:idp OR sourcetype=mcafee:ids OR sourcetype=tippingpoint OR sourcetype=FE_CEF OR sourcetype=FE_XML OR sourcetype=access_combined OR sourcetype=iis OR sourcetype=exchange123 OR sourcetype=cisco:fwsm OR sourcetype=fortinet OR sourcetype=fortigate OR sourcetype=cisco_wsa_w3c OR sourcetype=anomali_test OR sourcetype=csv)

[ts_tstats_url_all]
definition = `ts_tstats` count from datamodel=TS_Optic where nodename="TS_Optic.url" by `tstats_common_fields` TS_Optic.url, TS_Optic.src, TS_Optic.action span=`tstats_match_span` | `ts_common_match_prep`

[ts_tstats_md5_all]
definition = `ts_tstats` count from datamodel=TS_Optic where nodename="TS_Optic.md5" `tstats_common_fields` by TS_Optic.file_hash, TS_Optic.file_name, TS_Optic.src, TS_Optic.action span=`tstats_match_span` | `ts_common_match_prep`

[ts_tstats_email_all]
definition = `ts_tstats` count from datamodel=TS_Optic where nodename="TS_Optic.email" by `tstats_common_fields` TS_Optic.src, TS_Optic.dest, TS_Optic.src_ip, TS_Optic.user, TS_Optic.src_user, TS_Optic.recipient, TS_Optic.action span=`tstats_match_span` | `ts_common_match_prep`

[ts_tstats_fraud_all]
definition = `ts_tstats` count from datamodel=TS_OnPrem by `tstats_common_fields` TS_OnPrem.action, TS_OnPrem.src, TS_OnPrem.dest, TS_OnPrem.transaction_id span=`tstats_match_span` | rename TS_Optic.* AS *

[ts_common_match_prep]
definition = rename "TS_Optic.*" as *

# TSTATS - These macros affect all the tstats searches within the App
[tstats_match_span]
description = Used to time boundary for matches e.g. events should be bundled into 10m buckets
definition = 10m

[tstats_common_fields]
description = Used to determine the fields that we should always see in Datamodels
definition = _time, host, source, sourcetype

[ts_tstats]
description = Used to control the base tstats command behavior - overridden by ES definition
definition = tstats prestats=false local=false summariesonly=true allow_old_summaries=true


[drilldown_filter]
description = Controls which drilldown should be used - redefined at setup based on whether TS_Optic DM or CIM DM is selected
definition = `ts_drilldown_filter`

[index_filter]
description = Controls which indexs should be used - redefined at setup based on whether TS_Optic DM or CIM DM is selected
definition = `ts_index_filter`

[ioc_match(6)]
# Two possible definitions
# lookup_matching = `lookup_match("$ip_lookup_fields$", "$domain_lookup_fields$", "$url_lookup_fields$", "$email_lookup_fields$", "$md5_lookup_fields$")`
# advanced_matching = `ioc_match_batch("$ioc_match_batch$")`
args = ioc_match_batch, ip_lookup_fields, domain_lookup_fields, url_lookup_fields, email_lookup_fields, md5_lookup_fields
definition = `lookup_match("$ip_lookup_fields$", "$domain_lookup_fields$", "$url_lookup_fields$", "$email_lookup_fields$", "$md5_lookup_fields$")`
description = This macro is changed in the ThreatStream App setup to use different types of matching. it will link a search to either the ioc_match_batch macro or the lookup_match macro

[lookup_match(5)]
args = ip_lookup_fields, domain_lookup_fields, url_lookup_fields, email_lookup_fields, md5_lookup_fields
description = Macro used to lookup fields against appropriate ThreatStream KVStores
definition = `lookup_match_itype("ip_to_match", "$ip_lookup_fields$", "ts_lookup_srcip", "srcip")` \
 `lookup_match_itype("domain_to_match", "$domain_lookup_fields$", "ts_lookup_domain", "domain")` \
 `lookup_match_itype("url_to_match", "$url_lookup_fields$", "ts_lookup_url", "url")` \
 `lookup_match_itype("email_to_match", "$email_lookup_fields$", "ts_lookup_email", "email")` \
 `lookup_match_itype("md5_to_match", "$md5_lookup_fields$", "ts_lookup_md5", "md5")` \
 | search ts_lookup_key_value=*  \
 | rename ts_lookup_key_value AS indicator \
 | fields - _mkv_child, ts_time \
 | `ts_join_mv` \
 | rename * AS event.* \
 | eval event_time = 'event._time', _time= 'event._time' \
 | `ts_whitelist("indicator", "event.")`


[lookup_match_itype(4)]
args = mv_field, mv_field_values, ioc_lookup_type, key_to_match
description = Macro used to lookup fields on KVStore only when required
definition = if ( "$mv_field_values$"=="", "", "| eval  $mv_field$ = mvappend($mv_field_values$, \"\") | `ts_lookup_iocs($mv_field$, $ioc_lookup_type$, $key_to_match$)` | fields - $mv_field$")
iseval=1

[drilldown_match]
description = Macro used to match specific fields for when drilldowns occur
definition = `drilldown_match_lookup("src, src_ip, dest, dest_ip, src_host, dest_host", "src, dest, src_host, dest_host", "url", "src_user, recipient, user ", "file_hash")`

[drilldown_match_lookup(5)]
args = ip_lookup_fields, domain_lookup_fields, url_lookup_fields, email_lookup_fields, md5_lookup_fields
definition = `lookup_match_itype("ip_to_match", "$ip_lookup_fields$", "ts_lookup_srcip", "srcip")` \
 `lookup_match_itype("domain_to_match", "$domain_lookup_fields$", "ts_lookup_domain", "domain")` \
 `lookup_match_itype("url_to_match", "$url_lookup_fields$", "ts_lookup_url", "url")` \
 `lookup_match_itype("email_to_match", "$email_lookup_fields$", "ts_lookup_email", "email")` \
 `lookup_match_itype("md5_to_match", "$md5_lookup_fields$", "ts_lookup_md5", "md5")`

[ts_lookup_iocs(3)]
args = field_name, lookup_table, lookup_field
definition = `ts_lookup_remote` $lookup_table$ $lookup_field$ as $field_name$ OUTPUTNEW asn as \
 ts_asn, classification as ts_classification, confidence as ts_confidence, country as ts_country, \
 date_first as ts_date_first, date_last as ts_date_last, itype as ts_itype, lat as ts_lat, \
 lon as ts_lon, maltype as ts_maltype, org as ts_org, severity as ts_severity, source as ts_source, \
 $lookup_field$ as ts_lookup_key_value, id as ts_id, detail as ts_detail, resource_uri as \
 ts_resource_uri, actor as ts_actor, tipreport as ts_tipreport, type as ts_type
description = Used to lookup data against a ThreatStream IOC kvstore

[ioc_match_batch(1)]
# New style matching using custom search command
args = lookup_fields
description = Custom Search Command style matching against the KVStore
definition= | iocmatchbatch match_type=auto dest_field=anomali_results $lookup_fields$ | `ts_whitelist("indicator", "")` | eval event_time = _time | fields - _time | collect index=threatstream_summary sourcetype=anomali_matches

[ioc_match_display(3)]
# Two possible definitions
# performance matching = `lookup_match_display("$search$", "$data_restraints$")`
# iocmatchbatch matching = `iocmetafilter_match_display("$search$", "$iocmetafilter$")`
args = search ,iocmetafilter, data_restraints
definition = `lookup_match_display("$search$", "$data_restraints$")`
description = How to get matches from the ThreatStream Summary Index - redefined on app setup based on whether custom search commands are used

[lookup_match_display(2)]
args = search_args, ts_data_constraints
description = Used to display lookup style matches from the threatstream_summary index
definition = index=threatstream_summary $search_args$  \
 | fillnull whitelisted_at_match value="no" \
 | search whitelisted_at_match="no" \
 | eval indicator=coalesce('event.indicator', indicator, 'event.ts_lookup_key_value',ts_lookup_key_value) \
 | fields - event.indicator \
 | eval indicator = if(match(indicator, ";"), split(indicator, ";"), indicator) \
 | foreach event.ts_* [ eval <<FIELD>>=if(match('<<FIELD>>', ";"), split('<<FIELD>>', ";"),'<<FIELD>>')] \
 | eval event.ts_confidence = max('event.ts_confidence') \
 | eval event.ts_date_last = max(strptime('event.ts_date_last', "%Y-%m-%dT%T")) \
 | eval event.victim=case( 'event.ts_type'="ip" OR 'event.ts_type'="domain", if(indicator='event.src','event.dest', 'event.src'),'event.ts_type'="email", if(indicator='event.src_user','event.recipient', 'event.src_user'),'event.ts_type'="url", if(indicator='event.src', 'event.dest', 'event.src') , 'event.ts_type'="md5", 'event.src' ) \
 | eval event.ts_severity = case('event.ts_severity'="very-high", "very-high",'event.ts_severity'="high","high",'event.ts_severity'="medium","medium",'event.ts_severity'="low","low",'event.ts_severity'="very-low","very-low") \
 | convert mktime(event_time) \
 | eval Age = floor(abs(event_time - 'event.ts_date_last')/3600/24) \
 | search $ts_data_constraints$

[iocmetafilter_match_display(2)]
# Multiple renames going on as the analytics have to work where there may or may not be event. in the name of the field
args = data_search, ioc_meta
description = Used to display Custom Search Command style matches from the threatstream_summary index
definition = index=threatstream_summary  $data_search$ | fields orig_*, action, anomali_results, src, dest, url, file_hash, domain, user, src_user, src_port, dest_port, recipient, count, sourcetype, event.*, _time, tipreport, indicator, actor, whitelist_at_match, event_time \
 | rename event.* AS * \
 | fillnull whitelisted_at_match value="no" \
 | search whitelisted_at_match="no" \
 | iocmetafilter $ioc_meta$ field_prefix="ts_" anomali_results \
 | eval victim=case( ts_type="ip" OR ts_type="domain", if(indicator=src, dest, src), ts_type="email", if(indicator=src_user,recipient, src_user), ts_type="url", if(indicator=src, dest, src) , ts_type="md5", src ) \
 | convert mktime(event_time) \
 | `ts_get_time_offset(event_time,ts_date_last)` \
 | makemv tokenizer="([^,;]+),?;?" ts_actor \
 | makemv tokenizer="([^,;]+),?;?" ts_tipreport \
 | makemv tokenizer="([^,;]+),?;?" ts_itype \
