[ThreatStream Summary - Generating Hourly Indicator Matches By IP]
action.summary_index = 1
action.summary_index._name = threatstream_summary
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
cron_schedule = 30 */1 * * *
description = This report generates hourly ThreatStream indicator matches and stores them to the summary index
dispatch.earliest_time = -65m@m
dispatch.latest_time = -5m@m
enableSched = 1
realtime_schedule = 0
search = |`ts_tstats` count from datamodel=TS_Optic by `tstats_common_fields` TS_Optic.src,TS_Optic.dest, TS_Optic.action, TS_Optic.src_port, TS_Optic.dest_port, TS_Optic.src_ip, TS_Optic.dest_ip span=`tstats_match_span` \
 | `ts_common_match_prep` \
 `ioc_match("src, dest, src_host, dest_host, src_ip, dest_ip", "src, dest, src_host, dest_host, src_ip, dest_ip", "","","","")`
disabled = 0

[ThreatStream Summary - Generating Hourly Indicator Matches By Domain]
action.summary_index = 1
action.summary_index._name = threatstream_summary
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
cron_schedule = 15 */1 * * *
description = This report generates hourly ThreatStream indicator matches and stores them to the summary index
dispatch.earliest_time = -65m@m
dispatch.latest_time = -5m@m
enableSched = 1
realtime_schedule = 0
search = |`ts_tstats` count from datamodel=TS_Optic by `tstats_common_fields` TS_Optic.src,TS_Optic.dest, TS_Optic.action span=`tstats_match_span` \
 | `ts_common_match_prep` \
  `ioc_match("src, dest, src_host, dest_host", "", "src, dest,src_host, dest_host","","","")`
disabled = 0

[ThreatStream Summary - Generating Hourly Indicator Matches By URL]
action.summary_index = 1
action.summary_index._name = threatstream_summary
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
cron_schedule = 45 */1 * * *
description = This report generates hourly ThreatStream indicator matches and stores them to the summary index
dispatch.earliest_time = -65m@m
dispatch.latest_time = -5m@m
enableSched = 1
realtime_schedule = 0
search = | `ts_tstats` count from datamodel=TS_Optic by `tstats_common_fields` TS_Optic.url,TS_Optic.dest, TS_Optic.src, TS_Optic.action  span=`tstats_match_span` \
 | `ts_common_match_prep` \
  `ioc_match("url", "", "","url","","")`
disabled = 0

[ThreatStream Summary - Generating Hourly Indicator Matches By Email]
action.summary_index = 1
action.summary_index._name = threatstream_summary
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
cron_schedule = 0 */1 * * *
description = This report generates hourly ThreatStream indicator matches and stores them to the summary index
dispatch.earliest_time = -65m@m
dispatch.latest_time = -5m@m
enableSched = 1
realtime_schedule = 0
search = | `ts_tstats` count from datamodel=TS_Optic by `tstats_common_fields` TS_Optic.src,TS_Optic.dest, TS_Optic.src_ip, TS_Optic.user, TS_Optic.src_user, TS_Optic.recipient, TS_Optic.action span=`tstats_match_span` \
 | `ts_common_match_prep` \
  `ioc_match("src_user, recipient", "", "","","src_user, recipient","")`

disabled = 0

[ThreatStream Summary - Generating Hourly Indicator Matches By Hash]
action.summary_index = 1
action.summary_index._name = threatstream_summary
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
cron_schedule = 45 */1 * * *
description = This report generates hourly ThreatStream indicator matches and stores them to the summary index
dispatch.earliest_time = -65m@m
dispatch.latest_time = -5m@m
enableSched = 1
realtime_schedule = 0
search = | `ts_tstats` count from datamodel=TS_Optic by `tstats_common_fields` TS_Optic.file_hash,TS_Optic.dest, TS_Optic.src, TS_Optic.action span=`tstats_match_span` \
 | `ts_common_match_prep` \
  `ioc_match("file_hash", "", "","","","file_hash")`
disabled = 0

[ThreatStream Summary - CIM - Generating Matches from DNS Datamodel]
# DM fields to ts itype -> query=domain,
action.summary_index = 1
action.summary_index._name = threatstream_summary
dispatch.earliest_time = -65m@m
dispatch.latest_time = -5m@m
cron_schedule = 0 */1 * * *
enableSched = 1
search = | `ts_tstats` count from datamodel=Network_Resolution by `tstats_common_fields` DNS.query,DNS.src, DNS.query_type span=`tstats_match_span` \
 | `cim_common_match_prep("DNS")` \
 | rename query AS dest \
  `ioc_match("dest",  "", "dest","","","")`
disabled=1

[ThreatStream Summary - CIM - Generating Matches from Network Traffic Datamodel]
# DM fields to ts itype -> src=ip|domain, dest=ip|domain,
action.summary_index = 1
action.summary_index._name = threatstream_summary
dispatch.earliest_time = -65m@m
dispatch.latest_time = -5m@m
enableSched = 1
cron_schedule = 5 */1 * * *
search = | `ts_tstats` count from datamodel=Network_Traffic by `tstats_common_fields` All_Traffic.src, All_Traffic.dest, All_Traffic.action, All_Traffic.src_port, All_Traffic.dest_port, All_Traffic.src_ip, All_Traffic.dest_ip span=`tstats_match_span` \
 | `cim_common_match_prep("All_Traffic")` \
  `ioc_match("src, dest", "src, dest", "", "", "", "")`
disabled=1

[ThreatStream Summary - CIM - Generating Matches from Certificates Datamodel]
# DM fields to ts itype -> ssl_hash=md5
action.summary_index = 1
action.summary_index._name = threatstream_summary
dispatch.earliest_time = -65m@m
dispatch.latest_time = -5m@m
enableSched = 1
cron_schedule = 10 */1 * * *
search= | `ts_tstats` count from datamodel=Certificates where nodename="All_Certificates.SSL"  by `tstats_common_fields` All_Certificates.src, All_Certificates.dest, All_Certificates.SSL.ssl_hash, All_Certificates.SSL.ssl_issuer, All_Certificates.SSL.ssl_issuer_email, All_Certificates.SSL.ssl_name span=`tstats_match_span` \
 | `cim_common_match_prep("All_Certificates")` \
 | rename SSL.* AS * \
  `ioc_match("ssl_hash","","","","","ssl_hash")`
disabled=1

[ThreatStream Summary - CIM - Generating Matches from Malware Datamodel]
# DM fields to ts itype -> file_hash=md5, sender=email, src=ip|domain|url
action.summary_index = 1
action.summary_index._name = threatstream_summary
dispatch.earliest_time = -65m@m
dispatch.latest_time = -5m@m
enableSched = 1
cron_schedule = 20 */1 * * *
search = | `ts_tstats` count from datamodel=Malware  where nodename="Malware_Attacks" by `tstats_common_fields` Malware_Attacks.src, Malware_Attacks.action, Malware_Attacks.dest, Malware_Attacks.file_hash, Malware_Attacks.file_name, Malware_Attacks.signature \
 | `cim_common_match_prep("Malware_Attacks")` \
  `ioc_match("file_hash, sender, src", "src", "src", "src", "sender", "file_hash")`
disabled=1

[ThreatStream Summary - CIM - Generating Matches from Intrusion Detection Datamodel]
# DM fields to ts itype -> src=ip|domain|url, dest=ip|domain|url
action.summary_index = 1
action.summary_index._name = threatstream_summary
dispatch.earliest_time = -65m@m
dispatch.latest_time = -5m@m
enableSched = 1
cron_schedule = 30 */1 * * *
search = | `ts_tstats` count from datamodel=Intrusion_Detection by `tstats_common_fields` IDS_Attacks.src, IDS_Attacks.dest, IDS_Attacks.action, IDS_Attacks.signature, IDS_Attacks.user, IDS_Attacks.category, IDS_Attacks.severity span=`tstats_match_span` \
 | `cim_common_match_prep("IDS_Attacks")` \
 | rename severity AS event_severity \
  `ioc_match("src, dest", "src, dest", "src, dest", "src, dest", "", "")`
disabled=1

[ThreatStream Summary - CIM - Generating Matches from Web Datamodel]
# DM fields to ts itype -> url=url
action.summary_index = 1
action.summary_index._name = threatstream_summary
dispatch.earliest_time = -65m@m
dispatch.latest_time = -5m@m
enableSched = 1
cron_schedule = 40 */1 * * *
search = | `ts_tstats` count from datamodel=Web by `tstats_common_fields` Web.dest, Web.url, Web.action, Web.status Web.src, span=`tstats_match_span` \
 | `cim_common_match_prep("Web")` \
  `ioc_match("url", "", "", "url", "", "")`
disabled=1

[ThreatStream Summary - CIM - Generating Matches from Email Datamodel]
# DM fields to ts itype ->  src_user=email, recipient=email, file_hash=md5
action.summary_index = 1
action.summary_index._name = threatstream_summary
dispatch.earliest_time = -65m@m
dispatch.latest_time = -5m@m
enableSched = 1
cron_schedule = 50 */1 * * *
search = | `ts_tstats` count from datamodel=Email  by `tstats_common_fields` All_Email.src,All_Email.dest, All_Email.action, All_Email.src_user, All_Email.recipient All_Email.subject span=`tstats_match_span` \
 | `cim_common_match_prep("All_Email")` \
  `ioc_match("src_user, recipient", "", "","","src_user, recipient","")`
disabled=1

[_ScheduledView___ts_report_high_priority_matches]
action.email = 1
action.email.maxtime = 60m
action.email.paperorientation = landscape
action.email.papersize = letter
action.email.pdfview = _ts_report_high_priority_matches
action.email.reportServerEnabled = 0
action.email.sendpdf = 1
action.email.subject.view = Executive Report: Last 7 Days High Priority Matches
action.email.message.view = The report of "Last 7 Days High Priority Matches" is generated.
action.email.from = ThreatStream
action.email.ttl = 10
action.email.useNSSubject = 1
cron_schedule = 0 6 * * 1
description = scheduled search for view name=_ts_report_high_priority_matches
dispatch.earliest_time = -7d@d
dispatch.latest_time = @d
enableSched = 1
is_visible = 0
search = | noop
disabled = 1

[_ScheduledView___ts_report_new_indicators_24_hours]
action.email = 1
action.email.maxtime = 60m
action.email.paperorientation = landscape
action.email.papersize = letter
action.email.pdfview = _ts_report_new_indicators_24_hours
action.email.reportServerEnabled = 0
action.email.sendpdf = 1
action.email.from = ThreatStream
action.email.subject.view = ThreatStream Executive Report: New Indicators in Last 24 Hours
action.email.message.view = The report of "New Indicators in last 24 Hours" is generated.
action.email.ttl = 10
action.email.useNSSubject = 1
cron_schedule = 15 1 * * *
description = scheduled search for view name=_ts_report_new_indicators_24_hours
dispatch.earliest_time = -48h@h
dispatch.latest_time = -24h@h
enableSched = 1
is_visible = 0
search = | noop
disabled = 1

[_ScheduledView___ts_report_top_10]
action.email = 1
action.email.maxtime = 60m
action.email.paperorientation = landscape
action.email.papersize = letter
action.email.pdfview = _ts_report_top_10
action.email.reportServerEnabled = 0
action.email.sendpdf = 1
action.email.from = ThreatStream
action.email.subject.view = ThreatStream Executive Report: Daily Top 10 Indicator Matches
action.email.message.view = The report of "Daily Top 10 Indicator Matches" is generated.
action.email.ttl = 10
action.email.useNSSubject = 1
cron_schedule = 15 0 * * *
description = scheduled search for view name=_ts_report_top_10
dispatch.earliest_time = -48h@h
dispatch.latest_time = -24h@h
enableSched = 1
is_visible = 0
search = | noop
disabled = 1

[Daily Outbound Indicator Matches (ThreatStream MyAttacks)]
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
dispatch.earliest_time = -1d@d
dispatch.latest_time = @d
search = `ioc_match_display("","","")` \
 | rename event.* AS * \
 | where match(indicator, dest) | stats sum(count) as count by dest, ts_itype \
 | sort - count | head 1000 | rename dest as attacker_address, ts_itype as attack_type | table attacker_address, attack_type, count
description = Top 100 outbound indicator matches
disabled = 0
action.ts_my_attacks = 1
cron_schedule = 0 1 * * *
enableSched = 1


[Alert - High Priority Matches in Last Hour]
action.email = 0
action.email.include.search = 1
action.email.include.trigger = 1
action.email.include.trigger_time = 1
action.email.inline = 1
action.email.message.alert = There are high priority matches in the last hour.
action.email.priority = 2
action.email.reportServerEnabled = 0
action.email.sendcsv = 1
action.email.sendpdf = 1
action.email.sendresults = 1
action.email.subject.alert = ThreatStream Alert: High Priority Matches in Last Hour
action.email.from = ThreatStream
action.email.useNSSubject = 1
alert.digest_mode = True
alert.severity = 4
alert.suppress = 0
alert.track = 1
auto_summarize.dispatch.earliest_time = -1d@h
counttype = number of events
cron_schedule = 30 * * * *
dispatch.earliest_time = -2h@h
dispatch.latest_time = @h
display.general.type = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = threatstream
request.ui_dispatch_view = search
search = `ioc_match_display("apt OR c2 OR mal","itype=\\\"(apt|c2|mal)\\\" min_confidence=80","(event.ts_itype=*c2* OR event.ts_itype=*apt* OR event.ts_itype=*mal*) event.ts_confidence>=80")` \
 | rename event.* AS * \
 | search Age<=31 \
 | stats sum(count) as occurrence, min(Age) as age, values(dest) as dest, values(src) as src, values(ts_source) as ts_source, values(ts_itype) as ts_itype, values(ts_confidence) as ts_confidence, values(ts_country) as ts_country, values(ts_detail) as ts_detail by indicator \
 | sort age - occurrence
disabled = 1

[ThreatStream - Install - Errors]
search = index=_internal source=*ts_install.log ERROR edit
disabled=0
dispatch.earliest_time = -2h
dispatch.latest_time = now
request.ui_dispatch_app = threatstream
request.ui_dispatch_view = search

[ThreatStream - Generate Sample Events]
action.email.useNSSubject = 1
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
cron_schedule = 0 * * * *
dispatch.earliest_time = -1h@h
dispatch.latest_time = @h
enableSched = 1
search = | tssampleevents
disabled = 1

[ThreatStream - Event Action Generator]
action.email.useNSSubject = 1
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
cron_schedule = 0 * * * *
dispatch.earliest_time = -4h@h
dispatch.latest_time = now
enableSched = 1
search = `ts_event_action_gen`

[ThreatStream - Modular Input logs - ts_ioc_ingest]
search = index=_internal source=*ts_ioc_ingest.log
dispatch.earliest_time = -1d
dispatch.latest_time = now


[ThreatStream - Check for Recent Indicators]
action.analyzeioc.param.verbose = 0
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = 0 0 * * *
description = Check that recent indicators have been ingested into the ThreatStream App KVStore based on the date_last (last modified) field
dispatch.earliest_time = -1d
dispatch.latest_time = now
display.general.type = statistics
display.page.search.mode = fast
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = threatstream
request.ui_dispatch_view = search
search = | inputlookup ts_lookup_srcip\
| inputlookup ts_lookup_domain append=t\
| inputlookup ts_lookup_email append=t\
| inputlookup ts_lookup_md5 append=t\
| inputlookup ts_lookup_url append=t\
| eval date_last_epoch = strptime(date_last, "%Y-%m-%dT%H:%M:%S")\
| stats max(date_last_epoch) AS last_modified_ioc_time\
| eval is_late = now() - 86400*2\
| where last_modified_ioc_time < is_late

[Threat - High Confidence Actor Matches - Rule]
action.correlationsearch = 0
action.correlationsearch.enabled = 1
action.correlationsearch.label = Actor match detected
action.email.sendresults = 0
action.notable = 1
action.notable.param.security_domain = threat
action.notable.param.severity = medium
action.notable.param.rule_title = Actor:$name$ match detected
action.notable.param.rule_description = Indicator: $indicator$ match related to Actor:$name$ detected
action.notable.param.nes_fields = victim, indicator, actor, itype
action.notable.param.drilldown_name = View raw logs associated with $indicator$
action.notable.param.drilldown_search = `drilldown_filter` sourcetype=$orig_sourcetype$ $indicator$ $victim$ host=$orig_host$  `drilldown_match`
description = Alerts on actor related matches from threatstream
disabled = True
cron_schedule = 45 */1 * * *
dispatch.earliest_time = -120m@m
dispatch.latest_time = -60m@m
enableSched = 1
is_visible = false
request.ui_dispatch_app = SplunkEnterpriseSecuritySuite
search = `ioc_match_display("actor", "has_actor=hard min_confidence=80", "event.ts_actor=* AND event.ts_confidence>=80")` \
 | rename event.* AS * \
 | table sourcetype, host, source, victim, indicator, ts_itype, ts_actor, src, dest \
 | lookup tm_actor id AS ts_actor  OUTPUT name | rename ts_actor AS actor


[Threat - High Confidence Threat Bulletin Matches - Rule]
action.correlationsearch = 0
action.correlationsearch.enabled = 1
action.correlationsearch.label = Threat Bulletin Match detected
action.email.sendresults = 0
action.notable = 1
action.notable.param.security_domain = threat
action.notable.param.severity = medium
action.notable.param.rule_title = Threat Bulletin:$name$ match detected
action.notable.param.rule_description = Indicator: $indicator$ match related to Threat Bulletin:$name$ detected
action.notable.param.nes_fields = victim, indicator, actor, itype
action.notable.param.drilldown_name = View raw logs associated with $indicator$
action.notable.param.drilldown_search = `drilldown_filter` sourcetype=$orig_sourcetype$ $indicator$ $victim$ host=$orig_host$  `drilldown_match`
description = Alerts on actor related matches from threatstream
disabled = True
cron_schedule = 45 */1 * * *
dispatch.earliest_time = -120m@m
dispatch.latest_time = -60m@m
enableSched = 1
is_visible = false
request.ui_dispatch_app = SplunkEnterpriseSecuritySuite
search = `ioc_match_display("tipreport", "has_tipreport=hard min_confidence=80", "event.ts_tipreport=* AND event.ts_confidence>=80")` \
 | rename event.* AS * \
 | table sourcetype, host, source, src, dest, victim, indicator, ts_itype, ts_tipreport \
 | lookup tm_tipreport id AS ts_tipreport  OUTPUT name \
 | rename ts_tipreport AS tipreport, ts_itype AS itype


[Threat - High Confidence APT, Malware and C2 Matches - Rule]
action.correlationsearch = 0
action.correlationsearch.enabled = 1
action.correlationsearch.label = APT, malware or C2 indicator match detected
action.email.sendresults = 0
action.notable = 1
action.notable.param.security_domain = threat
action.notable.param.severity = medium
action.notable.param.rule_title = $itype$ match detected from $victim$
action.notable.param.rule_description = High Priority Match: $indicator$ with itype: $itype$
action.notable.param.nes_fields = victim, indicator, itype
action.notable.param.drilldown_name = View raw logs associated with $indicator$
action.notable.param.drilldown_search = `drilldown_filter` sourcetype=$orig_sourcetype$ $indicator$ $victim$ host=$orig_host$  `drilldown_match`
description = Alerts on matches with itypes such as APT, malware or C2
disabled = True
dispatch.earliest_time = -120m@m
dispatch.latest_time = -60m@m
enableSched = 1
cron_schedule = 45 */1 * * *
is_visible = false
request.ui_dispatch_app = SplunkEnterpriseSecuritySuite
search = `ioc_match_display("c2 OR apt OR mal", "itype=\\\"(apt|c2|mal)\\\" min_confidence=80", "(event.ts_itype=*apt* OR event.ts_itype=*c2* OR event.ts_itype=*mal*)" event.ts_confidence>=80)` \
 | rename event.* AS * \
 | table sourcetype, host, source, victim, indicator, ts_itype, src, dest | rename ts_itype AS itype

[Threat - Tor, I2P and Anonymous VPN Matches - Rule]
action.correlationsearch = 0
action.correlationsearch.enabled = 1
action.correlationsearch.label = Tor, I2P or Anonymous VPN match detected
action.email.sendresults = 0
action.notable = 1
action.notable.param.security_domain = low
action.notable.param.severity = medium
action.notable.param.rule_title = $itype$ connection detected
action.notable.param.rule_description = $itype$ connection detected $indicator$:$victim$
action.notable.param.nes_fields = victim, indicator, itype
action.notable.param.drilldown_name = View raw logs associated with $indicator$
action.notable.param.drilldown_search = `drilldown_filter` sourcetype=$orig_sourcetype$ $indicator$ $victim$ host=$orig_host$  `drilldown_match`
description = Alerts on matches with itypes such as anon_vpn, tor or i2p
disabled = True
dispatch.earliest_time = -120m@m
dispatch.latest_time = -60m@m
enableSched = 1
cron_schedule = 45 */1 * * *
is_visible = false
request.ui_dispatch_app = SplunkEnterpriseSecuritySuite
search = `ioc_match_display("tor OR anon OR i2p","itype=\\\"(anon_vpn|i2p|tor)\\\" min_confidence=80", "(event.ts_itype=*tor_* OR event.ts_itype=*anon_* OR event.ts_itype=*i2p_*) AND event.ts_confidence>=80")` \
 | rename event.* AS * \
 | table sourcetype, host, source, victim, indicator, ts_itype, src, dest | rename ts_itype AS itype

[Threat - New or Recently Updated Indicator Matches - Rule]
action.correlationsearch = 0
action.correlationsearch.enabled = 1
action.correlationsearch.label = Recently Updated Indicator match detected
action.email.sendresults = 0
action.notable = 1
action.notable.param.security_domain = threat
action.notable.param.severity = low
action.notable.param.rule_title = Recently Updated Indicator match $indicator$
action.notable.param.rule_description = Recently updated indicator $indicator$ match
action.notable.param.nes_fields = age, indicator, victim
action.notable.param.drilldown_name = View raw logs associated with $indicator
action.notable.param.drilldown_search = `drilldown_filter` sourcetype=$orig_sourcetype$ $indicator$ $victim$ host=$orig_host$  `drilldown_match`
description = Alerts on recently updated/created indicators from Threatstream
disabled = True
cron_schedule = 45 */1 * * *
dispatch.earliest_time = -120m@m
dispatch.latest_time = -60m@m
enableSched = 1
is_visible = false
request.ui_dispatch_app = SplunkEnterpriseSecuritySuite
search = `ioc_match_display("", "", "")` | rename event.* AS * | search Age < 5 | table sourcetype, host, source, victim, indicator, ts_itype, src, dest | rename ts_itype AS itype
