[sandbox_url]
display_location = field_menu
fields = dest_url,url
label = ANY.RUN Submit $@field_value$
link.method = get
link.target = blank
link.uri = /app/TA-anyrun/sandbox_e?url=$@field_value$
type = link

[lookup_ip]
display_location = field_menu
fields = dest_ip,dest_translated_ip,dvc_ip,ip
label = ANY.RUN Lookup ip $@field_value$
link.method = get
link.target = blank
link.uri = /app/TA-anyrun/lookup?query=$@field_value$
type = link

[lookup_domain]
display_location = field_menu
fields = dest_nt_domain,http_referrer_domain,recipient_domain,src_nt_domain,ssl_issuer_email_domain,url_domain,src_user_domain
label = ANY.RUN Lookup domain $@field_value$
link.method = get
link.target = blank
link.uri = /app/TA-anyrun/lookup?query=$@field_value$
type = link

[lookup_hash]
display_location = field_menu
fields = file_hash
label = ANY.RUN Lookup hash $@field_value$
link.method = get
link.target = blank
link.uri = /app/TA-anyrun/lookup?query=$@field_value$
type = link

[lookup_url]
display_location = field_menu
fields = dest_url,url
label = ANY.RUN Lookup url $@field_value$
link.method = get
link.target = blank
link.uri = /app/TA-anyrun/lookup?query=$@field_value$
type = link
