[aws-security-internal-index]
definition = (index="_internal")

[aws-security-cloudtrail-service(2)]
args = service, notable
definition = lookup aws_security_all_eventName eventName OUTPUT function | fillnull value="N/A" function | search function="$service$" | eval notable=if(match(eventName, "(^Get*|^List*|^Describe*)"), 0, 1) | search notable=$notable$

######################
### AWS CloudTrail ###
######################

[aws-security-cloudtrail-index]
definition = (index="main" OR `aws-security-s3-index`)

[aws-security-cloudtrail-sourcetype]
definition = `aws-security-cloudtrail-index` sourcetype="aws:cloudtrail"

[aws-security-cloudtrail(2)]
args = accountId, region
definition = `aws-security-cloudtrail-sourcetype` $accountId$ $region$

#######################################################
### S3 (Access Log: ELB, ALB, CloudFront, S3, etc.) ###
#######################################################

[aws-security-s3-index]
definition = (index="main")

[aws-security-accesslog-sourcetype(1)]
args = resource
definition = `aws-security-s3-index` sourcetype="aws:$resource$:accesslogs"

#######################
### AWS Description ###
#######################

[aws-security-metadata-index]
definition = (index="main")

[aws-security-metadata-sourcetype]
definition = `aws-security-metadata-index` sourcetype="aws:metadata"

[aws-security-metadata-field-extraction]
definition = | eval AccountId=if(isnum(AccountId),AccountId, user_id) , aws_account_id = AccountId, account_id = AccountId

[aws-security-metadata-resource(3)]
args = accountId, region, resource
definition = `aws-security-metadata-sourcetype` source="*:$resource$" `aws-security-metadata-field-extraction` | search $accountId$ $region$  | eventstats latest(_time) as latest_time | eval latest_time=relative_time(latest_time,"-55m") | where _time > latest_time | dedup Id sortby -start_time

[aws-security-metadata(4)]
args = accountId, region, resource, dedupfield
definition = `aws-security-metadata-sourcetype` | search source="*:$resource$" `aws-security-metadata-field-extraction` | search $accountId$ $region$  | eventstats latest(_time) as latest_time | eval latest_time=relative_time(latest_time,"-55m") | where _time > latest_time | dedup $dedupfield$ sortby -_time

######################
### Addon Summary  ###
######################
[aws-security-addon-input-index]
definition = (index=summary)

[aws-security-addon-account-index]
definition = (index=summary)

[aws-security-sourcetype-index-summary]
definition = sourcetype="aws:addon:input" earliest=-1d | dedup input_sourcetype, input_index | table input_sourcetype, input_index

[aws-security-account-summary]
definition = sourcetype="aws:addon:account" | dedup host, account_id, name

##################
### AWS Config ###
##################

[aws-security-config-index]
definition = (index="main" OR `aws-security-s3-index`)

[aws-security-config-sourcetype]
definition = `aws-security-config-index` sourcetype="aws:config"

[aws-security-config-notification-sourcetype]
definition = `aws-security-config-index` sourcetype="aws:config:notification"

[aws-security-config-resources(3)]
args = accountId, region, resourceType
definition = `aws-security-config-sourcetype` $accountId$  resourceType="$resourceType$" | dedup resourceId sortby -_time | where configurationItemStatus!="ResourceDeleted" | search $region$

[aws-security-config-notification(2)]
args = accountId, region
definition = `aws-security-config-notification-sourcetype` $accountId$ $region$

######################
###    Insights    ###
######################

[aws-security-specific-ports-unrestricted-sg(2)]
args = accountId, region
definition = `aws-security-metadata(($accountId$), ($region$), "ec2_security_groups", "GroupId")` | spath output=inbound path=IpPermissions{} | mvexpand inbound | rename VpcId as vpc_id | rename GroupId as id | regex inbound=".*CidrIp\": \"0.0.0.0/0.*" | rex field=inbound ".*ToPort\": [\"]*(?<to_port>[^\",}]*).*" |rex field=inbound ".*FromPort\": [\"]*(?<from_port>[^\",}]*).*" | fields account_id, region, id, vpc_id, to_port, from_port | where [| inputlookup aws_security_sg_ports | search risk="high" | eval searchstr="from_port<=".port." AND to_port>=".port | return 100 $searchstr]  | eval insight="Unrestricted access on specific ports", port=if(from_port=to_port, from_port, from_port." - ".to_port) | fields - to_port, from_port | mvcombine port

[aws-security-unrestricted-access-sg(2)]
args = accountId, region
definition = `aws-security-metadata(($accountId$), ($region$), "ec2_security_groups", "GroupId")` | spath output=inbound path=IpPermissions{} | mvexpand inbound | rename VpcId as vpc_id | rename GroupId as id | regex inbound=".*CidrIp\": \"0.0.0.0/0.*" | rex field=inbound ".*ToPort\": [\"]*(?<to_port>[^\",}]*).*" |rex field=inbound ".*FromPort\": [\"]*(?<from_port>[^\",}]*).*" | fields account_id, region, id, vpc_id, to_port, from_port | where NOT ( [| inputlookup aws_security_sg_ports | eval searchstr="from_port=".port." AND to_port=".port | return 100 $searchstr] ) | eval insight="Unrestricted access", port=if(from_port=to_port, from_port, from_port." ~ ".to_port) | fields - to_port, from_port | mvcombine port

[aws-security-unused-sg(2)]
args = accountId, region
definition = `aws-security-metadata(($accountId$), ($region$), "ec2_security_groups", "GroupId")` | rename VpcId as vpc_id | rename GroupId as id | rename GroupName as name | spath output=instances path=instances{}.id | eval instances_count=mvcount(instances) | where isnull(instances_count) | eval insight="Unused security group" | fields account_id, region, name, id, vpc_id, insight

[aws-security-redundant-sg-helper]
definition = mvexpand rules | rex field=rules ".*\[{(?<grants>[^\]]+).*" | eval grants_len=len(grants), grants=substr(grants,1,grants_len-2), grants=split(grants, "}, {"), grants=mvsort(grants), grants=mvjoin(grants, ","), parameter=replace(rules, ", \"grants\".*]", "") + grants

[aws-security-redundant-sg(2)]
args = accountId, region
definition = `aws-security-metadata(($accountId$), ($region$), "ec2_security_groups", "GroupId")` | spath output=inbound path=IpPermissions{} | spath output=outbound path=IpPermissionsEgress{} | rename inbound as rules | `aws-security-redundant-sg-helper` | rename VpcId as vpc_id | rename GroupId as id| stats values(parameter) as inbound, values(outbound) as rules by account_id, id, region, vpc_id | `aws-security-redundant-sg-helper` | stats values(parameter) as outbound, values(inbound) as inbound by account_id, id, region, vpc_id | eval inbound=mvsort(inbound), outbound=mvsort(outbound) | fields account_id, id, region, inbound, outbound, vpc_id | mvcombine id | eval id_count=mvcount(id), same_ids=id, id=mvindex(id,0)  | where id_count > 1 | eval insight="Redundant security groups"

[aws-security-large-number-rules-sg(2)]
args = accountId, region
definition = `aws-security-metadata(($accountId$), ($region$), "ec2_security_groups", "GroupId")` | spath output=inbound path=IpPermissions{}.IpRanges{} | spath output=outbound path=IpPermissionsEgress{}.IpRanges{} | rename VpcId as vpc_id | eval inbound_count=mvcount(inbound), outbound_count=mvcount(outbound), total_count = inbound_count+outbound_count | where (isnotnull(vpc_id) AND total_count > 50) OR (isnull(vpc_id) AND total_count > 100) | eval insight="Large number of rules"

[aws-security-password-policy-iam(1)]
args = accountId
definition = `aws-security-metadata(($accountId$), ("*"), "iam_users", "Arn")` | dedup account_id | rename PasswordPolicy.AllowUsersToChangePassword as policy, PasswordPolicy.PasswordReusePrevention as reuse  | where isnull(policy) OR isnull(reuse) | eval insight=if(isnull(policy), "No password policy", "Password reuse is not prevented"), UserName="Root Account"

[aws-security-key-rotation-iam(1)]
args = accountId
definition = `aws-security-metadata(($accountId$), ("*"), "iam_users", "Arn")` | spath output=AccessKeys path=AccessKeys{} | eval AccessKeys=mvfilter(match(AccessKeys,".*\"Status\": \"Active\",*")) | fields account_id UserName AccessKeys | mvexpand AccessKeys | rex field=AccessKeys ".*CreateDate\": \"(?<CreateDate>[^\"]*)" | eval CreateDay=strptime(CreateDate, "%FT%T"), diff_days=(now()-CreateDay)/86400 | where diff_days > 90 |fields account_id UserName CreateDate | mvcombine CreateDate | eval insight="IAM access key rotation"

[aws-security-long-unused-iam(1)]
args = accountId
definition = `aws-security-metadata(($accountId$), ("*"), "iam_users", "Arn")` | spath output=AccessKeys path=AccessKeys{} | eval AccessKeys=mvfilter(match(AccessKeys,".*\"Status\": \"Active\",*")) | fields account_id UserName AccessKeys PasswordLastUsed | mvexpand AccessKeys | rex field=AccessKeys ".*LastUsedDate\": \"(?<LastUsedDate>[^\"]*)" | eval ak_used_day=strptime(LastUsedDate, "%FT%T"), ps_used_day=strptime(PasswordLastUsed, "%FT%T"), recent_used_day=max(ak_used_day,ps_used_day), diff_days=(now()-recent_used_day)/86400 | stats min(diff_days) as no_used_days by UserName, account_id | where no_used_days > 30 | eval insight="User is unused for long time"


####################
### VPC Flow Log ###
####################

[aws-security-cloudwatch-logs-index]
definition = (index="main")

[aws-security-vpc-flow-sourcetype]
definition = `aws-security-cloudwatch-logs-index` sourcetype="aws:cloudwatchlogs:vpcflow"

[aws-security-vpc-flow(4)]
args = accountId, interfaces, protocol, vpcflow_action
definition = `aws-security-vpc-flow-sourcetype` $accountId$ $interfaces$ vpcflow_action=$vpcflow_action$ protocol=$protocol$

[aws-security-vpc-flow-log-index]
definition = index="aws_vpc_flow_logs"

###################
###  AWS Utils  ###
###################

[aws-security-pretty-print(1)]
args = field
definition = eval $field$=case(($field$>999999999 OR $field$<-999999999), tostring(round($field$/1000000000, 1))+"B", ($field$>99999 OR $field$<-99999), tostring(round($field$/1000000, 1))+"M", ($field$>999 OR $field$<-999), tostring(round($field$/1000, 1))+"K", true(), $field$)
