### LTM Summaries and Reports ###

[F5 - LTM - Activity by Pool Name - Summary]
action.summary_index = 1
cron_schedule = */59 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = +0s
displayview = flashtimeline
enableSched = 1
request.ui_dispatch_view = flashtimeline
search = sourcetype="ltm_log" | sitop  pool_name
vsid = fx3mgenj


[F5 - LTM - Activity by Dest IP - Summary]
action.summary_index = 1
cron_schedule = */59 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = +0s
displayview = flashtimeline
enableSched = 1
request.ui_dispatch_view = flashtimeline
search = sourcetype="ltm_log" | sitop dest_ip
vsid = fx3mgenj

[F5 - LTM - Connections Over Time - Summary]
action.summary_index = 1
cron_schedule = */59 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = +0s
displayview = flashtimeline
enableSched = 1
request.ui_dispatch_view = flashtimeline
search = sourcetype="ltm_log" | sitimechart count by pool_name
vsid = fx3mgenj

[F5 - LTM - Connections Over Time - Report]
action.email.sendresults = 0
cron_schedule = */10 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = +0s
displayview = flashtimeline
enableSched = 0 
request.ui_dispatch_view = flashtimeline
search = index="summary" F5  LTM  Connections Over Time  Summary | timechart count by pool_name
vsid = fx3rsu63


[F5 - LTM - Activity by Dest IP - Report]
action.email.sendresults = 0
cron_schedule = */59 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = +0s
displayview = flashtimeline
enableSched = 0 
request.ui_dispatch_view = flashtimeline
search = index="summary" F5  LTM  Activity by Dest IP  Summary| top dest_ip | head 20	

[F5 - LTM - Activity by Pool Name - Report]
action.email.sendresults = 0
cron_schedule = */59 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = +0s
displayview = flashtimeline
enableSched = 0 
request.ui_dispatch_view = flashtimeline
search = index="summary" F5  LTM  Activity by Pool Name  Summary | top pool_name | head 20


### GTM Summaries and Reports ###

[F5 - GTM - Activity by Eventtype - Summary]
action.summary_index = 1
cron_schedule = */59 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = +0s
displayview = flashtimeline
enableSched = 1
request.ui_dispatch_view = flashtimeline
search = sourcetype="gtm_log" | sitop  eventtype
vsid = fx3mgenj


[F5 - GTM - Activity by Dest IP - Summary]
action.summary_index = 1
cron_schedule = */59 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = +0s
displayview = flashtimeline
enableSched = 1
request.ui_dispatch_view = flashtimeline
search = sourcetype="gtm_log" | sitop dest_ip
vsid = fx3mgenj

[F5 - GTM - EventTypes Over Time - Summary]
action.summary_index = 1
cron_schedule = */59 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = +0s
displayview = flashtimeline
enableSched = 1
request.ui_dispatch_view = flashtimeline
search = sourcetype="gtm_log" | sitimechart count by eventtype
vsid = fx3mgenj

[F5 - GTM - EventTypes Over Timee - Report]
action.email.sendresults = 0
cron_schedule = */10 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = +0s
displayview = flashtimeline
enableSched = 0 
request.ui_dispatch_view = flashtimeline
search = index="summary" F5  GTM  EventTypes Over Time  Summary | timechart count by eventtype
vsid = fx3rsu63


[F5 - GTM - Activity by Dest IP - Report]
action.email.sendresults = 0
cron_schedule = */59 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = +0s
displayview = flashtimeline
enableSched = 0 
request.ui_dispatch_view = flashtimeline
search = index="summary" F5  GTM  Activity by Dest IP  Summary| top dest_ip | head 20	

[F5 - GTM - Activity by Eventtype - Report]
action.email.sendresults = 0
cron_schedule = */59 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = +0s
displayview = flashtimeline
enableSched = 0 
request.ui_dispatch_view = flashtimeline
search = index="summary" F5  GTM  Activity by Eventtype Summary| top eventtype | head 20	






#######################################################################
#################### INPUTS DASHBOARD SAVED SEACHES ###################
#######################################################################


[Inputs - Recent Changed Files]
search = index=_internal ("/" OR "\\") group=per_source_thruput earliest=-24h source=*metrics.log NOT splunk | dedup series | fields series | rename series as Filename  
dispatch.earliest_time = -24h

[Inputs - Recent Ignored Files]
search = index=_internal source=*splunkd.log earliest=-24h Component="fileclassifiermanager" Message="invalid file*" | fields Message 
dispatch.earliest_time = -24h

[Inputs - Crawl]
search = | crawl | fields source, sourcetype, size


#######################################################################
#################### ADMIN DASHBOARD SAVED SEACHES ####################
#######################################################################

[Admin - System Info]
search = index=_internal source=*splunkd.log Component="loader" Message="system info*"| head 1 | fields Message | fields - _*

[Admin - Splunkd Errors This Hour]
search = index=_internal source="*splunkd.log" earliest=-1h Log_Level="error" | stats count | rangemap field=count low=0-0 elevated=1-9 default=severe
dispatch.earliest_time = -1h

[Admin - Splunkd Avg Access Delay This Hour]
search = index=_internal source="*splunkd_access.log" earliest=-1h | rex "(?<delay>\d+)ms$" | stats avg(delay) as d | eval d = round(d, 3) | rangemap field=d low=0-250 elevated=250-499 default=severe
dispatch.earliest_time = -1h

[Admin - Splunkd Avg Uptime]
search = source="*splunkd.log" index=_internal "splunkd starting" OR "shutting down splunkd" | transaction startswith="splunkd starting" endswith="shutting down splunkd" | stats avg(duration) as avgdur | eval avgdur = round(avgdur/3600,3) | rangemap field=avgdur low=24-99999999 elevated=1-23.999 default=severe 

[Admin - Splunkd Recent Errors]
search = index=_internal source=*splunkd.log (Log_Level="fatal" OR Log_Level="error")| dedup punct| head 100 | fields Message
dispatch.earliest_time = -24h

[Admin - Recent Timestamping Issues]
search = index=_internal source=*splunkd.log Component="dateparserverbose" | dedup Message | fields Message 
dispatch.earliest_time = -24h

[Admin - Splunkweb 404s This Hour]
search = index=_internal 404 source="*web_access.log" earliest=-1h | stats count | rangemap field=count low=0-0 elevated=1-100 default=severe
dispatch.earliest_time = -1h

[Admin - Splunkweb Recent Unhandled Exceptions]
search = index=_internal source=*web_service.log Message="*Traceback*" | dedup Component,Line|rename Message as _raw
dispatch.earliest_time = -24h

[Admin - Splunkweb Recent Errors]
search = index=_internal source=*web_service.log Log_Level=error NOT traceback NOT "request headers"| dedup Message | fields Message
dispatch.earliest_time = -24h

[Admin - Splunkweb Browser Usage]
search = index=_internal source=*web_service.log  userAgent=* | timechart count(userAgent) by userAgent
dispatch.earliest_time = -24h



