[Accelerated Sourcetypes and Datamodels]
alert.digest_mode = 1
action.email.reportServerEnabled = 0
action.keyindicator.invert = 0
alert.track = 0
dispatch.earliest_time = -72h@h
dispatch.latest_time = now
cron_schedule = 0 2 * * *
enableSched = 1
request.ui_dispatch_view = search
search = | rest /services/datamodel/model \
| search NOT acceleration=*false*\
| dedup displayName \
| fields acceleration displayName title  \
| map  search="\
| tstats summariesonly=true values(sourcetype) AS sourcetypes from datamodel=$title$ where NOT sourcetypes="*-too_small"\
| eval datamodel=\"$title$\"" maxsearches=20\
| mvexpand sourcetypes\
| table sourcetypes datamodel\
| outputlookup sourcetype_datamodel_lookup.csv
