#vsid = g00rwm0v
[ExchangeSrv Sender Mail Size timechart]
action.email.sendresults = 0
action.summary_index = 1
cron_schedule = */10 * * * *
#dispatch.earliest_time = 1220025600
#dispatch.latest_time = 1220112000
displayview = flashtimeline
enableSched = 1
request.ui_dispatch_view = flashtimeline
search = sourcetype="exchangelog2003" NOT Sender="-" AND EventID=1019 | eval MbSize=Size/1048576 | timechart sum(MbSize) by Sender useother=f usenull=f
#vsid = *:1hvrwxnj


[ExchangeSrv Mail in queue count by size timechart]
action.email.inline = 1
action.summary_index = 1
cron_schedule = */10 * * * *
displayview = flashtimeline
enableSched = 1
realtime_schedule = 0
request.ui_dispatch_view = flashtimeline
search = sourcetype="exchangelog2003" EventID=1033 OR EventID=1034 OR EventID=1036 OR EventID=1038 | eval MbSize=Size/1048576 | timechart sum(MbSize)

[ExchangeSrv Mail in queue timechart]
action.email.inline = 1
action.summary_index = 1
cron_schedule = */10 * * * *
displayview = flashtimeline
enableSched = 1
realtime_schedule = 0
request.ui_dispatch_view = flashtimeline
search = sourcetype="exchangelog2003" EventID=1033 OR EventID=1034 OR EventID=1036 OR EventID=1038 | timechart count

[ExchangeSrv Mail Size Flow]
action.email.inline = 1
action.summary_index = 1
cron_schedule = *30 * * * *
displayview = flashtimeline
enableSched = 1
realtime_schedule = 0
request.ui_dispatch_view = flashtimeline
search = sourcetype="exchangelog2003"AND EventID=1019 | eval MbSize=Size/1048576 | timechart sum(MbSize)

[ExchangeSrv Recipient Maile Size timechart]
action.email.inline = 1
action.summary_index = 1
alert.suppress = 0
alert.track = 0
cron_schedule = */10 * * * *
displayview = flashtimeline
enableSched = 1
realtime_schedule = 0
request.ui_dispatch_view = flashtimeline
search = sourcetype="exchangelog2003" NOT Recipient="-" AND EventID=1019 NOT Recipient=OTHER | eval MbSize=Size/1048576 | timechart sum(MbSize) by Recipient useother=f usenull=f

[ExchnageSrv Spam mail]
action.email.inline = 1
action.summary_index = 1
alert.suppress = 0
alert.track = 0
cron_schedule = */30 * * * *
enableSched = 1
quantity = 0
realtime_schedule = 0
relation = greater than
search = sourcetype="exchangelog2003" Subject="FW: 您被攔截的郵件明細*"  | timechart count | where count > 0

[ExchangeSrv Top Senders]
action.email.reportServerEnabled = 0
action.summary_index = 1
cron_schedule = 0 0 * * *
displayview = flashtimeline
enableSched = 1
realtime_schedule = 0
request.ui_dispatch_view = flashtimeline
search = sourcetype="exchangelog2003" NOT Sender="-"  AND EventID=1031 | Top Sender
vsid = *:8ahpv0gq

[ExchangeSrv Top Senders by total mail size]
cron_schedule = 0 0 * * *
enableSched = 1
displayview = report_builder_display
request.ui_dispatch_view = report_builder_display
search = sourcetype="exchangelog2003" NOT Sender="-" AND EventID=1019 | eval MbSize=Size/1048576 | stats sum(MbSize) by Sender | sort sum(MbSize) over Sender desc | head 10
vsid = *:gnr2yl8s

[ExchangeSrv Top Recipients by total mail size]
cron_schedule = 0 0 * * *
enableSched = 1
displayview = report_builder_display
request.ui_dispatch_view = report_builder_display
search = sourcetype="exchangelog2003" NOT Recipient="-" AND EventID=1019 | eval MbSize=Size/1048576 | stats sum(MbSize) by Recipient | sort sum(MbSize) over Recipient desc | head 10
vsid = *:gnr3kfvi

#Exchange 2007 SavedSearch.

[Exchange2007 send mail count timechart]
action.email.inline = 1
action.email.reportServerEnabled = 0
action.summary_index = 1
alert.suppress = 0
alert.track = 0
cron_schedule = 0 0 * * *
displayview = report_builder_display
enableSched = 1
realtime_schedule = 0
request.ui_dispatch_view = report_builder_display
search = sourcetype="exchangelog2007" event_id="SEND" | timechart count
vsid = *:gnr8byic

[Exchange2007 BADMAIL count]
action.summary_index = 1
cron_schedule = */10 * * * *
displayview = flashtimeline
enableSched = 1
realtime_schedule = 0
request.ui_dispatch_view = flashtimeline
search = sourcetype="exchangelog2007" event_id="BADMAIL" | stats count as count | rangemap field=count low=0-100 elevated=101-200 default=sever
vsid = gnshl7vq


[Exchange2007 FAILMAIL count]
action.summary_index = 1
cron_schedule = */10 * * * *
displayview = flashtimeline
enableSched = 1
request.ui_dispatch_view = flashtimeline
search = sourcetype="exchangelog2007" event_id="FAIL" | stats count as count | rangemap field=count low=0-100 elevated=101-200 default=sever
vsid = gnsnqsoq

[Exchange2007 DUPLICATEDELIVER count]
action.summary_index = 1
cron_schedule = */10 * * * *
displayview = flashtimeline
enableSched = 1
realtime_schedule = 0
request.ui_dispatch_view = flashtimeline
search = sourcetype="exchangelog2007" event_id="DUPLICATEDELIVER"  | stats count as count | rangemap field=count low=0-100 elevated=101-200 default=sever
vsid = gnso49u9

[Exchange2007 DEFER count]
action.summary_index = 1
cron_schedule = */10 * * * *
displayview = flashtimeline
enableSched = 1
realtime_schedule = 0
request.ui_dispatch_view = flashtimeline
search = sourcetype="exchangelog2007" event_id="DEFER" | stats count as count | rangemap field=count low=0-100 elevated=101-200 default=sever

[Exchange2007 FAILMAIL Source Component]
action.summary_index = 1
cron_schedule = */10 * * * *
displayview = flashtimeline
enableSched = 1
realtime_schedule = 0
request.ui_dispatch_view = flashtimeline
search = sourcetype="exchangelog2007" event_id="FAIL" | stats count by log_source
vsid = gnspi02a

[Exchange2007 DuplicateDeliver Mails Recipient]
action.summary_index = 1
cron_schedule = 0 0 * * *
displayview = flashtimeline
enableSched = 1
request.ui_dispatch_view = flashtimeline
search = sourcetype="exchangelog2007" event_id="DUPLICATEDELIVER" | makemv delim=";" recipient_address | top recipient_address
vsid = gnty0612

[ExchangeSrv Top Recipients]
action.summary_index = 1
cron_schedule = 0 0 * * *
displayview = flashtimeline
enableSched = 1
realtime_schedule = 0
request.ui_dispatch_view = flashtimeline
search = sourcetype="exchangelog2003" NOT Recipient="-" AND EventID=1019 | top Recipient limit=10
vsid = *:mhhwt0i3

[Exchange2007 Top Recipients]
action.summary_index = 1
cron_schedule = 0 0 * * *
displayview = flashtimeline
enableSched = 1
request.ui_dispatch_view = flashtimeline
search = sourcetype="exchangelog2007" event_id="DELIVER" | makemv delim=";" recipient_address | top limit=10 recipient_address useother=f
vsid = goe53sy8

[Exchange2007 Top Senders]
action.summary_index = 1
cron_schedule = 0 0 * * *
displayview = flashtimeline
enableSched = 1
realtime_schedule = 0
request.ui_dispatch_view = flashtimeline
search = sourcetype="exchangelog2007" event_id="DELIVER" | top limit=10 sender_address useother=f
vsid = *:blnimgst

[Exchange2007 Top Senders by Total Mails Size]
cron_schedule = 0 0 * * *
enableSched = 1
displayview = report_builder_display
request.ui_dispatch_view = report_builder_display
search = sourcetype="exchangelog2007" NOT sender_address="-" AND event_id="DELIVER" | eval MbSize=total_bytes/1024 | stats sum(MbSize) by sender_address | sort sum(MbSize) over sender_address desc | head 10

[Exchange2007 Top Recipients by Total Mails Size]
cron_schedule = */1 * * * *
enableSched = 1
displayview = report_builder_display
request.ui_dispatch_view = report_builder_display
search = sourcetype="exchangelog2007" | makemv delim=";" recipient_address | eval MbSize=total_bytes/1048576 | stats sum(MbSize) by recipient_address | sort sum(MbSize) over recipient_address desc | head 10
