[windows-rename-user]
SOURCE_KEY = User
REGEX = (?<user>.*)

[windows-rename-user2]
SOURCE_KEY = User_Name
REGEX = (?<user>.*)

[windows-rename-user3]
SOURCE_KEY = Target_Account_Name
REGEX = (?<user>.*)

[windows-eventid]
SOURCE_KEY = EventCode
REGEX = (?<event_id>.*)

[windows-group]
SOURCE_KEY = Primary_Group_ID
REGEX = (?<user_group_id>.*)

[windows-src_ip]
REGEX = (?:Client|Source Network) Address:\s+(\d+\.\d+\.\d+\.\d+)
FORMAT = src_ip::$1

[windows-src_port]
REGEX = Source Port:\s+(\d+)
FORMAT = src_port::$1

[windows-process]
REGEX = Image File Name:\s+([^\n]+)
FORMAT = process::$1

#REGEX = (?:Caller|Primary|Client) Domain:\s+([^\n]*)
[windows-src_nt_domain-1]
SOURCE_KEY = Caller_Domain
REGEX = (.*)
FORMAT = src_nt_domain::$1

[windows-src_nt_domain-2]
SOURCE_KEY = Primary_Domain
REGEX = (.*)
FORMAT = src_nt_domain::$1

[windows-src_nt_domain-3]
SOURCE_KEY = Client_Domain
REGEX = (.*)
FORMAT = src_nt_domain::$1

#REGEX = (?:Target )?Domain:\s+([^\n]*)
[windows-dest_nt_domain-1]
SOURCE_KEY = Target_Domain
REGEX = (.*)
FORMAT = dest_nt_domain::$1

[windows-dest_nt_domain-2]
SOURCE_KEY = Domain
REGEX = (.*)
FORMAT = dest_nt_domain::$1

[windowsupdate-extracts]
REGEX = ^\S+\s+\S+\s+(?<pid>\S+)\s+(?<tid>\S+)\s+(?<component>\S+)\s+(?<text>.*)$

[windowsupdate-kbnum]
REGEX = \(KB\s*(?<kb_num>\d+)\)

[transformDNSLocation]
REGEX  = (\(\d*\))*)=.
FORMAT = $1::$2

#Exchange2003 fields
[ClientIP]
REGEX = (?i)^\s*(?:[^#\t]*\t){2}(?P<ClientIP>[^\t\-]*)

[ClienthostName]
REGEX = (?i)^\s*(?:[^#\t]*\t){3}(?P<ClienthostName>[^\t\-]*)

[PartnerName]
REGEX = (?i)^\s*(?:[^#\t]*\t){4}(?P<PartnerName>[^\t\-]*)

[ServerhostName]
REGEX = (?i)^\s*(?:[^#\t]*\t){5}(?P<ServerhostName>[^\t\-]*)

[ServerIP]
REGEX = (?i)^\s*(?:[^#\t]*\t){6}(?P<ServerIP>[^\t\-]*)

[Recipient]
REGEX = (?i)^\s*(?:[^#\t]*\t){7}(?P<Recipient>[^\t]*)

[EventID]
REGEX = (?i)^\s*(?:[^#\t]*\t){8}(?P<EventID>[^\t]*)

[MSGID]
REGEX = (?i)^\s*(?:[^#\t]*\t){9}(?P<MSGID>[^\t\-]*)

[Priority]
REGEX = (?i)^\s*(?:[^#\t]*\t){10}(?P<Priority>[^\t\-]*)

[RecipientReportStatus]
REGEX = (?i)^\s*(?:[^#\t]*\t){11}(?P<RecipientReportStatus>[^\t\-]*)

[Size]
REGEX = (?i)^\s*(?:[^#\t]*\t){12}(?P<Size>[^\t\-]*)

[RecipientNumbers]
REGEX = (?i)^\s*(?:[^#\t]*\t){13}(?P<RecipientNumbers>[^\t\-]*)

[OriginationTime]
REGEX = (?i)^\s*(?:[^#\t]*\t){14}(?P<OriginationTime>[^\t\-]*)

[Encryption]
REGEX = (?i)^\s*(?:[^#\t]*\t){15}(?P<Encryption>[^\t\-]*)

[ServiceVersion]
REGEX = (?i)^\s*(?:[^#\t]*\t){16}(?P<ServiceVersion>[^\t\-]*)

[LinkedMSGID]
REGEX = (?i)^\s*(?:[^#\t]*\t){17}(?P<LinkedMSGID>[^\t\-]*)

[Subject]
REGEX = (?i)^\s*(?:[^#\t]*\t){18}(?P<Subject>[^\t\-]*)

[Sender]
REGEX = (?i)^\s*(?:[^#\t]*\t){19}(?P<Sender>[^\t]*)



#Exchange2007 fields
[exchange2007fields]
DELIMS=","
FIELDS = date_time, client_ip, client_hostname, server_ip, server_hostname, source_context, connector_id, log_source, event_id, internal_message_id, message_id, recipient_address, recipient_status, total_bytes, recipient_count, related_recipient_address, reference, message_subject, sender_address, return_path, message_info

