[sqlinjection_pattern(2)]
args = sourcetype, uri_query_field
definition = | rex field=$uri_query_field$ "(?<injection>(?i)select.*?from|union.*?select|\\'$|delete.*?from|update\\W.*?set|alter.*?table|(\'|\"|\`|\%27|\%22)(\s|\+)*or(\s|\+)*(\'|\"|\`|\%27|\%22|\d)|group.*by|(?i):sleep\\(\\s*?\\d*?\\s*?\\)|benchmark\\(.*?\\,.*?\\)|(?i):[\\s()]case\\s*?\\(|\\)\\s*?like\\s*?\\(|having\\s*?[^\\s]+\\s*?[^\\w\\s]|if\\s?\\([\\d\\w]\\s*?[=<>~]\\)|\\\\.\\\\.sysdatabases|(?:\\[\\$(?:ne|eq|lte?|gte?|n?in|mod|all|size|exists|type|slice|x?or|div|like|between|and)\\]))|(?:create\\s+(?:procedure|function)\\s*?\\w+\\s*?\\(\\s*?\\)\\s*?-|;\\s*?(?:declare|open)\\s+[\\w-]+|procedure\\s+analyse\\s*?\\(|declare[^\\w]+[@#]\\s*?\\w+|exec\\s*?\\(\\s*?\\@\\)\\))"\
|search injection=*
iseval = 0

[sqlinjection_stats(2)]
args = sourcetype, uri_query_field
definition = sourcetype="$sourcetype$"|eval len=len($uri_query_field$)\
|eventstats avg(len) as avg stdev(len) as stdev\
|where len>(3*stdev+avg)\
|rex field=$uri_query_field$ "(?<injection>(?i)select.*?from|union.*?select|\'$|delete.*?from|update\W.*?set|alter.*?table|((\'|\')*(\ )*=(\ )*(\'|\'|\`).*?)|=(\'|\').*?or|group.by)" |search injection=*
iseval = 0
disabled = 0

[get_asset(1)]
args = subject
definition = `get_asset_by("str",$subject$)` | `get_asset_by("cidr",$subject$)`$

[get_asset_by(2)]
args = key,subject
definition = lookup update=true asset_lookup_by_$key$ key as "$subject$" OUTPUT$
errormsg = key (arg1) must be one of: str or cidr
iseval = 0
validation = (key=="str" OR key=="cidr")

[ctime(1)]
definition = `ctime($field$, "%m/%d/%Y %H:%M:%S")`
iseval = 0
args = field

[ctime(2)]
definition = convert timeformat="$format$" ctime($field$)
iseval = 0
args = field,format

[ctime(3)]
args = inField,outField,format
definition = `ctime($inField$,"$format$")` as $outField$
iseval = 0

[pvx_indexes]
definition = index=pvx
iseval = 0

[pvx_threat_intelligence]
definition = index=pvx_ti OR index=pvx_ti_domain
iseval = 0

[summariesonly]
definition = summariesonly=true
iseval = 0

[dynamic_dns_providers]
definition = lookup update=true dynamic_dns_providers_default dynamic_dns_domains as query OUTPUTNEW isDynDNS_default | lookup update=true dynamic_dns_providers_local dynamic_dns_domains as query OUTPUTNEW isDynDNS_local| eval isDynDNS = coalesce(isDynDNS_default, isDynDNS_local)|fields - isDynDNS_default, isDynDNS_local| search isDynDNS=True

[dynamic_dns_web_traffic]
definition = lookup update=true dynamic_dns_providers_default dynamic_dns_domains as url OUTPUTNEW isDynDNS_default | lookup update=true dynamic_dns_providers_local dynamic_dns_domains as url OUTPUTNEW isDynDNS_local| eval isDynDNS = coalesce(isDynDNS_default, isDynDNS_local)|fields - isDyn_default, isDynDNS_local| search isDynDNS=True

[internal_subnets]
definition = (all.src_ip=192.168.0.0/16 OR all.src_ip=172.16.0.0/12 OR all.src_ip=10.0.0.0/8)
iseval = 0

[internal_src]
definition = (all.src_ip=192.168.0.0/16 OR all.src_ip=172.16.0.0/12 OR all.src_ip=10.0.0.0/8)
iseval = 0

[internal_dest]
definition = (all.dest_ip=192.168.0.0/16 OR all.dest_ip=172.16.0.0/12 OR all.dest_ip=10.0.0.0/8)
iseval = 0


[multicast_ip_range_dest]
definition = (all.dest_ip=224.0.0.0/4 OR all.dest_ip="f*" OR all.dest_ip=239.255.255.250 OR all.dest_ip=*.255)
iseval = 0

[multicast_ip_range_src]
definition = (all.src_ip=224.0.0.0/4 OR all.src_ip="f*" OR all.src_ip=239.255.255.250 OR all.src_ip=*.255)
iseval = 0

[broadcast_ip_dest]
definition = (all.dest_ip="*.255")
iseval = 0

[corporate_dns]
definition = (all.dest_ip="1.1.1.1" OR all.dest_ip="8.8.8.8" OR all.dest_ip="208.67.222.222" OR all.dest_ip="208.67.220.220" OR `internal_dest`)
iseval = 0

[external_src]
definition = (all.src_ip=192.168.* OR all.src_ip=10.* OR all.src_ip=172.16.* OR all.src_ip=172.17.* OR all.src_ip=172.18.* OR all.src_ip=172.19.* OR all.src_ip=172.19.* OR all.src_ip=172.20.* OR all.src_ip=172.21.* OR all.src_ip=172.22.* OR all.src_ip=172.23.* OR all.src_ip=172.24.* OR all.src_ip=172.25.* OR all.src_ip=172.26.* OR all.src_ip=172.27.* OR all.src_ip=172.28.* OR all.src_ip=172.29.* OR all.src_ip=172.30.* OR all.src_ip=172.31.* OR all.src_ip=172.32.* OR all.src_ip=224.* OR all.src_ip=ff*)
iseval = 0

[internal_destination]
definition = (all.dest_ip=192.168.* OR all.dest_ip=10.* OR all.dest_ip=172.16.* OR all.dest_ip=172.17.* OR all.dest_ip=172.18.* OR all.dest_ip=172.19.* OR all.dest_ip=172.19.* OR all.dest_ip=172.20.* OR all.dest_ip=172.21.* OR all.dest_ip=172.22.* OR all.dest_ip=172.23.* OR all.dest_ip=172.24.* OR all.dest_ip=172.25.* OR all.dest_ip=172.26.* OR all.dest_ip=172.27.* OR all.dest_ip=172.28.* OR all.dest_ip=172.29.* OR all.dest_ip=172.30.* OR all.dest_ip=172.31.* OR all.dest_ip=172.32.*)
iseval = 0

[lookup_time(2)]
args = earliest, latest
definition = | rename result._time as result_time\
| eval earliest_time="$earliest$"\
| eval earliest_cur=if(earliest_time="0", "-10y@y", "$earliest$")\
| eval earliest=round(relative_time(now(), earliest_cur))\
| eval latest_time="$latest$"\
| eval latest_cur=if(latest_time="now" OR latest_time="", "-0m@m", "$latest$")\
| eval latest=round(relative_time(now(), latest_cur))\
| where (result_time>=earliest AND result_time<=latest)
iseval = 0

[sql_query_dump(2)]
args = command, query
definition = | rex field=$query$ "(?<querys>(?i)(BACKUP.?(DATABASE|TABLE)|SELECT.*.INTO.?OUTFILE|LOAD.DATA.INFILE.*.INTO.?TABLE))"\
| search querys=*
iseval = 0

[xss_detection(1)]
args = uri
definition = | rex field=$uri$ "(?<injection>((\%3C)|<)((\%2F)|\/)*[a-z0-9\%]+((\%3E)|>)|(?i)<(?:a|abbr|acronym|address|applet|area|audioscope|b|base|basefront|bdo|bgsound|big|blackface|blink|blockquote|body|bq|br|button|caption|center|cite|code|col|colgroup|comment|dd|del|dfn|dir|div|dl|dt|em|embed|fieldset|fn|font|form|frame|frameset|h1|head|hr|html|i|iframe|ilayer|img|input|ins|isindex|kdb|keygen|label|layer|legend|li|limittext|link|listing|map|marquee|menu|meta|multicol|nobr|noembed|noframes|noscript|nosmartquotes|object|ol|optgroup|option|p|param|plaintext|pre|q|rt|ruby|s|samp|script|select|server|shadow|sidebar|small|spacer|span|strike|strong|style|sub|sup|table|tbody|td|textarea|tfoot|th|thead|title|tr|tt|u|ul|var|wbr|xml|xmp)\W)"\
| search injection=*
iseval = 0

[sql_query_drop(2)]
args = command, query
definition = | rex field=$query$ "(?<querys>(?i)(DROP.?(TABLE|DATABASE))|DELETE.?FROM)"\
| search querys=*
iseval = 0

[codeinjection_pattern(2)]
args = sourcetype, uri_query_field
definition = sourcetype="$sourcetype$"\
| rex field=$uri_query_field$ "(?<injection>(?i)(&&|\||\`|\{|\}|;|&lt|:)*(ifconfig|pwd|\$\_SERVER\[|whoami|\%SYSTEMROOT\%|exec\%20|exec\(|eval\(|system\(|etc.?(passwd|shadow)|(bin|usr).?(cat|bin)|ping.?(\-|.?)))"\
| search injection=*
iseval = 0

[no_internal_ip]
definition = (all.src_ip!=192.168.* all.src_ip!=10.* AND all.src_ip!=172.16.* AND all.src_ip!=172.17.* AND all.src_ip!=172.18.* AND all.src_ip!=172.19.* AND all.src_ip!=172.19.* AND all.src_ip!=172.20.* AND all.src_ip!=172.21.* AND all.src_ip!=172.22.* AND all.src_ip!=172.23.* AND all.src_ip!=172.24.* AND all.src_ip!=172.25.* AND all.src_ip!=172.26.* AND all.src_ip!=172.27.* AND all.src_ip!=172.28.* AND all.src_ip!=172.29.* AND all.src_ip!=172.30.* AND all.src_ip!=172.31.* AND all.src_ip!=172.32.* AND all.src_ip!=224.* AND all.src_ip!=ff*)
iseval = 0

[vulnerability_ua]
definition = (all.http_user_agent="*Nikto/*" OR all.http_user_agent="*sqlmap/*" OR all.http_user_agent="*python*" OR all.http_user_agent="*ZmEu*" OR all.http_user_agent="*Joorge*" OR all.http_user_agent="*NESSUS*" OR all.http_user_agent="*nessus*" OR all.http_user_agent="*OpenVAS*" OR all.http_user_agent="*curl/*")
iseval = 0

[legitimate_upload_traffic]
definition = (site!="*archive.ubuntu.com" site!="*microsoft.com" site!="*.volia.net" site!="*.windowsupdate.com" site!="*.postgresql.org" site!="*.koyanet.lv") OR (ssl_subject_common_name!="*archive.ubuntu.com" ssl_subject_common_name!="*microsoft.com" ssl_subject_common_name!="*.volia.net" ssl_subject_common_name!="*.windowsupdate.com" ssl_subject_common_name!="*.postgresql.org" ssl_subject_common_name!="*.koyanet.lv")
iseval = 0

[command_injection(1)]
args = sourcetype
definition = | rex field=URI "(?<injection>(&&|\||\`|\{|\}|;|&lt|:)*(ifconfig\s|pwd\s|\$\_SERVER\[|whoami\s|\%SYSTEMROOT\%|exec\%20|exec\(|eval\(|system\(|etc.(passwd|shadow)|(bin|usr)\s(cat|bin)|(ping\W(\-[a-z])\s([1,9]))))"\
| search injection=*
iseval = 0

[public_dns]
definition = (all.dest_ip=8.8.8.8 OR all.dest_ip=1.1.1.1)
iseval = 0

[high_risk_countries]
definition = "China|North Corea|Russia"
iseval = 0

[query_local]
definition = all.query="*.local"
iseval = 0

[drop_dm_object_name(1)]
args = object
definition = rename "$object$.*" as *
iseval = 0

[alert_severity]
definition = | lookup alerts_severity rulename AS ruleName OUTPUT probability \
| lookup assets IP AS Source OUTPUT Priority as priority_src\
| lookup assets IP AS Destination OUTPUT Priority as priority_dest\
| eval asset_severity_src = if(priority_src="Low", 2, if(priority_src="Medium", 3, if(priority_src="High", 4, if(priority_src="Critical", 5, 3))))\
| eval asset_severity_dest = if(priority_dest="Low", 2, if(priority_dest="Medium", 3, if(priority_dest="High", 4, if(priority_dest="Critical", 5, 3))))\
| eval asset_severity = if(asset_severity_src>=asset_severity_dest, asset_severity_src, asset_severity_dest)\
| eval severity_score=(probability*asset_severity)/5*5 \
| eval severity = if(severity_score<=10, "Low", if(severity_score>=11 AND severity_score<=15, "Medium", if(severity_score>=16 AND severity_score<=20, "High", if(severity_score>=21, "Critical", "Medium")))) \
| fields - severity_score, asset_severity, priority, probability, asset_severity_dest, asset_severity_src, priority_src, priority_dest
iseval = 0

[whitelist]
definition = | eval check = wl_source+wla_dest\
| eval check2 = wla_source+wl_dest\
| eval check3 = wl_source+wl_dest\
| search NOT check=* AND NOT check2=* AND NOT check3=*\
| fields - dest_all, source_all, check, check2, check3, wla_dest, wla_source, wl_dest, wl_source
iseval = 0

[lateral_movement_protocols]
definition = (all.app="NetBT SS" OR all.app="ssh" OR all.app="smb" OR all.app="MS WMI" OR all.app="rdp" OR all.app="vnc" OR (all.dest_port=5985 OR all.dest_port=5986) OR (all.dest_port=135 AND all.dcerpc!=null))
iseval = 0
