#
# DO NOT EDIT THIS FILE!
#
# Iguana Web Analytics App for Splunk® | Saved Searches
#

# Please review/revise
[File Ingestion]
disabled = 0
search = index=_internal sourcetype=splunkd IWA | rex "(?<=finished\sfile\singestion:\s)(?<File>\/.+$)" | search File=* | eval Completed=strftime(_time, "%D %T") | table File, Completed
is_visible = true
description = This description is for Visitors per Section/Subsection over time report.

## ALERTS
[Bounce Rate Threshold]
disabled = 0
search = | from datamodel:Visit_Info | stats count(hitid) as hits by visitor_id | eval bounce=if(hits=1,1,0) | stats count(visitor_id) as total_visits, sum(bounce) as total_bounce | eval bounce_rate=round(total_bounce/total_visits*100,2)."%" | rename bounce_rate as "Bounce Rate", total_bounce as "Total Bounce", total_visits as "Total Visits" | fields "Bounce Rate"
is_visible = true
description = This alert will notify the recipient on when the Bounce Rate exceeds the configured threshold.
alert.track = 1
alert_condition = search "Bounce Rate">=75
cron_schedule = 0 12 * * 5
dispatch.earliest_time = -1w
enableSched = 0

[Visitor Count yesterday exceeded peak of Previous 5 days]
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = 00 01 * * *
dispatch.earliest_time = -10d
dispatch.latest_time = now
display.general.type = statistics
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = IguanaWebAnalytics
request.ui_dispatch_view = search
search = `iwa_index` earliest = -7d@d latest=-2d@d | bucket span=1d _time | stats dc(visitor_id) as visitor_count by _time | stats max(visitor_count) as prev_max_visitor_count | appendcols [search `iwa_index` earliest = -1d@d latest=-0d@d | bucket span=1d _time | stats dc(visitor_id) as current_visitor_count] | where current_visitor_count > prev_max_visitor_count

[Bots (Occurrence of same IP consecutively more than 10 times) in Last 1 day]
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = 00 01 * * *
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
display.general.type = statistics
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = IguanaWebAnalytics
request.ui_dispatch_view = search
search = |from datamodel:Visit_Info.Exclude_hits | fields _time, ip | bucket span=1s _time | sort _time\
  | autoregress ip | eval sameAsNext=if(ip=ip_p1,1,0) | streamstats current=t count(eval(sameAsNext=0)) AS sessionID | eventstats count AS inArowCount BY sessionID | where inArowCount>=10 | table _time, visit_id, visitor_id, ip

[Bounce Rate Greater Than 60 Percent In Last 1 Day]
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = 00 01 * * *
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
display.general.type = statistics
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = IguanaWebAnalytics
request.ui_dispatch_view = search
search = | from datamodel:Visit_Info.Exclude_hits | fields _time, hit_id, visit_id | stats count(hit_id) as hits by visit_id | eval bounce=if(hits=1,1,0) | stats count(visit_id) as total_visits, sum(bounce) as total_bounce | eval bounce_rate= total_bounce/total_visits * 100 | where bounce_rate > 60 | rename bounce_rate as "Bounce Rate", total_bounce as "Total Bounce", total_visits as "Total Visits"

[Pages and their Page views in Last 1 Day]
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = 00 01 * * *
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
display.general.type = statistics
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = IguanaWebAnalytics
request.ui_dispatch_view = search
search = | from datamodel:Page_Statistics.Exclude_hits | fields _time, post_page_event, post_pagename | search post_page_event = 0 | stats count by post_pagename

[Paid Search Keywords Last 1 Day]
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = 00 01 * * *
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = IguanaWebAnalytics
request.ui_dispatch_view = search
search = | from datamodel:Page_Statistics.Exclude_hits  | fields post_page_event, visitor_id, visit_id, language, visit_search_engine, visit_keywords, paid_search, _time  | search post_page_event = 0 AND paid_search = 1

[Return Visitors Less Than 30 Percent in Last 7 Days]
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = 00 01 * * *
dispatch.earliest_time = -7d@h
dispatch.latest_time = now
display.general.type = statistics
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = IguanaWebAnalytics
request.ui_dispatch_view = search
search = | from datamodel:Visit_Info.Exclude_hits | fields _time, visitor_id, visit_num | search | where  visit_num > 1 | stats dc(visitor_id) as return_visitor_count | appendcols [| from datamodel:Page_Statistics.Exclude_hits | fields _time, visitor_id, visit_num | search | stats dc(visitor_id) as visitor_count] | eval return_visitor_percentage = return_visitor_count/visitor_count * 100 | table visitor_count, return_visitor_count, return_visitor_percentage | where return_visitor_percentage < 30

[Searched Keywords in Last 1 Day]
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = 00 01 * * *
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
display.general.type = statistics
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = IguanaWebAnalytics
request.ui_dispatch_view = search
search = | from datamodel:Visit_Info.Exclude_hits | fields _time, visit_keywords | bucket span=1d _time | stats count by visit_keywords | replace "::empty::" WITH "Keyword Not Available" in visit_keywords | rename visit_keywords as "Search Keywords"

[Visitor Count of yesterday less than previous 5 days Average]
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = 00 01 * * *
dispatch.earliest_time = -10d
dispatch.latest_time = now
display.general.type = statistics
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = IguanaWebAnalytics
request.ui_dispatch_view = search
search = `iwa_index` earliest = -7d@d latest=-2d@d | bucket span=1d _time | stats dc(visitor_id) as visitor_count by _time | stats avg(visitor_count) as avg_visitor_count | appendcols [search `iwa_index` earliest = -1d@d latest=-0d@d | bucket span=1d _time | stats dc(visitor_id) as current_visitor_count] | where current_visitor_count > avg_visitor_count

# Lookup Creation
# [Custom Events Variables - Lookup Gen]
# action.email.sendresults = 0
# cron_schedule = 5,20,35,50 * * * *
# description = A necessary step to generate the custom table. RUN ONCE.
# dispatch.earliest_time = -30m@m
# dispatch.latest_time = +0s
# enableSched = 0
# is_visible = true
# search = | inputlookup append=true iwa_adobe_event_lookup] | outputlookup iwa_adobe_custom_event_lookup

[Custom Traffic Variables - Lookup Gen]
action.email.sendresults = 0
cron_schedule = 5,20,35,50 * * * *
description = Maintains a list of custom traffic variables.
dispatch.earliest_time = -30m@m
dispatch.latest_time = +0s
enableSched = 0
is_visible = true
search = | inputlookup append=true iwa_adobe_traffic_variables_lookup | outputlookup iwa_adobe_custom_traffic_variables_lookup