[mandiant_master_lookup]
cron_schedule = 0 */6 * * *
description = Populate the mandiant_master_lookup KV Store with Mandiant indicators
dispatch.earliest_time = -35m
dispatch.latest_time = now
enableSched = 1
realtime_schedule = 0
request.ui_dispatch_app = TA-mandiant-advantage
request.ui_dispatch_view = search
allow_skew = 50%
search = index=`mandiant_indicator_index` sourcetype="mandiant:advantage:indicators" earliest=-`mandiant_indicator_time_window`d mscore>=`mandiant_min_ic_score`| dedup value | rename value as _key | eval last_seen=round(strptime(last_seen_index, "%Y-%m-%dT%H:%M:%S.%fZ")) | rename threat_rating.threat_score as threat_score | rename threat_rating.severity_level as severity_level | rename threat_rating.severity_reason{} as severity_reason | rename category{} as category | rename threat_actor{} as threat_actor | rename malware{} as malware | rename campaigns_list{} as campaigns | rename reports_list{} as reports | table _key id type last_seen sha1 sha256 mscore threat_actor malware category threat_score severity_level severity_reason campaigns reports | outputlookup mandiant_master_lookup

[mandiant_match_vulnerabilities]
disabled = 1
cron_schedule = 30-59/30 * * * *
description = Match Vulnerabilities from the selected indices and sourcetypes
dispatch.earliest_time = -35m
dispatch.latest_time = now
enableSched = 1
realtime_schedule = 0
request.ui_dispatch_app = TA-mandiant-advantage
request.ui_dispatch_view = search
allow_skew = 50%
search = `mandiant_vuln_indices` `mandiant_vuln_srctypes`| rename `mandiant_vuln_host_field` as host_ | table `mandiant_vuln_fields`, host_ | mandiantmatchvulnerabilities

[mandiant_retire_vulnerabilities]
cron_schedule = 0 0 * * *
description = Delete mandiant vulnerabilities that are older than configured days.
dispatch.earliest_time = -1m
dispatch.latest_time = now
schedule_priority = highest
enableSched = 1
realtime_schedule = 0
request.ui_dispatch_app = TA-mandiant-advantage
request.ui_dispatch_view = search
search = | mandiantretirevulns ttl_days=`mandiant_vuln_retiring_days`

[mandiant_match_events_authentication]
disabled = 1
cron_schedule = 30-59/30 * * * *
description = Queries the Authentication CIM Data Model and uses the `mandiantmatchevents` command to correlate the `src` or `dest` fields with Mandiant indicators in the `mandiant_master_lookup`. Results of matched events are added to the `mandiant_matched_events` KV Store.
dispatch.earliest_time = -35m
dispatch.latest_time = now
enableSched = 1
realtime_schedule = 0
request.ui_dispatch_app = TA-mandiant-advantage
request.ui_dispatch_view = search
allow_skew = 50%
search = | datamodel Authentication Authentication search strict_fields=false | fillnull value=NULL | eval data_model="Authentication" | rename Authentication.action as action, Authentication.src, as src, Authentication.user, as user, Authentication.dest as dest | table _time, data_model, index, sourcetype, host, action, src, user, dest | mandiantmatchevents fields="src,dest" data_model="authentication"

[mandiant_match_events_endpoint_process]
disabled = 1
cron_schedule = 30-59/30 * * * *
description = Queries the Endpoint Services CIM Data Model and uses the `mandiantmatchevents` command to correlate the `file_hash` or `dest` fields with Mandiant indicators in the `mandiant_master_lookup`. Results of matched events are added to the `mandiant_matched_events` KV Store.
dispatch.earliest_time = -35m
dispatch.latest_time = now
enableSched = 1
realtime_schedule = 0
request.ui_dispatch_app = TA-mandiant-advantage
request.ui_dispatch_view = search
allow_skew = 50%
search = | datamodel Endpoint Processes search strict_fields=false | fillnull value=NULL | eval data_model="Endpoint Processes" | rename Processes.action as action, Processes.user, as user, Processes.dest as dest, Processes.process_hash as file_hash | table _time, data_model, index, sourcetype, host, action, user, dest, file_hash | mandiantmatchevents fields="file_hash,dest" data_model="endpoint_process"

[mandiant_match_events_endpoint_services]
disabled = 1
cron_schedule = 30-59/30 * * * *
description = Test
dispatch.earliest_time = -35m
dispatch.latest_time = now
enableSched = 1
realtime_schedule = 0
request.ui_dispatch_app = TA-mandiant-advantage
request.ui_dispatch_view = search
allow_skew = 50%
search = | datamodel Endpoint Services search strict_fields=false | fillnull value=NULL | eval data_model="Endpoint Services" | rename Services.user, as user, Services.dest as dest, Services.service_hash as service_hash, Services.service_dll_hash as service_dll_hash | table _time, data_model, index, sourcetype, host, user, dest, service_hash, service_dll_hash | mandiantmatchevents fields="service_hash,service_dll_hash,dest" data_model="endpoint_services"

[mandiant_match_events_endpoint_filesystem]
disabled = 1
cron_schedule = 30-59/30 * * * *
description = Queries the Endpoint Filesystem CIM Data Model and uses the `mandiantmatchevents` command to correlate the `file_hash` or `dest` fields with Mandiant indicators in the `mandiant_master_lookup`. Results of matched events are added to the `mandiant_matched_events` KV Store.
dispatch.earliest_time = -35m
dispatch.latest_time = now
enableSched = 1
realtime_schedule = 0
request.ui_dispatch_app = TA-mandiant-advantage
request.ui_dispatch_view = search
allow_skew = 50%
search = | datamodel Endpoint Filesystem search strict_fields=false | fillnull value=NULL | eval data_model="Endpoint Filesystem" | rename Filesystem.dest as dest, Filesystem.file_hash as file_hash, Filesystem.action as action, Filesystem.user as user | table _time, data_model, index, sourcetype, action, user, file_hash, dest | mandiantmatchevents fields="file_hash,dest" data_model="endpoint_filesystem"

[mandiant_match_events_intrusion_detection]
disabled = 1
cron_schedule = 30-59/30 * * * *
description = Queries the Intrusion Detection CIM Data Model and uses the `mandiantmatchevents` command to correlate the `file_hash`, `src` or `dest` fields with Mandiant indicators in the `mandiant_master_lookup`. Results of matched events are added to the `mandiant_matched_events` KV Store.
dispatch.earliest_time = -35m
dispatch.latest_time = now
enableSched = 1
realtime_schedule = 0
request.ui_dispatch_app = TA-mandiant-advantage
request.ui_dispatch_view = search
allow_skew = 50%
search = | datamodel Intrusion_Detection IDS_Attacks search strict_fields=false | fillnull value=NULL | eval data_model="Intrusion Detection (IDS Attacks)" | rename IDS_Attacks.action as action, IDS_Attacks.file_hash as file_hash, IDS_Attacks.src as src, IDS_Attacks.dest as dest, IDS_Attacks.user as user | table _time, data_model, index, sourcetype, action, host, user, file_hash, src, dest | mandiantmatchevents fields="file_hash,src,dest" data_model="intrusion_detection"

[mandiant_match_events_malware_attacks]
disabled = 1
cron_schedule = 30-59/30 * * * *
description = Queries the Malware Attacks CIM Data Model and uses the `mandiantmatchevents` command to correlate the `file_hash`, `src`, `dest` or `url` fields with Mandiant indicators in the `mandiant_master_lookup`. Results of matched events are added to the `mandiant_matched_events` KV Store.
dispatch.earliest_time = -35m
dispatch.latest_time = now
enableSched = 1
realtime_schedule = 0
request.ui_dispatch_app = TA-mandiant-advantage
request.ui_dispatch_view = search
allow_skew = 50%
search = | datamodel Malware Malware_Attacks search strict_fields=false | fillnull value=NULL | eval data_model="Malware Attacks" | rename Malware_Attacks.file_hash as file_hash, Malware_Attacks.src as src, Malware_Attacks.url as url, Malware_Attacks.action as action, Malware_Attacks.dest as dest, Malware_Attacks.user as user | table _time, data_model, index, sourcetype, file_hash, src, url, action, dest, user | mandiantmatchevents fields="file_hash,src,dest,url" data_model="malware_attacks"

[mandiant_match_events_network_resolution]
disabled = 1
cron_schedule = 30-59/30 * * * *
description = Queries the Network Resolution CIM Data Model and uses the `mandiantmatchevents` command to correlate the `src`, `dest`, or `domain` fields with Mandiant indicators in the `mandiant_master_lookup`. Results of matched events are added to the `mandiant_matched_events` KV Store.
dispatch.earliest_time = -35m
dispatch.latest_time = now
enableSched = 1
realtime_schedule = 0
request.ui_dispatch_app = TA-mandiant-advantage
request.ui_dispatch_view = search
allow_skew = 50%
search = | datamodel Network_Resolution DNS search strict_fields=false | fillnull value=NULL | eval data_model="Network Resolution" | rename DNS.src as src, DNS.dest as dest, DNS.query as domain | table _time, data_model, index, sourcetype, host, src, dest, domain | mandiantmatchevents fields="src,dest,domain" data_model="network_resolution"

[mandiant_match_events_network_traffic]
disabled = 1
cron_schedule = 30-59/30 * * * *
description = Queries the Network Traffic CIM Data Model and uses the `mandiantmatchevents` command to correlate the `src_ip`, `dest_ip`, `src` or `dest` fields with Mandiant indicators in the `mandiant_master_lookup`. Results of matched events are added to the `mandiant_matched_events` KV Store.
dispatch.earliest_time = -35m
dispatch.latest_time = now
enableSched = 1
realtime_schedule = 0
request.ui_dispatch_app = TA-mandiant-advantage
request.ui_dispatch_view = search
allow_skew = 50%
search = | datamodel Network_Traffic All_Traffic search strict_fields=false | fillnull value=NULL | eval data_model="Network Traffic" | rename All_Traffic.action as action, All_Traffic.src_ip, as src_ip, All_Traffic.user, as user, All_Traffic.dest as dest, All_Traffic.dest_ip as dest_ip, All_Traffic.src as src | table _time, data_model, index, sourcetype, host, action, src_ip, user, dest_ip, src, dest | mandiantmatchevents fields="src_ip,dest_ip,src,dest" data_model="network_traffic"

[mandiant_match_events_web]
disabled = 1
cron_schedule = 30-59/30 * * * *
description = Queries the Web CIM Data Model and uses the `mandiantmatchevents` command to correlate the `src`, `dest`, `url` or `domain` fields with Mandiant indicators in the `mandiant_master_lookup`. Results of matched events are added to the `mandiant_matched_events` KV Store.
dispatch.earliest_time = -35m
dispatch.latest_time = now
enableSched = 1
realtime_schedule = 0
request.ui_dispatch_app = TA-mandiant-advantage
request.ui_dispatch_view = search
allow_skew = 50%
search = | datamodel Web Web search strict_fields=false | fillnull value=NULL | eval data_model="Web" | rename Web.action as action, Web.dest as dest, Web.src as src, Web.url as url, Web.url_domain as domain, Web.user as user | table _time, data_model, index, sourcetype, host, action, dest, src, url, domain, user  | mandiantmatchevents fields="src,dest,url,domain" data_model="web"

[mandiant_create_notables]
disabled = 1
description = Queries the `mandiant_matched_events` KV Store for events and uses the `mandiantnotables` command to create a Splunk Notable Alert for each result found
action.correlationsearch.label = Mandiant Intel Hit
action.customsearchbuilder.enabled = 0
action.customsearchbuilder.spec = {}
action.notable = 1
action.notable.param.rule_description = Mandiant Threat Intelligence hit: Found in Data Model: $data_model$; Indicator: $indicator$; Mandiant Indicator Confidence Score: $calculated_risk_score$
action.notable.param.rule_title = Mandiant Matched Event - Indicator Match - $indicator$ in Data Model: $data_model$
action.notable.param.drilldown_name = Mandiant Matched Events
action.notable.param.drilldown_search = | inputlookup mandiant_matched_events | search indicator=$indicator$ notable_created=1 | table _time, index, sourcetype, data_model, action, host, src, src_ip, dest, dest_ip, domain, file_hash, indicator, category, malware, threat_actor, campaigns, reports
action.notable.param.security_domain = threat
action.notable.param.verbose = 0
action.keyindicator.invert = 0
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.param.verbose = 0
action.send2uba.param.verbose = 0
action.threat_add.param.verbose = 0
alert.track = 1
counttype = number of events
cron_schedule = */15 * * * *
dispatch.earliest_time = -15m
dispatch.latest_time = now
dispatch.rt_backfill = 1
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = TA-mandiant-advantage
request.ui_dispatch_view = search
action.risk.forceCsvResults = 1
alert.digest_mode = 0
alert.suppress = 0
search = | inputlookup mandiant_matched_events | eval key=_key | search notable_created=0 | mandiantnotables | rename ic_score as calculated_risk_score | eval vendor_severity=severity | table _time, index, sourcetype, data_model, action, host, src, src_ip, dest, dest_ip, domain, file_hash, indicator, calculated_risk_score, vendor_severity, threat_source_type, category, malware_alias, threat_group, urgency, severity

