
[reg_dot_exe_ran]
action.email.useNSSubject = 1
alert.track = 0
description = sourcetype="wineventlog:microsoft-windows-sysmon/operational" ingests Sysinternals' Sysmon Log
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
dispatchAs = user
display.events.fields = ["host","AccountExpires","AllowedToDelegateTo","AuthenticationPackageName","Caller_Process_ID","Category","Channel","Computer","Creator_Process_ID","Creator_Process_Name","DisplayName","Dummy","Error_Code","EventData_Xml","EventID","EventRecordID","FailureReason","Guid","HandleId","HomeDirectory","HomePath","ImpersonationLevel","IpAddress","IpPort","KeyLength","Level","LmPackageName","Logon_ID","LogonHours","LogonProcessName","LogonType","MemberName","MemberSid","New_Process_ID","New_Process_Name","NewSd","NewTargetUserName","NewTime","NewUacValue","ObjectName","ObjectServer","ObjectType","OldSd","OldTargetUserName","OldUacValue","Opcode","PackageName","PasswordLastSet","PreviousTime","PrimaryGroupId","Parent_Process","Image","ParentImage","BINARY_PATH_NAME","DEPENDENCIES","DISPLAY_NAME","ERROR_CONTROL","FAIL_RESET_PERIOD","FAILURE_ACTIONS","LOAD_ORDER_GROUP","GUID_name","SERVICE_NAME","SERVICE_START_NAME","START_TYPE","TAG","TYPE","GUID_display_name","Additional_Information","Advanced_Options","Algorithm_Name","Caller_Workstation","CommandLine","Configuration","Configuration_Access_Policy","ConfigurationFileHash","CurrentDirectory","DestinationHostname","DestinationIp","DestinationIsIpv6","DestinationPort","DestinationPortName","Disable_Integrity_Checks","EventCode","File_Path","Flight_Signing","Handle_ID","Hashes","HyperVisor_Debugging","HyperVisor_Launch_Type","HyperVisor_Load_Options","ImageLoaded","Initiated","IntegrityLevel","Kernel_Debugging","Key_Name","Key_Type","Load_Options","LogonId","Mandatory_Label","msad_action","Network_Address","New_Security_Descriptor","Number_of_Elements","Object_Name","Object_Server","Object_Type","Operation","ParentCommandLine","ParentProcessGuid","Policy_ID","Port","Protocol","Provider_Name","Return_Code","SchemaVersion","Security_ID","session_id","severity","Sid","Signature","SignatureStatus","Signed","SourceHostname","SourceIp","SourceIsIpv6","SourcePort","SourcePortName","src_ip","src_nt_host","State","System_Event_Logging","Target_Account_Domain","Test_Signing","UtcTime","Version","VSM_Launch_Type","100_Microso Kernel        11_10_1976 8_41_01 AM","Access_Right","Account_Expires","Allowed_To_Delegate_To","COM__Catalog_Collection","Display_Name","Domain_Behavior_Version","Domain_ID","Domain_Name","Force_Logoff","Home_Directory","Home_Drive","Length","Lockout_Duration","Lockout_Observation_Window","Lockout_Threshold","Logon_Hours","Machine_Account_Quota","Max__Password_Age","Min__Password_Age","Min__Password_Length","Mixed_Domain_Mode","MSADChangedAttributes","New_UAC_Value","OEM_Information","Old_Account_Name","Old_UAC_Value","Original_Security_Descriptor","Password_History_Length","Password_Last_Set","Password_Properties","Primary_Group_ID","Profile_Path","PSChildName","PSDrive","PSParentPath","PSPath","PSProvider","ReadCount","SAM_Account_Name","Script_Path","SID_History","Tcpip6       _todo_dll","Tcpip6    _todo_dll","User_Account_Control","user_group_id","User_Parameters","User_Principal_Name","User_Workstations","OsName","OsType","OsBuild","OsVersion","autorun_entry","image_path","publisher","description","autorun_type","app"]
display.events.type = table
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = line
display.visualizations.show = 0
request.ui_dispatch_app = stampede
request.ui_dispatch_view = search
search = sourcetype="wineventlog:microsoft-windows-sysmon/operational" Image="*\\reg.exe" | fillnull  | stats count by host

[shells_with_unusual_parents]
action.email.useNSSubject = 1
alert.track = 0
description = sourcetype="wineventlog:microsoft-windows-sysmon/operational" ingests Sysinternals' Sysmon Log
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
dispatchAs = user
display.events.fields = ["host","AccountExpires","AllowedToDelegateTo","AuthenticationPackageName","Caller_Process_ID","Category","Channel","Computer","Creator_Process_ID","Creator_Process_Name","DisplayName","Dummy","Error_Code","EventData_Xml","EventID","EventRecordID","FailureReason","Guid","HandleId","HomeDirectory","HomePath","ImpersonationLevel","IpAddress","IpPort","KeyLength","Level","LmPackageName","Logon_ID","LogonHours","LogonProcessName","LogonType","MemberName","MemberSid","New_Process_ID","New_Process_Name","NewSd","NewTargetUserName","NewTime","NewUacValue","ObjectName","ObjectServer","ObjectType","OldSd","OldTargetUserName","OldUacValue","Opcode","PackageName","PasswordLastSet","PreviousTime","PrimaryGroupId","Parent_Process","Image","BINARY_PATH_NAME","DEPENDENCIES","DISPLAY_NAME","ERROR_CONTROL","FAIL_RESET_PERIOD","FAILURE_ACTIONS","LOAD_ORDER_GROUP","GUID_name","SERVICE_NAME","SERVICE_START_NAME","START_TYPE","TAG","TYPE","GUID_display_name","Additional_Information","Advanced_Options","Algorithm_Name","Caller_Workstation","Configuration","Configuration_Access_Policy","ConfigurationFileHash","DestinationHostname","DestinationIp","DestinationIsIpv6","DestinationPort","DestinationPortName","Disable_Integrity_Checks","EventCode","File_Path","Flight_Signing","Handle_ID","HyperVisor_Debugging","HyperVisor_Launch_Type","HyperVisor_Load_Options","ImageLoaded","Initiated","Kernel_Debugging","Key_Name","Key_Type","Load_Options","LogonId","Mandatory_Label","msad_action","Network_Address","New_Security_Descriptor","Number_of_Elements","Object_Name","Object_Server","Object_Type","Operation","Policy_ID","Port","Protocol","Provider_Name","Return_Code","SchemaVersion","Security_ID","session_id","severity","Sid","Signature","SignatureStatus","Signed","SourceHostname","SourceIp","SourceIsIpv6","SourcePort","SourcePortName","src_ip","src_nt_host","State","System_Event_Logging","Target_Account_Domain","Test_Signing","Version","VSM_Launch_Type","100_Microso Kernel        11_10_1976 8_41_01 AM","Access_Right","Account_Expires","Allowed_To_Delegate_To","COM__Catalog_Collection","Display_Name","Domain_Behavior_Version","Domain_ID","Domain_Name","Force_Logoff","Home_Directory","Home_Drive","Length","Lockout_Duration","Lockout_Observation_Window","Lockout_Threshold","Logon_Hours","Machine_Account_Quota","Max__Password_Age","Min__Password_Age","Min__Password_Length","Mixed_Domain_Mode","MSADChangedAttributes","New_UAC_Value","OEM_Information","Old_Account_Name","Old_UAC_Value","Original_Security_Descriptor","Password_History_Length","Password_Last_Set","Password_Properties","Primary_Group_ID","Profile_Path","PSChildName","PSDrive","PSParentPath","PSPath","PSProvider","ReadCount","SAM_Account_Name","Script_Path","SID_History","Tcpip6       _todo_dll","Tcpip6    _todo_dll","User_Account_Control","user_group_id","User_Parameters","User_Principal_Name","User_Workstations","OsName","OsType","OsBuild","OsVersion","autorun_entry","image_path","publisher","description","autorun_type","app","usual_parent","unusual_parent"]
display.events.type = table
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = line
display.visualizations.show = 0
request.ui_dispatch_app = stampede
request.ui_dispatch_view = search
search = sourcetype="wineventlog:microsoft-windows-sysmon/operational" (Image=*\\cmd.exe OR Image=*\\powershell.exe) | lookup Win_Regular_Shells_with_Parents_30_days.csv Image AS Image OUTPUT ParentImage AS Regular_Parent | fillnull | eval parent_usual=mvfilter(Regular_Parent!=0) | eval unusual_parent=mvdedup(Regular_Parent) | stats count by host | table host count

[shells_spawned]
action.email.useNSSubject = 1
action.lookup = 1
action.lookup.filename = Win_Regular_Shells_with_Parents_30_days.csv
alert.track = 0
cron_schedule = 0 2 * * *
description = sourcetype="wineventlog:microsoft-windows-sysmon/operational" ingests Sysinternals' Sysmon Log
dispatch.earliest_time = -30d@d
dispatch.latest_time = now
display.events.fields = ["host","AccountExpires","AllowedToDelegateTo","AuthenticationPackageName","Caller_Process_ID","Category","Channel","Computer","Creator_Process_ID","Creator_Process_Name","DisplayName","Dummy","Error_Code","EventData_Xml","EventID","EventRecordID","FailureReason","Guid","HandleId","HomeDirectory","HomePath","ImpersonationLevel","IpAddress","IpPort","KeyLength","Level","LmPackageName","Logon_ID","LogonHours","LogonProcessName","LogonType","MemberName","MemberSid","New_Process_ID","New_Process_Name","NewSd","NewTargetUserName","NewTime","NewUacValue","ObjectName","ObjectServer","ObjectType","OldSd","OldTargetUserName","OldUacValue","Opcode","PackageName","PasswordLastSet","PreviousTime","PrimaryGroupId","Parent_Process","Image","ParentImage","BINARY_PATH_NAME","DEPENDENCIES","DISPLAY_NAME","ERROR_CONTROL","FAIL_RESET_PERIOD","FAILURE_ACTIONS","LOAD_ORDER_GROUP","GUID_name","SERVICE_NAME","SERVICE_START_NAME","START_TYPE","TAG","TYPE","GUID_display_name","Additional_Information","Advanced_Options","Algorithm_Name","Caller_Workstation","CommandLine","Configuration","Configuration_Access_Policy","ConfigurationFileHash","CurrentDirectory","DestinationHostname","DestinationIp","DestinationIsIpv6","DestinationPort","DestinationPortName","Disable_Integrity_Checks","EventCode","File_Path","Flight_Signing","Handle_ID","Hashes","HyperVisor_Debugging","HyperVisor_Launch_Type","HyperVisor_Load_Options","ImageLoaded","Initiated","IntegrityLevel","Kernel_Debugging","Key_Name","Key_Type","Load_Options","LogonId","Mandatory_Label","msad_action","Network_Address","New_Security_Descriptor","Number_of_Elements","Object_Name","Object_Server","Object_Type","Operation","ParentCommandLine","ParentProcessGuid","Policy_ID","Port","Protocol","Provider_Name","Return_Code","SchemaVersion","Security_ID","session_id","severity","Sid","Signature","SignatureStatus","Signed","SourceHostname","SourceIp","SourceIsIpv6","SourcePort","SourcePortName","src_ip","src_nt_host","State","System_Event_Logging","Target_Account_Domain","Test_Signing","UtcTime","Version","VSM_Launch_Type","100_Microso Kernel        11_10_1976 8_41_01 AM","Access_Right","Account_Expires","Allowed_To_Delegate_To","COM__Catalog_Collection","Display_Name","Domain_Behavior_Version","Domain_ID","Domain_Name","Force_Logoff","Home_Directory","Home_Drive","Length","Lockout_Duration","Lockout_Observation_Window","Lockout_Threshold","Logon_Hours","Machine_Account_Quota","Max__Password_Age","Min__Password_Age","Min__Password_Length","Mixed_Domain_Mode","MSADChangedAttributes","New_UAC_Value","OEM_Information","Old_Account_Name","Old_UAC_Value","Original_Security_Descriptor","Password_History_Length","Password_Last_Set","Password_Properties","Primary_Group_ID","Profile_Path","PSChildName","PSDrive","PSParentPath","PSPath","PSProvider","ReadCount","SAM_Account_Name","Script_Path","SID_History","Tcpip6       _todo_dll","Tcpip6    _todo_dll","User_Account_Control","user_group_id","User_Parameters","User_Principal_Name","User_Workstations","OsName","OsType","OsBuild","OsVersion","autorun_entry","image_path","publisher","description","autorun_type","app"]
display.events.type = table
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = line
display.visualizations.show = 0
enableSched = 1
request.ui_dispatch_app = stampede
request.ui_dispatch_view = search
search = sourcetype="wineventlog:microsoft-windows-sysmon/operational" (Image=*\\cmd.exe OR Image=*\\powershell.exe) | fillnull  | stats count by host

[autoruns_exe_name_longer_than_15_char]
search = sourcetype=csv source="autoruns*.csv" | rex field=image_path "(?<exe_name>[^\\\\]*(?=[.][a-zA-Z]+$))" max_match=1 | fillnull value=blank | eval char_n=len(exe_name) | search (char_n>15) | stats  count by host  | table  host count

[autoruns_from_suspicious_location]
search = sourcetype=csv source="autoruns*.csv" (image_path=*"programdata"* OR image_path=*"recycle bin"* OR image_path=*"appdata"* OR image_path=*"temp"* OR image_path=*File*) | fillnull value=blank | stats count by host

[autoruns_without_publisher_name]
search = sourcetype=csv source="autoruns*.csv" | fillnull value=blank | eval blank_publisher=if((publisher="blank"),1,0)  | search (blank_publisher=1) | stats count by host

[drivers_with_wrong_link_year]
search = sourcetype=csv source="drivers*.csv" | eval linkDate='Link Date' | eval nowYear=strftime(now(),"%Y") | rex field=linkDate "(?<linkYear>(19|2\d)\d{2})" | eval driver='Module Name' | eval driverType='Driver Type' | eval displayName='Display Name' | eval startMode='Start Mode' | eval pagedPoolBytes='Paged Pool(bytes)' | eval yearWrong=case(linkYear>nowYear,"yes",linkYear<=1995,"yes",1==1,"no") | search (yearWrong="yes") | stats  count by host   | table  host count

[process_checked_access_to_share]
search = sourcetype="WinEventLog:Security" source="WinEventLog:Security" EventCode=5145 | stats  count by host   | table  host count

[process_parent_is_not_in_System32]
search = sourcetype="WinEventLog:Security" source="WinEventLog:Security" (EventCode=4688 OR EventCode=592) NOT (New_Process_Name=*\smss.exe OR New_Process_Name=*\csrss.exe OR New_Process_Name=*\lsm.exe OR New_Process_Name=*\wininit.exe OR New_Process_Name=*\lsass.exe OR New_Process_Name=*\services.exe OR New_Process_Name=*\winlogon.exe) (Parent_Name!="*\System32\*.exe") | eval Parent_Name=if(Creator_Process_Name=NULL,"(lookup Win_Process_Name_By_Process_ID.csv New_Process_ID as Creator_Process_ID OUTPUT New_Process_Name as Parent_Name)",Creator_Process_Name) | stats count by host | table host count

[processes_created_in_unusual_directories]
search = sourcetype="WinEventLog:Security" source="WinEventLog:Security" (EventCode=4688 OR EventCode=592) NOT (New_Process_Name=*\smss.exe OR New_Process_Name=*\csrss.exe OR New_Process_Name=*\lsm.exe OR New_Process_Name=*\wininit.exe OR New_Process_Name=*\lsass.exe OR New_Process_Name=*\services.exe OR New_Process_Name=*\winlogon.exe) (New_Process_Name="*\*.BAT" OR New_Process_Name="*\*.CMD" OR New_Process_Name="*\*.COM" OR New_Process_Name="*\*.CPL" OR New_Process_Name="*\*.EXE" OR New_Process_Name="*\*.GADGET" OR New_Process_Name="*\*.INF1" OR New_Process_Name="*\*.INS" OR New_Process_Name="*\*.INX" OR New_Process_Name="*\*.ISU" OR New_Process_Name="*\*.JOB" OR New_Process_Name="*\*.JSE" OR New_Process_Name="*\*.LNK" OR New_Process_Name="*\*.MSC" OR New_Process_Name="*\*.MSI" OR New_Process_Name="*\*.MSP" OR New_Process_Name="*\*.MST" OR New_Process_Name="*\*.PAF" OR New_Process_Name="*\*.PIF" OR New_Process_Name="*\*.PS1" OR New_Process_Name="*\*.REG" OR New_Process_Name="*\*.RGS" OR New_Process_Name="*\*.SCR" OR New_Process_Name="*\*.SCT" OR New_Process_Name="*\*.SHB" OR New_Process_Name="*\*.SHS" OR New_Process_Name="*\*.U3P" OR New_Process_Name="*\*.VB" OR New_Process_Name="*\*.VBE" OR New_Process_Name="*\*.VBS" OR New_Process_Name="*\*.VBSCRIPT" OR New_Process_Name="*\*.WS" OR New_Process_Name="*\*.WSF" OR New_Process_Name="*\*.WSH" OR New_Process_Name="*\*.BIN") AND (New_Process_Name="*\fonts\*.exe" OR New_Process_Name="*\help\*.exe" OR New_Process_Name="*\wbem\*.exe" OR New_Process_Name="*\addins\*.exe" OR New_Process_Name="*\debut\*.exe" OR New_Process_Name="*\System32\tasks\*.exe" OR New_Process_Name="*RECYCLER\*.exe" OR New_Process_Name="*\SystemVolumeInformation\*.exe" OR New_Process_Name="*\Tasks\*.exe" OR New_Process_Name="*\debug\*.exe") | eval Parent_Name=if(Creator_Process_Name=NULL,"(lookup Win_Process_Name_By_Process_ID.csv New_Process_ID as Creator_Process_ID OUTPUT New_Process_Name as Parent_Name)",Creator_Process_Name) | stats count by host | table host count

[processes_with_known_bad_extensions]
search = sourcetype="WinEventLog:Security" source="WinEventLog:Security" (EventCode=4688 OR EventCode=592) NOT (New_Process_Name=*\smss.exe OR New_Process_Name=*\csrss.exe OR New_Process_Name=*\lsm.exe OR New_Process_Name=*\wininit.exe OR New_Process_Name=*\lsass.exe OR New_Process_Name=*\services.exe OR New_Process_Name=*\winlogon.exe) (New_Process_Name="*\rar.exe" OR New_Process_Name="*\psexec.exe" OR New_Process_Name="*\whoami.exe") | eval Parent_Name=if(Creator_Process_Name=NULL,"(lookup Win_Process_Name_By_Process_ID.csv New_Process_ID as Creator_Process_ID OUTPUT New_Process_Name as Parent_Name)",Creator_Process_Name) | stats count by host | table host count

[rare_processes]
search = sourcetype="WinEventLog:Security" source="WinEventLog:Security" (EventCode=4688 OR EventCode=592) NOT (New_Process_Name=*\smss.exe OR New_Process_Name=*\csrss.exe OR New_Process_Name=*\lsm.exe OR New_Process_Name=*\wininit.exe OR New_Process_Name=*\lsass.exe OR New_Process_Name=*\services.exe OR New_Process_Name=*\winlogon.exe) | eval Parent_Name=if(Creator_Process_Name=NULL,"(lookup Win_Process_Name_By_Process_ID.csv New_Process_ID as Creator_Process_ID OUTPUT New_Process_Name as Parent_Name)",Creator_Process_Name) | stats count by host | search (count>=1 AND count<=10) | table host New_Process_Name count

[service_name_is_GUID]
search = sourcetype=csv  source="psservice*.csv" | rex field=SERVICE_NAME "(?<GUID_name>^([0-9A-Fa-f]{8}[-][0-9A-Fa-f]{4}[-][0-9A-Fa-f]{4}[-][0-9A-Fa-f]{4}[-][0-9A-Fa-f]{12})$)" | rex field=DISPLAY_NAME "(?<GUID_display_name>^([0-9A-Fa-f]{8}[-][0-9A-Fa-f]{4}[-][0-9A-Fa-f]{4}[-][0-9A-Fa-f]{4}[-][0-9A-Fa-f]{12})$)" | fillnull | search (GUID_display_name!=0 OR GUID_name!=0) | stats  count by host   | table  host count

[svchost_dot_exe_was_not_created_by_services_dot_exe]
search = sourcetype="WinEventLog:Security" source="WinEventLog:Security" (EventCode=4688 OR EventCode=592) NOT (New_Process_Name=*\smss.exe OR New_Process_Name=*\csrss.exe OR New_Process_Name=*\lsm.exe OR New_Process_Name=*\wininit.exe OR New_Process_Name=*\lsass.exe OR New_Process_Name=*\services.exe OR New_Process_Name=*\winlogon.exe) (New_Process_Name="*\svchost.exe" AND Parent_Name!="*\System32\services.exe") | eval Parent_Name=if(Creator_Process_Name=NULL,"(lookup Win_Process_Name_By_Process_ID.csv New_Process_ID as Creator_Process_ID OUTPUT New_Process_Name as Parent_Name)",Creator_Process_Name) | stats count by host | table host count

[unsigned_drivers]
search = sourcetype=csv source="signatures*.csv" IsSigned=false | stats count by host | table host count
