[F5 Dropdown Lookup Generator]
action.email.useNSSubject = 1
alert.track = 0
cron_schedule = 0 1 * * *
dispatch.earliest_time = -30d@d
dispatch.latest_time = now
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.charting.chart = bar
display.visualizations.show = 0
enableSched = 1
request.ui_dispatch_app = f5
request.ui_dispatch_view = search
schedule_window = 15
search = | tstats count, max(_time) as latest from datamodel=dropdown by host,all.tenant,all.facility,all.app,all.devicegroup\
| rename all.* AS *\
| outputlookup f5_dropdown_lookup.csv
