[origProcess(1)]
args = process_name
definition = index=* eventtype=jamf_protect_alerts | search lastProcessName="$process_name$" | where process_responsible_pid = lastResponsiblePID
iseval = 0

[origUser(1)]
args = user_name
definition = index=* eventtype=jamf_protect_alerts | eval responsibleUser = case(mvindex('input.related.users{}.uid', 0) == process_ruid, mvindex('input.related.users{}.name', 0), mvindex('input.related.users{}.uid', 1) == process_ruid, mvindex('input.related.users{}.name', 1),  mvindex('input.related.users{}.uid', 2) == process_ruid, mvindex('input.related.users{}.name', 2)) | search responsibleUser = "$user_name$"
iseval = 0

[core_table]
definition = table _time dest detection_name signature process_path args path parent_process_path parent_process_args sha1 teamid
iseval = 0

[tm_table]
definition = table _time dest header.event_name return.description subject.effective_user_name subject.audit_user_name subject.terminal_id.ip_address subject.process_name exec_chain_child.parent_path exec_args.args_compiled
iseval = 0

[dc_table]
definition = rename dest AS "hostname", input.match.event.device.serialNumber AS "serialNumber", input.match.event.device.vendorName AS "vendor", input.match.event.device.vendorId AS "vendorId", input.match.event.device.productName AS "product", input.match.event.device.productId AS "productId", input.match.event.device.isEncrypted AS "encryptionStatus"\
| table hostname, serialNumber, vendor, vendorId, product, productId, encryptionStatus
iseval = 0

[nt_table]
definition = table _time action dest dest_ip dvc dvcType query record_type reply_code rule rule_id src src_interface src_ip src_port threat_result ttl user user_mail vendor vendor_account vendor_product

[ts_table]
definition = table _time action app category dest dest_ip dest_name dest_port deviceType dvc epoch_time file_hash file_name os product severity severity_id signature signature_id src_ip src_port url user user_mail vendor vendor_account vendor_product

[cs_flag(1)]
args = cs_flag
definition = eval cs_flag_array=mvappend(if(bit_and($cs_flag$, tonumber("0x00000001", 16)) > 0, "CS_VALID", null()),if(bit_and($cs_flag$, tonumber("0x00000002", 16)) > 0, "CS_ADHOC", null()),if(bit_and($cs_flag$, tonumber("0x00000004", 16)) > 0, "CS_GET_TASK_ALLOW", null()),if(bit_and($cs_flag$, tonumber("0x00000008", 16)) > 0, "CS_INSTALLER", null()),if(bit_and($cs_flag$, tonumber("0x00000010", 16)) > 0, "CS_FORCED_LV", null()),if(bit_and($cs_flag$, tonumber("0x00000020", 16)) > 0, "CS_INVALID_ALLOWED", null()),if(bit_and($cs_flag$, tonumber("0x00000100", 16)) > 0, "CS_HARD", null()),if(bit_and($cs_flag$, tonumber("0x00000200", 16)) > 0, "CS_KILL", null()),if(bit_and($cs_flag$, tonumber("0x00000400", 16)) > 0, "CS_CHECK_EXPIRATION", null()),if(bit_and($cs_flag$, tonumber("0x00000800", 16)) > 0, "CS_RESTRICT", null()),if(bit_and($cs_flag$, tonumber("0x00001000", 16)) > 0, "CS_ENFORCEMENT", null()),if(bit_and($cs_flag$, tonumber("0x00002000", 16)) > 0, "CS_REQUIRE_LV", null()),if(bit_and($cs_flag$, tonumber("0x00004000", 16)) > 0, "CS_ENTITLEMENTS_VALIDATED", null()),if(bit_and($cs_flag$, tonumber("0x00008000", 16)) > 0, "CS_NVRAM_UNRESTRICTED", null()),if(bit_and($cs_flag$, tonumber("0x00010000", 16)) > 0, "CS_RUNTIME", null()),if(bit_and($cs_flag$, tonumber("0x20000", 16)) > 0, "CS_LINKER_SIGNED", null()),if(bit_and($cs_flag$, tonumber("0x00100000", 16)) > 0, "CS_EXEC_SET_HARD", null()),if(bit_and($cs_flag$, tonumber("0x00200000", 16)) > 0, "CS_EXEC_SET_KILL", null()),if(bit_and($cs_flag$, tonumber("0x00400000", 16)) > 0, "CS_EXEC_SET_ENFORCEMENT", null()),if(bit_and($cs_flag$, tonumber("0x00800000", 16)) > 0, "CS_EXEC_INHERIT_SIP", null()),if(bit_and($cs_flag$, tonumber("0x01000000", 16)) > 0, "CS_KILLED", null()),if(bit_and($cs_flag$, tonumber("0x02000000", 16)) > 0, "CS_DYLD_PLATFORM", null()),if(bit_and($cs_flag$, tonumber("0x04000000", 16)) > 0, "CS_PLATFORM_BINARY", null()),if(bit_and($cs_flag$, tonumber("0x08000000", 16)) > 0, "CS_PLATFORM_PATH", null()),if(bit_and($cs_flag$, tonumber("0x10000000", 16)) > 0, "CS_DEBUGGED", null()),if(bit_and($cs_flag$, tonumber("0x20000000", 16)) > 0, "CS_SIGNED", null()),if(bit_and($cs_flag$, tonumber("0x40000000", 16)) > 0, "CS_DEV_CODE", null()),if(bit_and($cs_flag$, tonumber("0x80000000", 16)) > 0, "CS_DATAVAULT_CONTROLLER", null()))
iseval = 0