# Copyright (C) 2005-2011 Splunk Inc. All Rights Reserved.
[WIN-PERF-CPUTime]
action.None = 1
action_rss = 0
counttype = None
displayview = report_builder_display
relation = None
search = sourcetype="WMI:CPUTime" | timechart avg(PercentProcessorTime)
vsid = *:ft8wo94y

[All event logs last 24 hours]
cron_schedule = No value selected
dispatch.earliest_time = -24h
dispatch.latest_time = now
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = source="wineventlog:*" earliest_time="-24h"

[GUID_LOOKUP]
search = source="ActiveDirectory" (objectguid OR guid) | eval guid_lookup = upper(guid_lookup) | fields + guid_lookup, dcName | dedup guid_lookup | fields - _time,_kv,_meta,_raw,_serial,_subsecond
action.populate_lookup = 1
action.populate_lookup.dest = etc/apps/windows/lookups/guid_lookup.csv
run_on_startup = true
enableSched = 0
cron_schedule = 0 * * * *
alert_condition = stats count | search count > 0

[SID_LOOKUP]
search = source="ActiveDirectory" objectsid | fields + sid_lookup, cn, dcName | dedup sid_lookup | fields - _time,_kv,_meta,_raw,_serial,_subsecond
action.populate_lookup = 1
action.populate_lookup.dest = etc/apps/windows/lookups/sid_lookup.csv
run_on_startup = true
enableSched = 0
cron_schedule = 0 * * * *
alert_condition = stats count | search count > 0



[Failed Windows Updates by KB Number]
search = source="*\windowsupdate.log" Failure "Content Install" "Installation Failure" | fillnull value=Unspecified kb_num | chart count,max(_time) as latest_failure_time by kb_num | sort - latest_failure_time | convert ctime(latest_failure_time)

[Successful Windows Updates by KB Number]
search = source="*\windowsupdate.log" Success "Content Install" "Installation Successful" | fillnull value=Unspecified kb_num | chart count,max(_time) as latest_install_time by kb_num | sort - latest_install_time | convert ctime(latest_install_time)

[Successful Windows Updates by Host]
search = source="*\windowsupdate.log" Success "Content Install" "Installation Successful" | stats count by host

[Failed Windows Updates by Host]
search = source="*\windowsupdate.log" Failure "Content Install" "Installation Failure" | stats count by host

[Failed Windows Updates Never Applied by KB Number]
search = NOT [ search source="*\windowsupdate.log" Success "Content Install" "Installation Successful" | dedup kb_num | fields + kb_num ] source="*\windowsupdate.log" Failure "Content Install" "Installation Failure" | stats count,max(_time) as latest_failure_time by kb_num | convert ctime(latest_failure_time)

[System Performance Overview]
dispatch.earliest_time = -60m@m
dispatch.latest_time = +0s
displayview = report_builder_display
relation = None
search = source="WMI:LocalPhysicalDisk" OR source="WMI:CPUTime" OR source="WMI:Memory" | timechart avg(PercentProcessorTime),avg(AvailableMBytes),avg(PercentDiskTime)
vsid = *:fve13bvr


[CPU Utilization Summary]
cron_schedule = 4 */2 * * *
dispatch.earliest_time = -24h
dispatch.latest_time = now
dispatch.ttl = 2p
enableSched = 1
relation = None
search = source="wmi:cputime" | stats avg(PercentProcessorTime) as avgCPUTime,avg(PercentUserTime) as avgUserTime | eval avgCPUTime=round(avgCPUTime,1) | eval avgUserTime=round(avgUserTime,1)


[CPU Utilization by Threshold]
cron_schedule = 15 * * * *
dispatch.earliest_time = -24h
dispatch.latest_time = now
dispatch.ttl = 2p
enableSched = 1
relation = None
search = source="wmi:cputime" | eval range=case(PercentProcessorTime<80, "OK (<80%)", PercentProcessorTime<95, "Warn (80%-94%)", 1==1, "High (95%+)") | chart count by range


[Top Processes by Memory]
action.email.sendresults = 0
cron_schedule = 12 * * * *
dispatch.earliest_time = -24h
dispatch.latest_time = now
dispatch.ttl = 2p
enableSched = 1
relation = None
search = `top_process_by_mem`

[Top Processes by CPU]
action.email.sendresults = 0
cron_schedule = 43 * * * *
dispatch.earliest_time = -24h
dispatch.latest_time = now
dispatch.ttl = 2p
enableSched = 1
relation = None
search = `top_process_by_cpu`

[Disk Utilization]
action.email.sendresults = 0
cron_schedule = 31 * * * *
dispatch.earliest_time = -24h
dispatch.latest_time = now
dispatch.ttl = 2p
enableSched = 1
relation = None
search = source=wmi:localphysicaldisk ("Name=_Total" OR "Name=Total") | timechart avg(CurrentDiskQueueLength) as "Disk Queue Len", avg(PercentDiskTime) as "Disk Busy %"

[Logins by User Name]
action.email.sendresults = 0
dispatch.earliest_time = -7d@d
dispatch.latest_time = now
relation = None
search = source="wineventlog:security" EventCode=528 OR EventCode=540 OR EventCode=4624 | `get_user_name` | stats count by User_Name

[Failed Remote Logins by Name]
action.email.sendresults = 0
dispatch.earliest_time = -7d@d
dispatch.latest_time = now
relation = None
search = source="wineventlog:security" ("EventCode=4625") OR ("EventCode=529" OR "EventCode=530" OR "EventCode=531" OR "EventCode=532" OR "EventCode=533" OR "EventCode=534" OR "EventCode=535" OR "EventCode=536" OR "EventCode=537" OR "EventCode=539") (Logon_Type=3 OR Logon_Type=8 OR Logon_Type=10) | `get_user_name` | chart count by User_Name

[Successful Escalation of Privilege by Name]
action.email.sendresults = 0
dispatch.earliest_time = -7d
dispatch.latest_time = now
relation = None
search = source=wineventlog:security (EventCode=576 OR EventCode=4672 OR EventCode=577 OR EventCode=4673 OR EventCode=578 OR EventCode=4674) | `get_user_name` | chart count by User_Name

[Shutdowns by Cause]
action.email.sendresults = 0
dispatch.earliest_time = -30d@d
dispatch.latest_time = now
relation = None
search = source=wineventlog:system "EventCode=1076" OR "EventCode=6008" | rex field=Message "(?m)(?<cause>.*)$" | fields + _time,Comment,cause

[Service Failures by Name]
action.email.sendresults = 0
dispatch.earliest_time = -30d@d
dispatch.latest_time = now
relation = None
search = source=wineventlog:system terminated ("EventCode=7034" OR "EventCode=7031") | rex field=Message "(?i)^The (?<Service_Name>.*) service terminated unexpectedly.\s+It has done this (?<num_failures>\d+)" | stats sum(num_failures) by Service_Name

[Services That Failed to Start]
action.email.sendresults = 0
dispatch.earliest_time = -30d@d
dispatch.latest_time = now
relation = None
search = source=wineventlog:system SourceName="Service Control Manager" "service failed to start" | rex field=Message "^The (?<Service_Name>.*) service failed" | chart count by Service_Name

[win_eventlog_count_sum_index]
action.email.sendresults = 0
action.summary_index = 1
action.summary_index.span = 5m
cron_schedule = */5 * * * *
description = Count of wineventlog events
dispatch.earliest_time = -8m@m
dispatch.latest_time = -3m@m
displayview = flashtimeline
enableSched = 1
request.ui_dispatch_view = flashtimeline
search = source="wineventlog:*" | stats count count(eval(Type="Warning")) as warnings count(eval(Type="Error")) as errors

[performance_snapshot]
action.email.sendresults = 0
action.summary_index = 1
cron_schedule = */5 * * * *
dispatch.earliest_time = -8m@m
dispatch.latest_time = -3m@m
displayview = flashtimeline
enableSched = 1
request.ui_dispatch_view = flashtimeline
search = source=WMI:Memory OR source=WMI:CPUTime OR source=WMI:LocalPhysicalDisk | sitimechart span=1m avg(PercentProcessorTime) as "CPU",avg(PercentCommittedBytesInUse) as "Memory",avg(PercentDiskTime) as "Disk"


