# McAfee EPO version 5
[sample.v5.mcafee_epo]
disabled = false
breaker = ^\d{4}-\d{2}-\d{2}\s+\d{2}:\d{2}:\d{2}
interval = 3600
count = 0
earliest = -60m
latest = now
source=mcafee_v5.sample
sourcetype=mcafee:epo

## Replace timestamps 2010-09-01 22:13:03
token.0.token = ^(\d{4}-\d{2}-\d{2}\s+\d{2}:\d{2}:\d{2})
token.0.replacementType = timestamp
token.0.replacement = %Y-%m-%d %H:%M:%S

## Replace IP address - dest_ip and src_ip
token.1.token = ##IPV4##
token.1.replacementType = random
token.1.replacement = ipv4

## Replace MAC address
token.2.token = ##MAC##
token.2.replacementType = random
token.2.replacement = mac

## Replace user
token.3.token = (##USER##)
token.3.replacementType = file
token.3.replacement = $SPLUNK_HOME/etc/apps/Splunk_TA_mcafee/samples/username.sample

## Replace dest_nt_domain
token.4.token = (##DOMAIN##)
token.4.replacementType = file
token.4.replacement = $SPLUNK_HOME/etc/apps/Splunk_TA_mcafee/samples/malicious_domains.sample

## Replace dest_nt_host
token.5.token = (##HOST##)
token.5.replacementType = file
token.5.replacement = $SPLUNK_HOME/etc/apps/Splunk_TA_mcafee/samples/hostname.sample

## Replace file_name
token.6.token = (##FILE_NAME##)
token.6.replacementType = file
token.6.replacement = $SPLUNK_HOME/etc/apps/Splunk_TA_mcafee/samples/windows_file_name.sample

# McAfee IDS
[sample.mcafee_ids]
disabled = false
interval = 3600
count = 100
earliest = -60m
latest = now
source=mcafee_ids.sample
sourcetype=mcafee:ids

## Replace timestamps Sep  2 18:29:31, Attack Time: 2010-09-02 18:29:22 EDT
token.0.token = ((?:\w{3}\s+\d{1,2}\s+\d{2}:\d{2}:\d{2})|(?:\d{4}-\d{2}-\d{2}\s+\d{2}:\d{2}:\d{2}\s+\w{3}))
token.0.replacementType = timestamp
token.0.replacement = %b %d %H:%M:%S %Y

## Replace domain
token.1.token = (##DOMAIN##)
token.1.replacementType = file
token.1.replacement = $SPLUNK_HOME/etc/apps/Splunk_TA_mcafee/samples/malicious_domains.sample

## Replace IP address
token.2.token = ##IPV4##
token.2.replacementType = random
token.2.replacement = ipv4

## Replace sensor name
token.3.token = (##SENSOR_NAME##)
token.3.replacementType = file
token.3.replacement = $SPLUNK_HOME/etc/apps/Splunk_TA_mcafee/samples/sensorName.sample

## Replace Attack ID
token.4.token = (##ATTACK_ID##)
token.4.replacementType = mvfile
token.4.replacement = $SPLUNK_HOME/etc/apps/Splunk_TA_mcafee/samples/mcafee_ids_attack.sample:1

## Replace Attack Name
token.5.token = (##ATTACK_NAME##)
token.5.replacementType = mvfile
token.5.replacement = $SPLUNK_HOME/etc/apps/Splunk_TA_mcafee/samples/mcafee_ids_attack.sample:2
