[Search for all user activities]
action.keyindicator.invert = 0
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.param.verbose = 0
action.threat_add.param.verbose = 0
alert.track = 0
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
display.general.type = statistics
display.statistics.wrap = 0
search = | from datamodel:Network_Sessions.VPN \
| search (vendor_product="Cisco ASA") OR (user!=N/A msg="SSL tunnel shutdown" ) \
| eval assigned_ip=coalesce(assigned_ip,tunnelip) \
| eval Session_Duration = tostring(duration, "duration") \
| rex field=Session_Duration "((?P<day>\d+)\+){0,1}(?P<hour>\d{2}):(?P<min>\d{2}):(?P<sec>\d{2})" \
| eval hour=if(day>0,((day*24))+hour,hour) \
| eval Session_Duration = hour." hours ".min." minutes ".sec." seconds" \
| iplocation src_ip \
| stats count by _time user src_ip assigned_ip Session_Duration\
| fields - lat lon Region duration count

[VPN New Countries]
action.email.useNSSubject = 1
action.keyindicator.invert = 0
action.lookup = 1
action.lookup.append = 1
action.lookup.filename = vpn_countries.csv
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.param.verbose = 0
action.threat_add.param.verbose = 0
alert.track = 0
cron_schedule = 0 0 * * *
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
enableSched = 1
schedule_window = auto
search = | from datamodel:Network_Sessions.VPN   | iplocation src_ip |table Country |dedup Country |search NOT [|inputlookup vpn_countries.csv]

[VPN New Users]
action.email.useNSSubject = 1
action.keyindicator.invert = 0
action.lookup = 1
action.lookup.append = 1
action.lookup.filename = vpn_users.csv
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.param.verbose = 0
action.threat_add.param.verbose = 0
alert.track = 0
cron_schedule = 0 0 * * *
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
enableSched = 1
schedule_window = auto
search = |from datamodel:Network_Sessions.VPN |stats count by user |search user!=N/A user!=unknown |fields - count |search NOT  [| inputlookup vpn_users.csv ]

[Vpn User Tracking Report]
action.email.useNSSubject = 1
action.keyindicator.invert = 0
action.lookup = 1
action.lookup.filename = vpn_user_tracking.csv
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.param.verbose = 0
action.threat_add.param.verbose = 0
alert.track = 0
cron_schedule = */10 * * * *
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
enableSched = 1
schedule_window = auto
search = | tstats count from datamodel=Network_Traffic.All_Traffic WHERE \
    [| tstats count from datamodel=Network_Sessions.All_Sessions WHERE nodename=All_Sessions.VPN by All_Sessions.VPN.tunnelip \
    | rename All_Sessions.VPN.tunnelip as All_Traffic.src \
    | fields - count] by  All_Traffic.src  All_Traffic.dest All_Traffic.user All_Traffic.app\
| sort - count \
| `drop_dm_object_name("All_Traffic")` |sort - count |search src="*" user="*" dest="*" app="*"

