[Top 10 classifications]
search = sourcetype="snort" | top 10 classification

[Top 10 destination IPs]
search = sourcetype="snort" | top 10 dest_ip

[Top 10 destination ports]
search = sourcetype="snort" | top 10 dest_port

[Top 10 signatures]
search = sourcetype="snort" | top 10 name | fields - percent

[Top 10 source IPs]
search = sourcetype="snort" | top 10 src_ip

[Top 10 source ports]
search = sourcetype="snort" | top 10 src_port

[Alert trend]
search = sourcetype="snort" | timechart count by proto | rename _time AS Date | fieldformat Date = strftime(Date, "%m/%d/%Y") | sort - Date

[Snort Event Types]
alert.track = 0
dispatch.earliest_time = 0
display.general.type = statistics
display.statistics.drilldown = row
display.statistics.rowNumbers = 1
search = sourcetype="snort" src_ip="*" src_port="*" dest_ip="*" dest_port="*" name="*"\
| stats count as total by signature,name \
| sort -total\
| table signature,name,total\
| rename name AS "Event Name", signature AS "Signature", total AS "Total Events"

[Sources]
alert.track = 0
dispatch.earliest_time = 0
display.general.type = visualizations
display.visualizations.singlevalue.colorMode = block
display.visualizations.singlevalue.rangeColors = ["0x53a051","0xf8be34"]
display.visualizations.singlevalue.rangeValues = [0]
display.visualizations.singlevalue.useColors = 1
display.visualizations.type = singlevalue
search = sourcetype="snort" src_ip="*" src_port="*" dest_ip="*" dest_port="*" name="*" | stats dc(src_ip)

[Events]
alert.track = 0
dispatch.earliest_time = 0
display.general.type = visualizations
display.visualizations.singlevalue.colorMode = block
display.visualizations.singlevalue.rangeColors = ["0x53a051","0xdc4e41"]
display.visualizations.singlevalue.rangeValues = [0]
display.visualizations.singlevalue.useColors = 1
display.visualizations.type = singlevalue
search = sourcetype="snort" src_ip="*" src_port="*" dest_ip="*" dest_port="*" name="*" | stats count

[Events and Sources]
alert.track = 0
dispatch.earliest_time = 0
display.general.type = visualizations
display.visualizations.charting.axisTitleX.visibility = collapsed
display.visualizations.charting.axisY2.enabled = 1
display.visualizations.charting.chart.overlayFields = sources
display.visualizations.charting.chart.showDataLabels = minmax
display.visualizations.charting.drilldown = none
display.visualizations.charting.legend.labelStyle.overflowMode = ellipsisEnd
display.visualizations.charting.legend.placement = bottom
search = sourcetype=snort | timechart count as events,dc(src_ip) as sources

[Top Source Countries]
alert.track = 0
dispatch.earliest_time = 0
display.general.type = visualizations
display.visualizations.charting.chart = pie
search = sourcetype="snort" | iplocation src_ip \
| stats count by Country \
| sort -count

[Sources and Signatures - with 5 or more Events]
alert.track = 0
dispatch.earliest_time = 0
display.general.type = statistics
display.statistics.overlay = heatmap
display.statistics.totalsRow = 1
search = sourcetype="snort"\
| eventstats count as total_count by src_ip\
| stats count as total by name,src_ip\
| sort -total\
| eventstats sum(total) as total_events by src_ip\
| iplocation src_ip\
| lookup dnslookup clientip as src_ip OUTPUT clienthost as src_name \
| eval src_name=coalesce(src_name,src_ip)\
| table src_name,src_ip,Country,name,total_events\
| mvcombine name\
| sort -total_events\
| where total_events > 4\
| rename  src_name AS "Source Host", src_ip AS "Source IP", Country AS "Source Country", name AS "Event Name", total_events AS "Total Events"

[Sources, Destinations and Signatures]
alert.track = 0
dispatch.earliest_time = 0
display.general.type = statistics
display.statistics.overlay = heatmap
search = sourcetype="snort" src_ip="*" src_port="*" dest_ip="*" dest_port="*" name="*"\
| iplocation src_ip \
| rename Country as src_country \
| iplocation dest_ip \
| rename Country as dest_country \
| eval signature = signature  \
| fillnull value="" \
| stats count by src_ip,src_country,dest_ip,dest_country,name | sort -count\
| rename src_ip AS "Source IP", src_country AS "Source Country", dest_ip AS "Destination IP", name AS "Event Name", dest_country AS "Destination Country", dest_ip AS "Destination IP", count AS "Total Events"

[Last 100 events]
alert.track = 0
dispatch.earliest_time = 0
display.general.type = statistics
display.statistics.rowNumbers = 1
search = sourcetype="snort" src_ip="*" src_port="*" dest_ip="*" dest_port="*" name="*"\
| head 100 \
| iplocation src_ip \
| eval src_country=Country \
| iplocation dest_ip \
| eval dest_country=Country \
| lookup dnslookup clientip as src_ip OUTPUT clienthost as src_name \
| eval src_name=coalesce(src_name,src_ip)\
| fillnull value="-" \
| table _time,src_name,src_ip,src_country,dest_ip,dest_country,signature,name\
| rename _time AS "Time", src_name AS "Source Host", src_ip AS "Source IP", src_country AS "Source Country", dest_ip AS "Destination IP", name AS "Event Name", dest_country AS "Destination Country", signature AS "Signature"

[Persistent sources with 5 or more events in the last 5 days]
alert.track = 0
dispatch.earliest_time = 0
display.general.type = statistics
display.statistics.overlay = heatmap
search = sourcetype="snort" src_ip="*" src_port="*" dest_ip="*" dest_port="*" name="*"\
| eventstats count as total_count, max(_time) as Last, min(_time) as First by src_ip\
| stats count as total by First,Last,name,src_ip\
| eventstats sum(total) as total_events by src_ip\
| iplocation src_ip\
| eval day_diff = round((Last-First)/86400,0)\
| where total_events>5\
| where day_diff > 1\
| eval n=now()-Last\
| where n<86400*5000\
| lookup dnslookup clientip as src_ip OUTPUT clienthost as src_name \
| eval src_name=coalesce(src_name,src_ip)\
| table src_name,src_ip,Country,First,Last,day_diff,name,total_events\
| mvcombine name\
| fieldformat First=strftime(First,"%x %X") | fieldformat Last=strftime(Last,"%x %X")\
| sort -total_events\
| rename src_name AS "Source Host", src_ip AS "Source IP", day_diff AS "Day Diff.", name AS "Event Name", total_events AS "Total Events", Country AS "Source Country"

[Events by time in result set]
alert.track = 0
dispatch.earliest_time = 0
display.general.type = visualizations
display.visualizations.charting.chart = line
display.visualizations.charting.drilldown = none
search = sourcetype="snort" src_ip="*" src_port="*" dest_ip="*" dest_port="*" name="*"\
 | timechart count by index

[Top destination IP in result set]
alert.track = 0
dispatch.earliest_time = 0
display.general.type = visualizations
display.visualizations.charting.chart = pie
search = sourcetype="snort" src_ip="*" src_port="*" dest_ip="*" dest_port="*" name="*"\
| stats count by dest_ip | sort - count\
| rename dest_ip AS "Destination IP"

[Top source IP in result set]
alert.track = 0
dispatch.earliest_time = 0
display.general.type = visualizations
display.visualizations.charting.chart = pie
search = sourcetype="snort" src_ip="*" src_port="*" dest_ip="*" dest_port="*" name="*"\
| stats count by src_ip | sort - count\
| rename src_ip AS "Source IP"

[Top alerts in result set]
alert.track = 0
dispatch.earliest_time = 0
display.general.type = visualizations
display.visualizations.charting.axisTitleX.text = Event Name
display.visualizations.charting.axisTitleY.visibility = collapsed
display.visualizations.charting.chart = bar
display.visualizations.charting.legend.placement = none
search = sourcetype="snort" src_ip="*" src_port="*" dest_ip="*" dest_port="*" name="*"\
| stats count by name | sort - name\
| rename name AS "Event Name"

[Alerts table of result set]
alert.track = 0
dispatch.earliest_time = 0
display.general.type = statistics
search = sourcetype="snort" src_ip="*" src_port="*" dest_ip="*" dest_port="*" name="*"\
| fields src_ip src_port dest_ip dest_port proto signature name\
| rename src_ip AS "Source IP", src_port AS "Source Port", dest_ip AS "Destination IP", name AS "Event Name", dest_port AS "Destination Port", proto AS "Protocol", signature AS "Signature", _raw AS RAW, _time AS Time

[Countries by Source IPs in result set]
alert.track = 0
dispatch.earliest_time = 0
display.general.type = visualizations
display.visualizations.mapHeight = 669
display.visualizations.mapping.drilldown = none
display.visualizations.mapping.map.center = (44.21,23.2)
display.visualizations.mapping.type = choropleth
display.visualizations.type = mapping
search = sourcetype="snort" src_ip="*" src_port="*" dest_ip="*" dest_port="*" name="*"\
| iplocation src_ip | stats count by Country | geom geo_countries allFeatures=True featureIdField=Country

[Top source IP in result set map]
alert.track = 0
dispatch.earliest_time = 0
display.general.type = statistics
display.statistics.rowNumbers = 1
search = sourcetype="snort" src_ip="*" src_port="*" dest_ip="*" dest_port="*" name="*"\
| iplocation src_ip \
| rename Country as src_country \
| iplocation dest_ip \
| rename Country as dest_country  \
| stats count by src_ip,src_country,name | sort -count\
| rename src_ip AS "Source IP", src_country AS "Source Country", name AS "Event Name", count AS "Total Events"

[Top alerts in result set map]
alert.track = 0
dispatch.earliest_time = 0
display.general.type = statistics
display.statistics.rowNumbers = 1
search = sourcetype="snort" src_ip="*" src_port="*" dest_ip="*" dest_port="*" name="*"\
| stats count by name | sort - count\
| rename name AS "Event Name", count AS "Total Events"

[Alerts table of result set map]
alert.track = 0
dispatch.earliest_time = 0
display.general.type = statistics
search = sourcetype="snort" src_ip="*" src_port="*" dest_ip="*" dest_port="*" name="*"\
| fields _time src_ip src_port dest_ip dest_port proto signature name\
| rename src_ip AS "Source IP", src_port AS "Source Port", dest_ip AS "Destination IP", name AS "Event Name", dest_port AS "Destination Port", proto AS "Protocol", signature AS "Signature", _raw AS RAW, _time AS Time\
| fieldformat Time = strftime(Time, "%m/%d/%Y %H:%M:%S")
