#
# Data Model Acceleration
# By default this application uses data model acceleration. If you are unable to use
# acceleration you can edit these macros and replace true with false
#

# Web data model acceleration
[dragos_cim_web_accelerated]
definition = "true"

# Network Resolution (DNS) data model acceleration
[dragos_cim_dns_accelerated]
definition = "true"

# Network traffic data model acceleration
[dragos_cim_network_traffic_accelerated]
definition = "true"

#
# Search macros
# Do not modify these values
#

#
# Web traffic
#
[dragos_events_query_web]
definition = tstats summariesonly=`dragos_cim_web_accelerated` count FROM datamodel="Web"

[dragos_indicator_query_web]
definition = tstats summariesonly=`dragos_cim_web_accelerated` count(Web.url) FROM datamodel=Web BY Web.url,_time |  rename Web.url as indicator, count(Web.url) as count | eval indicator=mvindex(split(indicator, ":"), 0) | append [| tstats summariesonly=`dragos_cim_web_accelerated` count(Web.dest) FROM datamodel=Web BY Web.dest,_time | rename Web.dest as indicator count(Web.dest) as count ] 

#
# DNS traffic
#
[dragos_events_query_dns]
definition = tstats summariesonly=`dragos_cim_dns_accelerated` count FROM datamodel="Network_Resolution.DNS"

[dragos_indicator_query_dns]
definition = tstats summariesonly=`dragos_cim_dns_accelerated` count(DNS.query) FROM datamodel="Network_Resolution.DNS" where DNS.query!=unknown by DNS.query,_time | rename DNS.query as indicator, count(DNS.query) as count | append [| tstats summariesonly=`dragos_cim_dns_accelerated` count(DNS.answer) FROM datamodel="Network_Resolution.DNS" where DNS.answer!=unknown by DNS.answer,_time | rename DNS.answer as indicator, count(DNS.answer) as count ]

#
# Network traffic
#
[dragos_events_query_network_traffic]
definition = tstats summariesonly=`dragos_cim_network_traffic_accelerated` count FROM datamodel="Network_Traffic.All_Traffic"

[dragos_indicator_query_network_traffic]
definition = tstats summariesonly=`dragos_cim_network_traffic_accelerated` count(All_Traffic.src_ip) FROM datamodel="Network_Traffic.All_Traffic" by All_Traffic.src_ip,_time | rename All_Traffic.src_ip as indicator, count(All_Traffic.src_ip) as count | append [| tstats summariesonly=`dragos_cim_network_traffic_accelerated` count(All_Traffic.dest_ip) FROM datamodel="Network_Traffic.All_Traffic" by All_Traffic.dest_ip,_time | rename All_Traffic.dest_ip as indicator, count(All_Traffic.dest_ip) as count ]


#
# Utils
#
[dragos_append_zero_count]
definition =  append [| gentimes start=-1 end=0  | eval count=0 ]
