[source::...ta-proofpoint-casb-addon-for-splunk*.log*]
sourcetype = taproofpointcasbaddonforsplunk:log

[source::...ta_proofpoint_casb_addon_for_splunk*.log*]
sourcetype = taproofpointcasbaddonforsplunk:log

[proofpoint:casb:activitylog]
FIELDALIAS-aob_gen_proofpoint_casb_activitylog_alias_1 = cloudService AS app
FIELDALIAS-aob_gen_proofpoint_casb_activitylog_alias_2 = userEmail AS user_id
FIELDALIAS-aob_gen_proofpoint_casb_activitylog_alias_3 = userEmail AS src_user
FIELDALIAS-aob_gen_proofpoint_casb_activitylog_alias_4 = userAgent AS user_agent
FIELDALIAS-aob_gen_proofpoint_casb_activitylog_alias_5 = requestIp AS src
FIELDALIAS-aob_gen_proofpoint_casb_activitylog_alias_6 = cloudService AS dest
FIELDALIAS-aob_gen_proofpoint_casb_activitylog_alias_7 = userEmail AS src_user_id
FIELDALIAS-aob_gen_proofpoint_casb_activitylog_alias_8 = userEmail AS user
FIELDALIAS-aob_gen_proofpoint_casb_activitylog_alias_9 = fileName AS file_name
EVAL-action = case(action="Successful Login","success", action="Suspicious Login" AND suspiciousLoginStatus="Success","success", action="Unsuccessful Login","failure", action="Suspicious Login" AND suspiciousLoginStatus="Failure","failure", action="Successful Multi-Factor Authentication","success", action="Unsuccessful Multi-Factor Authentication","failure", action="File/Folder Download","read", action="Anonymous Link Usage","read", action="Company Link Usage","read", action="File Download","read", action="File Access","read", action="File Send to Recycle Bin","deleted", action="File/Folder Upload","created", action="File Upload","created", action="File/Folder Add","created", action="File Share","acl_modified", action="Anonymous Link Remove","acl_modified", action="Company Link Remove","acl_modified", action="Link Share","acl_modified", action="Link Unshare","acl_modified", action="Shared Link Update","acl_modified", action="Secure Link Member Add","acl_modified", action="Company Link Create","acl_modified", action="Company Link Update","acl_modified", action="Secure Link Create","acl_modified", action="Secure Link Update","acl_modified", action="Anonymous Link Remove","acl_modified", action="Public Link Create","acl_modified", action="Public Link Remove","acl_modified", action="Public Link Share","acl_modified", action="Public Link Unshare","acl_modified", action="Sharing Set","acl_modified", action="Sharing Revoke","acl_modified", action="File Sharing Properties Update","acl_modified", action="User Create","created", action="User Delete","deleted", action="User Activate","modified", action="User Deactivate","modified", action="User Unsuspend","modified", action="User Suspend ","modified", action="User Password Reset","modified", action="User Update","modified")
EVAL-authentication_method = "NA"
EVAL-authentication_service	= "NA"
EVAL-dest_nt_domain	= "NA"
EVAL-reason = "NA"
EVAL-response_time = 0
EVAL-signature = "NA"
EVAL-signature_id = "NA"
EVAL-duration = 0
EVAL-src_nt_domain = "NA"
EVAL-src_user_role= "NA"
EVAL-src_user_type="NA"
EVAL-user_role="NA"
EVAL-user_type=if(userIsVAP="true","VAP","Regular User")
EVAL-vendor_account="NA"
KV_MODE = json
SHOULD_LINEMERGE = 0
category = Splunk App Add-on Builder
pulldown_type = 1

[proofpoint:casb:alerts]
FIELDALIAS-aob_gen_proofpoint_casb_alerts_alias_1 = title AS subject
FIELDALIAS-aob_gen_proofpoint_casb_alerts_alias_2 = related_events_0_user_id AS src
FIELDALIAS-aob_gen_proofpoint_casb_alerts_alias_3 = related_events_0_cloud_service AS app
FIELDALIAS-aob_gen_proofpoint_casb_alerts_alias_4 = description AS body
FIELDALIAS-aob_gen_proofpoint_casb_alerts_alias_5 = related_events_0_meta_data_extracted_fields_1_128764 AS user
FIELDALIAS-aob_gen_proofpoint_casb_alerts_alias_6 = related_events_0_user_agent AS http_user_agent
FIELDALIAS-aob_gen_proofpoint_casb_alerts_alias_7 = related_events_0_intelligence_0_ip_address AS src_ip

KV_MODE = json
SHOULD_LINEMERGE = 0
category = Splunk App Add-on Builder
pulldown_type = 1

