[EclecticIQ alert]
action.webhook.enable_allowlist = 0
search = `eiq_sightings_search` (last_ip=* OR dest=* OR dst=* OR query=* OR url=* OR file_hash=* OR md5=* OR sha1=* OR sha256=* OR sha512=* OR sender=* OR src_user=* OR src_ip=* OR src=* OR hostname=* OR recipient=* OR receiver=* OR dest_user=* OR domain=* OR ipaddress=*) \
| eval event_hash=sha512(_raw) \
| rex field=url "(http(?s)\:\/\/)(?<eiq_domain>[\w\-\.]+)(\:|\/|$)" \
| eval eiq_dest=coalesce(last_ip, dest, dst) \
| eval eiq_src=coalesce(src_ip, src,ipaddress) \
| eval eiq_domain=coalesce(domain, query, eiq_domain, hostname) \
| eval eiq_url=coalesce(uri, query) \
| eval eiq_file_hash=coalesce(file_hash,hash-md5, md5, sha1, sha256, sha512) \
| eval eiq_sender=coalesce(sender, src_user) \
| eval eiq_receiver=coalesce(recipient, receiver, dest_user) \
| eval value = coalesce(eiq_dest, eiq_src, eiq_domain,eiq_url,eiq_file_hash, eiq_sender,eiq_receiver)\
| join value type=inner max=0 \
    [ search `observables_index` earliest=0 latest=now()\
    | rename meta.maliciousness as confidence \
    | rename id as obs_id  \
    | sort - last_updated_at \
    | dedup obs_id \
    | mvexpand entities{}\
    | table obs_id, value, confidence, type, entities{},last_updated_at]\
 | eval entity_id = substr('entities{}', -36) \
 | join entity_id type=inner max=0 \
    [ search `entity_index` earliest=0 latest=now()\
    | rename meta.tags{} as tags, sources{} as sources , data.title as title\
    | rename id as entity_id  \
    | sort - last_updated_at \
    | dedup entity_id \
    | rename type as entity_type\
    | table entity_id tags, sources, title, outgoing_feeds, entity_type]\
 | eval alert_field=case(isnotnull(eiq_src), "src", isnotnull(eiq_dest), "dest", isnotnull(eiq_file_hash), "file_hash", isnotnull(eiq_domain), "domain", isnotnull(eiq_url), "url", isnotnull(eiq_sender), "sender", isnotnull(eiq_receiver), "receiver") \
 | eval alert_source="splunk_search" \
 | rename entities{} as entities | stats values(entity_id) as entity_id, values(alert_field) as alert_field, values(value) as value, values(confidence) as confidence, values(type) as type, values(entities) as entities,values(last_updated_at) as last_updated_at, values(obs_id) as obs_id ,values(alert_source) as alert_source, values(tags) as meta_tags_eiq, values(sources) as sources, values(title) as title latest(_time) as time , values(index) as index , values(sourcetypes) as sourcetypes, values(host) as host, values(outgoing_feeds) as outgoing_feeds , ,values(entity_type) as entity_type, values(type) as type_eiq, values(eiq_src) as src, values(eiq_dest) as dest, values(confidence) as confidence_eiq, values(sourcetype) as sourcetype by event_hash\
 | eval key=time."-".'event_hash',event_index=index, event_sourcetype=sourcetype, event_time=time, event_host=host,timestamp_eiq = strftime(now(), "%Y-%m-%dT%H:%M:%S.%6N%:z") , meta_entity_url_eiq=entity_id ,entity_title_eiq=title, feed_id_eiq = outgoing_feeds , sighting ="0", source_name_eiq= sources, value_eiq= value, observable_id=obs_id\
| table key,entity_id, alert_field, alert_source,confidence_eiq, src, dest,entity_title_eiq, event_time, event_hash, event_index, event_host, event_sourcetype,feed_id_eiq, value_url_eiq, type_eiq, timestamp_eiq, source_name_eiq, feed_id_eiq, meta_entity_url_eiq, value_eiq, last_updated_at, entity_type, sighting, meta_tags_eiq,observable_id\
| outputlookup eiq_alerts_list append=True key_field=key

[EclecticIQ tstats Threat Intelligence alert - Source/Destination]
action.webhook.enable_allowlist = 0
search = |`eiq_dm_alert_src_dst`| eval value=coalesce(src,dest)  \
| join value type=inner max=0 \
    [ search `observables_index` earliest=0 latest=now() \
    | rename meta.maliciousness as confidence \
    | rename id as obs_id \
    | sort - last_updated_at \
    | dedup obs_id \
    | mvexpand entities{} \
    | table obs_id, value, confidence, type, entities{},last_updated_at] \
| eval entity_id = substr('entities{}', -36) \
| join entity_id type=inner max=0 \
    [ search `entity_index` earliest=0 latest=now() \
    | rename meta.tags{} as tags, sources{} as sources , data.title as title \
    | rename id as entity_id \
    | sort - last_updated_at \
    | dedup entity_id \
    | rename type as entity_type \
    | table entity_id tags, sources, title, outgoing_feeds, entity_type] \
| eval alert_field=case(src!="unknown", "src", 1=1, "dest") \
| eval event_hash=sha512(sourcetype.index._time.host.value) \
| eval alert_source="splunk_dm_search" \
| rename entities{} as entities \
| stats values(entity_id) as entity_id, values(alert_field) as alert_field, values(value) as value, values(type) as type, values(entities) as entities,values(last_updated_at) as last_updated_at, values(obs_id) as obs_id ,values(alert_source) as alert_source, values(tags) as meta_tags_eiq, values(sources) as sources, values(title) as title latest(_time) as time , values(index) as index , values(sourcetype) as sourcetypes, values(host) as host, values(outgoing_feeds) as outgoing_feeds , ,values(entity_type) as entity_type, values(type) as type_eiq,values(src) as src, values(dest) as dest, values(confidence) as confidence_eiq, values(sourcetype) as sourcetype by event_hash\
| eval key=time."-".'event_hash',event_index=index, event_sourcetype=sourcetype, event_time=time, event_host=host,timestamp_eiq = strftime(now(), "%Y-%m-%dT%H:%M:%S.%6N%:z") , meta_entity_url_eiq=entity_id ,entity_title_eiq=title, feed_id_eiq = outgoing_feeds , sighting ="0", source_name_eiq= sources, value_eiq= value, observable_id=obs_id\
| table key,entity_id, alert_field, alert_source,confidence_eiq, src, dest,entity_title_eiq, event_time, event_hash, event_index, event_host, event_sourcetype,feed_id_eiq, value_url_eiq, type_eiq, timestamp_eiq, source_name_eiq, feed_id_eiq, meta_entity_url_eiq, value_eiq, last_updated_at, entity_type, sighting, meta_tags_eiq, observable_id\
| outputlookup eiq_alerts_list append=True key_field=key

[EclecticIQ tstats Threat Intelligence alert - URL]
action.webhook.enable_allowlist = 0
search = |`eiq_dm_alert_url` | eval value=url\
| join value type=inner max=0 \
    [ search `observables_index` earliest=0 latest=now() \
    | rename meta.maliciousness as confidence \
    | rename id as obs_id \
    | sort - last_updated_at \
    | dedup obs_id \
    | mvexpand entities{} \
    | table obs_id, value, confidence, type, entities{},last_updated_at] \
    | eval entity_id = substr('entities{}', -36) \
    | join entity_id type=inner max=0 \
    [ search `entity_index` earliest=0 latest=now() \
    | rename meta.tags{} as tags, sources{} as sources , data.title as title \
    | rename id as entity_id \
    | sort - last_updated_at \
    | dedup entity_id \
    | rename type as entity_type \
    | table entity_id tags, sources, title, outgoing_feeds, entity_type] \
| eval alert_field=case(isnotnull(value), "url") \
| eval event_hash=sha512(sourcetype.index._time.host.value) \
| eval alert_source="splunk_dm_search" \
| rename entities{} as entities \
| stats values(entity_id) as entity_id, values(alert_field) as alert_field, values(value) as value, values(type) as type, values(entities) as entities,values(last_updated_at) as last_updated_at, values(obs_id) as obs_id ,values(alert_source) as alert_source, values(tags) as meta_tags_eiq, values(sources) as sources, values(title) as title latest(_time) as time , values(index) as index , values(sourcetype) as sourcetypes, values(host) as host, values(outgoing_feeds) as outgoing_feeds , ,values(entity_type) as entity_type, values(type) as type_eiq, values(eiq_src) as src, values(eiq_dest) as dest, values(confidence) as confidence_eiq, values(sourcetype) as sourcetype by event_hash\
| eval key=time."-".'event_hash',event_index=index, event_sourcetype=sourcetype, event_time=time, event_host=host,timestamp_eiq = strftime(now(), "%Y-%m-%dT%H:%M:%S.%6N%:z") , meta_entity_url_eiq=entity_id ,entity_title_eiq=title, feed_id_eiq = outgoing_feeds , sighting ="0", source_name_eiq= sources, value_eiq= value, observable_id=obs_id\
| table key,entity_id, alert_field, alert_source,confidence_eiq, src, dest,entity_title_eiq, event_time, event_hash, event_index, event_host, event_sourcetype,feed_id_eiq, value_url_eiq, type_eiq, timestamp_eiq, source_name_eiq, feed_id_eiq, meta_entity_url_eiq, value_eiq, last_updated_at, entity_type, sighting, meta_tags_eiq, observable_id\
| outputlookup eiq_alerts_list append=True key_field=key

[EclecticIQ tstats Threat Intelligence alert - Hash]
action.webhook.enable_allowlist = 0
search = |`eiq_dm_alert_hash`  \
| eval value=file_hash\
| join value type=inner max=0 \
    [ search `observables_index` earliest=0 latest=now() \
    | rename meta.maliciousness as confidence \
    | rename id as obs_id \
    | sort - last_updated_at \
    | dedup obs_id \
    | mvexpand entities{} \
    | table obs_id, value, confidence, type, entities{},last_updated_at] \
| eval entity_id = substr('entities{}', -36) \
| join entity_id type=inner max=0 \
    [ search `entity_index` earliest=0 latest=now() \
    | rename meta.tags{} as tags, sources{} as sources , data.title as title \
    | rename id as entity_id \
    | sort - last_updated_at \
    | dedup entity_id \
    | rename type as entity_type \
    | table entity_id tags, sources, title, outgoing_feeds, entity_type] \
| eval alert_field=case(isnotnull(value), "file_hash") \
| eval event_hash=sha512(sourcetype.index._time.host.value) \
| eval alert_source="splunk_dm_search" \
| rename entities{} as entities \
| stats values(entity_id) as entity_id, values(alert_field) as alert_field, values(value) as value, values(type) as type, values(entities) as entities,values(last_updated_at) as last_updated_at, values(obs_id) as obs_id ,values(alert_source) as alert_source, values(tags) as meta_tags_eiq, values(sources) as sources, values(title) as title latest(_time) as time , values(index) as index , values(sourcetype) as sourcetypes, values(host) as host, values(outgoing_feeds) as outgoing_feeds , ,values(entity_type) as entity_type, values(type) as type_eiq, values(eiq_src) as src, values(eiq_dest) as dest, values(confidence) as confidence_eiq, values(sourcetype) as sourcetype by event_hash\
| eval key=time."-".'event_hash',event_index=index, event_sourcetype=sourcetype, event_time=time, event_host=host,timestamp_eiq = strftime(now(), "%Y-%m-%dT%H:%M:%S.%6N%:z") , meta_entity_url_eiq=entity_id ,entity_title_eiq=title, feed_id_eiq = outgoing_feeds , sighting ="0", source_name_eiq= sources, value_eiq= value, observable_id=obs_id\
| table key,entity_id, alert_field, alert_source,confidence_eiq, src, dest,entity_title_eiq, event_time, event_hash, event_index, event_host, event_sourcetype,feed_id_eiq, value_url_eiq, type_eiq, timestamp_eiq, source_name_eiq, feed_id_eiq, meta_entity_url_eiq, value_eiq, last_updated_at, entity_type, sighting, meta_tags_eiq, observable_id\
| outputlookup eiq_alerts_list append=True key_field=key

[EclecticIQ tstats Threat Intelligence alert - Domain]
action.webhook.enable_allowlist = 0
search = |`eiq_dm_alert_domain` | eval value=domain\
| join value type=inner max=0 \
    [ search `observables_index` earliest=0 latest=now() \
    | rename meta.maliciousness as confidence \
    | rename id as obs_id \
    | sort - last_updated_at \
    | dedup obs_id \
    | mvexpand entities{} \
    | table obs_id, value, confidence, type, entities{},last_updated_at] \
| eval entity_id = substr('entities{}', -36) \
| join entity_id type=inner max=0 \
    [ search `entity_index` earliest=0 latest=now() \
    | rename meta.tags{} as tags, sources{} as sources , data.title as title \
    | rename id as entity_id \
    | sort - last_updated_at \
    | dedup entity_id \
    | rename type as entity_type \
    | table entity_id tags, sources, title, outgoing_feeds, entity_type] \
| eval alert_field=case(isnotnull(value), "domain") \
| eval event_hash=sha512(sourcetype.index._time.host.value) \
| eval alert_source="splunk_dm_search" \
| rename entities{} as entities \
| stats values(entity_id) as entity_id, values(alert_field) as alert_field, values(value) as value, values(type) as type, values(entities) as entities,values(last_updated_at) as last_updated_at, values(obs_id) as obs_id ,values(alert_source) as alert_source, values(tags) as meta_tags_eiq, values(sources) as sources, values(title) as title latest(_time) as time , values(index) as index , values(sourcetype) as sourcetypes, values(host) as host, values(outgoing_feeds) as outgoing_feeds , ,values(entity_type) as entity_type, values(type) as type_eiq, values(eiq_src) as src, values(eiq_dest) as dest, values(confidence) as confidence_eiq, values(sourcetype) as sourcetype by event_hash\
| eval key=time."-".'event_hash',event_index=index, event_sourcetype=sourcetype, event_time=time, event_host=host,timestamp_eiq = strftime(now(), "%Y-%m-%dT%H:%M:%S.%6N%:z") , meta_entity_url_eiq=entity_id ,entity_title_eiq=title, feed_id_eiq = outgoing_feeds , sighting ="0", source_name_eiq= sources, value_eiq= value, observable_id=obs_id\
| table key,entity_id, alert_field, alert_source,confidence_eiq, src, dest,entity_title_eiq, event_time, event_hash, event_index, event_host, event_sourcetype,feed_id_eiq, value_url_eiq, type_eiq, timestamp_eiq, source_name_eiq, feed_id_eiq, meta_entity_url_eiq, value_eiq, last_updated_at, entity_type, sighting, meta_tags_eiq, observable_id\
| outputlookup eiq_alerts_list append=True key_field=key

[EclecticIQ tstats Threat Intelligence alert - Email]
action.webhook.enable_allowlist = 0
search = |`eiq_dm_alert_email`  \
| eval value=coalesce(src_user,recipient) \
| join value type=inner max=0 \
    [ search `observables_index` earliest=0 latest=now() \
    | rename meta.maliciousness as confidence \
    | rename id as obs_id \
    | sort - last_updated_at \
    | dedup obs_id \
    | mvexpand entities{} \
    | table obs_id, value, confidence, type, entities{},last_updated_at] \
| eval entity_id = substr('entities{}', -36) \
| join entity_id type=inner max=0 \
    [ search `entity_index` earliest=0 latest=now() \
    | rename meta.tags{} as tags, sources{} as sources , data.title as title \
    | rename id as entity_id \
    | sort - last_updated_at \
    | dedup entity_id \
    | rename type as entity_type \
    | table entity_id tags, sources, title, outgoing_feeds, entity_type] \
| eval alert_field=case(isnotnull(value), "email") \
| eval event_hash=sha512(sourcetype.index._time.host.value) \
| eval alert_source="splunk_dm_search" \
| rename entities{} as entities \
| stats values(entity_id) as entity_id, values(alert_field) as alert_field, values(value) as value, values(type) as type, values(entities) as entities,values(last_updated_at) as last_updated_at, values(obs_id) as obs_id ,values(alert_source) as alert_source, values(tags) as meta_tags_eiq, values(sources) as sources, values(title) as title latest(_time) as time , values(index) as index , values(sourcetype) as sourcetypes, values(host) as host, values(outgoing_feeds) as outgoing_feeds , ,values(entity_type) as entity_type, values(type) as type_eiq, values(eiq_src) as src, values(eiq_dest) as dest, values(confidence) as confidence_eiq, values(sourcetype) as sourcetype by event_hash\
| eval key=time."-".'event_hash',event_index=index, event_sourcetype=sourcetype, event_time=time, event_host=host,timestamp_eiq = strftime(now(), "%Y-%m-%dT%H:%M:%S.%6N%:z") , meta_entity_url_eiq=entity_id ,entity_title_eiq=title, feed_id_eiq = outgoing_feeds , sighting ="0", source_name_eiq= sources, value_eiq= value, observable_id=obs_id\
| table key,entity_id, alert_field, alert_source,confidence_eiq, src, dest,entity_title_eiq, event_time, event_hash, event_index, event_host, event_sourcetype,feed_id_eiq, value_url_eiq, type_eiq, timestamp_eiq, source_name_eiq, feed_id_eiq, meta_entity_url_eiq, value_eiq, last_updated_at, entity_type, sighting, meta_tags_eiq, observable_id\
| outputlookup eiq_alerts_list append=True key_field=key