[Errors - PowerShell Errors]
search = eventtype=mssql sourcetype="PowerShell:ScriptExecutionErrorRecord" | rex field=PositionMessage "At (?<ScriptFile>[A-Z]:[^:]+):" | stats count by ScriptFile,CategoryInfo,Exception
dispatch.earliest_time = -8h
dispatch.latest_time = now

[Index Performance - Missing Indices]
search = eventtype=mssql-indexstats-missing | eval equality_columns=replace(equality_columns,"\\[","=[") | eval inequality_columns=replace(inequality_columns,"\\[","![") | eval included_columns=replace(included_columns,"\\[","+[") | eval columns=included_columns + ", " + equality_columns + ", " + inequality_columns | eval columns=replace(columns,"^, ","") | eval columns=replace(columns,", $","") | eval columns=replace(columns, ", , ",", ") | eval columns=split(columns, ", ") | stats values(columns) as Columns,sparkline(avg(user_seeks)) as "Seeks", sum(user_seeks) as us,avg(avg_total_user_cost) as tuc,max(avg_user_impact) as aui by ServerInstance,DatabaseName,Table | eval "Index Impact"=us*tuc*aui*0.01 | table ServerInstance,DatabaseName,Table,Columns,Seeks,"Index Impact" | sort -"Index Impact"
dispatch.earliest_time = -24h
dispatch.latest_time = now
is_visible = false

[Index Performance - Underused Indices]
search = eventtype=mssql-indexstats-usage | stats sparkline(avg(Reads)) as Reads,sparkline(avg(Writes)) as Writes, max(FillFactor) as FillFactor,sum(Reads) as TotalReads, sum(Writes) as TotalWrites by ServerInstance,DatabaseName,IndexName,IndexType | where TotalWrites >= TotalReads | table ServerInstance,DatabaseName,IndexName,IndexType,Reads,Writes,FillFactor,TotalReads,TotalWrites | sort TotalReads
dispatch.earliest_time = -24h
dispatch.latest_time = now
is_visible = false

[Lookup - MSSQL Instances]
search = eventtype=mssql-instanceinfo | stats latest(DisplayName) as DisplayName,latest(Name) as Name,latest(Clustered) as Clustered,latest(InstanceID) as InstanceID,latest(FileVersion) as FileVersion,latest(Version) as Version,latest(VirtualName) as VirtualName,latest(Instance) as Instance,latest(Port) as Port,latest(ServiceAccount) as ServiceAccount,latest(Edition) as Edition,latest(AuditLevel) as AuditLevel,latest(LoginMode) as LoginMode,latest(PhysicalMemory) as PhysicalMemory,latest(Processors) as Processors,latest(Product) as Product,latest(ProductLevel) as ProductLevel,latest(MajorVersion) as MajorVersion,latest(MinorVersion) as MinorVersion,latest(Build) as Build,latest(Release) as Release by host,ServerInstance | outputlookup SQLInstanceInformation
cron_schedule = 15 */4 * * *
dispatch.earliest_time = -24h
dispatch.latest_time = +0s
enableSched = true
run_on_startup = true

[Lookup - MSSQL Databases]
search = eventtype=mssql-databaseinfo | stats latest(Name) as Name,latest(ID) as ID,latest(DatabaseOwnershipChaining) as DatabaseOwnershipChaining,latest(Parent) as Parent,latest(CompatibilityLevel) as CompatibilityLevel,latest(DboLogin) as DboLogin,latest(DefaultSchema) as DefaultSchema,latest(EncryptionEnabled) as EncryptionEnabled,latest(LastBackupDate) as LastBackupDate,latest(LastDifferentialBackupDate) as LastDifferentialBackupDate,latest(LastLogBackupDate) as LastLogBackupDate,latest(Owner) as Owner,latest(PrimaryFilePath) as PrimaryFilePath,latest(LogicalDisk) as LogicalDisk,latest(ReadOnly) as ReadOnly,latest(Version) as Version,latest(Urn) as Urn,latest(AutoGrow) as AutoGrow,latest(AutoShrink) as AutoShrink,latest(AutoGrowSetting) as AutoGrowSetting,latest(Users) as Users by host,DatabaseGuid,ServerInstance | outputlookup SQLDatabaseInformation
cron_schedule = 30 */4 * * *
dispatch.earliest_time = -24h
dispatch.latest_time = +0s
enableSched = true
run_on_startup = true

[Lookup - MSSQL Hosts]
search = eventtype=mssql-hostinfo | stats latest(ComputerName) as ComputerName,latest(ComputerDomain) as ComputerDomain,latest(OSSerialNumber) as OSSerialNumber,latest(OSVersion) as OSVersion,latest(OSBuildNumber) as OSBuildNumber by host | rex field=OSVersion "^(?<OSBaseVersion>\d+\.\d+)" | table host,ComputerName,ComputerDomain,OSSerialNumber,OSBaseVersion,OSVersion,OSBuildNumber | outputlookup SQLHostInformation
cron_schedule = 15 */4 * * *
dispatch.earliest_time = -24h
dispatch.latest_time = +0s
enableSched = true
run_on_startup = true

[Lookup - MSSQL Users]
search = eventtype=mssql-userinfo | stats latest(ID) as ID,latest(DatabaseName) as DatabaseName,latest(CreateDate) as CreateDate,latest(DateLastModified) as DateLastModified,latest(HasDBAccess) as HasDBAccess,latest(IsSystemObject) as IsSystemObject,latest(LoginType) as LoginType,latest(IsDisabled) as IsDisabled,latest(IsLocked) as IsLocked,latest(IsPasswordExpired) as IsPasswordExpired,latest(Language) as Language,latest(MustChangePassword) as MustChangePassword,latest(PasswordExpirationEnabled) as PasswordExpirationEnabled,latest(PasswordHashAlgorithm) as PasswordHashAlgorithm,latest(PasswordPolicyEnforced) as PasswordPolicyEnforced,latest(WindowsLoginAccessType) as WindowsLoginAccessType by Name,ServerInstance,DatabaseGuid | outputlookup SQLUserInformation
cron_schedule = 15 */4 * * *
dispatch.earliest_time = -24h
dispatch.latest_time = +0s
enableSched = true
run_on_startup = true

[LookupBuilder - Last Login Time]
search = eventtype=mssql-audit succeeded="true" | lookup dm_audit_class_type class_type OUTPUT securable_class_desc | search securable_class_desc="LOGIN" | stats latest(_time) as LastLogin by session_server_principal_name,server_instance_name | rename session_server_principal_name as user,server_instance_name as ServerInstance | inputlookup append=T SQLLastLogin | stats max(LastLogin) as LastLogin by user,ServerInstance | outputlookup SQLLastLogin
cron_schedule = */15 * * ? * *
dispatch.earliest_time = -15m
dispatch.latest_time = +0s
enableSched = true
run_on_startup = true
is_visible = false

[Lookup - Last Login Time]
search = eventtype=mssql-audit succeeded="true" | lookup dm_audit_class_type class_type OUTPUT securable_class_desc | search securable_class_desc="LOGIN" | stats latest(_time) as LastLogin by session_server_principal_name,server_instance_name | rename session_server_principal_name as user,server_instance_name as ServerInstance | outputlookup SQLLastLogin
dispatch.earliest_time = -24h
dispatch.latest_time = +0s

[Operations Overview - SQL Instances]
search = | inputlookup SQLInstanceInformation | join host,DisplayName [ search eventtype=mssql-services | stats latest(Status) as Status by host,DisplayName ] | stats values(Status) as Status by ServerInstance | eval nStatus = if(Status=="Running","Running",Status) | stats count by nStatus | rename nStatus as Status
dispatch.earliest_time = -10m
dispatch.latest_time = now
is_visible = false

[Operations Overview - SQL Databases]
search = | inputlookup SQLDatabaseInformation | join host,DatabaseGuid [search eventtype=mssql-databasehealth | stats latest(Status) as Status by host,DatabaseGuid] | stats values(Status) as Status by DatabaseGuid,ServerInstance | eval Status=if(isnull(Status),"Failed",Status) | eval nStatus = if(Status=="Normal","Normal",Status) | stats count by Status
dispatch.earliest_time = -10m
dispatch.latest_time = now
is_visible = false

[Operations Overview - Busiest SQL Databases]
search = eventtype=mssql-databasehealth | lookup SQLDatabaseInformation DatabaseGuid OUTPUT Name,ServerInstance | stats latest(ActiveConnections) as ActiveConnections by Name,ServerInstance | sort -ActiveConnections | head 10
dispatch.earliest_time = -10m
dispatch.latest_time = now
is_visible = false

[Operations Overview - Largest SQL Databases]
search = eventtype=mssql-databasehealth | lookup SQLDatabaseInformation DatabaseGuid OUTPUT Name,ServerInstance | stats latest(Size) as Size by Name,ServerInstance | sort -Size | head 10 | rename Size AS "Size (MB)"
dispatch.earliest_time = -10m
dispatch.latest_time = now
is_visible = false

[Operations Overview - SQL Host Errors]
search = | inputlookup SQLInstanceInformation | join host,DisplayName [ search eventtype=mssql-services | stats latest(Status) as Status by host,DisplayName ] | join host [ search eventtype=mssql | stats latest(_time) as lastEvent by host | eval difftime=now()-lastEvent | fields host,difftime ] | eval Status=if(difftime>300,"Non-Reporting",Status) | stats values(Status) as Status,values(host) as Hosts by ServerInstance | where Status!="Running" | rename ServerInstance as Instance
dispatch.earliest_time = -10m
dispatch.latest_time = now
is_visible = false

[SQL Instance Upgrade Report]
search =| inputlookup SQLInstanceInformation | lookup SQLBuilds Version OUTPUT Patch,Recommended | where Recommended!="Yes" | table host,ServerInstance,DisplayName,Version,Patch,Recommended | rename Version as "Current Version",Patch as "Current Patch" 
dispatch.earliest_time = -10m
dispatch.latest_time = now
is_visible = false

#
# There is a list of KPI's that output
#	host Statistic Value color
# in macros.conf - each KPI is appended and then a chart based on Statistic is done.
# Alter the table and the appends to add a new statistic
#
[SQL Host List]
search = `mssql-perf-cpu-kpi` | append [ search `mssql-perf-process-kpi` ] | append [ search `mssql-perf-qlen-kpi` ] | append [ search `mssql-perf-space-kpi` ] | chart last(range) by host,Statistic | lookup SQLHostInformation host OUTPUT ComputerDomain,ComputerName | where isnotnull(ComputerDomain) | eval HostDomain=ComputerDomain+"\\"+ComputerName | table host,HostDomain,"% Processor Time","SQL % Processor Time","Disk Queue Length","Disk Min % Free Space" | sort host
dispatch.earliest_time = -15m
dispatch.latest_time = now
is_visible = false

[Security - Server Logons - Last 24 hours]
search = eventtype=mssql-audit succeeded="true" | lookup dm_audit_class_type class_type OUTPUT securable_class_desc | search securable_class_desc="LOGIN" | stats latest(_time) as lastLogin, count as nLogins by session_server_principal_name,server_instance_name | eval lastLogin = strftime(lastLogin, "%F %T") | rename session_server_principal_name as "User", server_instance_name as "ServerInstance", nLogins as "# Logins", lastLogin as "Last Login Time" | sort - "# Logins"
dispatch.earliest_time = -24h
dispatch.latest_time = now
is_visible = false

[Security - Failed Logons - Last 24 hours]
search = eventtype=mssql-audit | lookup dm_audit_class_type class_type OUTPUT securable_class_desc | search securable_class_desc="LOGIN" | eval flc=if(succeeded=="false",1,0) | eval slc=if(succeeded=="true",1,0) | eval flv=if(succeeded=="false",server_principal_name,"") | eval slv=if(succeeded=="true",session_server_principal_name,"") | eval src_ip=if(src_ip=="<local machine>",host + " (Local)",src_ip) | stats latest(_time) as last_attempt,sum(flc) as flc,sum(slc) as slc,values(flv) as flv,values(slv) as slv by src_ip | where flc > 0 | eval slc=if(slc>0,"Yes","") | eval last_attempt=strftime(last_attempt,"%F %T") | table src_ip,last_attempt, flv, slv, slc | rename src_ip as "Source", last_attempt as "Last Attempt", flv as "Failed Logon IDs", slv as "Successful Logon IDs", slc as "Successful?"
dispatch.earliest_time = -24h
dispatch.latest_time = now
is_visible = false

[Security - Database Operations - Last 24 hours]
search = eventtype=mssql-audit class_type="DB" action_id!="VDST" | lookup dm_audit_actions action_id OUTPUT name | join host, session_id, server_principal_id [ search eventtype=mssql-audit class_type="LX" succeeded="true" | eval src_ip=if(src_ip=="local machine",host,src_ip) | stats values(src_ip) as src_ip by host,session_id,server_principal_id ] | table _time,session_server_principal_name,src_ip,name,action_signature,server_instance_name,object_name,succeeded | rename session_server_principal_name as "User ID",src_ip as "Source System",name as Action,action_signature as Operation,server_instance_name as ServerInstance,object_name as DatabaseName,succeeded as "Succeeded?"
dispatch.earliest_time = -24h
dispatch.latest_time = now
is_visible = false

[Security - Rare Queries - Last 24 hours]
search = eventtype=mssql-audit class_type=U | stats earliest(_time) as _time,earliest(RecordNumber) as rn,count by host,session_id,server_principal_id,succeeded,schema_name,object_name,server_instance_name,database_name,session_server_principal_name,statement,action_id| where count < 10 | join host,session_id,server_principal_id [ search eventtype=mssql-audit class_type=LX succeeded=true | stats earliest(_time) as logonTime, values(src_ip) as src_ip by host,session_id,server_principal_id ] | lookup dm_audit_actions action_id OUTPUT name | eval logonTime=strftime(logonTime,"%F %T") | eval obj=schema_name + ".[" + object_name + "]" | table _time,session_server_principal_name,src_ip,logonTime,server_instance_name,database_name,name,obj,count,host,rn | sort +count | rename session_server_principal_name as "User",src_ip as "Workstation",logonTime as "Logon Time",server_instance_name as "ServerInstance",database_name as "DatabaseName",name as "SQL Command",obj as "Table/View",count as "Occurrances",host as "ReportingHost",rn as "RecordNumber"
dispatch.earliest_time = -24h
dispatch.latest_time = now
is_visible = false

