
# As of version 8, we now use dateTimeConnect as the primary timestamp.
# the reason we do this is that it minimizes the need for sorts at search time,
# because the legs go into the index in the same order that we'll want them displayed
# to the user.
[custom_timestamp_extraction]
INGEST_EVAL = _time = case(isnotnull(dateTimeConnect) AND dateTimeConnect!="0", dateTimeConnect, isnotnull(dateTimeDisconnect) AND dateTimeDisconnect!="0", dateTimeDisconnect, true(),dateTimeOrigination)

[no_column_headers]
REGEX = ^INTEGER\,INTEGER\,INTEGER.*$
DEST_KEY = queue
FORMAT = nullQueue

[remove_lines_without_data]
REGEX = ^\d+$
DEST_KEY = queue
FORMAT = nullQueue

[cucm_server_name]
REGEX = c(?:d|m)r_(.+)_\d+_\d+$
FORMAT = server_name::$1
WRITE_META = true
SOURCE_KEY = MetaData:Source

[cube_server_name]
REGEX = (cube_)?(?<server_name>[^\/\\\.]*)\.\d{2}_\d{2}_\d{4}_\d{2}_\d{2}_\d{2}.\d{3}$
FORMAT = server_name::$2
WRITE_META = true
SOURCE_KEY = MetaData:Source

[multivalue_device_name]
INGEST_EVAL = device_name = mvappend(origDeviceName,destDeviceName)

[make_called_party_number_index_time]
INGEST_EVAL = calledPartyNumber = finalCalledPartyNumber

[make_hpdn_index_time]
INGEST_EVAL = huntPilotDN = if(isnull(huntPilotDN) AND calledPartyPatternUsage="7",finalCalledPartyNumber,huntPilotDN)

[make_cucm_call_id_index_time]
INGEST_EVAL = call_id = globalCallId_ClusterID + "." + globalCallID_callManagerId + "." + globalCallID_callId

#index=cisco_cdr origIpAddr!=0
#| table origIpAddr
#| streamstats count
#``` introducing some artificial testcase numbers with less than full digits ```
#| eval origIpAddr=case(count==1,"4294967295", count==2, "0", count==3, "1", count=="4", "16", count=="5", "256", count=="6", "4096", count=="7", "65536", count=="8", "1048576", count=="9", "16777216", count=="10", "268435456", true(), origIpAddr)
#| eval legacy=origIpAddr
#| `convert_ip_address(legacy)`
#| eval orig_reverse_hex = case(tonumber(origIpAddr)<0,"",tonumber(origIpAddr)<16, "0000000", tonumber(origIpAddr)<256, "000000", tonumber(origIpAddr)<4096, "00000", tonumber(origIpAddr)<65536, "0000", tonumber(origIpAddr)<1048576, "000", tonumber(origIpAddr)<16777216, "00", tonumber(origIpAddr)<268435456,"0",true(),"") . substr(if (tostring(origIpAddr,"hex")!="0xFFFFFFFF", replace(tostring(origIpAddr,"hex"), "0xFFFFFFFF", "0x"), tostring(origIpAddr,"hex")), 3, 8)
#| eval src_ip=tonumber(substr(orig_reverse_hex,7,2),16) . ".". tonumber(substr(orig_reverse_hex,5,2),16).".".tonumber(substr(orig_reverse_hex,3,2),16).".".tonumber(substr(orig_reverse_hex,1,2),16)

[make_src_ip_addr_index_time]
# the first part with all the numerical comparison is basically just zeropadding for the hex integer we make.
# the hex integer we make is 8chars (zeropadded), and is the bytes in reverse order.
# in the last step we simply reverse them and make them into a dotted quad of decimal integers.
# Note that if the origIpAddr is 0,  and origIpv4v6Addr is populated, we use origIpv4v6Addr (which is NOT
# logged as a signed long integer).
INGEST_EVAL = orig_reverse_hex=if(origIpAddr=="0" AND isnotnull(origIpv4v6Addr),null(),case(tonumber(origIpAddr)<0,"",tonumber(origIpAddr)<16, "0000000", tonumber(origIpAddr)<256, "000000", tonumber(origIpAddr)<4096, "00000", tonumber(origIpAddr)<65536, "0000", tonumber(origIpAddr)<1048576, "000", tonumber(origIpAddr)<16777216, "00", tonumber(origIpAddr)<268435456,"0",true(),"") . substr(if (tostring(origIpAddr,"hex")!="0xFFFFFFFF", replace(tostring(origIpAddr,"hex"), "0xFFFFFFFF", "0x"), tostring(origIpAddr,"hex")), 3, 8)), src_ip=if(origIpAddr=="0" AND isnotnull(origIpv4v6Addr), origIpv4v6Addr,tonumber(substr(orig_reverse_hex,7,2),16) . ".". tonumber(substr(orig_reverse_hex,5,2),16).".".tonumber(substr(orig_reverse_hex,3,2),16).".".tonumber(substr(orig_reverse_hex,1,2),16))

[make_dest_ip_addr_index_time]
# see comments on make_src_ip_addr_index_time
INGEST_EVAL = dest_reverse_hex=if(destIpAddr=="0" AND isnotnull(destIpv4v6Addr),null(),case(tonumber(destIpAddr)<0,"",tonumber(destIpAddr)<16, "0000000", tonumber(destIpAddr)<256, "000000", tonumber(destIpAddr)<4096, "00000", tonumber(destIpAddr)<65536, "0000", tonumber(destIpAddr)<1048576, "000", tonumber(destIpAddr)<16777216, "00", tonumber(destIpAddr)<268435456,"0",true(),"") . substr(if (tostring(destIpAddr,"hex")!="0xFFFFFFFF", replace(tostring(destIpAddr,"hex"), "0xFFFFFFFF", "0x"), tostring(destIpAddr,"hex")), 3, 8)), dest_ip=if(destIpAddr=="0" AND isnotnull(destIpv4v6Addr), destIpv4v6Addr,tonumber(substr(dest_reverse_hex,7,2),16) . ".". tonumber(substr(dest_reverse_hex,5,2),16).".".tonumber(substr(dest_reverse_hex,3,2),16).".".tonumber(substr(dest_reverse_hex,1,2),16))

[build_call_guid_words]
INGEST_EVAL = incomingGuidWord1=substr(IncomingProtocolCallRef,0,8), incomingGuidWord2=substr(IncomingProtocolCallRef,9,8), incomingGuidWord3=substr(IncomingProtocolCallRef,17,8), incomingGuidWord4=substr(IncomingProtocolCallRef,25,8), outgoingGuidWord1=substr(OutgoingProtocolCallRef,0,8), outgoingGuidWord2=substr(OutgoingProtocolCallRef,9,8), outgoingGuidWord3=substr(OutgoingProtocolCallRef,17,8), outgoingGuidWord4=substr(OutgoingProtocolCallRef,25,8)

[cube_calling_party_number]
INGEST_EVAL = callingPartyNumber = clid

[cube_called_party_number]
INGEST_EVAL = calledPartyNumber = dnis

[cube_duration]
INGEST_EVAL = duration = round(if(isnotnull(tx_duration) AND tx_duration!="",tonumber(substr(tx_duration,0,len(tx_duration)-3))/1000,tonumber(strptime(h323_disconnect_time,"*%H:%M:%S.%3N %Z %a %b %d %Y")) - tonumber(strptime(h323_connect_time,"*%H:%M:%S.%3N %Z %a %b %d %Y"))),3)


####################
# FILE-BASED LOOKUPS
####################

# In the Canary UI - the entire masthead is made of Canary modules
# this is a piece of the logic that creates our "settings" link in the top right.
[manager_sections]
filename = manager_sections.csv

[call_release_cause_codes]
filename = call_release_cause_codes.csv
reverse_lookup_honor_case_sensitive_match = false

[redirect_reason_codes]
filename = redirect_reason_codes.csv
reverse_lookup_honor_case_sensitive_match = false

[on_behalf_of_codes]
filename = on_behalf_of_codes.csv
reverse_lookup_honor_case_sensitive_match = false

[codec_types]
filename = codec_types_detailed.csv
reverse_lookup_honor_case_sensitive_match = false

[pattern_usage_codes]
filename = pattern_usage_codes.csv
reverse_lookup_honor_case_sensitive_match = false

[routing_reasons]
filename = routing_reasons.csv
reverse_lookup_honor_case_sensitive_match = false

[mobile_call_types]
filename = mobile_call_types.csv
reverse_lookup_honor_case_sensitive_match = false

[call_quality_thresholds]
filename = call_quality_thresholds.csv
reverse_lookup_honor_case_sensitive_match = false

[call_quality_thresholds_default]
filename = call_quality_thresholds.default.7.6.csv

[protocol_call_ref_id]
filename = protocol_call_ref_id.6.5.csv
reverse_lookup_honor_case_sensitive_match = false

[dtmfmethod]
filename = dtmfmethod.6.5.csv
reverse_lookup_honor_case_sensitive_match = false

[precedence_level]
filename = precedence_level.6.5.csv
reverse_lookup_honor_case_sensitive_match = false

[rsvpstat]
filename = rsvpstat.6.5.csv
reverse_lookup_honor_case_sensitive_match = false

[videocap_resolution]
filename = videocap_resolution.6.5.csv
reverse_lookup_honor_case_sensitive_match = false


[data_types]
filename = data_types.csv
reverse_lookup_honor_case_sensitive_match = false

[data_types_default]
filename = data_types.default.csv

[groups]
filename = groups.csv
reverse_lookup_honor_case_sensitive_match = false
max_matches = 1
match_type = WILDCARD(number)

[groups_default]
filename = groups.default.csv

[devices]
filename = devices.csv
reverse_lookup_honor_case_sensitive_match = false
max_matches = 1
match_type = EXACT(name) WILDCARD(clusterId)

[devices_default]
filename = devices.7.8.default.csv

[cidr]
filename = cidr.csv
reverse_lookup_honor_case_sensitive_match = false
match_type = CIDR(subnet)
max_matches = 1

[cidr_default]
filename = cidr.default.csv

[clusters]
filename = clusters.csv
case_sensitive_match = false
reverse_lookup_honor_case_sensitive_match = false

[clusters_default]
filename = clusters.7.8.default.csv

#[gateways]
#filename = gateways.csv

[field_gallery]
filename = field_gallery.8.2.csv
reverse_lookup_honor_case_sensitive_match = false

[report_gallery]
filename = report_gallery.csv
reverse_lookup_honor_case_sensitive_match = false

[examples]
filename = examples.8.1.1.csv
reverse_lookup_honor_case_sensitive_match = false

[field_areas]
filename = field_areas.csv
reverse_lookup_honor_case_sensitive_match = false

[country_codes]
filename = country_codes.csv
reverse_lookup_honor_case_sensitive_match = false
match_type=WILDCARD(nanpa_region)
max_matches = 1

# IOS VOICE GATEWAY STUFF
[vg_leg_types]
filename = vg_leg_types.csv
reverse_lookup_honor_case_sensitive_match = false

[vg_call_types]
filename = vg_call_types.csv
reverse_lookup_honor_case_sensitive_match = false

[vg_info_types]
filename = vg_info_types.csv
reverse_lookup_honor_case_sensitive_match = false

[vg_q931_cause_codes]
filename = vg_q931_cause_codes.csv
reverse_lookup_honor_case_sensitive_match = false

[vg_feature_names]
filename = vg_feature_names.csv
reverse_lookup_honor_case_sensitive_match = false

[vg_codec_type_rates]
filename = vg_codec_type_rates.csv
reverse_lookup_honor_case_sensitive_match = false

[vg_huntgroups]
filename = vg_huntgroups.csv
reverse_lookup_honor_case_sensitive_match = false





# 8 digit extensions that begin with 6, are broken into a 4 digit siteCode
# and a 4 digit extension.
#[custom-callingPartySiteCode]
#REGEX = ^((?<callingPartySitecode>6\d{3})(?<callingPartyExtension>\d{4}))$
#SOURCE_KEY = callingPartyNumber

[cisco-cdr-comment]
REGEX  = (?m)(\w+)=([^;]+)
FORMAT = $1::$2
SOURCE_KEY=comment

[cisco-cmr-varvqmetrics]
REGEX  = (?m)(\w+)=([\d\.]+)
FORMAT = $1::$2
SOURCE_KEY=varVQMetrics

[cisco-cmr-videotransmissionmetrics]
REGEX  = (?m)(\w+)=([\d\.]+)
FORMAT = $1::$2
SOURCE_KEY=videoTransmissionMetrics

[cisco-cmr-videoreceptionmetrics]
REGEX  = (?m)(\w+)=([\d\.]+)
FORMAT = $1::$2
SOURCE_KEY=videoReceptionMetrics

[cisco-cmr-videotransmissionmetrics_channel2]
REGEX  = (?m)(\w+)=([\d\.]+)
FORMAT = $1::$2
SOURCE_KEY=videoTransmissionMetrics_channel2

[cisco-cmr-videoreceptionmetrics_channel2]
REGEX  = (?m)(\w+)=([\d\.]+)
FORMAT = $1::$2
SOURCE_KEY=videoReceptionMetrics_channel2

[cisco-cdr-orighardphone]
REGEX  = ^SEP([\dABCDEF]{12})
FORMAT = origHardPhoneMac::$1 orig_device_type::hardphone
SOURCE_KEY=origDeviceName

[cisco-cdr-desthardphone]
REGEX  = ^SEP([\dABCDEF]{12})
FORMAT = destHardPhoneMac::$1 dest_device_type::hardphone
SOURCE_KEY=destDeviceName


[cisco-cdr-origanalogdevice]
REGEX  = ^AN([\dABCDEF]{12})
FORMAT = origAnalogMac::$1 orig_device_type::analogdevice
SOURCE_KEY=origDeviceName

[cisco-cdr-destanalogdevice]
REGEX  = ^AN([\dABCDEF]{12})
FORMAT = destAnalogMac::$1 dest_device_type::analogdevice
SOURCE_KEY=destDeviceName

[cisco-cdr-origjabberdesktop]
REGEX  = ^(CSF\S+)
FORMAT = orig_device_type::jabberdesktop
SOURCE_KEY=origDeviceName

[cisco-cdr-destjabberdesktop]
REGEX  = ^(CSF\S+)
FORMAT = dest_device_type::jabberdesktop
SOURCE_KEY=destDeviceName

[cisco-cdr-origjabberiphone]
REGEX  = ^(TCT\S+)
FORMAT = orig_device_type::jabberiphone
SOURCE_KEY=origDeviceName

[cisco-cdr-destjabberiphone]
REGEX  = ^(TCT\S+)
FORMAT = dest_device_type::jabberiphone
SOURCE_KEY=destDeviceName

[cisco-cdr-origjabberandroid]
REGEX  = ^(BOT\S+)
FORMAT = orig_device_type::jabberandroid
SOURCE_KEY=origDeviceName

[cisco-cdr-destjabberandroid]
REGEX  = ^(BOT\S+)
FORMAT = dest_device_type::jabberandroid
SOURCE_KEY=destDeviceName

[cisco-cdr-origjabbertablet]
REGEX  = ^(TAB\S+)
FORMAT = orig_device_type::jabbertablet
SOURCE_KEY=origDeviceName

[cisco-cdr-destjabbertablet]
REGEX  = ^(TAB\S+)
FORMAT = dest_device_type::jabbertablet
SOURCE_KEY=destDeviceName

# Cisco Unified Personal Communicator
[cisco-cdr-origcupc]
REGEX  = ^(CUPC\S+)
FORMAT = orig_device_type::cupc
SOURCE_KEY=origDeviceName

[cisco-cdr-destcupc]
REGEX  = ^(CUPC\S+)
FORMAT = dest_device_type::cupc
SOURCE_KEY=destDeviceName

[cisco-cdr-origipcom]
REGEX  = (?i)^(cipc-|ipcom-)\S+
FORMAT = orig_device_type::ipcommunicator
SOURCE_KEY=origDeviceName

[cisco-cdr-destipcom]
REGEX  = (?i)^(cipc-|ipcom-)\S+
FORMAT = dest_device_type::ipcommunicator
SOURCE_KEY=destDeviceName

[cisco-cdr-origuccx]
REGEX = (?i)^(uccx_.+)
FORMAT = origUccxDevice::$1 orig_device_type::uccx
SOURCE_KEY=origDeviceName

[cisco-cdr-destuccx]
REGEX = (?i)^(uccx_.+)
FORMAT = destUccxDevice::$1 dest_device_type::uccx
SOURCE_KEY=destDeviceName

[cisco-cdr-origcti]
REGEX = (?i)^(?:CCX|CTIP)_(.+)
FORMAT = orig_cti_route_point::$1 orig_device_type::cti
SOURCE_KEY=origDeviceName

[cisco-cdr-destcti]
REGEX = (?i)^(?:CCX|CTIP)_(.+)
FORMAT = dest_cti_route_point::$1 dest_device_type::cti
SOURCE_KEY=destDeviceName

[cisco-cdr-origcallcontrolgroup]
REGEX  = (?i)^CCG[-_]+(\S+)
FORMAT = origCallControlGroup::$1 orig_device_type::ccg
SOURCE_KEY=origDeviceName

[cisco-cdr-destcallcontrolgroup]
REGEX  = (?i)^CCG[-_]+(\S+)
FORMAT = destCallControlGroup::$1 dest_device_type::ccg
SOURCE_KEY=destDeviceName

[cisco-cdr-origunityvm]
# was:
#REGEX  = ^((?:CiscoUM|Unity)[-\S]+)
REGEX  = ^((?:CiscoUM|Unity)(?!.*trunk).*)
FORMAT = origUnityVMDevice::$1 orig_device_type::unityvm
SOURCE_KEY=origDeviceName

[cisco-cdr-destunityvm]
# was:
#REGEX  = ^((?:CiscoUM|Unity)[-\S]+)
REGEX  = ^((?:CiscoUM|Unity)(?!.*trunk).*)
FORMAT = destUnityVMDevice::$1 dest_device_type::unityvm
SOURCE_KEY=destDeviceName


[cisco-cdr-origcfb]
REGEX  = (^CFB|CONF$)
FORMAT = orig_device_type::conference_bridge
SOURCE_KEY=origDeviceName

[cisco-cdr-destcfb]
REGEX  = (^CFB|CONF$)
FORMAT = dest_device_type::conference_bridge
SOURCE_KEY=destDeviceName

[cisco-cdr-origicd]
REGEX  = ^(ICD_\S+)
FORMAT = dest_device_type::icd_queue
SOURCE_KEY=destDeviceName

[cisco-cdr-desticd]
REGEX  = ^(ICD_\S+)
FORMAT = orig_device_type::icd_queue
SOURCE_KEY=origDeviceName

[cisco-cdr-origipcc]
REGEX  = ^(IPCC_\S+)
FORMAT = dest_device_type::ipcc_cti_port
SOURCE_KEY=destDeviceName

[cisco-cdr-destipcc]
REGEX  = ^(IPCC_\S+)
FORMAT = orig_device_type::ipcc_cti_port
SOURCE_KEY=origDeviceName

# what about FXS devices...
[cisco-cdr-origata]
REGEX  = ^(ATA[\dABCDEF]+)
FORMAT = orig_device_type::ata
SOURCE_KEY=origDeviceName

[cisco-cdr-destata]
REGEX  = ^(ATA[\dABCDEF]+)
FORMAT = dest_device_type::ata
SOURCE_KEY=destDeviceName




# NOTE: as of this writing the nature of the "alt_host" and "alt_name" fields are not understood.
# However extracting them here at least with these temporary names will allow future users
# to more easily use them just by changing the names in the FORMAT key below.
[alternate-syslog-fields]
REGEX = \w{3}\s\d{2}\s\d{2}:\d{2}:\d{2}\s(\S+)\s(\S+)\s(\d+)\s:\s\d+:\s\S+\s\w{3}\s\d{2}\s\d{4}\s\d{2}:\d{2}:\d{2}\s\S+\s:\s+%([\w-]*-(\w+)):\s%
FORMAT = alt_host::$1 alt_name::$2 globalCallID_callManagerId::$3 hostname::$4 type::$5


[cisco-cdr-dest-mgcp-gateway]
SOURCE_KEY=destDeviceName
#Works when tested... fails in splunk.
#REGEX = ^([^/]+/)?S([\d]+)(?:/SU([\d]+))?/([^@]+)@(.+)

REGEX = ^(?<dest_AALN>[^/]+)?/?(?<dest_gateway_slot>S[\d]+)/(?<dest_gateway_sub_unit>SU[\d]+)?/?(?<dest_gateway_port>[^@]+)@(?<dest_mgcp_gateway>.+)
FORMAT = dest_AALN::$1 dest_gateway_slot::$2 dest_gateway_sub_unit::$3 dest_gateway_port::$4 dest_mgcp_gateway::$5 dest_gateway::$5 dest_device_type::gateway

[cisco-cdr-orig-mgcp-gateway]
SOURCE_KEY=origDeviceName
# works when tested... fails in splunk.
#REGEX = ^([^/]+/)?S([\d]+)(?:/SU([\d]+))?/([^@]+)@(.+)
REGEX = ^(?<orig_AALN>[^/]+)?/?(?<orig_gateway_slot>S[\d]+)/(?<orig_gateway_sub_unit>SU[\d]+)?/?(?<orig_gateway_port>[^@]+)@(?<orig_mgcp_gateway>.+)
FORMAT = orig_AALN::$1 orig_gateway_slot::$2 orig_gateway_sub_unit::$3 orig_gateway_port::$4 orig_mgcp_gateway::$5 orig_gateway::$5 orig_device_type::gateway

[cucm_outgoing_call_reference_id]
SOURCE_KEY = OutgoingProtocolCallRef
REGEX =  ^(.{8})
FORMAT = outgoing_call_reference_id::$1

[cucm_incoming_call_reference_id]
SOURCE_KEY = IncomingProtocolCallRef
REGEX =  ^(.{8})
FORMAT = incoming_call_reference_id::$1


###########################
# lookups that can get lat/long from american DN's.
###########################
[parse_phone_numbers]
external_cmd = countrycode_areacode_exchange_lookup.py
external_type = python
fields_list = callingPartyNumber,finalCalledPartyNumber,clusterLocale,callingPartyCountryCode,callingPartyAreaCode, callingPartyExchange,callingPartyNumberType,finalCalledPartyCountryCode,finalCalledPartyAreaCode,finalCalledPartyExchange,finalCalledPartyNumberType
python.version = python3


[north_american_area_codes]
filename = npa-nxx-lata-clli-ocn-location.csv
reverse_lookup_honor_case_sensitive_match = false

[na_states]
filename = na_states.csv
reverse_lookup_honor_case_sensitive_match = false




# NOTE:  As of Cisco CDR 7.7.1 Cube data is instead ingested
# via INDEXED_EXTRACTIONS=csv along with FIELD_NAMES in props.conf
# this exists to provide field extraction for older indexed data.
[AutoHeader-ios-gateway-detailed]
DELIMS = ","
FIELDS = unix_time,call_id,cdr_type,cube_leg_type,h323_conf_id,peer_address,peer_sub_address,h323_setup_time,alert_time,h323_connect_time,h323_disconnect_time,h323_disconnect_cause,disconnect_text,h323_call_origin,charged_units,info_type,paks_out,bytes_out,paks_in,bytes_in,username,clid,dnis,gtd_orig_cic,gtd_term_cic,tx_duration,peer_id,peer_if_index,logical_if_index,acom_level,noise_level,voice_tx_duration,account_code,codec_bytes,codec_type_rate,ontime_rv_playout,remote_udp_port,remote_media_udp_port,vad_enable,receive_delay,round_trip_delay,hiwater_playout_delay,lowater_playout_delay,gapfill_with_interpolation,gapfill_with_redundancy,gapfill_with_silence,gapfill_with_prediction,early_packets,late_packets,lost_packets,max_bitrate,faxrelay_start_time,faxrelay_stop_time,faxrelay_max_jit_buf_depth,faxrelay_jit_buf_ovflow,faxrelay_init_hs_mod,faxrelay_mr_hs_mod,faxrelay_num_pages,faxrelay_tx_packets,faxrelay_rx_packets,faxrelay_direction,faxrelay_pkt_conceal,faxrelay_ecm_status,faxrelay_encap_protocol,faxrelay_nsf_country_code,faxrelay_nsf_manuf_code,faxrelay_fax_success,override_session_time,h323_ivr_out,internal_error_code,h323_voice_quality,remote_media_address,remote_media_id,carrier_id,calling_party_category,originating_line_info,charge_number,transmission_medium_req,service_descriptor,outgoing_area,incoming_area,out_trunkgroup_label,out_carrier_id,dsp_id,in_trunkgroup_label,in_carrier_id,cust_biz_grp_id,supp_svc_xfer_by,voice_feature,feature_operation,feature_op_status,feature_op_time,feature_id,gw_rxd_cdn,gw_rxd_cgn,gtd_gw_rxd_ocn,gtd_gw_rxd_cnn,gw_rxd_rdn,gw_final_xlated_cdn,gw_final_xlated_cgn,gw_final_xlated_rdn,gk_xlated_cdn,gk_xlated_cgn,gw_collected_cdn,ip_hop,redirected_station,subscriber,in_intrfc_desc,out_intrfc_desc,session_protocol,local_hostname,backward_call_id,feature_id_field1,feature_id_field2,feature_id_field3,feature_id_field4,feature_id_field5,feature_id_field6,feature_id_field7,feature_id_field8,feature_id_field9,feature_id_field10,feature_id_field11,feature_id_field12
[AutoHeader-ios-gateway-compact]
DELIMS = ","
FIELDS = unix_time,call_id,cdr_type,cube_leg_type,h323_conf_id,peer_address,peer_sub_address,h323_setup_time,alert_time,h323_connect_time,h323_disconnect_time,h323_disconnect_cause,disconnect_text,h323_call_origin,charged_units,info_type,paks_out,bytes_out,paks_in,bytes_in,username,clid,dnis,gtd_orig_cic,gtd_term_cic,tx_duration,peer_id,peer_if_index,logical_if_index,acom_level,noise_level,voice_tx_duration,account_code


# ton/npi/pi/si  in ios voice gateway fields.
# NOTE: there are more than just these 4.
[cube_final_xlated_cgn]
SOURCE_KEY = gw_final_xlated_cgn
REGEX  = ^(?:(?:ton:(\d+),npi:(\d+),)?(?:pi:(\d+),si:(\d+),)?#:)?(\w+)
FORMAT = gw_final_xlated_cgn_ton::$1 gw_final_xlated_cgn_npi::$2 gw_final_xlated_cgn_pi::$3 gw_final_xlated_cgn_si::$4 gw_final_xlated_cgn_number::$5

[cube_final_xlated_cdn]
SOURCE_KEY = gw_final_xlated_cdn
REGEX  = ^(?:(?:ton:(\d+),npi:(\d+),)?(?:pi:(\d+),si:(\d+),)?#:)?(\w+)
FORMAT = gw_final_xlated_cdn_ton::$1 gw_final_xlated_cdn_npi::$2 gw_final_xlated_cdn_pi::$3 gw_final_xlated_cdn_si::$4 gw_final_xlated_cdn_number::$5

[cube_rxd_cdn]
SOURCE_KEY = gw_rxd_cdn
REGEX  = ^(?:(?:ton:(\d+),npi:(\d+),)?(?:pi:(\d+),si:(\d+),)?#:)?(\w+)
FORMAT = gw_rxd_cdn_ton::$1 gw_rxd_cdn_npi::$2 gw_rxd_cdn_pi::$3 gw_rxd_cdn_si::$4 gw_rxd_cdn_number::$5

[cube_rxd_cgn]
SOURCE_KEY = gw_rxd_cgn
REGEX  = ^(?:(?:ton:(\d+),npi:(\d+),)?(?:pi:(\d+),si:(\d+),)?#:)?(\w+)
FORMAT = gw_rxd_cgn_ton::$1 gw_rxd_cgn_npi::$2 gw_rxd_cgn_pi::$3 gw_rxd_cgn_si::$4 gw_rxd_cgn_number::$5


[cube_call_reference_id]
SOURCE_KEY = h323_conf_id
REGEX = ^(?:[^\s]{8})?([^\s]{8})\s
FORMAT = call_reference_id::$1

# Adds parsing to SYSLOG version of CUCM audit trails.
[cucm_audit_all]
REGEX = \[\s*([^|\]]*?)\s*=\s*([^|\]]*)\]
FORMAT = $1::$2

[cucm_audit_detail]
REGEX = \[\s*(AuditDetails.*?)\]\s*\[
FORMAT = AuditDetails::$1

[cucm_audit_detail_details]
REGEX = \s*([^= ]*)\s*=\s*([^\|]*)\s*\|
FORMAT = $1::$2
SOURCE_KEY = AuditDetails

[cucm_audit_detail_simple_records]
REGEX = Application user (\S*) (\S*) to (.*)
FORMAT = object::$1 action::$2 object_category::$3 status::"success"
SOURCE_KEY = AuditDetails

[cucm_audit_user]
REGEX = (.*)
FORMAT = user::$1
SOURCE_KEY = UserID

[cucm_audit_detail_record]
REGEX = record in (.*) with key field name = (\S*) (.*)
FORMAT = action::$3 object_category::$1 object::$2 status::"success"
SOURCE_KEY = AuditDetails

[cucm_audit_detail_success1]
REGEX = Successfully Timed out of (.*)
FORMAT = action::"timeout" object::$1 status::"success"
SOURCE_KEY = AuditDetails

[cucm_audit_detail_success2]
REGEX = Successfully Logged into (.*)
FORMAT = action::"login" object::$1 status::"success"
SOURCE_KEY = AuditDetails

[cucm_audit_detail_failure]
REGEX = Failed to Log into (.*)
FORMAT = action::"login" object::$1 status::"failure"
SOURCE_KEY = AuditDetails

[cucm_audit_detail_success3]
REGEX = Successfully Logged out (.*)
FORMAT = action::"logout" object::$1 status::"success"
SOURCE_KEY = AuditDetails

[cucm_audit_detail_success4]
REGEX = (\w*) Authentication Successful
FORMAT = action::"login" status::"success"
SOURCE_KEY = AuditDetails

[cucm_audit_detail_access_component]
REGEX = Attempt to access data was successful.\s*User is authorized to access (.*)
FORMAT = action::"access" status::"success" ComponentSetting::$1
SOURCE_KEY = AuditDetails



# CUCM syslog of registration information and alarms
[cucm-syslog-codes]
REGEX = %(UC[A-Za-z0-9_]+)-(?:[A-Za-z0-9_]+-)?([0-7])-([A-Za-z0-9_]+):
FORMAT = product::$1 code::$2 cucm_eventname::$3

# this is the same regex as default syslog extractions, but appinspect flags it as a failure to
# depend on a core transform forcing us to ship our own copy of it.  Also it's considered by some
# not best practice to rely on the core syslog-extractions transform even though here it works fine.
[kiwi-syslog-extractions]
REGEX = \s([^\s\[]+)(?:\[(\d+)\])?:\s
FORMAT = process::$1 pid::$2

[cucm-syslog-bracket-kv]
REGEX = \[\s*([^=]+)\s*=\s*([^\]]+)\s*]
FORMAT = $1::$2

[cucm-syslog-event-description]
REGEX = ^.*:\s*([^:]+)\s*$
FORMAT = cucm_eventdescription::$1





