[dt_basesearch]
definition = tstats summariesonly=true count FROM datamodel=Web BY _time Web.url Web.src Web.dest source | rename Web.url AS url | rename Web.src AS src | rename Web.dest AS dest | rename source AS log_source | dtdomainextract field_in=url field_out=domain | eval domain=lower(domain) | fields url src dest log_source domain _time

[dt_rename_base_fields]
definition = rename url as URL, src as Source, dest as Destination, domain as "Domain Name", log_source as "Log Source"

[dt_rename_iris_fields]
definition = rename en_domain_name AS "Domain Name", en_risk_score AS "Overall Risk Score", en_threat_profile_malware AS "Threat Profile Malware", en_threat_profile_phishing AS "Threat Profile Phishing", en_threat_profile_spam AS "Threat Profile Spam", en_threat_profile_type as "Threat Type", en_proximity_score as "Proximity Score", en_adsense_code AS "Adsense Code", en_google_analytics_code AS "Google Analytics Code", en_popularity_rank AS "Popularity Rank", en_domain_create_date AS "Domain Create Date", en_first_seen AS "First Seen", en_server_type AS "Server Type", en_website_title AS "Website Title", en_domain_updated_timestamp AS "Domain Updated Timestamp", en_domain_expiration_date AS "Domain Expiration Date", en_tld AS "Tld", en_website_response_code AS "Website Response Code", en_redirect_url AS "Redirect Url", en_registrant_name AS "Registrant Name", en_registrant_org AS "Registrant Org", en_registrar AS "Registrar", en_spf_info AS "Spf Info", en_ga4 AS "Ga4", en_gtm_codes AS "Gtm Codes", en_fb_codes AS "Fb Codes", en_hotjar_codes AS "Hotjar Codes", en_baidu_codes AS "Baidu Codes", en_yandex_codes AS "Yandex Codes", en_matomo_codes AS "Matomo Codes", en_statcounter_project_codes AS "Statcounter Project Codes", en_statcounter_security_codes AS "Statcounter Security Codes", en_additional_codes_raw AS "Additional Codes Raw", en_additional_whois_email AS "Additional Whois Email", en_additional_soa_email AS "Additional Soa Email", en_additional_ssl_raw AS "Additional Ssl Raw", en_ssl_info_1_hash AS "Ssl Info 1 Hash", en_ssl_info_1_organization AS "Ssl Info 1 Organization", en_ssl_email AS "Ssl Email", en_ssl_info_1_subject AS "Ssl Info 1 Subject", en_ssl_info_issuer_common_name AS "Ssl Info Issuer Common Name", en_ssl_info_common_name AS "Ssl Info Common Name", en_ssl_info_not_after AS "Ssl Info Not After", en_ssl_info_not_before AS "Ssl Info Not Before", en_ssl_info_duration AS "Ssl Info Duration", en_ssl_info_alt_names AS "Ssl Info Alt Names", en_threat_profile_evidence AS "Threat Profile Evidence", en_additional_name_servers_raw AS "Additional Name Servers Raw", en_name_server_1_domain AS "Name Server 1 Domain", en_name_server_1_host AS "Name Server 1 Host", en_name_server_1_ip AS "Name Server 1 Ip", en_name_server_2_domain AS "Name Server 2 Domain", en_name_server_2_host AS "Name Server 2 Host", en_name_server_2_ip AS "Name Server 2 Ip", en_additional_mx_raw AS "Additional Mx Raw", en_mx_1_domain AS "Mx 1 Domain", en_mx_1_host AS "Mx 1 Host", en_mx_1_priority AS "Mx 1 Priority", en_mx_1_ip AS "Mx 1 Ip", en_additional_ips_raw AS "Additional Ips Raw", en_ip_1_address AS "Ip 1 Address", en_ip_1_country_code AS "Ip 1 Country Code", en_ip_1_isp AS "Ip 1 Isp", en_ip_1_asn AS "Ip 1 Asn", en_ip_2_address AS "Ip 2 Address", en_ip_2_country_code AS "Ip 2 Country Code", en_ip_2_isp AS "Ip 2 Isp", en_ip_2_asn AS "Ip 2 Asn", en_admin_contact_city AS "Admin Contact City", en_admin_contact_country AS "Admin Contact Country", en_admin_contact_fax AS "Admin Contact Fax", en_admin_contact_name AS "Admin Contact Name", en_admin_contact_org AS "Admin Contact Org", en_admin_contact_phone AS "Admin Contact Phone", en_admin_contact_postal AS "Admin Contact Postal", en_admin_contact_state AS "Admin Contact State", en_admin_contact_street AS "Admin Contact Street", en_admin_contact_email AS "Admin Contact Email", en_billing_contact_city AS "Billing Contact City", en_billing_contact_country AS "Billing Contact Country", en_billing_contact_fax AS "Billing Contact Fax", en_billing_contact_name AS "Billing Contact Name", en_billing_contact_org AS "Billing Contact Org", en_billing_contact_phone AS "Billing Contact Phone", en_billing_contact_postal AS "Billing Contact Postal", en_billing_contact_state AS "Billing Contact State", en_billing_contact_street AS "Billing Contact Street", en_billing_contact_email AS "Billing Contact Email", en_technical_contact_city AS "Technical Contact City", en_technical_contact_country AS "Technical Contact Country", en_technical_contact_fax AS "Technical Contact Fax", en_technical_contact_name AS "Technical Contact Name", en_technical_contact_org AS "Technical Contact Org", en_technical_contact_phone AS "Technical Contact Phone", en_technical_contact_postal AS "Technical Contact Postal", en_technical_contact_state AS "Technical Contact State", en_technical_contact_street AS "Technical Contact Street", en_technical_contact_email AS "Technical Contact Email", en_registrant_contact_city AS "Registrant Contact City", en_registrant_contact_country AS "Registrant Contact Country", en_registrant_contact_fax AS "Registrant Contact Fax", en_registrant_contact_name AS "Registrant Contact Name", en_registrant_contact_org AS "Registrant Contact Org", en_registrant_contact_phone AS "Registrant Contact Phone", en_registrant_contact_postal AS "Registrant Contact Postal", en_registrant_contact_state AS "Registrant Contact State", en_registrant_contact_street AS "Registrant Contact Street", en_registrant_contact_email AS "Registrant Contact Email", en_tag AS "Tag", en_tag_raw AS "Tag Raw", dt_queued AS "Queued", dt_retrieved AS "Retrieved", dt_observed AS "Observed"

# If not checked, then Enrichment Data in Cache will be ignored and an API call will be made for every domain
[enable_cache]
definition = 1

# Longer cache can result in stale data but the greater economy of queries - in days
[dt_cache_retention_period]
definition = 30

# (Minimum 0, Maximum 100)
[dt_proximity_score_threshold]
definition = 65

# (Minimum 0, Maximum 100)
[dt_threat_profile_score_threshold]
definition = 85

# (Minimum 1, Maximum 99)
[dt_high_risk_threshold]
definition = 90

# (Minimum 0, Maximum dt_high_risk_threshold-1)
[dt_medium_risk_threshold]
definition = 70

# In minutes
[dt_refresh_interval]
definition = 15

# (Minimum 0, Maximum 100)
[dt_risk_score_threshold]
definition = 75

# (Minimum 0, Maximum 100)
[dt_risk_score_increase_alert_threshold]
definition = 50

# (Less Than 'x' Days)
[dt_young_domain_age]
definition = 7

[dt_include_allowlisted_domains]
definition=0

[dt_enrich_to_stats_lookup]
definition = lookup dt_stats en_attribute_name as en_domain_name \
| eval key=en_domain_name, \
en_attribute_name = en_domain_name, \
dt_last_enriched_datetime = dt_retrieved, \
dt_fooyn_timestamp=if(isnull(dt_fooyn_timestamp), null, dt_fooyn_timestamp), \
dt_looyn_timestamp=if(isnull(dt_fooyn_timestamp), null, dt_looyn_timestamp), \
dt_num_of_times_enriched=if(isnull(dt_num_of_times_enriched), 1, dt_num_of_times_enriched + 1) \
| table key en_attribute_name dt_last_enriched_datetime dt_num_of_times_enriched dt_fooyn_timestamp dt_looyn_timestamp dt_num_of_AdhocLookups\
| outputlookup key_field=key dt_stats

[dt_include_monitoring_list_domains]
definition=0

[dt_include_allowlisted_domains_in_notable_events]
definition=0

[dt_include_allowlisted_domains_in_enrichment]
definition=1

[dt_only_monitored_domains_in_notable_events]
definition=1

[dt_use_risk_threshold_in_notable_events]
definition=0

[dt_use_threatprofile_threshold_in_notable_events]
definition=0

[dt_ignore_iris_detect_in_notable_events]
definition=0

[dt_monitor_tags_in_notable_events]
definition=0

[dt_exceed_domain_age_threshold_in_young_rule]
definition=1

[dt_only_monitored_domains_in_young_rule]
definition=0

[dt_notable_events]
definition = search index=notable | eval count=1 | where search_name IN ("DomainTools - DomainTools Young Domains - Rule", "DomainTools - DomainTools Domain Monitoring - Rule")

[dt_risk_score_increase_in_rule]
definition=1

[dt_use_risk_threshold_in_risk_rule]
definition=0

[dt_use_risk_score_increase_alert_threshold_in_risk_rule]
definition=0

[dt_detect_in_rule]
definition=1

# retry unknown domains 1 or 0
[unknown_domain_retry]
definition = 1

# minutes
[unknown_domain_retry_time]
definition = 60

# regex tldextract
[dtdomainextract2]
definition = rex field=url "(.*:\/\/)?(?P<temp_domain>[^:#\/?]+)" \
| lookup dt_public_suffix_list wildcard_tld AS temp_domain OUTPUT tld AS tld \
| where match(temp_domain, "(.*[.|@])?([\p{L}\w-]+[.]".tld."$)") \
| eval domain = replace(temp_domain, "(.*[.|@])?([\p{L}\w-]+[.]".tld."$)", "\2")

[toEpoch(1)]
args = reltime
definition = if(isnull(round(relative_time(time(), "$reltime$"))), "$reltime$", round(relative_time(time(), "$reltime$")))
iseval = 1