[CacheFlow - Update Category Lookup]
cron_schedule = 0 3 * * *
dispatch.earliest_time = -24h
dispatch.latest_time = +0s
displayview = flashtimeline
enableSched = 1
request.ui_dispatch_view = flashtimeline
search = eventtype="bc_cf_access*" | inputlookup cs_categories.csv append=true | dedup cs_categories  |  table cs_categories | outputlookup cs_categories.csv
vsid = fx3mgenj

[BlueCoat - DataCube]
search = eventtype=bcoat_request  |  bin _time span=5m | makemv delim=";" allowempty=t category |  fillnull src_ip cs_bytes category  dest_host rs_bytes sc_bytes sc_status sr_bytes  | eval client_bytes=sc_bytes+cs_bytes | eval server_bytes=rs_bytes+sr_bytes | eval savings_bytes=client_bytes-server_bytes | eval savings_bytes=if(server_bytes==0,0,savings_bytes) |  eval savings_perc = (1/client_bytes)  * savings_bytes * 100  | stats count by host src_ip sourcetype category dest_host server_bytes client_bytes savings_bytes savings_perc _time
is_visible = false

[BlueCoat - DataCube - Summary Index]
cron_schedule = 0 */6 * * *
dispatch.earliest_time = -6h
dispatch.latest_time = +0s
enableSched = 1
action.summary_index = 1
action.summary_index.marker = bcoat
realtime_schedule = 0
search = eventtype=bcoat_request  |  bin _time span=5m | makemv delim=";" allowempty=t category |  fillnull src_ip cs_bytes category  dest_host rs_bytes sc_bytes sc_status sr_bytes  | eval client_bytes=sc_bytes+cs_bytes | eval server_bytes=rs_bytes+sr_bytes | eval savings_bytes=client_bytes-server_bytes | eval savings_bytes=if(server_bytes==0,0,savings_bytes) |  eval savings_perc = (1/client_bytes)  * savings_bytes * 100  | sistats count by host src_ip sourcetype category dest_host server_bytes client_bytes savings_bytes savings_perc _time
is_visible = false

#
##
## ProxySG Overview Searches
##
[Overview - Requests over Time]
cron_schedule = 0 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = +0s
displayview = flashtimeline
enableSched = 1
request.ui_dispatch_view = flashtimeline
search = sourcetype="bcoat_proxysg" | timechart count by host 
vsid = fx3mgenj

[Overview - Top Websites]
cron_schedule = 0 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = +0s
displayview = flashtimeline
enableSched = 1
request.ui_dispatch_view = flashtimeline
search = sourcetype="bcoat_proxysg" dest_host!="-" filter_result!="DENIED" | top dest_host limit=10 | rename dest_host as "Site"
vsid = fx3mgenj

[Overview - Top Categories]
cron_schedule = 0 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = +0s
displayview = flashtimeline
enableSched = 1
request.ui_dispatch_view = flashtimeline
search = sourcetype="bcoat_proxysg" filter_result!="DENIED" | makemv delim=";" allowempty=false setsv=true category | top category | rename category as "Category"
vsid = fx3mgenj

[Overview - Top Clients by IP]
cron_schedule = 0 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = +0s
displayview = flashtimeline
enableSched = 1
request.ui_dispatch_view = flashtimeline
search = sourcetype="bcoat_proxysg" src_ip!="-" | top src_ip limit=10 | rename src_ip as "Client IP"
vsid = fx3mgenj

[Overview - Top Clients by Username]
cron_schedule = 0 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = +0s
displayview = flashtimeline
enableSched = 1
request.ui_dispatch_view = flashtimeline
search = sourcetype="bcoat_proxysg" user!="-" | top user limit=10 | rename user as "Username"
vsid = fx3mgenj

##############################################################################
##
## Traffic Dashboard Searches
##
[Traffic - Cache Efficiency]
cron_schedule = 0 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = +0s
displayview = flashtimeline
enableSched = 1
request.ui_dispatch_view = flashtimeline
search = sourcetype="bcoat_proxysg" | replace *_HIT with CACHE_HIT in action | replace *_MISS* with CACHE_MISS in action | timechart count by action
vsid = fx3mgenj

[Traffic - Top Websites]
cron_schedule = 0 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = +0s
displayview = flashtimeline
enableSched = 1
request.ui_dispatch_view = flashtimeline
search = sourcetype="bcoat_proxysg" dest_host!="-" filter_result!="DENIED" | top dest_host limit=10 | rename dest_host as "Site"
vsid = fx3mgenj

[Traffic - Top Clients by IP Address]
cron_schedule = 0 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = +0s
displayview = flashtimeline
enableSched = 1
request.ui_dispatch_view = flashtimeline
search = sourcetype="bcoat_proxysg" src_ip!="-" | top src_ip limit=10 | rename src_ip as "Client IP"
vsid = fx3mgenj

##############################################################################
##
## Bandwidth Reports
##
[Bandwidth - Proxy Bandwidth]
cron_schedule = 0 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = +0s
displayview = flashtimeline
enableSched = 1
request.ui_dispatch_view = flashtimeline
search = sourcetype="bcoat_proxysg" | eval bandwidth=sc_bytes/1024 | timechart sum(bandwidth) by host
vsid = fx3mgenj

[Bandwidth - Top Websites]
cron_schedule = 0 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = +0s
displayview = flashtimeline
enableSched = 1
request.ui_dispatch_view = flashtimeline
search = sourcetype="bcoat_proxysg" | eval kb=round((sc_bytes+cs_bytes)/1024,2) | stats sum(kb) as "Data Transferred (kb)" by dest_host | sort -"Data Transferred (kb)" | rename dest_host as "Site"
vsid = fx3mgenj

[Bandwidth - Top Users]
cron_schedule = 0 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = +0s
displayview = flashtimeline
enableSched = 1
request.ui_dispatch_view = flashtimeline
search = sourcetype="bcoat_proxysg" user!="-" | eval kb=round((sc_bytes+cs_bytes)/1024,2) | stats sum(kb) as "Data Transferred (kb)" by user | sort -"Data Transferred (kb)" |rename user as "User"
vsid = fx3mgenj

##############################################################################
##
## Security Searches
##
[Security - Top Malware Sites]
cron_schedule = 0 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = +0s
displayview = flashtimeline
enableSched = 1
request.ui_dispatch_view = flashtimeline
search = sourcetype="bcoat_proxysg" (category=Spyware* OR category=Suspicious OR category=Phishing OR x_virus_id!=-) | top dest_host | rename dest_host as "Site"
vsid = fx3mgenj

[Security - Top Malware Clients by Username]
cron_schedule = 0 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = +0s
displayview = flashtimeline
enableSched = 1
request.ui_dispatch_view = flashtimeline
search = sourcetype="bcoat_proxysg" user!=- (category=Spyware* OR category=Suspicious OR category=Phishing OR x_virus_id!=-) | top user | rename user as "Username"
vsid = fx3mgenj

[Security - Top Malware Clients by IP Address]
cron_schedule = 0 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = +0s
displayview = flashtimeline
enableSched = 1
request.ui_dispatch_view = flashtimeline
search = sourcetype="bcoat_proxysg" src_ip!=- (category=Spyware* OR category=Suspicious OR category=Phishing OR x_virus_id!=-) | top src_ip | rename src_ip as "Client IP"
vsid = fx3mgenj

[Security - Top Viruses Found]
cron_schedule = 0 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = +0s
displayview = flashtimeline
enableSched = 1
request.ui_dispatch_view = flashtimeline
search = sourcetype="bcoat_proxysg" x_virus_id!=- | top x_virus_id as "Virus ID"
vsid = fx3mgenj

##
#############################################################################
##
## Reporter Searches
##
[Base Reports - Category]
cron_schedule = 0 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = +0s
displayview = flashtimeline
enableSched = 1
request.ui_dispatch_view = flashtimeline
search = sourcetype="bcoat_proxysg" filter_result!="DENIED" | makemv delim=";" allowempty=false setsv=true http_content_type | makemv delim=";" allowempty=false setsv=true category | eval bytes=sc_bytes+cs_bytes | stats count as "Requests" count(eval(http_response_code=200 and http_content_type="text/html")) as "Page Views" sum(sc_bytes) as "Bytes Received" sum(cs_bytes) as "Bytes Sent" sum(bytes) as "Total Bytes" by category | sort -"Requests"
vsid = fx3mgenj

[Base Reports - Client IP]
cron_schedule = 0 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = +0s
displayview = flashtimeline
enableSched = 1
request.ui_dispatch_view = flashtimeline
search = sourcetype="bcoat_proxysg" filter_result!="DENIED" | makemv delim=";" allowempty=false setsv=true http_content_type | makemv delim=";" allowempty=false setsv=true category | eval bytes=sc_bytes+cs_bytes | stats count as "Requests" count(eval(http_response_code=200 and http_content_type="text/html")) as "Page Views" sum(sc_bytes) as "Bytes Received" sum(cs_bytes) as "Bytes Sent" sum(bytes) as "Total Bytes" by src_ip | rename src_ip as "Client IP" | sort -"Requests"
vsid = fx3mgenj

[Base Reports - Group]
cron_schedule = 0 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = +0s
displayview = flashtimeline
enableSched = 1
request.ui_dispatch_view = flashtimeline
search = sourcetype="bcoat_proxysg" filter_result!="DENIED" | makemv delim=";" allowempty=false setsv=true http_content_type | makemv delim=";" allowempty=false setsv=true category | eval bytes=sc_bytes+cs_bytes | stats count as "Requests" count(eval(http_response_code=200 and http_content_type="text/html")) as "Page Views" sum(sc_bytes) as "Bytes Received" sum(cs_bytes) as "Bytes Sent" sum(bytes) as "Total Bytes" by user_group | rename user_group as "Group" | sort -"Requests"
vsid = fx3mgenj

[Base Reports - Malware]
cron_schedule = 0 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = +0s
displayview = flashtimeline
enableSched = 1
request.ui_dispatch_view = flashtimeline
search = sourcetype="bcoat_proxysg" filter_result!="DENIED" | makemv delim=";" allowempty=false setsv=true http_content_type | makemv delim=";" allowempty=false setsv=true category | eval bytes=sc_bytes+cs_bytes | stats count as "Requests" count(eval(http_response_code=200 and http_content_type="text/html")) as "Page Views" sum(sc_bytes) as "Bytes Received" sum(cs_bytes) as "Bytes Sent" sum(bytes) as "Total Bytes" by x_virus_id |rename x_virus_id as "Malware Variant" | sort -"Requests"
vsid = fx3mgenj

[Base Reports - Site]
cron_schedule = 0 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = +0s
displayview = flashtimeline
enableSched = 1
request.ui_dispatch_view = flashtimeline
search = sourcetype="bcoat_proxysg" filter_result!="DENIED" | makemv delim=";" allowempty=false setsv=true http_content_type | makemv delim=";" allowempty=false setsv=true category | eval bytes=sc_bytes+cs_bytes | stats count as "Requests" count(eval(http_response_code=200 and http_content_type="text/html")) as "Page Views" sum(sc_bytes) as "Bytes Received" sum(cs_bytes) as "Bytes Sent" sum(bytes) as "Total Bytes" by dest_host | rename dest_host as "Site" | sort -"Requests"
vsid = fx3mgenj

[Base Reports - User]
cron_schedule = 0 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = +0s
displayview = flashtimeline
enableSched = 1
request.ui_dispatch_view = flashtimeline
search = sourcetype="bcoat_proxysg" filter_result!="DENIED" | makemv delim=";" allowempty=false setsv=true http_content_type | makemv delim=";" allowempty=false setsv=true category | eval bytes=sc_bytes+cs_bytes | stats count as "Requests" count(eval(http_response_code=200 and http_content_type="text/html")) as "Page Views" sum(sc_bytes) as "Bytes Received" sum(cs_bytes) as "Bytes Sent" sum(bytes) as "Total Bytes" by user | rename user as "Username" | sort -"Requests"
vsid = fx3mgenj

[User Behavior -  Blocked Web Browsing per User]
cron_schedule = 0 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = +0s
displayview = flashtimeline
enableSched = 1
request.ui_dispatch_view = flashtimeline
search = sourcetype="bcoat_proxysg" action="TCP_DENIED" user!="-" | top user limit=10 countfield="Requests" | rename user as "Username"
vsid = fx3mgenj

[User Behavior - Web Browsing per Category]
cron_schedule = 0 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = +0s
displayview = flashtimeline
enableSched = 1
request.ui_dispatch_view = flashtimeline
search = sourcetype="bcoat_proxysg" | makemv delim=";" allowempty=false setsv=true category | top category limit=10 countfield="Requests" | rename category as "Category"
vsid = fx3mgenj

[User Behavior - Web Browsing per Site]
cron_schedule = 0 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = +0s
displayview = flashtimeline
enableSched = 1
request.ui_dispatch_view = flashtimeline
search = sourcetype="bcoat_proxysg" | top dest_host limit=10 countfield="Requests" | rename dest_host as "Site"
vsid = fx3mgenj

[User Behavior - Web Browsing per User]
cron_schedule = 0 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = +0s
displayview = flashtimeline
enableSched = 1
request.ui_dispatch_view = flashtimeline
search = sourcetype="bcoat_proxysg" | top user countfield="Requests" limit=10 | rename user as "Username"
vsid = fx3mgenj

[Security - Blocked Web Browsing by User Agent]
cron_schedule = 0 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = +0s
displayview = flashtimeline
enableSched = 1
request.ui_dispatch_view = flashtimeline
search = sourcetype="bcoat_proxysg" action="TCP_DENIED" | top http_user_agent by user countfield="Requests" limit=10 | rename user as "Username" http_user_agent as "User Agent"
vsid = fx3mgenj

[Security - Blocked Web Sites]
cron_schedule = 0 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = +0s
displayview = flashtimeline
enableSched = 1
request.ui_dispatch_view = flashtimeline
search = sourcetype="bcoat_proxysg" action="TCP_DENIED" | top dest_host countfield="Requests" limit=10 | rename dest_host as "Site"
vsid = fx3mgenj

[Bandwidth Usage - Requests per Content Type]
cron_schedule = 0 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = +0s
displayview = flashtimeline
enableSched = 1
search = sourcetype="bcoat_proxysg" filter_result!="DENIED" | makemv delim=";" allowempty=false setsv=true http_content_type | makemv delim=";" allowempty=false setsv=true category | eval bytes=sc_bytes+cs_bytes | stats count as "Requests" count(eval(http_response_code=200 and http_content_type="text/html")) as "Page Views" sum(sc_bytes) as "Bytes Received" sum(cs_bytes) as "Bytes Sent" sum(bytes) as "Total Bytes" by http_content_type | rename http_content_type as "Content Type" | sort -"Requests"
vsid = fx3mgenj

[Bandwidth Usage - Requests per Protocol]
cron_schedule = 0 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = +0s
displayview = flashtimeline
enableSched = 1
request.ui_dispatch_view = flashtimeline
search = sourcetype="bcoat_proxysg" filter_result!="DENIED" | makemv delim=";" allowempty=false setsv=true http_content_type | makemv delim=";" allowempty=false setsv=true category | eval bytes=sc_bytes+cs_bytes | stats count as "Requests" count(eval(http_response_code=200 and http_content_type="text/html")) as "Page Views" sum(sc_bytes) as "Bytes Received" sum(cs_bytes) as "Bytes Sent" sum(bytes) as "Total Bytes" by uri_scheme | rename uri_scheme as "Protocol" | sort -"Requests"
vsid = fx3mgenj

[Bandwidth Usage - Web Requests per Client IP]
cron_schedule = 0 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = +0s
displayview = flashtimeline
enableSched = 1
request.ui_dispatch_view = flashtimeline
search = sourcetype="bcoat_proxysg" filter_result!="DENIED" | makemv delim=";" allowempty=false setsv=true http_content_type | makemv delim=";" allowempty=false setsv=true category | eval bytes=sc_bytes+cs_bytes | stats count as "Requests" count(eval(http_response_code=200 and http_content_type="text/html")) as "Page Views" sum(sc_bytes) as "Bytes Received" sum(cs_bytes) as "Bytes Sent" sum(bytes) as "Total Bytes" by src_ip | rename src_ip as "Client IP" | sort -"Requests"
vsid = fx3mgenj

