{"basic_builder": {"appname": "TA-microsoft-365-defender-advanced-hunting-api", "friendly_name": "Microsoft 365 Defender Advanced hunting API", "version": "1.0.0", "author": "Jimmy Pedersen", "description": "Run Kusto queries against MS365 Defender Advanced Hunting tables. Find out more here:\nhttps://docs.microsoft.com/en-us/microsoft-365/security/defender/api-advanced-hunting?view=o365-worldwide\n\nQuota Limitations: https://docs.microsoft.com/en-us/microsoft-365/security/defender/api-advanced-hunting?view=o365-worldwide#quotas-and-resource-allocation", "theme": "#65A637", "large_icon": "iVBORw0KGgoAAAANSUhEUgAAAEgAAABICAYAAABV7bNHAAAAAXNSR0IArs4c6QAACFVJREFUeF7t3AeP2zgQBWBteu+9d+T//5ogSO+993r4eDcLrpaypJXlTXAiYMRr0TT55r03Q0p3S9XUZiKwNOEzG4EJoBaGTABNAA0zkYlBa2XQtWvXfg/D/u/69tWrV4tkaWTQBNC/AZ4A+o/oE4NaFD8BNAE0LClMDPqbGbR169Zq165dK5bw/v376tu3b8No0ePbfzSDjh8/Xm3btm0ZEIB9+PChevbsWY8lDuu6rgAtLS1Ve/fuTYv+8ePHqpWcPXu2evv2bfXmzZt07eDBg9X27durBw8erOq7ZcuWaseOHan/79/zq2XXDaDdu3dXhw8frjZu3JgYcu/evQpDfA4E7wF4//796vPnzwkQcjtx4kQC4OvXr9WnT58qkvv+/XsFzE2bNiWgnz9/nkCfR1s4QAA5efJkAuDly5cp4mfOnEmLA4hFf/z4MQHw5cuX6tevXyvW6fu+S3o7d+5MYOoDJGDu37+/OnDgQAL14cOHg9m0cIAAceHChSQTYGjkYaGi/vPnz16BNx5m5TLFwmPHjlU3b95cBXCvwauqWjhAJohBpPD06dO+8+3Unwyx6smTJ536z+q0cIDI49SpU0lGpQWQGTZ5YVZIj+9gF78iPeyryy8WGhImOdIb0hYKkEUD5927d6vYs3nz5uQd5LFhw4bkQV6YBgjAAQto/MffQH79+vWyVAMI10iMR5EyQNfaRgWIoZqsRWIOM3716lUy52j6HDp0KKV7C5HS+UkTO+J7Fr9nz54EKEMm13oBeeTIkdTn7t27iUmCgIVtY+dgjgoQQERbpP1r4bnvYFT4hc/DtPtE26IBATDpHaPyZnzBAZA6yVxkt65tNIAik5iM95iUe47IkkHIjcfoY7GyEnnpXy8g8z4YB1h99u3bl76rbMiDoL+KXB/g8Kc8g7YBNQpAJnX+/PkkF5KqtwDnxYsXK65HDYMJFmxRjx49WvH1WX0wBGMUj00ZUnGKbXfu3GnDJl0fBSCLM5Fbt26tqmtIjfT4UO5FJoNRGubwJFsLY+QNG7At+jD227dvL3ch29OnT1d18KMDSQre48ePE5BtbRSAZBtUlo1ILMwzmMVUTbDe8sVjGfMuAcRkMaQJxJAbcybVaFFimA9mdilKRwHIhIBx8eLFZJx8QbNgC0fvUiaZF0B+i9QEyh4vGrYBrw76LBaNBlBISbkvUtK5LYbIM+ZSmydAsaXBYOaskZc5AKhrATkaQDwIpeNoQvRIIveLsSQW4/I0QOXHI3b9vKeUPEpBGw0gRmwiUZecO3cu/Z0bs4haBGMlSU1/B2JKAzIptVIfxo0VzDuOR8KwMSbKBTIXuK610GgAXb58OU1C8SeK/Ij35KYpm1iUBYcnuR7vLbDUSn0ArH4KlgYg4YMha8Crl0i/S5srQCJDSvZL3t+4cSMt1qSOHj2a/o7WBFqXSc/qc+nSpeRzkcKxkAdGXRQ+hGWCg9GzzrjnCpC6RZbCCFEOqvtccZZnFBHHsj5VbRt4pTFJChPt7KMpKCOYAIoj3dE9CBCyV13fKC1y9c/5khKgvn9qA6LpemTOYK5+Km+yK1XOfJL01h0g8lI01otDBi3qpaJxLSCpcQCSZ0rg1KvtGHtdADIhrCCxODhHc9Gt340oLWgtwORpvQ44cJh3Lm+eyCf9/kIlFj8at2CiSBTVOJfJAShJYghAJcmqx8wn5O297Cl4kUFnFY1zNel8cXmaZ9CyCW/I71nN06ibxnKCic22PFrcbuq63RgNIPoWJRUr/5F+83tcAaaoM8qulW0Tw6IozA1aX4HicSH3OqPaGDsaQPX0CjBpPyKZ+wYA6+c+bROvXy/5GeY6VchB65s5RwNInWHfE2U+8xY9vpTLzMIYaVfKNwFno6vlGRE4CtX4rD6nLkEYDSCssHN2cKXOiOMPWSOvexg1IEW5y/lM06IYr3Gjpgkwclmr02Ir0vX+/SgAyRQRPdkj9kWymUkq2vKzZv6Unxt1iWzeBxiko/6JbQNJAzwvTpvmNev3RgEojlxLt35LEwca8OL2TB+AMNOYAA8wjMUDAVY/9P8jjlxNOrJT/dxZFKOCjed89HeObAPLL2IP1wZUHJc4jCMljIknQJrOnG17ZDzB6NJGYZAfNlHG6XwmbvvIVLQfd1j5RWQ1nmVLoi+ZqF38Wz8/YugABY5xlAiAjlMD25f85qRx41kAJ4uul8qNJrBGA8gPKtIswtGDHXR+WB+3aHwGxDBofiI9M29gXb9+fTnrkS7pAAV4FhxVMJl61e9mmANmAtx45tJn7zcqQCLtJboiLltFxAHoM9G1gMh2EclSdivtzAFNNsYAdP7gFLa4bh/Gi0jRXLpmMHMZFaA6bS1aRJ0yimJMNLKbyQPQZjduEeUH7OQVd0Wka4zCOP0BHCwkK1sbfmeDPOShz4UCFKyJ/VFePYuuxXtpMpLj0jx1kxCZOB3kb+TCx+qbTYZvPOCUnn3sYs7RZ+EAhTeJ6qynVbHAPkq2icdX4sRy1p0R45eq6j6g5H0XDlDUIfn9qjDmeCAzJnjlypUVR7IlgMgozDekFPf+47hlreAs3IP8IGaIsEwVWwN1ET8CHrbEQ5xMNt+Jx1ZBaRAPcQKIjHxf+o67p8Bm2n0MuQTkwhkUk4jsY4FSvcUBKB4DBoDMxG/y56SleZ6TPwbMnGVIY/mcdLsWm23sWjeAYmIAkdVKG9X6zcemo1tjATNqrrZF97m+7gDNmiwpYlpkKQwjnf/Nf4rQFsk428775dVz2/fncf2PZtA8Fjh0jAmgFgQngCaAholsYtDEoIlBwxCYN4NGnc1fNPj0f39pCdYE0ATQMD1PDJoYNIxB/wAmDs+jIha7RgAAAABJRU5ErkJggg==", "small_icon": "iVBORw0KGgoAAAANSUhEUgAAACQAAAAkCAYAAADhAJiYAAAAAXNSR0IArs4c6QAAAx1JREFUWEftmHlPKkEQxBtFxBNB8Ubw9vt/GvDCO16IggqIRvPrvN6MCAu7vvjIi/2Xujsz1VXVNRsj0mcV6TM80t+A8vn8+79gbGdnxyPmE0O/gP7I8X8zFI/Htc9IJCKvr6/SbDYD2zA0QwMDA7KxsSH1el1qtZokk0l5fHyUi4sLBbG4uCjj4+Nyd3cnAB0ZGZH9/X15f/efldCAEomEPDw89MwArAGwWq36rgkNCHYODg68jufn5wWQMMDhb29vcn19LZVKxZNxbW1N1/hVIEDINDExIel0WumnstmsPD09ye3t7ZdzALa6uqrAkJMCVLlclvv7+7byBQK0tbUlu7u7ygBM2O8ctLm5qUYuFoueh/DN4eGhjI2NqVyXl5feWt7f29v70kQgQCsrK3JycqKbIJmxNDQ0pAB5DgBqe3tbCoWCTE5OqmwAohHzUC6Xk6Ojo+8BQqqbmxvtmJF+eXnRDXsBxHvIZwymUimdwNYKxJBJZN2z2dTUlMRiMd0chszE09PTytDS0pI8Pz+rb+x9/OPu4YLqGRBZQlfkjDE1MzMjpVKpa7ZwoMlt3slkMso2ORYaEIvxwfDwsG4EO3TbSxGUNOOaGemZ0FCAmBgSmdHHM41GQ8HxdyTxK/c9dxgwusWBre9ZMkAgFV26KW2d+wFymTTvIBkx0Hrf9QyIA83UhJuNt5tFnUC5I47Jz8/PP2VYKMlYhIlJZJcVkvr4+NhXMgMNU9x/ZBaXsU1eaEDLy8tydnam663r0dFRvbfwVLvCcwAhFtwcckM2NCAmxNKZ7CGFGV38gLHpnuuDikajms68Q7obSwCEofX1dW+v0IDsE2J2dlZvbbJpbm7Okwxgp6enur8ZH2B4jjuQgiWyywK0ldVApnYXcwjXAN0CZHBwULOJyaH4KlhYWJCrqytlDmbwm10dnUwXGlA7U5rpDZD7MQa7gOzETOAcau2IAwg5coRDyCh+tjhAGrILjwEEz5n//EYyNEPtNsVTSAdYpu5HP/J9g+cbD/8qQ9/A4S39BdSNxY4MdVv4E8/7+/9DP8FAtzM+AM+QJUNo5xoEAAAAAElFTkSuQmCC", "visible": true, "tab_version": "4.1.0", "tab_build_no": "0", "build_no": 1}, "data_input_builder": {"datainputs": [{"index": "default", "sourcetype": "ms365:defender:advancedhunting:json", "interval": "300", "use_external_validation": true, "streaming_mode_xml": true, "name": "ms365_defender_advanced_hunting", "title": "MS365 Defender Advanced Hunting API", "description": "Collect output of Kusto queries from MS365 Defender Advanced Hunting API.", "type": "customized", "parameters": [{"name": "account", "label": "Account", "help_string": "", "required": true, "possible_values": [], "format_type": "global_account", "default_value": "", "placeholder": "", "type": "global_account", "value": "account0"}, {"name": "tenant_id", "label": "Tenant ID", "help_string": "", "required": true, "format_type": "text", "default_value": "", "placeholder": "", "type": "text", "value": "cb356782-ad9a-47fb-878b-7ebceb85b86c"}, {"name": "custom_query", "label": "Custom Query", "help_string": "Enter your query here. If you use a checkpoint prefix it with '###' like so \"###checkpoint\".", "required": true, "format_type": "text", "default_value": "", "placeholder": "EmailEvents |  ....", "type": "text", "value": "EmailEvents | where Timestamp > ago(5m) | take 100"}], "data_inputs_options": [{"type": "customized_var", "name": "account", "title": "Account", "description": "", "required_on_edit": false, "required_on_create": true, "possible_values": [], "format_type": "global_account", "default_value": "", "placeholder": ""}, {"type": "customized_var", "name": "tenant_id", "title": "Tenant ID", "description": "", "required_on_edit": false, "required_on_create": true, "format_type": "text", "default_value": "", "placeholder": ""}, {"type": "customized_var", "name": "custom_query", "title": "Custom Query", "description": "Enter your query here. If you use a checkpoint prefix it with '###' like so \"###checkpoint\".", "required_on_edit": false, "required_on_create": true, "format_type": "text", "default_value": "", "placeholder": "EmailEvents |  ...."}], "code": "\n# encoding = utf-8\n\nimport os\nimport sys\nimport time\nimport datetime\nimport json\nimport urllib.request\nimport urllib.parse\n\n'''\nboilerplate code is from https://docs.microsoft.com/en-us/microsoft-365/security/defender-endpoint/run-advanced-query-sample-python?view=o365-worldwide\n'''\n\n\ndef validate_input(helper, definition):\n    pass\n    \ndef collect_events(helper, ew):\n    \"\"\"\n    # The following examples send rest requests to some endpoint.\n    response = helper.send_http_request(url, method, parameters=None, payload=None,\n                                        headers=None, cookies=None, verify=True, cert=None,\n                                        timeout=None, use_proxy=True)\n    # get the response headers\n    r_headers = response.headers\n    # get the response body as text\n    r_text = response.text\n    # get response body as json. If the body text is not a json string, raise a ValueError\n    r_json = response.json()\n    # get response cookies\n    r_cookies = response.cookies\n    # get redirect history\n    historical_responses = response.history\n    # get response status code\n    r_status = response.status_code\n    # check the response status, if the status is not sucessful, raise requests.HTTPError\n    response.raise_for_status()\n\n    # The following examples show usage of check pointing related helper functions.\n    # save checkpoint\n    helper.save_check_point(key, state)\n    # delete checkpoint\n    helper.delete_check_point(key)\n    # get checkpoint\n    state = helper.get_check_point(key)\n\n    # To create a splunk event\n    helper.new_event(data, time=None, host=None, index=None, source=None, sourcetype=None, done=True, unbroken=True)\n    \"\"\"\n\n    '''\n    # The following example writes a random number as an event. (Multi Instance Mode)\n    # Use this code template by default.\n    import random\n    data = str(random.randint(0,100))\n    event = helper.new_event(source=helper.get_input_type(), index=helper.get_output_index(), sourcetype=helper.get_sourcetype(), data=data)\n    ew.write_event(event)\n    '''\n\n    '''\n    # The following example writes a random number as an event for each input config. (Single Instance Mode)\n    # For advanced users, if you want to create single instance mod input, please use this code template.\n    # Also, you need to uncomment use_single_instance_mode() above.\n    import random\n    input_type = helper.get_input_type()\n    for stanza_name in helper.get_input_stanza_names():\n        data = str(random.randint(0,100))\n        event = helper.new_event(source=input_type, index=helper.get_output_index(stanza_name), sourcetype=helper.get_sourcetype(stanza_name), data=data)\n        ew.write_event(event)\n    '''\n    \n    \n    # Get bearer token\n    account = helper.get_arg('account')\n    tenantId = helper.get_arg('tenant_id')\n    clientId = account['username']\n    appSecret = account['password']\n    proxy_settings = helper.get_proxy()\n\n    url = \"https://login.windows.net/%s/oauth2/token\" % (tenantId)\n    \n    resourceAppIdUri = 'https://api.security.microsoft.com'\n    \n    body = {\n        'resource' : resourceAppIdUri,\n        'client_id' : clientId,\n        'client_secret' : appSecret,\n        'grant_type' : 'client_credentials'\n    }\n    data = urllib.parse.urlencode(body).encode(\"utf-8\")\n    \n    try:\n        helper.log_info(\"Getting AAD token\")\n        req = urllib.request.Request(url, data)\n        response = urllib.request.urlopen(req)\n        jsonResponse = json.loads(response.read())\n        aadToken = jsonResponse[\"access_token\"]\n        helper.log_error(\"Access token: %s\" % aadToken)\n        \n    except Exception as e:\n        helper.log_error(\"Failed getting AAD token.\")\n        helper.log_error(\"Error was: %s\" % e)\n        exit()\n    \n    \n    # Run query\n    try:\n        query = helper.get_arg('custom_query')\n        # manage checkpoint \n        \n        \n        \n        helper.log_debug(\"Will attempt to run query: %s\" % query)\n        \n        url = \"https://api.security.microsoft.com/api/advancedhunting/run\"\n        headers = { \n            'Content' : 'application/json',\n            'Authorization' : \"Bearer \" + aadToken\n        }\n        \n        data = json.dumps({ 'Query' : query }).encode(\"utf-8\")\n        req = urllib.request.Request(url, data, headers)\n        response = urllib.request.urlopen(req)\n\n            # Handle response\n        if response.status == 403:\n            helper.log_error(\"403 Unauthorized. \" + response.read())\n        if response.status == 429:\n            helper.log_error(\"API quota reached for tenancy: %s.\" % tenantId)\n        if response.status == 200:\n            try:\n                jsonResponse = json.loads(response.read())\n                stats = jsonResponse[\"Stats\"]\n                schema = jsonResponse[\"Schema\"]\n                results = jsonResponse[\"Results\"]\n                helper.log_info(\"Query: \\\"\" + query + \"\\\" took \" + str(stats[\"ExecutionTime\"]) + \" to complete.\")\n            except json.JSONDecodeError:\n                helper.log_error(\"Couldn't decode response as JSON. Response was: \" + str(response.read()))\n    \n    except Exception as e:\n        helper.log_error(\"Exception: \" + str(e))\n\n    \n    # send to splunk\n    try:\n        for result in results:\n            result = str(result)\n            event = helper.new_event(source=helper.get_input_type(), index=helper.get_output_index(), sourcetype=helper.get_sourcetype(), data=result)\n            ew.write_event(event)\n      \n    except Exception as e:\n        helper.log_error(\"There was an error iterating the results. Enable debug to see the output.\")\n        helper.log_debug(\"Failed to iterate the returned results:\\n%s\" % str(results))\n        \n    \n    \n", "customized_options": [{"name": "account", "value": "account0"}, {"name": "tenant_id", "value": "cb356782-ad9a-47fb-878b-7ebceb85b86c"}, {"name": "custom_query", "value": "EmailEvents | where Timestamp > ago(5m) | take 100"}], "uuid": "6a772261f36b45b8857fd7a49be433c4", "sample_count": 0}]}, "global_settings_builder": {"global_settings": {"log_settings": {"log_level": "DEBUG"}, "credential_settings": []}}, "sourcetype_builder": {"ms365:defender:advancedhunting:json": {"metadata": {"event_count": 0, "data_input_name": "ms365_defender_advanced_hunting", "extractions_count": 0, "cims_count": 0}}}, "validation": {"validators": ["best_practice_validation", "data_model_mapping_validation", "field_extract_validation", "app_cert_validation"], "status": "job_started", "validation_id": "v_1655769866_12"}}