[secureauth_idp]
rename = secureauth:idp

[secureauth:idp]
description = Output produced by SecureAuth IdP
NO_BINARY_CHECK = true
category = Network & Security
disabled = false
pulldown_type = true
SHOULD_LINEMERGE = false

TIME_PREFIX = \w{3}\s+\d{1,2}\s\d{2}\:\d{2}\:\d{2}\s\d{1,3}\.\d{1,3}\.\d{1,3}\.\d{1,3}\s\d+\s
MAX_TIMESTAMP_LOOKAHEAD = 24

TRANSFORMS-secureauth_idp = host

EXTRACT-dest_nt_domain1 = LDAP\:\/\/(?<dest_nt_domain>.+)\/
EXTRACT-dest_nt_domain2 = Domain\s+-\s+(?<dest_nt_domain>.+)\s
EXTRACT-dur = RequestDuration="(?<dur_HH>\d+):(?<dur_MM>\d+):(?<dur_SS>\d+.\d+)
EXTRACT-user = ^(?:[^:\n].+user:)\s+(?<user>\w+)
EXTRACT-blacklisted_country = Check if the IP '\d+.\d+.\d+.\d+' country '(?<blacklisted_country>.+)' is in specified countries, result: true
EXTRACT-whitelisted_ip = is not in specified countries, result: (?<whitelisted_ip>\w+)
EXTRACT-blacklisted_ip = is in specified countries, result: (?<blacklisted_ip>\w+)
EXTRACT-whitelisted_country = Check if the IP '\d+.\d+.\d+.\d+' country '(?<whitelisted_country>.+)' is not in specified countries, result: true
EXTRACT-ge = Check IP Risk 'ge\s(?<ge>\d+)'
EXTRACT-UserID = return user membership data with the name: (?<UserID>.+) with the result code:
EXTRACT-UserHostAddress = Check IP Risk 'ge\s\d+':\s(?<UserHostAddress>\d{1,3}.\d{1,3}.\d{1,3}.\d{1,3})
EXTRACT-AE_IP_threatType = "threatType":(?<AE_IP_threatType>\d+)
EXTRACT-Message = "message":"(?<Message>.+?)"
EXTRACT-AE_IP_RiskScore = "risk_factor":(?<AE_IP_RiskScore>\d+)
EXTRACT-AE_IP_threatCategory = "threatCategory":(?<AE_IP_threatCategory>\d+)

# API Extractions, v1.4.5
EXTRACT-API_OTP = "otp":"(?P<api_otp>\d{6})"
EXTRACT-API_ReferenceId = "reference_id":"(?P<api_reference_id>\w{8}-\w{4}-\w{4}-\w{4}-\w{12})"
EXTRACT-API_Status = "status":"(?P<api_status>\w+)"
EXTRACT-API_Message = "message":"(?P<api_message>[\w\-\.\:\;\s]*)"
EXTRACT-API_UserId = "user_id":"(?P<api_user_id>[\w\-\@\.]*)"
EXTRACT-API_Domain = "Domain":"(?P<api_domain>\w+)"
EXTRACT-API_Token = "Token":"(?P<api_token>[\w\s\.]*)"
EXTRACT-API_AuthRequest_Type = "AuthRequestType":"(?P<AuthRequestType>[\w\_\-]+)"
EXTRACT-API_FactorId = "FactorId":"(?P<factor_id>\w+)"
EXTRACT-API_PushAcceptDetails = "PushAcceptDetails":"?\{?(?P<PushAcceptDetails>[\w\"\:\_\,]+)/}?"?,
EXTRACT-API_EvalNumber = "EvalNumber":"?(?P<eval_number>\w+)"?
EXTRACT-API_UserId2 = "UserId":"(?P<UserID>[\w\d\.\-\@]+)"
EXTRACT-API_Authenticated = "authenticated":"(?P<api_authenticated>\w+)"
EXTRACT-API_AuthRegMethod = "authrermethod":"(?P<AuthRegMethod>\w+)"
EXTRACT-API_Domain231 = "domain":"?(?P<api_domain>\w+)"?
EXTRACT-API_Full_Message = "Message=\"(?P<Message>.*)\"\n"
EXTRACT-API_Company_Name = "company_name":"?(?P<api_company_name>\w+)"?
EXTRACT-API_Applicaton_Description = "application_description":"?(?P<api_app_desc>\w+)"?
EXTRACT-API_End_User_IP = "enduser_ip":"(?P<api_enduser_ip>\d{1,3}\.\d{1,3}\.\d{1,3}\.\d{1,3})"
EXTRACT-API_Title = "title":"?(?P<api_title>\w+)"?
EXTRACT-API_Biometric_Type = "title":"?(?P<api_biometric_type>\w+)"?

EXTRACT-msg=ApiResponseMessage="(?P<msg>[\w\d]*)"
EXTRACT-status=ApiResponseStatus="(?P<status>[\w\d]*)"

FIELDALIAS-secureauth_idp-app = Realm AS app
FIELDALIAS-secureauth_idp-dest_host = Appliance AS dest_host
FIELDALIAS-secureauth_idp-dest_ip = HostName AS dest
FIELDALIAS-secureauth_idp-priority = Priority AS dest_priority
FIELDALIAS-secureauth_idp-src = UserHostAddress AS src
FIELDALIAS-secureauth_idp-user = UserID AS user

EVAL-action = case(EventID=="20990" AND Succeed=="True", "success", EventID=="20990" AND Succeed=="False", "failure")
EVAL-dest = mvappend(dest_ip, dest_host)
EVAL-duration = (dur_HH * 3600) + (dur_MM * 60) + dur_SS
EVAL-AE_IP_threatCategory = if(isnotnull(AE_IP_threatType) AND isnull(AE_IP_threatCategory),"NULL",AE_IP_threatCategory)
EVAL-AE_IP_threatType = coalesce(AE_IP_threatType, AE_IP_RiskScore)
EVAL-UserID = if(isnull(UserID), "NULL", UserID)
