[source::...ta-crowdstrike-falcon-event-streams*.log*]
sourcetype = tacrowdstrikefalconeventstreams:log

[source::...ta_crowdstrike_falcon_event_streams*.log*]
sourcetype = tacrowdstrikefalconeventstreams:log

[CrowdStrike:Event:Streams:JSON]
EVAL-action =  case('event.PatternDispositionValue'IN (16,26,128,144,512,522,538,1024,1152,2048,2176,4112,5120),"blocked", 'event.PatternDispositionValue' IN (0,272,282,768,778,794,1280,2304,2432,4368), "allowed",  'event.Success'=="false", "failure", 'event.Success'=="true", "success", 'event.PatternDispositionFlags.PolicyDisabled'=true, "allowed", 'event.PatternDispositionDescription' LIKE "%would have been%", "allowed", 'event.PatternDispositionDescription' LIKE "%blocked%", "blocked", 'event.PatternDispositionDescription' LIKE "%Blocked%", "blocked")
EVAL-description = coalesce('event.DetectDescription', 'event.Description', 'event.RuleDescription')
EVAL-ip = coalesce('event.LocalAddress', 'event.EndpointIp')
EVAL-user = coalesce('event.UserID', 'event.UserID', 'event.UserId')
EVAL-id = coalesce('event.DetectId', 'event.Id', 'event.operationName')
EVAL-vendor_product = "CrowdStrike Falcon"
FIELDALIAS-dest = event.ComputerName ASNEW dest
FIELDALIAS-dest_nt_domain = event.MachineDomain ASNEW dest_nt_domain
FIELDALIAS-file_hash = event.SHA256String ASNEW file_hash
FIELDALIAS-file_name = event.FileName ASNEW file_name
FIELDALIAS-file_path = event.FilePath ASNEW file_path
FIELDALIAS-id = event.DetectId ASNEW id
FIELDALIAS-parent_process = event.ParentCommandLine ASNEW parent_process
FIELDALIAS-parent_process_id = event.ParentProcessId ASNEW parent_process_id
FIELDALIAS-parent_process_name = event.ParentImageFileName ASNEW parent_process_name
FIELDALIAS-process_id = event.ProcessId ASNEW process_id
FIELDALIAS-severity = event.SeverityName ASNEW severity
FIELDALIAS-severity_id = event.Severity ASNEW severity_id
FIELDALIAS-src = event.UserIp ASNEW src
FIELDALIAS-subject = event.DetectDescription ASNEW subject
FIELDALIAS-url = event.FalconHostLink ASNEW url

KV_MODE = json
SHOULD_LINEMERGE = 0
TIME_FORMAT = %s
TIME_PREFIX = "metadata.event.CreationTime"
TRUNCATE = 0
TZ = UTC
category = CrowdStrike Event Streams
pulldown_type = 1