[default]
[scheduledsearch_create_lookup_cluster]
action.email.useNSSubject = 1
action.webhook.enable_allowlist = 0
alert.track = 0
cron_schedule = */5 * * * *
description = Lookup for Cluster Informations
dispatch.earliest_time = -60m@m
dispatch.latest_time = now
display.general.timeRangePicker.show = 0
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.show = 0
enableSched = 1
request.ui_dispatch_app = proxmox_insights
request.ui_dispatch_view = search
schedule_window = auto
search = | union \
    [| tstats values(cluster_resources.cluster) as cluster from datamodel=Proxmox.cluster_resources by cluster_resources.node_ip \
    | rename cluster_resources.node_ip as nodeip \
    | eval dropdown = if(cluster="standalone",cluster." (".nodeip.")",cluster) \
    | strcat "\"" nodeip "\"" nodeip \
    | stats values(nodeip) as nodeips by dropdown \
    | eval nodeips = mvjoin(nodeips, ",")] \
    [| tstats values(node_status_detail.cluster) as cluster from datamodel=Proxmox.node_status_detail by node_status_detail.node_ip \
    | rename node_status_detail.node_ip as nodeip \
    | eval dropdown = if(cluster="standalone",cluster." (".nodeip.")",cluster) \
    | strcat "\"" nodeip "\"" nodeip \
    | stats values(nodeip) as nodeips by dropdown \
    | eval nodeips = mvjoin(nodeips, ",")] \
    [| tstats values(node_status.cluster) as cluster from datamodel=Proxmox.node_status by node_status.node_ip \
    | rename node_status.node_ip as nodeip \
    | eval dropdown = if(cluster="standalone",cluster." (".nodeip.")",cluster) \
    | strcat "\"" nodeip "\"" nodeip \
    | stats values(nodeip) as nodeips by dropdown \
    | eval nodeips = mvjoin(nodeips, ",") ] \
| dedup dropdown nodeips | where len(dropdown)>1 | outputlookup kv_proxmox_clusters

