[mac_actions_timechart(5)]
args = ind, srctype, earl, late, span
definition = index=$ind$ sourcetype=$srctype$ earliest=$earl$ latest=$late$\
|sort - _time|timechart span=$span$ fixedrange=F count by action
iseval = 0

[mac_initiated_transfers_by_origin_map(5)]
args = ind, srctype, earl, late, originIP
definition = index=$ind$ sourcetype=$srctype$ earliest=$earl$ latest=$late$ action=*|iplocation $originIP$\
| stats count by Country| geom geo_countries allFeatures=True featureIdField=Country
iseval = 0

[mac_dest_ip_timechart(6)]
args = ind, srctype, earl, late, span, destIP
definition = index=$ind$ sourcetype=$srctype$ earliest=$earl$ latest=$late$\
| timechart span=$span$ fixedrange=F count by $destIP$ usenull=f limit=10
iseval = 0

[mac_error_transfer_by_dest_map(5)]
args = ind, srctype, earl, late, destIP
definition = index=$ind$ sourcetype=$srctype$ earliest=$earl$ latest=$late$ action=error|iplocation $destIP$\
| stats count by Country| geom geo_countries allFeatures=True featureIdField=Country
iseval = 0

[mac_error_transfer_by_origin_map(5)]
args = ind, srctype, earl, late, originIP
definition = index=$ind$ sourcetype=$srctype$ earliest=$earl$ latest=$late$ action=error|iplocation $originIP$\
| stats count by Country| geom geo_countries allFeatures=True featureIdField=Country
iseval = 0

[mac_errors_by_customer_account(5)]
args = ind, srctype, earl, late, originAccount
definition = index=$ind$ sourcetype=$srctype$ earliest=$earl$ latest=$late$ action="error"\
| stats count(action) as "Number of Errors" by $originAccount$
iseval = 0

[mac_errors_by_origin_country(10)]
args = ind, srctype, earl, late, destIP, originIP, customerName, amountTransferred, originAccount, destAccount
definition = index=$ind$ sourcetype=$srctype$ earliest=$earl$ latest=$late$ action="error"\
| iplocation $destIP$\
| rename Country as "Destination Country", City as "DestCity"\
| iplocation $originIP$\
| rename Country as "Origin Country", $customerName$ as Customer, $amountTransferred$ as Amount, action as Status\
| fields "Origin Country", "Destination Country", Customer, $originAccount$, $destAccount$, Amount, Status\
| stats count(Status) as Errors by "Origin Country"
iseval = 0

[mac_initiated_transfers_by_dest_map(5)]
args = ind, srctype, earl, late, destIP
definition = index=$ind$ sourcetype=$srctype$ earliest=$earl$ latest=$late$ action=*|iplocation $destIP$\
| stats count by Country| geom geo_countries allFeatures=True featureIdField=Country
iseval = 0

[mac_max_amount_by_customer(6)]
args = ind, srctype, earl, late, amountTransferred, customerName
definition = index=$ind$ sourcetype=$srctype$ earliest=$earl$ latest=$late$ action="authorized"|stats max($amountTransferred$) as max_amount by $customerName$|sort - max_amount|head 10
iseval = 0

[mac_multiple_failed_logins(9)]
args = ind, srctype, earl, late, span, customerName, originAccount, destAccount, amountTransferred
definition = index=$ind$ sourcetype=$srctype$ earliest=$earl$ latest=$late$\
|convert timeformat="%Y/%m/%d %H:%M:%S" ctime(epoch) AS c_time\
|sort - _time\
|streamstats time_window=$span$ count(eval(action="denied")) as denied_count count(eval(action="authorized")) as "authorized_count" latest(action) as latest_action by $customerName$,$originAccount$,$destAccount$\
|where denied_count>=5 and authorized_count>=1 and latest_action="authorized" \
|table _time, $customerName$, $originAccount$, $destAccount$, $amountTransferred$, denied_count, authorized_count\
|eval $amountTransferred$=tostring(round($amountTransferred$, 2),"commas")
iseval = 0

[mac_multiple_ip_within_timeframe(10)]
args = ind, srctype, earl, late, span, originAccount, destAccount, amountTransferred, originIP, customerName
definition = index=$ind$ sourcetype=$srctype$ earliest=$earl$ latest=$late$\
| convert timeformat="%Y/%m/%d %H:%M:%S" ctime(epoch) AS c_time|sort - _time\
| streamstats time_window=$span$ count(eval(action="authorized")) as authorized_count list($originAccount$) as FromAccount list($destAccount$) as ToAccount list($amountTransferred$) as amount list(action) as action list(c_time) as time values($originIP$) as clientIP dc(clientIP) as clientIP_count by $customerName$\
|where clientIP_count>=2\
|chart count(clientIP) as "Number of IP Addresses" values(clientIP) as "IP Addresses" by $customerName$
iseval = 0

[mac_new_acct_large_transfer(10)]
args = ind, srctype, earl, late, OpenDate, amountTransferred, destIP, customerName, originAccount, destAccount
definition = index=$ind$ sourcetype=$srctype$ earliest=$earl$ latest=$late$\
|sort - _time\
|where _time<relative_time($OpenDate$, "+1d")  and $amountTransferred$>1000|eval AccountOpenDate=strftime($OpenDate$,"%Y-%m-%d %H:%M:%S") |iplocation $destIP$|rename Country as DestCountry City as DestCity |table _time,AccountOpenDate, $customerName$, $amountTransferred$, $originAccount$, $destAccount$, DestCountry, DestCity
iseval = 0

[mac_perc_errors(4)]
args = ind, srctype, earl, late
definition = index=$ind$ sourcetype=$srctype$ earliest=$earl$ latest=$late$ action=error\
| chart count(action) as Total by action | eval ErrorRate=round(((Total/107)*100), 2)\
| fields- action, Total
iseval = 0

[mac_perc_successes(4)]
args = ind, srctype, earl, late
definition = index=$ind$ sourcetype=$srctype$ earliest=$earl$ latest=$late$ action=authorized\
| chart count(action) as Total by action | eval SuccessRate=round(((Total/107)*100), 2)\
| fields- action, Total
iseval = 0

[mac_successes_by_customer_account(6)]
args = ind, srctype, earl, late, originAccount, customerName
definition = index=$ind$ sourcetype=$srctype$ earliest=$earl$ latest=$late$\
| fields $originAccount$,$customerName$, action\
| search action="authorized"|rename action as "Action"\
| chart count(Action) as Successes by $originAccount$\
| sort- Successes limit=10
iseval = 0

[mac_successes_by_origin_country(7)]
args = ind, srctype, earl, late, originAccount, customerName, originIP
definition = index=$ind$ sourcetype=$srctype$ earliest=$earl$ latest=$late$ action="authorized"\
| fields $originAccount$,$customerName$, action, $originIP$\
| iplocation $originIP$ | chart count(action) as Successes by Country\
| sort- Successes
iseval = 0

[mac_successes_by_dest_map(5)]
args = ind, srctype, earl, late, destIP
definition = index=$ind$ sourcetype=$srctype$ earliest=$earl$ latest=$late$ action=authorized|iplocation $destIP$\
| stats count by Country| geom geo_countries allFeatures=True featureIdField=Country
iseval = 0

[mac_successes_by_origin_map(5)]
args = ind, srctype, earl, late, originIP
definition = index=$ind$ sourcetype=$srctype$ earliest=$earl$ latest=$late$ action=authorized|iplocation $originIP$\
| stats count by Country| geom geo_countries allFeatures=True featureIdField=Country
iseval = 0

[mac_suspicious_dest_by_customer(9)]
args = ind, srctype, earl, late, destIP, amountTransferred, customerName, originAccount, destAccount
definition = index=$ind$ sourcetype=$srctype$ earliest=$earl$ latest=$late$\
|eval _time=strptime(_time, "%Y/%m/%d %H:%M:%S") |sort - _time\
|eval is_suspicious="no"\
|lookup susplcious_ip.csv ip as $destIP$ OUTPUT is_suspicious\
|where is_suspicious="yes" AND $amountTransferred$>10000|iplocation $destIP$|rename Country as destCountry|table _time, $customerName$, $originAccount$, $destAccount$, action, $amountTransferred$, destCountry, $destIP$\
| stats values(destCountry) as "Destination" by $customerName$, $amountTransferred$\
| rename $customerName$ as Customer, $amountTransferred$ as Amount
iseval = 0

[mac_origin_ip_timechart(6)]
args = ind, srctype, earl, late, span, originIP
definition = index=$ind$ sourcetype=$srctype$ source="wire_transfer.csv" \
| timechart span=$span$ fixedrange=F count by $originIP$ usenull=f limit=10
iseval = 0

[mac_total_dollars_failed(10)]
args = ind, srctype, earl, late, originAccount, destAccount, amountTransferred, originIP, customerName, destIP
definition = index=$ind$ sourcetype=$srctype$ source="wire_transfer.csv" action="error"\
| fields $originAccount$ $destAccount$ action $amountTransferred$ $originIP$ $customerName$ $destIP$\
| eventstats sum($amountTransferred$) as "Total Amount"\
| table "Total Amount"\
| dedup "Total Amount"\
| rename "Total Amount" as "Total Amount Failed to Transfer"
iseval = 0

[mac_total_dollars_transferred(7)]
args = ind, srctype, earl, late, amountTransferred, customerName, originIP
definition = index=$ind$ sourcetype=$srctype$ source="wire_transfer.csv" action=authorized\
| stats values($amountTransferred$) as Amount by $customerName$, $originIP$\
| eventstats sum(Amount) as Total\
| fields Total\
| dedup Total
iseval = 0

[mac_total_errors(8)]
args = ind, srctype, earl, late, OpenDate, customerName, originAccount, destAccount
definition = index=$ind$ sourcetype=$srctype$ source="wire_transfer.csv" action="error"\
| fields - epoch $OpenDate$\
| stats count(action) as "Errors" by $customerName$, $originAccount$, $destAccount$\
| eventstats sum(Errors) as "Total Errors"\
| table "Total Errors"
iseval = 0

[mac_total_successes(4)]
args = ind, srctype, earl, late
definition = index=$ind$ sourcetype=$srctype$ source="wire_transfer.csv" action=authorized\
| chart count(action) as Total
iseval = 0

[mac_authorized_transfers_within_hour(11)]
args = ind, srctype, earl, late, transferAmount, originAccount, destAccount, customerName, OpenDate, originIP, destIP
definition = index=$ind$ sourcetype=$srctype$ earliest=$earl$ latest=$late$\
|sort - _time|eval $transferAmount$=tostring(round($transferAmount$, 2),"commas")\
|streamstats time_window=1h count(eval(action="authorized")) as authorized_count list($originAccount$) as FromAccount list($destAccount$) as ToAccount list($transferAmount$) as amount list(action) as action list(_time) as time by $customerName$|where authorized_count>=7|fields - $OpenDate$ epoch $originIP$ $destIP$ _time\
| eval isOutlier = 1\
| table authorized_count, $customerName$, FromAccount, ToAccount, amount
iseval = 0

[mac_dest_ips_for_each_origin(6)]
args = ind, srctype, earl, late, destIP, originIP
definition = index=$ind$ sourcetype=$srctype$ earliest=$earl$ latest=$late$ action="authorized"\
| stats values($destIP$) as destIPs, dc($destIP$) as numDestIPs by $originIP$\
| rename $originIP$ as "Client IP", destIPs as "Destination IPs", numDestIPs as "Number of Destination IPs"\
| sort- "Number of Destination IPs"
iseval = 0
