[source::...cbapi.log]
sourcetype = vmware:cb:edr:cbapi
priority = 100

[source::...vmware_cb_edr_app_for_splunk/modularinput.log]
sourcetype = vmware:cb:edr:modularinput
priority = 100

[source::...vmware_cb_edr_app_for_splunk/vmware-cb-edr-amsi-modularinput.log]
sourcetype = vmware:cb:edr:modularinput:amsi
priority = 100

[source::...vmware_cb_edr_app_for_splunk/utilities.log]
sourcetype = vmware:cb:edr:utilities
priority = 100

[source::...vmware_cb_edr_app_for_splunk/vmware-edr-kill-process.log]
sourcetype = vmware:cb:edr:action:kill_process
priority = 100

[source::...vmware_cb_edr_app_for_splunk/vmware-edr-isolate-device.log]
sourcetype = vmware:cb:edr:action:quarantine_device
priority = 100

[source::...vmware_cb_edr_app_for_splunk/vmware-edr-unisolate-device.log]
sourcetype = vmware:cb:edr:action:quarantine_device
priority = 100

[source::...vmware_cb_edr_app_for_splunk/vmware-bah-hash.log]
sourcetype = vmware:cb:edr:action:ban_hash
priority = 100

[source::...vmware_cb_edr_app_for_splunk/edrbinarysearch.log]
sourcetype = vmware:cb:edr:command:binarysearch
priority = 100

[source::...vmware_cb_edr_app_for_splunk/edrsensorsearch.log]
sourcetype = vmware:cb:edr:command:sensorsearch
priority = 100

[source::...vmware_cb_edr_app_for_splunk/edrprocesssearch.log]
sourcetype = vmware:cb:edr:command:processsearch
priority = 100

[source::...vmware_cb_edr_alert_action_st]
EVAL-vendor_product = "Carbon Black EDR"
EVAL-vendor="VMWare"
HEADER_MODE = firstline
LEARN_MODEL = false
SHOULD_LINEMERGE       = false
BREAK_ONLY_BEFORE_DATE = false
LINE_BREAKER           = (\r?\n==##~~##~~  1E8N3D4E6V5E7N2T9 ~~##~~##==\r?\n)
SEDCMD-removeCAM = s/^\*\*\*Common Action Model\*\*\*[^\r\n]+[\r\n]+(.*)/\1/g
TIME_PREFIX = device_timestamp":
MAX_TIMESTAMP_LOOKAHEAD = 50
TIME_FORMAT = %Y-%m-%dT%H:%M:%S.%3NZ

[vmware:cb:edr:alert_action:vmware-edr-kill-process]
EVAL-vendor_product = "Carbon Black EDR"
EVAL-vendor="VMWare"
HEADER_MODE = firstline
LEARN_MODEL = false
SHOULD_LINEMERGE       = false
BREAK_ONLY_BEFORE_DATE = false
LINE_BREAKER           = (\r?\n==##~~##~~  1E8N3D4E6V5E7N2T9 ~~##~~##==\r?\n\*\*\*Common Action Model\*\*\*[^\r\n]+[\r\n]+)
SEDCMD-removeCAM = s/^\*\*\*Common Action Model\*\*\*[^\r\n]+[\r\n]+(.*)/\1/g
TIME_PREFIX = device_timestamp":
MAX_TIMESTAMP_LOOKAHEAD = 50
TIME_FORMAT = %Y-%m-%dT%H:%M:%S.%3NZ
TZ = UTC

[vmware:cb:edr:alert_action:vmware-edr-ban-hash]
EVAL-vendor_product = "Carbon Black EDR"
EVAL-vendor="VMWare"
HEADER_MODE = firstline
LEARN_MODEL = false
SHOULD_LINEMERGE       = false
BREAK_ONLY_BEFORE_DATE = false
LINE_BREAKER           = (\r?\n==##~~##~~  1E8N3D4E6V5E7N2T9 ~~##~~##==\r?\n\*\*\*Common Action Model\*\*\*[^\r\n]+[\r\n]+)
SEDCMD-removeCAM = s/^\*\*\*Common Action Model\*\*\*[^\r\n]+[\r\n]+(.*)/\1/g
TIME_PREFIX = device_timestamp":
MAX_TIMESTAMP_LOOKAHEAD = 50
TIME_FORMAT = %Y-%m-%dT%H:%M:%S.%3NZ
TZ = UTC

[vmware:cb:edr:alert_action:vmware-edr-isolate-device]
EVAL-vendor_product = "Carbon Black EDR"
EVAL-vendor="VMWare"
HEADER_MODE = firstline
LEARN_MODEL = false
SHOULD_LINEMERGE       = false
BREAK_ONLY_BEFORE_DATE = false
LINE_BREAKER           = (\r?\n==##~~##~~  1E8N3D4E6V5E7N2T9 ~~##~~##==\r?\n\*\*\*Common Action Model\*\*\*[^\r\n]+[\r\n]+)
SEDCMD-removeCAM = s/^\*\*\*Common Action Model\*\*\*[^\r\n]+[\r\n]+(.*)/\1/g
TIME_PREFIX = device_timestamp":
MAX_TIMESTAMP_LOOKAHEAD = 50
TIME_FORMAT = %Y-%m-%dT%H:%M:%S.%3NZ
TZ = UTC

[vmware:cb:edr:alert_action:vmware-edr-unisolate-device]
EVAL-vendor_product = "Carbon Black EDR"
EVAL-vendor="VMWare"
HEADER_MODE = firstline
LEARN_MODEL = false
SHOULD_LINEMERGE       = false
BREAK_ONLY_BEFORE_DATE = false
LINE_BREAKER           = (\r?\n==##~~##~~  1E8N3D4E6V5E7N2T9 ~~##~~##==\r?\n\*\*\*Common Action Model\*\*\*[^\r\n]+[\r\n]+)
SEDCMD-removeCAM = s/^\*\*\*Common Action Model\*\*\*[^\r\n]+[\r\n]+(.*)/\1/g
TIME_PREFIX = device_timestamp":
MAX_TIMESTAMP_LOOKAHEAD = 50
TIME_FORMAT = %Y-%m-%dT%H:%M:%S.%3NZ
TZ = UTC

[vmware:cb:edr:cmd:binarysearch]
EVAL-vendor_product = "Carbon Black EDR"
EVAL-vendor="VMWare"

[vmware:cb:edr:cmd:sensorsearch]
EVAL-vendor_product = "Carbon Black EDR"
EVAL-vendor="VMWare"
KV_MODE = json
EVAL-webui_link = "https://".source."/#/host/".id

[vmware:cb:edr:alert_action:vmware_kill_process]
TRUNCATE = 999999
EVAL-vendor_product = "Carbon Black EDR"
EVAL-vendor="VMWare"

[vmware:cb:edr:alert_action:vmware_quarantine]
EVAL-vendor_product = "Carbon Black EDR"
EVAL-vendor="VMWare"

[source::...event_bridge_output.json*]
sourcetype = vmware:cb:edr:json

# EXTRACT -> REPORT -> KV_MODE -> FIELDALIAS -> EVAL -> LOOKUP
[vmware:cb:edr:json]
SHOULD_LINEMERGE = false
KV_MODE = JSON
TIME_PREFIX = \"timestamp\"\:
TIME_FORMAT=%s
MAX_TIMESTAMP_LOOKAHEAD = 0
pulldown_type = true
EVENT_BREAKER_ENABLE = true
TRUNCATE = 100000

#############################################################
## General
##############################################################
FIELDALIAS-os = docs{}.os_type AS os
EVAL-link_sensor = replace(link_sensor, "https://", "")
EVAL-link_target = replace(link_target, "https://", "")
EVAL-link_parent = replace(link_parent, "https://", "")
EVAL-link_child = replace(link_child, "https://", "")
EVAL-link_process = replace(link_process, "https://", "")
EVAL-link_md5 = replace(link_md5, "https://", "")
EVAL-action = case(is_network=="netconn" OR (is_alert!="" OR alert_type!="") AND (isnull(is_file) AND isnull(is_registry) AND isnull(is_binary)),"allowed",\
              action=="write","modified",\
              action=="create","created",\
              action=="delete","deleted",\
              action=="writeval","modified",\
              action=="delval","deleted",\
              action=="createkey","created",\
              action=="delkey","deleted",\
              action=="lastwrite","modified",\
              action=="binary","read",\
              action=="created","created",\
              type=="binarystore.file.added","created",\
              type=="ingress.event.filelessscriptload","created",\
              result=="complete","success",\
              match(result,"error"),"failure",\
              isnotnull(action),action,\
              true(),null)

REPORT-event_type 	  = vmware_carbonblack_is_alert_transform
REPORT-op-type-1 = vmware_carbonblack_is_network_transform, vmware_carbonblack_is_file_transform, vmware_carbonblack_is_registry_transform
REPORT-op-type-2 = vmware_carbonblack_is_process_transform, vmware_carbonblack_is_binary_transform, vmware_carbonblack_is_edr_alert_transform
REPORT-operation_type_edr = vmware_carbonblack_is_edr_file_transform, vmware_carbonblack_is_edr_process_transform
REPORT-endpoint = vmware_carbonblack_endpoint_transform, vmware_carbonblack_endpoint_transform2
REPORT-process_from_path = vmware_carbonblack_process_name_transform, vmware_carbonblack_parent_process_name_transform

EVAL-dvc 			= coalesce(endpoint, hostname, computer_name)
EVAL-vendor 		= "VMware Carbon Black"
EVAL-product 		= "Carbon Black EDR"
EVAL-vendor_product = "Carbon Black EDR"
EVAL-file_hash = case(type IN("binarystore.file.added","ingress.event.filemod","ingress.event.module","watchlist.storage.hit.binary","watchlist.hit.binary"), COALESCE(if(md5="",null,md5),'docs{}.md5'), true(), file_hash)
EVAL-file_access_time = case(type IN("ingress.event.filemod","ingress.event.module"),timestamp)
EVAL-file_modify_time = case(type IN("binarystore.file.added","ingress.event.filemod","ingress.event.module"),timestamp)
EVAL-file_create_time = case(type=="binarystore.file.added" OR (type=="ingress.event.filemod" AND action=="create"),timestamp)
EVAL-status         = if(status=="Unresolved","success",status)
EVAL-dest_nt_domain = if(mvcount(split(username,"\\"))==2,mvindex(split(username,"\\"),0),null)
EVAL-user			= coalesce(mvindex(split(username,"\\"),-1),process_guid)
EVAL-user_name = COALESCE(mvindex(split(COALESCE(username,'docs{}.username'),"\\"),-1), 'docs{}.username', child_username,"process-guid:"+process_guid)
EVAL-parent_process = COALESCE(parent_process,'docs{}.parent_name',if(isnotnull(is_edr_process),parent_process_from_path,null))
EVAL-parent_process_name = COALESCE(parent_process_name,parent_process,'docs{}.parent_name',if(isnotnull(is_edr_process),parent_process_from_path,null))
EVAL-parent_process_exec = COALESCE(parent_process_name,parent_process,'docs{}.parent_name',if(isnotnull(is_edr_process),parent_process_from_path,null))
EVAL-parent_process_path = if(type == "ingress.event.procstart" OR type == "ingress.event.procend",parent_path,parent_process_path)
EVAL-parent_process_id = if(type == "ingress.event.procstart" OR type == "ingress.event.procend",parent_pid,parent_process_id)
EVAL-parent_process_guid = if(event_type=="childproc",parent_guid,parent_process_guid)
EVAL-process_exec = COALESCE(process_exec,process_name,'docs{}.process_name',process_from_path,if(file_name!="0" AND isnotnull(is_edr_process), file_name, process))
EVAL-process_path = COALESCE(if(event_type=="childproc",path,process_path),case(isnotnull(is_edr_process),COALESCE('docs{}.path',path)))
EVAL-process_name = COALESCE(process_name,'docs{}.process_name',process_from_path,if(file_name!="0" AND isnotnull(is_edr_process), file_name, process))
EVAL-process_hash = COALESCE(process_md5,'docs{}.process_md5',if(isnotnull(is_edr_process),if(md5="" OR isnull(md5),'docs{}.md5',md5),null))
EVAL-parent_process_hash = if(isnotnull(is_edr_process),if(parent_md5="" OR isnull(parent_md5),'docs{}.parent_md5',parent_md5),null)

##############################################################
## ALERTS CIM
##############################################################
# Reviewed for CIM 5.1 Feb 12, 2023
EVAL-app = coalesce('docs{}.product_name', "Carbon Black EDR")
FIELDALIAS-body	= ioc_attr as body
#EVAL-signature_id = coalesce(watchlist_name, ioc_value, "n")
FIELDALIAS-notification_type = type as notification_type
EVAL-type = if(isnotnull(is_alert),"alert",type)
EVAL-signature = case(isnotnull(is_alert),watchlist_name,is_alert!="" OR alert_type!="",type)
EVAL-signature_id = if(isnotnull(is_alert),watchlist_id,signature_id)
EVAL-severity_id = if(isnotnull(is_alert),alert_severity,severity_id)
EVAL-id = COALESCE(unique_id,id)
EVAL-is_edr_alert = if(isnotnull(is_alert),"true","false")

EVAL-subject = "Type:"+notification_type + ", Watchlist_name:" + watchlist_name
EVAL-severity = if(is_alert !="" OR alert_type!="",if(alert_severity < 20, "informational", if((alert_severity >= 20 AND alert_severity < 40), "low", if((alert_severity >= 40 AND alert_severity < 60), "medium", if((alert_severity >= 60 AND alert_severity < 80), "high", if((alert_severity >= 80), "critical", "unknown"))))),null)


##############################################################
## ENDPOINT CIM
##############################################################
# Reviewed for CIM 5.1 Feb 12, 2023
REPORT-object_info = vmware_carbonblack_file_and_path_transform, vmware_carbonblack_registry_transform

# Filesystem
EVAL-size = COALESCE(size,'docs{}.orig_mod_len')
EVAL-file_size = case(size==0,0,isnotnull('docs{}.orig_mod_len'),'docs{}.orig_mod_len',true(),size/1024)
EVAL-change_type = if((is_file != "" OR is_binary != ""),"filesystem", if(is_registry != "", "registry", if(is_process != "", "process", "")))
EVAL-file_name = case(type=="binarystore.file.added",mvindex(split(file_path,"/"),-1),\
                    type=="ingress.event.filelessscriptload",mvindex(split(mvindex(split(process_path,"/"),-1), "\\"), -1),\
                    is_file != "", file_name,\
                    true(), null())
EVAL-file_path = if(isnull(file_path),\
    case(like(process_path,"%/%"),mvjoin(mvindex(split(process_path,"/"),0,-2),"/"),\
    like(process_path,"%\\%"),mvjoin(mvindex(split(process_path,"\\"),0,-2),"\\"),\
    true(),null()),\
    null())
# Registry
EVAL-registry_path = if(is_registry != "", coalesce(registry_path,file_path),null)
EVAL-registry_key = if(is_registry != "", registry_key,null)
EVAL-registry_key_name = if(is_registry != "", coalesce(registry_key,file_name),null)
EVAL-registry_value = if(is_registry != "",registry_value,null)
EVAL-registry_value_data = if(isnull(registry_value_data) OR registry_value_data="","unknown", registry_value_data)
EVAL-registry_value_name = if(isnull(registry_value_name) OR registry_value_name="","unknown", registry_value_name)
EVAL-registry_value_text = if(isnull(registry_value_text) OR registry_value_text="","unknown", registry_value_text)
EVAL-registry_hive = if(is_registry != "", coalesce(registry_key,file_name),null)

EVAL-object = case(is_file!="",file_name,is_registry!="", coalesce(registry_key,file_name))
EVAL-object_path = case(is_file!="",file_path,is_registry!="",coalesce(registry_path,file_path))
EVAL-vendor_action = case(isnotnull(vendor_action),vendor_action,type=="binarystore.file.added", "created")
EVAL-process_id = coalesce(pid,process_id)
EVAL-process = case(file_name!="0", file_name, isnotnull(command), command." ".object)

##############################################################
## NETWORK TRAFFIC CIM
##############################################################
# Reviewed for CIM 5.1 Feb 12, 2023

EVAL-dest_ip = coalesce(if(direction == "outbound",remote_ip,if(direction == "inbound",local_ip,null)),ipv4,comms_ip)
EVAL-dest_translated_ip = coalesce(if(direction == "outbound",remote_ip,if(direction == "inbound",local_ip,null)),ipv4)
EVAL-dest = if(domain!="",domain,coalesce(if(direction == "outbound",remote_ip,if(direction == "inbound",local_ip,null)),ipv4, endpoint, server_name, computer_name))
EVAL-src  = coalesce('docs{}.endpoint', 'docs{}.endpoint{}', hostname, computer_name, "unknown")
EVAL-dest_port = if(direction == "outbound",coalesce(remote_port,port),if(direction == "inbound",local_port,null))
EVAL-src_port = if(direction == "outbound",local_port,if(direction == "inbound",coalesce(remote_port,port),null))
EVAL-dest_translated_port = if(direction == "outbound",coalesce(remote_port,port),if(direction == "inbound",local_port,null))
EVAL-src_translated_port = if(direction == "outbound",local_port,if(direction == "inbound",coalesce(remote_port,port),null))
EVAL-transport = if(protocol=="6","tcp",if(protocol=="17","udp","unknown"))
EVAL-protocol = if(is_network=="netconn","ip",null)
EVAL-protocol_version = case(is_network=="netconn" AND isnotnull(local_ip),if(match(local_ip,":"),"ipv6","ipv4"), is_network=="netconn" AND isnotnull(remote_ip),if(match(remote_ip,":"),"ipv6","ipv4"))

##############################################################
## IDS CIM
##############################################################
# Reviewed for CIM 5.1 Feb 12, 2023
EVAL-category = if(is_alert!="" OR alert_type!="",coalesce(watchlist_name,report_id),null)
EVAL-ids_type = if(is_alert!="" OR alert_type!="","host",null)

# Audit Log User Activity - Web
EXTRACT-audit-log-user-activity-msg-ip = ip='[a-z:]+(?<src_ip>[\d\.]+)'
EXTRACT-audit-log-user-activity-msg-method = method='(?<http_method>\w+)'
EXTRACT-audit-log-user-activity-msg-path = path='(?<uri_path>[^']+)'
EXTRACT-audit-log-user-activity-msg-content = content='{(?<content>.*)}'
REPORT-audit-log-user-activity-kv = audit-log-user-activity-kv
REPORT-audit-log-user-activity-msg-content = audit-log-user-activity-msg-content
# Audit Log Live Response
EXTRACT-audit-log-live-response-msg-ip = host:\s*[a-z:]+(?<src_ip>[\d\.]+)\s*.'(?<src_host>[^']+)'
REPORT-audit-log-live-response-kv = audit-log-live-response-kv

# CIM Updates
FIELDALIAS-process_name = command AS process_name
FIELDALIAS-userid = userid AS user_id
