[qualys:hostDetection]
TRUNCATE=0
SHOULD_LINEMERGE = false
KV_MODE = auto
TIME_PREFIX=LAST_SCAN_DATETIME="|LAST_UPDATE_DATETIME="
TIME_FORMAT=%Y-%m-%dT%H:%M:%S
MAX_TIMESTAMP_LOOKAHEAD = 20
TZ = UTC
MAX_DAYS_AGO = 10951

FIELDALIAS-severity = SEVERITY as severity_id
FIELDALIAS-type = TYPE as category
FIELDALIAS-dest = IP as dest

EVAL-dvc = "Qualys"
EVAL-vendor_product = "Qualys Cloud Platform"

# LOOKUP-qid = qualys_kb_lookup QID AS QID OUTPUT TITLE AS TITLE VULN_TYPE AS VULN_TYPE CATEGORY AS CATEGORY PATCHABLE AS PATCHABLE PCI_FLAG AS PCI_FLAG CVSS_BASE CVSS_TEMPORAL CVE VENDOR_REFERENCE PUBLISHED_DATETIME AS PUBLISHED_DATETIME

LOOKUP-qualys_severity_lookup = qualys_severity_lookup severity_id OUTPUT vendor_severity, severity

LOOKUP-qualys_kb_lookup = qualys_kb_lookup QID OUTPUT VULN_TYPE, PATCHABLE, PCI_FLAG, TITLE as signature, CATEGORY as vuln_category, PUBLISHED_DATETIME, CVSS_BASE as cvss, CVSS_TEMPORAL, CVE as cve, VENDOR_REFERENCE as xref

REPORT-tcpportservice = extract_tcp_port_service
REPORT-udpportservice = extract_udp_port_service
REPORT-tcpservice = extract_tcp_service
REPORT-udpservice = extract_udp_service

[qualys://knowledge_base]
SHOULD_LINEMERGE = true
KV_MODE = auto
TIME_PREFIX=TA-QualysCloudPlatform:\s|LAST_SCAN_DATETIME="|LAST_UPDATE_DATETIME="
TIME_FORMAT=%Y-%m-%dT%H:%M:%S
MAX_TIMESTAMP_LOOKAHEAD = 20
MAX_DAYS_AGO = 10951

[qualys:wasFindings]
TRUNCATE=0
SHOULD_LINEMERGE = false
KV_MODE = auto
TIME_PREFIX=lastDetectedDate="|lastTestedDate="
TIME_FORMAT=%Y-%m-%dT%H:%M:%S
MAX_TIMESTAMP_LOOKAHEAD = 20
TZ = UTC
MAX_DAYS_AGO = 10951
# LINE_BREAKER=WAS_FINDING|WAS_SUMMARY

FIELDALIAS-severity = severity as severity_id
FIELDALIAS-type = type as category
FIELDALIAS-dest = url as dest

EVAL-dvc = "Qualys"
EVAL-vendor_product = "Qualys Cloud Platform"

LOOKUP-qualys_severity_lookup = qualys_severity_lookup severity_id OUTPUT vendor_severity, severity

LOOKUP-qualys_kb_lookup = qualys_kb_lookup QID as qid OUTPUT VULN_TYPE as vuln_type, PATCHABLE as patchable, PCI_FLAG as PCI_flag, TITLE as signature, CATEGORY as vuln_category, PUBLISHED_DATETIME as published_datetime, CVSS_BASE as cvss, CVSS_TEMPORAL as cvss_temporal, CVE as cve, VENDOR_REFERENCE as xref

[qualys:pc:policyInfo]
TRUNCATE=0
SHOULD_LINEMERGE=false
KV_MODE=auto
TIME_PREFIX=LAST_EVALUATED_DATETIME="|LAST_MODIFIED_DATETIME="|CREATED_DATETIME="
TIME_FORMAT=%Y-%m-%dT%H:%M:%S
MAX_TIMESTAMP_LOOKAHEAD=20
TZ=UTC
# As per the definition the default value is 2 days.
# So if the next event has LAST_EVALUATED_DATETIME more than 2 days then the next event will be given the _time of current event. Hence, providing the max value.
MAX_DAYS_HENCE = 7300      # (From the current date, data for next 30 yrs will be considered)
MAX_DAYS_AGO = 7300        # (From the current date, 30 yrs old data will be considered)

[qualys:pc:postureInfo]
TRUNCATE=0
SHOULD_LINEMERGE=false
KV_MODE=auto
TIME_PREFIX=POSTURE_MODIFIED_DATE="
TIME_FORMAT=%Y-%m-%dT%H:%M:%S
MAX_TIMESTAMP_LOOKAHEAD=20
TZ=UTC

[qualys:cs:csImageInfo]
TRUNCATE=0
INDEXED_EXTRACTIONS=json
KV_MODE=none
MAX_EVENTS=50000
NO_BINARY_CHECK=true
TIMESTAMP_FIELDS=updated
TIME_FORMAT=%Y-%m-%dT%H:%M:%SZ
category=Structured
description=JavaScript Object Notation format. For more information, visit http://json.org/
disabled=false
pulldown_type=true

[qualys:cs:csImageVulnInfo]
TRUNCATE=0
CHARSET=UTF-8
INDEXED_EXTRACTIONS=json
KV_MODE=none
MAX_EVENTS=50000
NO_BINARY_CHECK=true
TIMESTAMP_FIELDS=lastFound
TIME_FORMAT=%Y-%m-%dT%H:%M:%SZ
category=Structured
description=JavaScript Object Notation format. For more information, visit http://json.org/
disabled=false
pulldown_type=true
TZ=UTC

FIELDALIAS-severity = severity as severity_id
FIELDALIAS-type = typeDetected as category
FIELDALIAS-dest = IP as dest

EVAL-dvc = "Qualys"
EVAL-vendor_product = "Qualys Cloud Platform"

# LOOKUP-qid = qualys_kb_lookup qid AS QID OUTPUT TITLE AS TITLE VULN_TYPE AS VULN_TYPE CATEGORY AS CATEGORY PATCHABLE AS PATCHABLE PCI_FLAG AS PCI_FLAG CVSS_BASE CVSS_TEMPORAL CVE VENDOR_REFERENCE PUBLISHED_DATETIME AS PUBLISHED_DATETIME

LOOKUP-qualys_severity_lookup = qualys_severity_lookup severity_id OUTPUT vendor_severity, severity

LOOKUP-qualys_kb_lookup = qualys_kb_lookup QID as qid OUTPUT VULN_TYPE, PATCHABLE, PCI_FLAG, TITLE as signature, CATEGORY as vuln_category, PUBLISHED_DATETIME, CVSS_BASE as cvss, CVSS_TEMPORAL, CVE as cve, VENDOR_REFERENCE as xref

[qualys:cs:container]
TRUNCATE=0
TIME_PREFIX="updated": "|"stateChanged": "
TIME_FORMAT=%Y-%m-%dT%H:%M:%S
TZ=UTC
CHARSET=UTF-8
NO_BINARY_CHECK=true
INDEXED_EXTRACTIONS=json
KV_MODE=none
MAX_EVENTS=50000

[qualys:cs:containerVuln]
TRUNCATE=0
TIME_PREFIX="lastFound": "
TIME_FORMAT=%Y-%m-%dT%H:%M:%S
TZ=UTC
CHARSET=UTF-8
NO_BINARY_CHECK=true

FIELDALIAS-severity = severity as severity_id
FIELDALIAS-type = typeDetected as category
FIELDALIAS-dest = IP as dest

EVAL-dvc = "Qualys"
EVAL-vendor_product = "Qualys Cloud Platform"

LOOKUP-qualys_severity_lookup = qualys_severity_lookup severity_id OUTPUT vendor_severity, severity

LOOKUP-qualys_kb_lookup = qualys_kb_lookup QID as qid OUTPUT VULN_TYPE, PATCHABLE, PCI_FLAG, TITLE as signature, CATEGORY as vuln_category, PUBLISHED_DATETIME, CVSS_BASE as cvss, CVSS_TEMPORAL, CVE as cve, VENDOR_REFERENCE as xref

[qualys:fim:event]
TRUNCATE=0
TIMESTAMP_FIELDS=dateTime
TZ=UTC
CHARSET=UTF-8
NO_BINARY_CHECK=true
INDEXED_EXTRACTIONS=json
KV_MODE=none
MAX_EVENTS=50000

[qualys:fim:ignored_event]
TRUNCATE=0
TIMESTAMP_FIELDS=dateTime
TZ=UTC
CHARSET=UTF-8
NO_BINARY_CHECK=true
INDEXED_EXTRACTIONS=json
KV_MODE=none
MAX_EVENTS=50000

[qualys:fim:incident]
TRUNCATE=0
TIMESTAMP_FIELDS=createdBy.date
TZ=UTC
CHARSET=UTF-8
NO_BINARY_CHECK=true
INDEXED_EXTRACTIONS=json
KV_MODE=none
MAX_EVENTS=50000


[qualys:edr:antimalware]
INDEXED_EXTRACTIONS=json
KV_MODE=none
MAX_EVENTS=50000
TRUNCATE = 0
NO_BINARY_CHECK=true
TIMESTAMP_FIELDS=dateTime
TIME_FORMAT=%Y-%m-%dT%H:%M:%SZ
TZ=UTC
CHARSET=UTF-8
category=Structured
description=JavaScript Object Notation format. For more information, visit http://json.org/
disabled=false
pulldown_type=true

EVAL-category = case('eventMetadata.eppEventName' IN ("NetworkMonitor.OnThreatDetected"),'eventMetadata.networkEventAttackTechnique','type' IN ("FILE","PROCESS","NETWORK","DEVICECONTROL","ANTIPHISHING","TRAFFIC"),'category{}','type' IN ("CONTENTCONTROL"),'userControl.categories{}')
EVAL-action=case('type' IN ("DEVICECONTROL"),lower('action'),'eventMetadata.detectionType' IN ("On-Demand"), lower('eventMetadata.fileActionTaken'),'eventMetadata.eppEventName' IN ("NetworkMonitor.OnThreatDetected"), lower('eventMetadata.networkEventActionTaken'),'eventMetadata.eppEventName' IN ("FileScan.OnAccess.Malware","FileScan.Quarantine.ListChanged", "FileScan.OnDemand.Malware","FileScan.OnAccess.Malware","TrafficScan.Malware"), lower('eventMetadata.fileActionTaken'),'eventMetadata.eppEventName' IN ("FileScan.AMSI.Detection","BehavioralScan.Midas.OnApplicationActionTaken","BehavioralScan.Midas.ApplicationBlocked","BehavioralScan.Midas.ExploitBlocked","BehavioralScan.Midas.OnExploitActionTaken","AntiExploit.OnDetection"),lower('eventMetadata.processActionTaken'),'eventMetadata.eppEventName' IN ("AntiRansomware.Monitor.OnDetection","Antiphishing.Phishing","DataLossPrevention.DeviceControl.DeviceInfo","UserControl.Categories.WebPage.Blocked","UserControl.Blacklist.WebPage.Blocked","UserControl.Application.Blocked"),lower('action'))
FIELDALIAS-date = dateTime as date
FIELDALIAS-dest = asset.hostName as dest
FIELDALIAS-severity_id = score as severity_id
EVAL-severity = case('score' IN ("1","2") , "INFO",'score' IN ("3") , "LOW",'score' IN ("4","5","6") , "MEDIUM",'score' IN ("7","8") , "HIGH",'score' IN ("9","10") , "CRITICAL")
EVAL-file_path=case('eventMetadata.detectionType' IN ("On-Demand"),'file.fullPath','eventMetadata.eppEventName' IN ("FileScan.OnAccess.Malware","FileScan.Quarantine.ListChanged","FileScan.OnAccess.Malware","TrafficScan.Malware"), 'file.fullPath','eventMetadata.eppEventName' IN ("FileScan.AMSI.Detection","BehavioralScan.Midas.OnApplicationActionTaken","BehavioralScan.Midas.ApplicationBlocked","BehavioralScan.Midas.ExploitBlocked","BehavioralScan.Midas.OnExploitActionTaken"),'process.processFile.fullPath','eventMetadata.eppEventName' IN ("UserControl.Categories.WebPage.Blocked","UserControl.Blacklist.WebPage.Blocked","UserControl.Application.Blocked"),'userControl.imagePath')
EVAL-file_name=case('eventMetadata.detectionType' IN ("On-Demand"),'file.fileName','eventMetadata.eppEventName' IN ("FileScan.OnAccess.Malware","FileScan.Quarantine.ListChanged", "FileScan.OnAccess.Malware","TrafficScan.Malware"), 'file.fileName','eventMetadata.eppEventName' IN ("FileScan.AMSI.Detection","BehavioralScan.Midas.OnApplicationActionTaken","BehavioralScan.Midas.ApplicationBlocked","BehavioralScan.Midas.ExploitBlocked","BehavioralScan.Midas.OnExploitActionTaken"),'process.processFile.fileName')
EVAL-file_hash=case('eventMetadata.detectionType' IN ("On-Demand"),'file.sha256','eventMetadata.eppEventName' IN ("FileScan.OnAccess.Malware","FileScan.Quarantine.ListChanged", "FileScan.OnAccess.Malware","TrafficScan.Malware"), 'file.sha256','eventMetadata.eppEventName' IN ("FileScan.AMSI.Detection","BehavioralScan.Midas.OnApplicationActionTaken","BehavioralScan.Midas.ApplicationBlocked","BehavioralScan.Midas.ExploitBlocked","BehavioralScan.Midas.OnExploitActionTaken"),'process.processFile.sha256')
EVAL-detection_type =case('eventMetadata.detectionType' IN ("On-Demand"),'eventMetadata.detectionType','eventMetadata.eppEventName' IN ("FileScan.OnAccess.Malware","FileScan.Quarantine.ListChanged", "FileScan.OnDemand.Malware","FileScan.OnAccess.Malware","TrafficScan.Malware","FileScan.AMSI.Detection","BehavioralScan.Midas.OnApplicationActionTaken","BehavioralScan.Midas.ApplicationBlocked","BehavioralScan.Midas.ExploitBlocked","BehavioralScan.Midas.OnExploitActionTaken","AntiExploit.OnDetection","AntiRansomware.Monitor.OnDetection","Antiphishing.Phishing","NetworkMonitor.OnThreatDetected"), 'eventMetadata.detectionType')
EVAL-os = case('eventMetadata.eppEventName' IN ("BehavioralScan.Midas.OnApplicationActionTaken","BehavioralScan.Midas.ApplicationBlocked"),'asset.fullOSName')
EVAL-malicious_url = case('eventMetadata.eppEventName' IN ("Antiphishing.Phishing"), 'eventMetadata.antiPhishingURL','eventMetadata.eppEventName' IN ("NetworkMonitor.OnThreatDetected"),'eventMetadata.networkEventUrl')
EVAL-dvc_id = case('type' IN ("DEVICECONTROL"),'deviceControl.deviceId')
EVAL-dvc_name = case('type' IN ("DEVICECONTROL"),'deviceControl.deviceName')
EVAL-blocked_url = case('eventMetadata.eppEventName' IN ("UserControl.Categories.WebPage.Blocked","UserControl.Blacklist.WebPage.Blocked","UserControl.Application.Blocked"), 'userControl.blockedUrl')
FIELDALIAS-signature = eventMetadata.threatName as signature
FIELDALIAS-user = asset.lastLoggedOnUser as user
EVAL-dest_nt_domain = if(like('asset.hostName', "%.%"), replace('asset.hostName', "^[^\\.]+\\.", ""), "")
EVAL-script_path = case('eventMetadata.eppEventName' IN ("FileScan.AMSI.Detection"),'amsi.scriptFileName')
EVAL-script_name = case('eventMetadata.eppEventName' IN ("FileScan.AMSI.Detection"), mvindex(split('amsi.scriptFileName', "/"),-1))

FIELDALIAS-actorimageFullPath = actor.imageFullPath as actorimageFullPath
FIELDALIAS-actorProcessArgs =  actor.arguments as actorProcessArgs
EVAL-parent_process = case('eventMetadata.eppEventName' IN ("FileScan.OnAccess.Malware"), 'actorimageFullPath'." ".'actorProcessArgs')

FIELDALIAS-processFullPath = process.fullPath as processFullPath
FIELDALIAS-processArgs = process.arguments as processArgs
EVAL-process = case('eventMetadata.eppEventName' IN ("AntiRansomware.Monitor.OnDetection","FileScan.AMSI.Detection","BehavioralScan.Midas.OnApplicationActionTaken","BehavioralScan.Midas.ApplicationBlocked"),'processFullPath'." ".'processArgs')

EVAL-parent_process_id = case('eventMetadata.eppEventName' IN ("AntiRansomware.Monitor.OnDetection","FileScan.OnAccess.Malware","FileScan.AMSI.Detection","BehavioralScan.Midas.OnApplicationActionTaken","BehavioralScan.Midas.ApplicationBlocked"), 'actor.processId')
EVAL-parent_process_name = case('eventMetadata.eppEventName' IN ("AntiRansomware.Monitor.OnDetection","FileScan.OnAccess.Malware","FileScan.AMSI.Detection","BehavioralScan.Midas.OnApplicationActionTaken","BehavioralScan.Midas.ApplicationBlocked"), 'actor.processName')
EVAL-parent_process_path =case('eventMetadata.eppEventName' IN ("AntiRansomware.Monitor.OnDetection","FileScan.OnAccess.Malware","FileScan.AMSI.Detection","BehavioralScan.Midas.OnApplicationActionTaken","BehavioralScan.Midas.ApplicationBlocked"), 'actor.imageFullPath')

EVAL-process_id =case('eventMetadata.eppEventName' IN ("AntiRansomware.Monitor.OnDetection","FileScan.AMSI.Detection","BehavioralScan.Midas.OnApplicationActionTaken","BehavioralScan.Midas.ApplicationBlocked"), 'process.pid')
EVAL-process_name =case('eventMetadata.eppEventName' IN ("AntiRansomware.Monitor.OnDetection","FileScan.AMSI.Detection","BehavioralScan.Midas.OnApplicationActionTaken","BehavioralScan.Midas.ApplicationBlocked"), 'process.processName')
EVAL-process_path  =case('eventMetadata.eppEventName' IN ("AntiRansomware.Monitor.OnDetection","FileScan.AMSI.Detection","BehavioralScan.Midas.OnApplicationActionTaken","BehavioralScan.Midas.ApplicationBlocked"), 'process.fullPath')

EVAL-vendor_product = "Qualys Cloud Platform"

[qualys:edr:network]
INDEXED_EXTRACTIONS=json
KV_MODE=none
MAX_EVENTS=50000
TRUNCATE = 0
NO_BINARY_CHECK=true
TIMESTAMP_FIELDS=dateTime
TIME_FORMAT=%Y-%m-%dT%H:%M:%SZ
TZ=UTC
CHARSET=UTF-8
category=Structured
description=JavaScript Object Notation format. For more information, visit http://json.org/
disabled=false
pulldown_type=true

EVAL-action = lower(action)
FIELDALIAS-creation_time = dateTime as creation_time
FIELDALIAS-dest = network.localIP as dest
FIELDALIAS-process_guid = actor.processUniqueId as process_guid
FIELDALIAS-process_id = actor.processId as process_id
FIELDALIAS-transport = network.protocol as transport
FIELDALIAS-transport_dest_port = network.remotePort as transport_dest_port
FIELDALIAS-user = process.userName as user
FIELDALIAS-dest_port = network.localPort as dest_port
FIELDALIAS-src = network.remoteIP as src
FIELDALIAS-src_port = network.remotePort as src_port
FIELDALIAS-state = network.state as state

[qualys:edr:process]
INDEXED_EXTRACTIONS=json
KV_MODE=none
MAX_EVENTS=50000
TRUNCATE = 0
NO_BINARY_CHECK=true
TIMESTAMP_FIELDS=dateTime
TIME_FORMAT=%Y-%m-%dT%H:%M:%SZ
TZ=UTC
CHARSET=UTF-8
category=Structured
description=JavaScript Object Notation format. For more information, visit http://json.org/
disabled=false
pulldown_type=true

FIELDALIAS-dest = asset.hostName as dest
EVAL-action = lower(action)
FIELDALIAS-loaded_file = process.processFile.moduleName as loaded_file
FIELDALIAS-os = asset.fullOSName as os
FIELDALIAS-parent_process_exec = actor.processName as parent_process_exec
FIELDALIAS-parent_process_id = actor.processId as parent_process_id
FIELDALIAS-parent_process_guid = actor.processUniqueId as parent_process_guid
FIELDALIAS-parent_process_name = actor.processName as parent_process_name
FIELDALIAS-parent_process_path = actor.imageFullPath as parent_process_path
FIELDALIAS-process_exec = process.processName as process_exec
FIELDALIAS-process_hash = process.processFile.sha256 as process_hash
FIELDALIAS-process_guid = uniqueId as process_guid
FIELDALIAS-process_id = process.pid as process_id
FIELDALIAS-process_integrity_level = process.integrityLevel as process_integrity_level
FIELDALIAS-process_name = process.processName as process_name
FIELDALIAS-process_path = process.fullPath as process_path
FIELDALIAS-user = process.userName as user
FIELDALIAS-user_id = process.sid as user_id
FIELDALIAS-process = processNameWithArg as process
FIELDALIAS-original_file_name = process.processFile.originalFileName as original_file_name

EVAL-vendor_product = "Qualys Cloud Platform"

[qualys:edr:file]
INDEXED_EXTRACTIONS=json
KV_MODE=none
MAX_EVENTS=50000
TRUNCATE = 0
NO_BINARY_CHECK=true
TIMESTAMP_FIELDS=dateTime
TIME_FORMAT=%Y-%m-%dT%H:%M:%SZ
TZ=UTC
CHARSET=UTF-8
category=Structured
description=JavaScript Object Notation format. For more information, visit http://json.org/
disabled=false
pulldown_type=true

FIELDALIAS-dest = asset.hostName as dest
EVAL-action = lower(action)
FIELDALIAS-file_access_time = file.accessDate as file_access_time
FIELDALIAS-file_create_time = file.createdDate as file_create_time
FIELDALIAS-file_hash = file.sha256 as file_hash
FIELDALIAS-file_modify_time = file.writeDate as file_modify_time
FIELDALIAS-file_name = file.fileName as file_name
FIELDALIAS-file_path = file.path as file_path
FIELDALIAS-file_size = file.size as file_size
FIELDALIAS-process_guid = actor.processUniqueId as process_guid
FIELDALIAS-process_id = actor.processId as process_id
FIELDALIAS-user = actor.userName as user

EVAL-vendor_product = "Qualys Cloud Platform"

[qualys:edr:registry]
INDEXED_EXTRACTIONS=json
KV_MODE=none
MAX_EVENTS=50000
TRUNCATE = 0
NO_BINARY_CHECK=true
TIMESTAMP_FIELDS=dateTime
TIME_FORMAT=%Y-%m-%dT%H:%M:%SZ
TZ=UTC
CHARSET=UTF-8
category=Structured
description=JavaScript Object Notation format. For more information, visit http://json.org/
disabled=false
pulldown_type=true

FIELDALIAS-dest = asset.hostName as dest
EVAL-action = lower(action)
FIELDALIAS-process_guid = actor.processUniqueId as process_guid
FIELDALIAS-process_id = actor.processId as process_id
FIELDALIAS-registry_path = registry.key as registry_path
FIELDALIAS-registry_value_data = registry.value as registry_value_data
FIELDALIAS-registry_value_name = registry.path as registry_value_name
FIELDALIAS-registry_value_text = registry.value as registry_value_text
FIELDALIAS-user = actor.userName as user
FIELDALIAS-registry_key = registry.key as registry_key
EVAL-registry_hive = mvindex(split(registry_key, "\\"),0)

FIELDALIAS-registry_key_alias = registry.key as registry_key_alias
EVAL-registry_key_name = mvindex(split(registry_key_alias, "\\"),-1)

EVAL-vendor_product = "Qualys Cloud Platform"

[qualys:edr:event]
INDEXED_EXTRACTIONS=json
KV_MODE=none
MAX_EVENTS=50000
TRUNCATE = 0
NO_BINARY_CHECK=true
TIMESTAMP_FIELDS=dateTime
TIME_FORMAT=%Y-%m-%dT%H:%M:%SZ
TZ=UTC
CHARSET=UTF-8
category=Structured
description=JavaScript Object Notation format. For more information, visit http://json.org/
disabled=false
pulldown_type=true

[qualys:activityLog]
TRUNCATE=0
TIMESTAMP_FIELDS=Date
TZ=UTC
CHARSET=UTF-8
NO_BINARY_CHECK=true
INDEXED_EXTRACTIONS=json
KV_MODE=none
MAX_EVENTS=50000
TIME_FORMAT=%Y-%m-%dT%H:%M:%SZ

[qualys:sem:detection]
TIMESTAMP_FIELDS=dateTime
LINE_BREAKER=(\<DETECTION\s)
SHOULD_LINEMERGE=true
NO_BINARY_CHECK=true
TZ=UTC
CHARSET=UTF-8
KV_MODE=xml
MAX_EVENTS=50000
TIME_FORMAT=%Y-%m-%dT%H:%M:%SZ

FIELDALIAS-severity = DETECTION.SEVERITY as severity_id
FIELDALIAS-type = DETECTION.type as category
FIELDALIAS-dest = DETECTION.IP as dest

EVAL-dvc = "Qualys"
EVAL-vendor_product = "Qualys Cloud Platform"

LOOKUP-qualys_severity_lookup = qualys_severity_lookup severity_id OUTPUT vendor_severity, severity

LOOKUP-qualys_kb_lookup = qualys_kb_lookup QID as DETECTION.QID OUTPUT VULN_TYPE, PATCHABLE, PCI_FLAG, TITLE as signature, CATEGORY as vuln_category, PUBLISHED_DATETIME, CVSS_BASE as cvss, CVSS_TEMPORAL, CVE as cve, VENDOR_REFERENCE as xref

[qualys:sem:asset_summary]
TIMESTAMP_FIELDS=dateTime
TZ=UTC
CHARSET=UTF-8
KV_MODE=xml
MAX_EVENTS=50000
TIME_FORMAT=%Y-%m-%dT%H:%M:%SZ

[qualys:pcrs:postureInfo]
TRUNCATE=0
SHOULD_LINEMERGE=false
INDEXED_EXTRACTIONS=json
KV_MODE=none
TIME_PREFIX="postureModifiedDate": "
TIME_FORMAT=%Y-%m-%dT%H:%M:%SZ
MAX_TIMESTAMP_LOOKAHEAD= 20
MAX_EVENTS=50000

[qualys:pcrs:policyInfo]
TRUNCATE=0
SHOULD_LINEMERGE=false
KV_MODE=auto
TIME_PREFIX="lastEvaluatedDate": "
TIME_FORMAT=%Y-%m-%dT%H:%M:%S
MAX_TIMESTAMP_LOOKAHEAD=20
TZ=UTC
MAX_DAYS_HENCE = 7300
MAX_DAYS_AGO = 7300

[qualys:csam:assets]
TRUNCATE=0
SHOULD_LINEMERGE=false
KV_MODE=auto
MAX_TIMESTAMP_LOOKAHEAD=20
TZ=UTC
MAX_DAYS_HENCE = 7300
MAX_DAYS_AGO = 7300
INDEXED_EXTRACTIONS=json

[qualys:certview:certificates]
TRUNCATE=0
SHOULD_LINEMERGE=false
KV_MODE=auto
MAX_TIMESTAMP_LOOKAHEAD=20
TZ=UTC
MAX_DAYS_HENCE = 7300
MAX_DAYS_AGO = 7300
INDEXED_EXTRACTIONS=json

[qualys:csam:software]
TRUNCATE=0
SHOULD_LINEMERGE=false
KV_MODE=auto
MAX_TIMESTAMP_LOOKAHEAD=20
TZ=UTC
MAX_DAYS_HENCE = 7300
MAX_DAYS_AGO = 7300
INDEXED_EXTRACTIONS=json

[qualys:csam:businessApps]
TRUNCATE=0
SHOULD_LINEMERGE=false
KV_MODE=auto
MAX_TIMESTAMP_LOOKAHEAD=20
TZ=UTC
MAX_DAYS_HENCE = 7300
MAX_DAYS_AGO = 7300
INDEXED_EXTRACTIONS=json

[qualys:cspm:gcp_postureInfo]
TRUNCATE=0
TIMESTAMP_FIELDS=evaluatedOn
TZ=UTC
CHARSET=UTF-8
NO_BINARY_CHECK=true
INDEXED_EXTRACTIONS=json
KV_MODE=none
MAX_EVENTS=50000

[qualys:cspm:azure_postureInfo]
TRUNCATE=0
TIMESTAMP_FIELDS=evaluatedOn
TZ=UTC
CHARSET=UTF-8
NO_BINARY_CHECK=true
INDEXED_EXTRACTIONS=json
KV_MODE=none
MAX_EVENTS=50000

[qualys:cspm:aws_postureInfo]
TRUNCATE=0
TIMESTAMP_FIELDS=evaluatedOn
TZ=UTC
CHARSET=UTF-8
NO_BINARY_CHECK=true
INDEXED_EXTRACTIONS=json
KV_MODE=none
MAX_EVENTS=50000