[tippingpoint_sms_log]
TRANSFORMS-smsaudit = set_sourcetype_audit
TRANSFORMS-ipsevent = set_sourcetype_event

[tippingpoint_nsva_log]
TRANSFORMS-vtpsaudit = set_sourcetype_nsva_audit
TRANSFORMS-nsvaevent = set_sourcetype_nsva_event
TRANSFORMS-errorlog = set_sourcetype_error_log

[tippingpoint_nsva_json]
SEDCMD-strip_non_JSON = s/^[^{]+|[^}]+$//g
KV_MODE = JSON
LOOKUP-action_for_tpips = tpips_action_lookup act AS action OUTPUT action
LOOKUP-severity_for_tpips = tpips_severity_lookup severity_id AS severity OUTPUT severity
LOOKUP-vendor_info_for_tpips = tpips_vendor_info_lookup sourcetype OUTPUT vendor, ids_type, vendor_product
EXTRACT-filter_id = ^(?:[0+:]*)(?P<filter_id>\d+) in filter
EXTRACT-filter_name = ^.*?:\s+(?P<filter_name>.*) in filter
FIELDALIAS-extract_protocol = protocol AS transport
FIELDALIAS-extract_src = src-ip AS src_ip src-ip AS src
FIELDALIAS-extract_spt = src-port AS src_port
FIELDALIAS-extract_dst = dst-ip AS dest_ip dst-ip AS dest
FIELDALIAS-extract_dpt = dst-port AS dest_port
FIELDALIAS-extract_signature = filter AS signature
FIELDALIAS-user = accountid AS user

[tippingpoint_ips_event]
FIELDALIAS-extract_dvchost = dvchost AS dvc_name
EXTRACT-version = ^(?:[^\|\n]*\|){3}(?P<version>[^\|]+)
LOOKUP-severity_for_tpips = tpips_severity_lookup severity_id OUTPUT severity
FIELDALIAS-extract_dpt = dpt AS dest_port
FIELDALIAS-extract_act = act AS action
FIELDALIAS-extract_spt = spt AS src_port
EXTRACT-filter_id = ^(?:[^\|\n]*\|){4}(?P<filter_id>\d+)
EXTRACT-signature = ^(?:[^\|\n]*\|){5}(?P<signature>[^\|]+)
EXTRACT-log_format = ^(?:[^ \n]* ){5}(?P<log_format>[^\|]+)
FIELDALIAS-extract_cs5 = cs5 AS sms_name
EXTRACT-filter_name = ^(?:[^\|\n]*\|){5}(?P<filter_name>[^\|]+)
EXTRACT-logged_time = ^(?P<logged_time>\d+\-\d+\-\d+\s+\d+:\d+:\d+,\d+)
EXTRACT-time_stamp = ^(?P<time_stamp>\d+\-\d+\-\d+\s+\d+:\d+:\d+,\d+)
LOOKUP-vendor_info_for_tpips = tpips_vendor_info_lookup sourcetype OUTPUT vendor,product,vendor_product,ids_type
FIELDALIAS-extract_cs3 = cs3 AS id
EXTRACT-event_severity = ^[^,\n]*,\d+\s+(?P<event_severity>\w+)
EXTRACT-signature_id = ^(?:[^\|\n]*\|){4}(?P<signature_id>\d+)
FIELDALIAS-extract_dntdom = dntdom AS dest_nt_domain
EXTRACT-name = ^(?:[^\|\n]*\|){2}(?P<name>\w+)
FIELDALIAS-extract_rt = rt AS date
EXTRACT-event_time = ^(?P<event_time>\w+\s+\d+\s+\d+:\d+:\d+\s+\d+\.\d+\.\d+\.\d+)
FIELDALIAS-extract_cat = cat AS category
EXTRACT-sms_device = ^[^\]\n]*\]\s+(?P<sms_device>[^ ]+)
EXTRACT-product = ^[^\|\n]*\|(?P<product>\w+)
EXTRACT-detection_type = ^(?:[^\|\n]*\|){6}(?P<detection_type>\d+)
FIELDALIAS-extract_srcip = srcip AS src_ip
FIELDALIAS-extract_dst = dst AS dest_ip
FIELDALIAS-extract_hitcount = cnt AS hitcount
EXTRACT-severity_id = ^(?:[^\|\n]*\|){6}(?P<severity_id>\d+)
FIELDALIAS-extract_suser = suser AS user suser AS sender

[tippingpoint_sms_audit]
EXTRACT-event_time = ^(?P<event_time>\w+\s+\d+\s+\d+:\d+:\d+\s+\d+\.\d+\.\d+\.\d+)
EXTRACT-status,distribution_time = ^(?:[^\|\n]*\|){4}(?P<status>\w+)(?:[^\|\n]*\|){2}(?P<distribution_time>.+)

[tippingpoint_nsva_event]
EXTRACT-appliance_name = ^(?:[^ \n]* ){3}(?P<appliance_name>[^ ]+)
EXTRACT-log_format = ^(?:[^ \n]* )+?(?P<log_format>CEF[^\|]+)|TippingPoint
EXTRACT-vendor_product = ^(?:[^\|\n]*\|){1}(?P<vendor_product>\w+)
EXTRACT-appliance_type = ^(?:[^\|\n]*\|){2}(?P<appliance>\w+)
EXTRACT-version = ^(?:[^\|\n]*\|){3}(?P<version>[^\|]+)
EXTRACT-filter_id = ^(?:[^\|\n]*\|){4}(?P<filter_id>\d+)
EXTRACT-signature_id = ^(?:[^\|\n]*\|){4}(?P<signature_id>\d+)
EXTRACT-filter_name = ^(?:[^\|\n]*\|){5}(?P<filter_name>[^\|]+)
EXTRACT-signature = ^(?:[^\|\n]*\|){5}(?P<signature>[^\|]+)
EXTRACT-severity_id = ^(?:[^\|\n]*\|){6}(?P<severity_id>\d+)
EXTRACT-logged_time = ^(?:[^ \n]* ){2}(?P<logged_time>\d+\-\d+\-\d+T\d+:\d+:\d+.\d+\+\d+:\d+)
EXTRACT-time_stamp = ^(?:[^ \n]* ){2}(?P<time_stamp>\d+\-\d+\-\d+T\d+:\d+:\d+.\d+\+\d+:\d+)
LOOKUP-action_for_tpips = tpips_action_lookup act OUTPUTNEW action
LOOKUP-severity_for_tpips = tpips_severity_lookup severity_id OUTPUT severity
LOOKUP-vendor_info_for_tpips = tpips_vendor_info_lookup sourcetype OUTPUTNEW vendor, ids_type
FIELDALIAS-extract_dvchost = dvchost AS dvc_name
FIELDALIAS-extract_dvc = dvc AS dvc_ip
FIELDALIAS-extract_cat = cat AS category
FIELDALIAS-extract_proto = proto AS transport
FIELDALIAS-extract_src = src AS src_ip
FIELDALIAS-extract_spt = spt AS src_port
FIELDALIAS-extract_dst = dst AS dest_ip dst AS dest
FIELDALIAS-extract_dpt = dpt AS dest_port
FIELDALIAS-extract_hitcount = cnt AS hitcount
FIELDALIAS-extract_start = ^(?:[^ \n]* )+?start=(?P<log_format>[^\|]+\+\d+) AS event_time
FIELDALIAS-extract_cn2 = cn2 AS ssl_enabled

[tippingpoint_nsva_audit]
EXTRACT-event_time = ^(?:[^ \n]* ){2}(?P<event_time>\d+\-\d+\-\d+T\d+:\d+:\d+.\d+\+\d+:\d+)
EXTRACT-appliance_name = ^(?:[^ \n]* ){3}(?P<appliance_name>[^ ]+)

[sourcetype_error_log]
EXTRACT-event_time = ^(?:[^ \n]* ){2}(?P<event_time>\d+\-\d+\-\d+T\d+:\d+:\d+.\d+\+\d+:\d+)
EXTRACT-appliance_name = ^(?:[^ \n]* ){3}(?P<appliance_name>[^ ]+)
