######################################################
#
# Balabit Shell Control Box App for Splunk
#
######################################################

[balabit_scb_all_logs]
definition = sourcetype=balabit:shellcontrolbox
iseval = 0

[balabit_scb_proxy_connection]
definition = `balabit_scb_all_logs` eventtype=BalaBit:ShellControlBox:ProxyConnection
iseval = 0

[balabit_scb_proxy_authentication]
definition = `balabit_scb_all_logs` eventtype=BalaBit:ShellControlBox:ProxyAuthentication
iseval = 0

[balabit_scb_system_config_changes]
definition = `balabit_scb_all_logs` eventtype=BalaBit:ShellControlBox:System tag=change
iseval = 0

[balabit_scb_fix_system_configuration_changes_table]
definition = | rex mode=sed field=vendor_message "s/:.+$//" | rex mode=sed field=vendor_message "s/^Element at.+changed from.+$/Element changed/"
iseval = 0

[balabit_scb_policy]
definition = `balabit_scb_all_logs` eventtype=BalaBit:ShellControlBox:Policy
iseval = 0

[balabit_scb_strftime(1)]
args = unix_time_t
definition = eval $unix_time_t$=strftime($unix_time_t$, "%F %T")
iseval = 0

[balabit_scb_strfseconds(1)]
args = seconds
definition = eval d_days=floor($seconds$/24/3600) | eval d_hours=floor(($seconds$/3600)-(d_days*24)) | eval d_minutes = floor(($seconds$/60)-(d_days*60*24)-(d_hours*60)) | eval d_seconds = floor($seconds$-(d_days*3600*24)-(d_hours*3600)-(d_minutes * 60)) | strcat d_days "d " d_hours "h " d_minutes "m " d_seconds "s" $seconds$ | fields - d_days,d_hours,d_minutes,d_seconds
iseval = 0

[balabit_scb_session_list]
definition = sourcetype=BalaBit:ShellControlBox (tag=start OR tag=end OR tag=authentication OR tag=audit)| eval end_time=if(tag == "end",_time,'') | eval is_audit_event=if(vendor_class == "proxy-connection-audit", "yes", '') | stats values(host) AS host, values(service) AS service, earliest(_time) AS start_time, max(end_time) AS end_time, values(connection) AS connection, values(user) AS user, values(authentication_success) AS authentication_success, values(src_ip) AS src_ip, values(dest_ip) AS dest_ip, values(audit_trail_file) AS "audit_trail_file", values(is_audit_event) AS has_audit_event, values(verdict) AS verdict by parent_session_id | search (NOT verdict='ZV_REJECT') | eval duration=if(end_time>0, end_time-start_time, now()-start_time) | sort -start_time
iseval = 0

[balabit_scb_audit_trail_list]
definition = sourcetype="BalaBit:ShellControlBox" (tag=audit OR tag=start OR tag=authentication) OR (eventtype="BalaBit:ShellControlBox:Indexer" NOT jobs='\(*\)') | stats earliest(_time) AS start_time, latest(_time) AS last_update_time, values(audit_trail_file) AS audit_trail_file, latest(vendor_message) AS status by audit_trail_job_id,host | eval duration=last_update_time-start_time | append [ search sourcetype="BalaBit:ShellControlBox" (tag=audit OR tag=start OR tag=authentication) | stats earliest(_time) AS session_start_time, values(host) AS host, values(service) AS service, values(process) AS process, values(audit_trail_file) AS audit_trail_file, values(dest_ip) AS dest_ip, values(src_ip) AS src_ip by parent_session_id ] | selfjoin keepsingle=true audit_trail_file | eval duration=if(duration>0, duration, "0") | eval status=if(len(status)>0, status, "Not yet processed") | sort -session_start_time
iseval = 0

[balabit_scb_snmp_mib_data(1)]
args = mib
definition = sourcetype=BalaBit:ShellControlBox:SNMP snmp_mib=$mib$
iseval = 0
