[iocmatchbatch-command]
syntax = iocmatch match_type=(ip|md5|url|domain|email|auto) dest_field=<fieldname> fieldlist_field=<field> <field-list>
shortdesc = Matches logs against the Anomali KVStore and outputs the results to the specified field
description = \
    This command will match records against the Anomali ingested IOCs, dropping logs that don't match any IOCs and \
    outputting the results to the specified dest_field. The match type is used to determine which type of IOCs are \
    matched against. The fieldlist_field allows a multivalue field to be placed in an event that contains the fields to be matched
comment1 = \
    This example matches the src and dest fields of a CIM compliant stream of event to
example1 = \
    index=firewall tag=network | iocmatch match_type=ip dest_field=anomali_results src, dest
comment2 = \
    This example allows programmatic matching on fields, in this case where the src is not internal
example2 = \
    index=firewall tag=network \
    | eval some_field=case(cidrmatch("192.168.0.0/24",src),"",cidrmatch("172.16.0.0/12",src),"",cidrmatch("10.0.0.0/8",src),true(),mvappend(analysis,"src")) \
    | iocmatch type=ip fieldlist_field=analysis dest_field=anomali_results
usage = public


[iocmetafilter-command]
syntax = iocmetafilter org_name=<org> org_match=(disabled|soft|hard) has_actor=(disabled|soft|hard) has_tipreport=(disabled|soft|hard)  \
 min_confidence=<int> max_confidence=<int> min_severity=(low|medium|high|very-high) max_severity=(low|medium|high|very-high) tag=<string> tag_match=(disabled|soft|hard) \
 feed=<string> feed_match=(disabled|hard|soft) field_prefix=<string> itype=<string> ae_sourcetype=<string> legacy_data_sourcetype=<string> time_priority=(date_last|date_first) \
 severity_match=(disabled|soft|hard) feed_id=<int> feed_id_match=(disabled|soft|hard) <field-list>
shortdesc = Parse matched IOC metadata generated by the iocmatchbatch command
description = An ioc metadata parser with the ability to perform checks and return metadata associated with a specific IOC where IOC duplication is found in \
    Threatstream. This command also formats the Anomali Enterprise data into the correct format for the integration to display
usage = public

[tssampleevents-command]
syntax = tssampleevents datamodel=(cim|optic) event_count=<int> itype=<list> tm_iocs_only=<bool> query_limit=<int>
shortdesc = Generates logs gauranteed to match against indicators. Used to fill the Threatstream app
description = \
    This command will match create records that will match against the Anomali ingested IOCs, itypes should be a list of exclusive itypes to generate logs for \
    tm_iocs_only should only be set when threatmodel associated iocs are required. query_limit sets the maximum number of records to return from the kvstore per ioc format
usage = public