[ThreatStream Portal Indicator Lookup]
display_location = field_menu
fields = *ts_lookup_key_value, *indicator, *Indicator
label = ThreatStream Intel Lookup: $@field_value$
link.method = get
link.target = blank
link.uri = https://ui.threatstream.com/detail/$@field_value$
type = link
disabled=0

[ThreatStream Portal Threat Bulletin Lookup]
display_location = field_menu
fields = *tipreport
label = ThreatStream Threat Bulletin ID Lookup: $@field_value$
link.method = get
link.target = blank
link.uri = https://ui.threatstream.com/tip/$@field_value$
type = link
disabled=0

[ThreatStream Portal Actor Lookup]
display_location = field_menu
fields = *actor
label = ThreatStream Actor ID Lookup: $@field_value$
link.method = get
link.target = blank
link.uri = https://ui.threatstream.com/actor/$@field_value$
type = link
disabled=0

[ThreatStream Portal Lookup Email]
display_location = field_menu
fields = *recipient, *src_user
label = ThreatStream Intel Email Lookup: $@field_value$
link.method = get
link.target = blank
link.uri = https://ui.threatstream.com/detail/$@field_value$
type = link
disabled=0

[ThreatStream Portal Lookup File Hash]
display_location = field_menu
fields = *file_hash
label = ThreatStream Intel File Hash Lookup: $@field_value$
link.method = get
link.target = blank
link.uri = https://ui.threatstream.com/detail/$@field_value$
type = link
disabled=0

[ThreatStream Portal Lookup IP]
display_location = field_menu
fields = *src, *src_ip, *dest, *dest_ip, *dest_host, *src_host, *domain, *query
label = ThreatStream Intel IP/Domain Lookup: $@field_value$
link.method = get
link.target = blank
link.uri = https://ui.threatstream.com/detail/$@field_value$
type = link
disabled=0

[ThreatStream Portal Lookup URL]
display_location = field_menu
fields = url, event.url
label = ThreatStream Portal Lookup url: $@field_value$
link.method = get
link.target = blank
link.uri = https://ui.threatstream.com/detail/$@field_value$
type = link
disabled=0

[ThreatStream - Whitelist Sourcetype: $@field_value$ from IOC matches]
type = search
display_location = field_menu
fields = *sourcetype
label = ThreatStream whitelist source: $@field_value$
search.search_string = |makeresults | eval src="*",source="*",sourcetype="$@field_value$",dest="*",indicator="*",host="*", disabled="no" | fields - _time| outputlookup append=t ts_whitelist
search.preserve_timerange = true
search.app = threatstream

[ThreatStream - Whitelist Network src: $@field_value$ from IOC matches]
type = search
display_location = field_menu
fields = src, event.src
label = ThreatStream whitelist source: $@field_value$
search.search_string = |makeresults | eval src="$@field_value$",source="*",sourcetype="*",dest="*",indicator="*",host="*", disabled="no" | fields - _time| outputlookup append=t ts_whitelist
search.preserve_timerange = true
search.app = threatstream

[ThreatStream - Whitelist Source: $@field_value$ from IOC matches ]
type=search
display_location = field_menu
fields = *source
label = ThreatStream whitelist data source: $@field_value$
search.search_string = |makeresults | eval src="*",source="$@field_value$",sourcetype="*",dest="*",indicator="*",host="*", disabled="no" | fields - _time| outputlookup append=t ts_whitelist
search.preserve_timerange = true
search.app = threatstream

[ThreatStream - Whitelist destination: $@field_value$ from IOC matches ]
type=search
display_location = field_menu
fields = *dest
label = ThreatStream whitelist destination: $@field_value$
search.search_string = |makeresults | eval src="*",source="*",sourcetype="*",dest="$@field_value$",indicator="*",host="*", disabled="no" | fields - _time| outputlookup append=t ts_whitelist
search.preserve_timerange = true
search.app = threatstream

[ThreatStream - Whitelist Data Host: $@field_value$ from IOC matches]
type=search
display_location = field_menu
fields = *host
label = ThreatStream whitelist data host: $host$
search.search_string = |makeresults | eval src="*",source="*",sourcetype="*",dest="*",indicator="*",host="$@field_value$", disabled="no" | fields - _time| outputlookup append=t ts_whitelist
search.preserve_timerange = true
search.app = threatstream

[ThreatStream - Whitelist Indicator: $@field_value$ from IOC Matches]
type=search
display_location = field_menu
fields = indicator, event.indicator, Indicator, ts_lookup_key_value
label = ThreatStream whitelist Indicator
search.search_string = |makeresults | eval src="*",source="*",sourcetype="*",dest="*",indicator="$@field_value$",host="*", disabled="no" | fields - _time | outputlookup append=t ts_whitelist
search.preserve_timerange = true
search.app = threatstream
