[Tenable SC Asset Data]
dispatch.earliest_time = -1h
dispatch.latest_time = now
cron_schedule = 0 */1 * * *
enableSched = 1
realtime_schedule = 0
search = `get_tenable_index` sourcetype="tenable:sc:assets" | dedup sc_uniqueness, source | eval key=sc_uniqueness."_".source | rename assetExposureScore as asset_exposure_score acrScore as acr_score policyName as policy_name | table key, ip, SC_address, bios_uuid, dns_name, last_authenticated_scan_date, last_unauthenticated_scan_date, mac_address, mcafee_epo_guid, netbios_name, os_cpe, repository_id, source, asset_exposure_score, acr_score, policy_name, uuid | outputlookup append=true key_field=key sc_asset_data_lookup

[Tenable SC Asset Data - All Time]
dispatch.earliest_time = 0
dispatch.latest_time = now
disabled = 0
search = `get_tenable_index` sourcetype="tenable:sc:assets" | dedup sc_uniqueness, source | eval key=sc_uniqueness."_".source | rename assetExposureScore as asset_exposure_score acrScore as acr_score policyName as policy_name | table key, ip, SC_address, bios_uuid, dns_name, last_authenticated_scan_date, last_unauthenticated_scan_date, mac_address, mcafee_epo_guid, netbios_name, os_cpe, repository_id, source, asset_exposure_score, acr_score, policy_name, uuid | outputlookup append=true key_field=key sc_asset_data_lookup

[Tenable SC Plugin Data]
dispatch.earliest_time = -5m
dispatch.latest_time = now
cron_schedule = 2-59/5 * * * *
enableSched = 1
realtime_schedule = 0
search = `get_tenable_index` sourcetype="tenable:sc:plugin" | rename id as plugin_id, name as plugin_name, family.id as plugin_family_id, family.name as plugin_family, version as plugin_version, synopsis as plugin_synopsis, solution as plugin_solution, pluginPubDate as plugin_publication_date, pluginModDate as plugin_modification_date | eval key=plugin_id | table key, plugin_id, plugin_name, plugin_family_id, plugin_family, plugin_version, risk_factor, plugin_synopsis, plugin_solution, plugin_publication_date, plugin_modification_date, vpr_score | outputlookup append=true key_field=key sc_plugin_data_lookup

[Tenable SC Vuln Data]
action.email.useNSSubject = 1
alert.track = 0
dispatch.earliest_time = -10m
dispatch.latest_time = now
cron_schedule = 0-59/5 * * * *
enableSched = 1
realtime_schedule = 0
search = `get_tenable_index` sourcetype="tenable:sc:vuln" | dedup plugin_id, port, protocol, sc_uniqueness, source | eval key=plugin_id."_".port."_".protocol."_".sc_uniqueness."_".source | table key, plugin_id, port, protocol, synopsis, solution, state, first_found, last_found, last_fixed, severity, vpr_score, repository_id, ip, SC_address, dns_name | outputlookup append=true key_field=key sc_vuln_data_lookup

[Tenable SC Vuln Data - All Time]
disabled = 0
dispatch.earliest_time = 0
dispatch.latest_time = now
search = `get_tenable_index` sourcetype="tenable:sc:vuln" | dedup plugin_id, port, protocol, sc_uniqueness, source | eval key=plugin_id."_".port."_".protocol."_".sc_uniqueness."_".source | table key, plugin_id, port, protocol, synopsis, solution, state, first_found, last_found, last_fixed, severity, vpr_score, repository_id, ip, SC_address, dns_name | outputlookup append=true key_field=key sc_vuln_data_lookup

[Tenable IO Plugin Data]
dispatch.earliest_time = -1h
dispatch.latest_time = now
cron_schedule = 2 */1 * * *
enableSched = 1
realtime_schedule = 0
search = `get_tenable_index` sourcetype="tenable:io:plugin" | dedup id | eval plugin_publication_date = round(strptime(plugin_publication_date."+0000", "%Y-%m-%dT%H:%M:%SZ%z")) | eval plugin_modification_date = round(strptime(plugin_modification_date."+0000", "%Y-%m-%dT%H:%M:%SZ%z")) | rename name as plugin_name, id as plugin_id, synopsis as plugin_synopsis, solution as plugin_solution | eval key=plugin_id | table key, plugin_id, plugin_name, plugin_version, risk_factor, plugin_synopsis, plugin_solution, plugin_publication_date, plugin_modification_date, vpr_score | outputlookup append=true key_field=key io_plugin_data_lookup
alert.track = 0

[Tenable IO Plugin Data - All Time]
disabled = 0
dispatch.earliest_time = 0
dispatch.latest_time = now
search = `get_tenable_index` sourcetype="tenable:io:plugin" | dedup id | eval plugin_publication_date = round(strptime(plugin_publication_date."+0000", "%Y-%m-%dT%H:%M:%SZ%z")) | eval plugin_modification_date = round(strptime(plugin_modification_date."+0000", "%Y-%m-%dT%H:%M:%SZ%z")) | rename name as plugin_name, id as plugin_id, synopsis as plugin_synopsis, solution as plugin_solution | eval key=plugin_id | table key, plugin_id, plugin_name, plugin_version, risk_factor, plugin_synopsis, plugin_solution, plugin_publication_date, plugin_modification_date, vpr_score | outputlookup append=true key_field=key io_plugin_data_lookup
alert.track = 0

[Tenable IO Asset Data]
dispatch.earliest_time = -1h
dispatch.latest_time = now
cron_schedule = 0 */1 * * *
enableSched = 1
realtime_schedule = 0
search = `get_tenable_index` sourcetype="tenable:io:assets" | dedup uuid | rename sources{}.name as sources | eval key=uuid | table key, uuid, agent_names, fqdns, hostnames, sources, system_types, ipv4, ipv6, mac_address, acr_score, exposure_score, state, last_seen | outputlookup append=true key_field=key io_asset_data_lookup

[Tenable IO Asset Data - All Time]
dispatch.earliest_time = 0
dispatch.latest_time = now
disabled = 0
search = `get_tenable_index` sourcetype="tenable:io:assets" | dedup uuid | rename sources{}.name as sources | eval key=uuid | table key, uuid, agent_names, fqdns, hostnames, sources, system_types, ipv4, ipv6, mac_address, acr_score, exposure_score, state, last_seen | outputlookup append=true key_field=key io_asset_data_lookup

[Tenable IO Vuln Data]
dispatch.earliest_time = -1h
dispatch.latest_time = now
cron_schedule = 0 */1 * * *
enableSched = 1
realtime_schedule = 0
search = `get_tenable_index` sourcetype="tenable:io:vuln" | dedup plugin_id, asset_uuid, port, protocol | eval key=plugin_id."_".asset_uuid."_".port."_".protocol | eval first_found = round(strptime(first_found."+0000", "%Y-%m-%dT%H:%M:%S.%fZ%z")) | eval last_found = round(strptime(last_found."+0000", "%Y-%m-%dT%H:%M:%S.%fZ%z")) | eval last_fixed = if(isnotnull(last_fixed) ,round(strptime(last_fixed."+0000", "%Y-%m-%dT%H:%M:%S.%fZ%z")), "") | eval data_source="Host" | table key, plugin_id, asset_uuid, port, protocol, synopsis, solution, state, first_found, last_found, last_fixed, severity, vpr_score, dns_name, data_source | outputlookup append=true key_field=key io_vuln_data_lookup

[Tenable IO Vuln Data - All Time]
disabled = 0
dispatch.earliest_time = 0
dispatch.latest_time = now
search = `get_tenable_index` sourcetype="tenable:io:vuln" | dedup plugin_id, asset_uuid, port, protocol | eval key=plugin_id."_".asset_uuid."_".port."_".protocol | eval first_found = round(strptime(first_found."+0000", "%Y-%m-%dT%H:%M:%S.%fZ%z")) | eval last_found = round(strptime(last_found."+0000", "%Y-%m-%dT%H:%M:%S.%fZ%z")) | eval last_fixed = if(isnotnull(last_fixed) ,round(strptime(last_fixed."+0000", "%Y-%m-%dT%H:%M:%S.%fZ%z")), "") | eval data_source="Host" | table key, plugin_id, asset_uuid, port, protocol, synopsis, solution, state, first_found, last_found, last_fixed, severity, vpr_score, dns_name, data_source | outputlookup append=true key_field=key io_vuln_data_lookup
alert.track = 0

[Tenable NNM Vuln Data]
dispatch.earliest_time = 0
dispatch.latest_time = now
cron_schedule = 0 */12 * * *
enableSched = 1
realtime_schedule = 0
search = `get_tenable_index` sourcetype="tenable:nnm:vuln" | dedup  plugin_id, protocol, src_port, dest_port, src_ip, dest_ip | eval key=plugin_id."_".src_port."_".dest_port."_".protocol."_".src_ip."_".dest_ip | table key, plugin_id, protocol, src_port, dest_port, severity, src_ip, dest_ip | outputlookup append=true key_field=key nnm_vuln_data_lookup

[Tenable NNM Events Over Time]
action.email.useNSSubject = 1
alert.track = 0
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
display.general.type = visualizations
display.page.search.tab = visualizations
display.statistics.show = 1
display.visualizations.charting.chart.stackMode = stacked
request.ui_dispatch_app = TenableAppforSplunk
request.ui_dispatch_view = search
search = `get_tenable_index` sourcetype="tenable:nnm:vuln" | timechart count by plugin_name usenull=f

[Tenable NNM Top 10 Events]
action.email.useNSSubject = 1
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
description = Top events last 24hrs
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
display.general.type = visualizations
display.page.search.tab = visualizations
display.statistics.show = 1
request.ui_dispatch_app = TenableAppforSplunk
request.ui_dispatch_view = search
search = `get_tenable_index` sourcetype="tenable:nnm:vuln" | top limit=10 plugin_name

[Tenable NNM Top Destination by Country]
action.email.useNSSubject = 1
alert.track = 0
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
display.general.type = visualizations
display.page.search.tab = visualizations
display.statistics.show = 1
request.ui_dispatch_app = TenableAppforSplunk
request.ui_dispatch_view = search
search = `get_tenable_index` sourcetype="tenable:nnm:vuln" | iplocation dest | top Country limit=10

[Tenable NNM Top Source by Country]
action.email.useNSSubject = 1
alert.track = 0
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
display.general.type = visualizations
display.page.search.tab = visualizations
display.statistics.show = 1
request.ui_dispatch_app = TenableAppforSplunk
request.ui_dispatch_view = search
search = `get_tenable_index` sourcetype="tenable:nnm:vuln" | iplocation src | top Country limit=10

[Tenable Top Destination IP]
action.email.useNSSubject = 1
alert.track = 0
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
display.general.type = visualizations
display.page.search.tab = visualizations
display.statistics.show = 1
request.ui_dispatch_app = TenableAppforSplunk
request.ui_dispatch_view = search
search = `get_tenable_index` sourcetype="tenable:nnm:vuln" | top dest

[Tenable Top Destination Port]
action.email.useNSSubject = 1
alert.track = 0
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
display.general.type = visualizations
display.page.search.tab = visualizations
display.statistics.show = 1
request.ui_dispatch_app = TenableAppforSplunk
request.ui_dispatch_view = search
search = `get_tenable_index` sourcetype="tenable:nnm:vuln" | eval service_name=dest_port."/".dest_svc | top service_name

[Tenable Top NNM Plugin ID]
action.email.useNSSubject = 1
alert.track = 0
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
display.general.type = visualizations
display.page.search.tab = visualizations
display.statistics.show = 1
request.ui_dispatch_app = TenableAppforSplunk
request.ui_dispatch_view = search
search = `get_tenable_index` sourcetype="tenable:nnm:vuln" | top limit=10 plugin_id

[Tenable Top Source IP]
action.email.useNSSubject = 1
alert.track = 0
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
display.general.type = visualizations
display.page.search.tab = visualizations
display.statistics.show = 1
request.ui_dispatch_app = TenableAppforSplunk
request.ui_dispatch_view = search
search = `get_tenable_index` sourcetype="tenable:nnm:vuln" | top src

[Tenable Top Source Port]
action.email.useNSSubject = 1
alert.track = 0
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
display.general.type = visualizations
display.page.search.tab = visualizations
display.statistics.show = 1
request.ui_dispatch_app = TenableAppforSplunk
request.ui_dispatch_view = search
search = `get_tenable_index` sourcetype="tenable:nnm:vuln" | eval service_name=src_port."/".src_svc | top service_name

[Tenable IO and SC vuln data]
action.keyindicator.invert = 0
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.param.verbose = 0
action.send2uba.param.verbose = 0
action.threat_add.param.verbose = 0
alert.track = 0
cron_schedule =  */5 * * * *
dispatch.earliest_time = 0
dispatch.latest_time = now
display.general.timeRangePicker.show = 0
enableSched = 1
run_on_startup = 1
search = | inputlookup io_vuln_data_lookup | rename dns_name as asset_name | eval product="Tenable.io" | table synopsis, state, severity, asset_name, last_found, data_source, product | appendpipe [| inputlookup sc_vuln_data_lookup | eval product="Tenable.sc" | table synopsis, state, last_found, severity, asset_name, product] | rename synopsis as Synopsis, state as State, last_found as "Last Found", severity as Severity, asset_name as "Asset Name", data_source as "Data Source", product as Product

[Tenable OT Vuln Data]
dispatch.earliest_time = -1h
dispatch.latest_time = now
cron_schedule = 0 */1 * * *
enableSched = 1
realtime_schedule = 0
search = `get_tenable_index` sourcetype="tenable:ot:vuln" | eval scan_time=strptime(time, "%Y-%m-%dT%H:%M:%S.%6NZ") | eval key=id |fields key, id, OT_address, assetId, output, pluginId, port, protocol, status, svcName, scan_time | table key, OT_address, assetId, output, pluginId, port, protocol, status, svcName, scan_time | outputlookup append=true key_field=key ot_vuln_data_lookup

[Tenable WAS Assets Data - All Time]
disabled = 0
dispatch.earliest_time = 0
dispatch.latest_time = now
search = `get_tenable_index` sourcetype="tenable:was:assets" | eval network_fqdns = 'network.fqdns{}' | eval types = 'types{}' | eval updated_at = 'timestamps.updated_at' | eval key=uuid | table key, acr_score, exposure_score, state, network_fqdns, uuid, types, updated_at | outputlookup append=true key_field=key was_assets_data_lookup

[Tenable WAS Assets Data - Last 1 Hour]
dispatch.earliest_time = -1h
dispatch.latest_time = now
cron_schedule = 0 */1 * * *
enableSched = 1
realtime_schedule = 0
search = `get_tenable_index` sourcetype="tenable:was:assets" | eval network_fqdns = 'network.fqdns{}' | eval types = 'types{}' | eval updated_at = 'timestamps.updated_at' | eval key=uuid | table key, acr_score, exposure_score, state, network_fqdns, uuid, types, updated_at | outputlookup append=true key_field=key was_assets_data_lookup

[Tenable ASM Assets Data - All Time]
disabled = 0
dispatch.earliest_time = 0
dispatch.latest_time = now
search =  `get_tenable_index` sourcetype="tenable:asm:assets" | eval key=id | eval cves='cves{}' | table key, ip_address, record_type, severity_ranking, hostname, cves, last_metadata_change, id | outputlookup append=true key_field=key asm_assets_data_lookup

[Tenable ASM Assets Data - Last 1 Hour]
dispatch.earliest_time = -1h
dispatch.latest_time = now
cron_schedule = 0 */1 * * *
enableSched = 1
realtime_schedule = 0
search =  `get_tenable_index` sourcetype="tenable:asm:assets" | eval key=id | eval cves='cves{}' | table key, ip_address, record_type, severity_ranking, hostname, cves, last_metadata_change, id | outputlookup append=true key_field=key asm_assets_data_lookup

[Tenable SC Mobile Assets - All Time]
disabled = 0
dispatch.earliest_time = 0
dispatch.latest_time = now
search = `get_tenable_index` sourcetype="tenable:sc:mobile:assets" | eval key=identifier | eval timefield=strftime(_time, "%Y-%m-%dT%H:%M:%S.%6fZ") | table key, identifier, model, score, serial, timefield | outputlookup append=true key_field=key sc_mobile_assets_data_lookup

[Tenable SC Mobile Assets - Last 1 Hour]
dispatch.earliest_time = -1h
dispatch.latest_time = now
cron_schedule = 0 */1 * * *
enableSched = 1
realtime_schedule = 0
search = `get_tenable_index` sourcetype="tenable:sc:mobile:assets" | eval key=identifier | eval timefield=strftime(_time, "%Y-%m-%dT%H:%M:%S.%6fZ") | table key, identifier, model, score, serial, timefield | outputlookup append=true key_field=key sc_mobile_assets_data_lookup

[Tenable OT Assets - All Time]
disabled = 0
dispatch.earliest_time = 0
dispatch.latest_time = now
search = `get_tenable_index` sourcetype="tenable:ot:assets" | eval last_seen = round(strptime('lastSeen', "%Y-%m-%dT%H:%M:%S.%3QZ")) | eval first_seen = round(strptime('firstSeen', "%Y-%m-%dT%H:%M:%S.%3QZ"))  | eval key=id | eval severity=case(criticality=="HighCriticality", "high", criticality=="MediumCriticality", "medium", criticality=="LowCriticality", "low") | rename superType as super_type directIp as direct_ip directMac as diret_mac lastUpdate as last_update runStatus as run_status | table key, category, severity, direct_ip, type, super_type, direct_mac, id, run_status, state, vendor, name, first_seen, last_seen, last_update | outputlookup append=true key_field=key ot_assets_data_lookup

[Tenable OT Assets - Last 1 Hour]
dispatch.earliest_time = -1h
dispatch.latest_time = now
cron_schedule = 0 */1 * * *
enableSched = 1
realtime_schedule = 0
search = `get_tenable_index` sourcetype="tenable:ot:assets" | eval last_seen = round(strptime('lastSeen', "%Y-%m-%dT%H:%M:%S.%3QZ")) | eval first_seen = round(strptime('firstSeen', "%Y-%m-%dT%H:%M:%S.%3QZ"))  | eval key=id | eval severity=case(criticality=="HighCriticality", "high", criticality=="MediumCriticality", "medium", criticality=="LowCriticality", "low") | rename superType as super_type directIp as direct_ip directMac as diret_mac lastUpdate as last_update runStatus as run_status | table key, category, severity, direct_ip, type, super_type, direct_mac, id, run_status, state, vendor, name, first_seen, last_seen, last_update | outputlookup append=true key_field=key ot_assets_data_lookup

[Tenable Vuln WAS Data]
action.webhook.enable_allowlist = 0
alert.track = 0
cron_schedule = 0 */1 * * *
dispatch.earliest_time = -1h
dispatch.latest_time = now
enableSched = 1
realtime_schedule = 0
search = `get_tenable_index` sourcetype="tenable:was:vuln" \
| eval first_found=strptime(first_found, "%Y-%m-%dT%H:%M:%SZ") \
| eval last_found=strptime(last_found, "%Y-%m-%dT%H:%M:%SZ") \
| eval last_observed=strptime(last_observed, "%Y-%m-%dT%H:%M:%SZ") \
| rename plugin.publication_date as plugin_publication_date, scan.completed_at as scan_completed \
| eval scan_completed=strptime(scan_completed, "%Y-%m-%dT%H:%M:%SZ") \
| eval plugin_publication_date=strptime(plugin_publication_date, "%Y-%m-%dT%H:%M:%SZ") \
| fields plugin_publication_date, IO_address, asset_fqdn, asset_uuid, finding_id, first_found, last_found, last_observed, ipv4, ipv6, plugin.id, plugin.name, plugin.risk_factor, plugin.synopsis, scan.uuid, scan_completed, severity, url, vendor_severity, state \
| rename plugin.id as plugin_id, plugin.name as plugin_name, plugin.risk_factor as risk_factor, plugin.synopsis as plugin_synopsis, scan.uuid as scan_uuid \
| eval key=finding_id \
| table key, IO_address, asset_fqdn, asset_uuid, finding_id, first_found, last_found, last_observed, ipv4, ipv6, plugin_id, plugin_name, risk_factor, plugin_synopsis, scan_uuid, scan_completed, severity, url, vendor_severity, state, plugin_publication_date \
| outputlookup append=true key_field=key was_vulnerability_data_lookup
