[Project Honey Pot - Threatscore Timechart Last 24h]
action.email.inline = 1
action.email.reportServerEnabled = 0
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
auto_summarize = 0
auto_summarize.dispatch.earliest_time = -7d@d
auto_summarize.timespan = 1m
cron_schedule = 0 * * * *
dispatch.earliest_time = -24h@h
dispatch.latest_time = -1h@h
displayview = flashtimeline
enableSched = 1
request.ui_dispatch_view = flashtimeline
search = eventtype="honeypot_app_events" | timechart count by threatscore

[Project Honey Pot - Unique Visitors Threatscoring_Last 7d]
action.email.inline = 1
action.email.reportServerEnabled = 0
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
auto_summarize = 0
auto_summarize.dispatch.earliest_time = -7d@d
auto_summarize.timespan = 1m
cron_schedule = 10 23 * * *
dispatch.earliest_time = -7d@h
dispatch.latest_time = -1d@h
displayview = flashtimeline
enableSched = 1
request.ui_dispatch_view = flashtimeline
search = eventtype="honeypot_app_events" | stats dc(clientip) as "Number of Unique Visitors" by threatscore | sort -threatscore | rename threatscore as "Honey Pot Project Threatscore"

[Project Honey Pot - Unique Visitors Threatscoring_Last 24h]
action.email.inline = 1
action.email.reportServerEnabled = 0
action.summary_index = 1
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
auto_summarize = 0
auto_summarize.dispatch.earliest_time = -1d@h
auto_summarize.timespan = 1m
cron_schedule = 5 0 * * *
dispatch.earliest_time = -24h@h
dispatch.latest_time = -5m@h
displayview = flashtimeline
enableSched = 1
realtime_schedule = 0
request.ui_dispatch_view = flashtimeline
search = eventtype="honeypot_app_events" | stats dc(clientip) as "Number of Unique Visitors" by threatscore | sort -threatscore | rename threatscore as "Honey Pot Project Threatscore"

[Project Honey Pot - Unique Visitors Threatscoring_Last Previous Month]
action.email.inline = 1
action.email.reportServerEnabled = 0
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
auto_summarize = 0
auto_summarize.dispatch.earliest_time = -1mon@d
auto_summarize.timespan = 1m
cron_schedule = 15 20 1 * *
dispatch.earliest_time = -1mon@mon
dispatch.latest_time = @mon
displayview = flashtimeline
enableSched = 1
request.ui_dispatch_view = flashtimeline
search = eventtype="honeypot_app_events" | stats dc(clientip) as "Number of Unique Visitors" by threatscore | sort -threatscore | rename threatscore as "Honey Pot Project Threatscore"

[Project Honey Pot - Unique Visitors Threatscoring_Last_Last 30d]
action.email.inline = 1
action.email.reportServerEnabled = 0
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
auto_summarize = 0
auto_summarize.dispatch.earliest_time = -1mon@d
auto_summarize.timespan = 1m
cron_schedule = 10 22 * * *
dispatch.earliest_time = -30d@d
dispatch.latest_time = -1d@d
displayview = flashtimeline
enableSched = 1
request.ui_dispatch_view = flashtimeline
search = eventtype="honeypot_app_events" | stats dc(clientip) as "Number of Unique Visitors" by threatscore | sort -threatscore | rename threatscore as "Honey Pot Project Threatscore"

[Project Honey Pot - Threatscore Timechart Last 4h]
action.email.inline = 1
action.email.reportServerEnabled = 0
action.summary_index = 1
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
auto_summarize = 0
auto_summarize.dispatch.earliest_time = -1d@h
auto_summarize.timespan = 1m
cron_schedule = */15 * * * *
dispatch.earliest_time = -4h@m
dispatch.latest_time = -5m@m
displayview = flashtimeline
enableSched = 1
realtime_schedule = 0
request.ui_dispatch_view = flashtimeline
search = eventtype="honeypot_app_events" | timechart count by threatscore

[Project Honey Pot - Threatscore AVG Last 7 Days]
action.email.inline = 1
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
auto_summarize = 0
auto_summarize.dispatch.earliest_time = -7d@d
cron_schedule = 0 0 * * *
dispatch.earliest_time = -7d@d
dispatch.latest_time = -1d@d
displayview = flashtimeline
enableSched = 1
search = eventtype="honeypot_app_events" | where threatscore>0 | stats avg(threatscore) as threatscore_avg | eval threatscore_avg=round(threatscore_avg,2)

[Project Honey Pot - Threatscore AVG Last 4 Hours]
action.email.inline = 1
action.email.reportServerEnabled = 0
action.summary_index = 1
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
auto_summarize = 0
auto_summarize.dispatch.earliest_time = -1d@h
auto_summarize.timespan = 1m
cron_schedule = */15 * * * *
dispatch.earliest_time = -4h@m
dispatch.latest_time = now
displayview = flashtimeline
enableSched = 1
realtime_schedule = 0
request.ui_dispatch_view = flashtimeline
search = eventtype="honeypot_app_events" | where threatscore>0 | stats avg(threatscore) as threatscore_avg | eval threatscore_avg=round(threatscore_avg,2)

[Communication to BAD IP - Percentage bad ip destinations single value]
action.email.inline = 1
action.email.reportServerEnabled = 0
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
auto_summarize.timespan = 1m
dispatch.earliest_time = -60m@m
dispatch.latest_time = now
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = eventtype="ip_check" | stats count by src_ip dst_ip dst_port protocol | lookup threatscore clientip AS dst_ip | sort -threatscore | stats count(dst_ip) as total_connections count(eval(threatscore>0)) as count_bad | eval percentage = count_bad * 100/total_connections | table percentage | eval percentage = round(percentage,2) | rename percentage as "Percentage ip destinations bad"
vsid = hkuths73

[Communication to BAD IP - Threatscore>0 Table]
action.email.inline = 1
action.email.reportServerEnabled = 0
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
auto_summarize.timespan = 1m
dispatch.earliest_time = -60m@m
dispatch.latest_time = now
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = eventtype="ip_check" | stats count by src_ip dst_ip dst_port protocol | lookup threatscore clientip AS dst_ip | sort -threatscore | where threatscore>0
vsid = hkuryig1

[Communication to BAD IP - Threatscore>0 Table Realtime]
action.email.inline = 1
action.email.reportServerEnabled = 0
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
cron_schedule = * * * * *
dispatch.earliest_time = rt-5m
dispatch.latest_time = rt
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = eventtype="ip_check" | stats count by src_ip dst_ip dst_port protocol | lookup threatscore clientip AS dst_ip | sort -threatscore | where threatscore>0
vsid = hkus05vd

[Communication to BAD IP - Unique Infected Clients]
action.email.inline = 1
action.email.reportServerEnabled = 0
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
auto_summarize.timespan = 1m
dispatch.earliest_time = -60m@m
dispatch.latest_time = now
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = eventtype="ip_check" | stats count by src_ip dst_ip dst_port protocol | lookup threatscore clientip AS dst_ip | sort -threatscore | where threatscore>0 | stats dc(src_ip) as "Potential Infected Clients"
vsid = hkus9h52

[Communication to BAD IP - Unique Malware Destination Port]
action.email.inline = 1
action.email.reportServerEnabled = 0
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
auto_summarize.timespan = 1m
dispatch.earliest_time = -60m@m
dispatch.latest_time = now
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = eventtype="ip_check" | stats count by src_ip dst_ip dst_port protocol | lookup threatscore clientip AS dst_ip | sort -threatscore | where threatscore>0 | stats dc(dst_port) as "Malware-Port"
vsid = hkus8eqe

[Communication to BAD IP - Unique Malware Destinations Identified]
action.email.inline = 1
action.email.reportServerEnabled = 0
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
auto_summarize.timespan = 1m
dispatch.earliest_time = -60m@m
dispatch.latest_time = now
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = eventtype="ip_check" | stats count by src_ip dst_ip dst_port protocol | lookup threatscore clientip AS dst_ip | sort -threatscore | where threatscore>0 | stats dc(dst_ip) as "Malware-IP"
vsid = hkus75ib

[Critical Network Traffic Analyzer]
action.email.inline = 1
action.email.reportServerEnabled = 0
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
auto_summarize.timespan = 1m
dispatch.earliest_time = -60m@m
dispatch.latest_time = now
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = eventtype="ip_check" | stats count by src_ip dst_ip dst_port protocol | lookup threatscore clientip AS dst_ip | sort -threatscore
vsid = hkavvgl2

[Project Honey Pot - Threatscore Timechart Last 24h]
enableSched = 0

[Project Honey Pot - Threatscore AVG Last 4 Hours]
enableSched = 0

[Project Honey Pot - Threatscore AVG Last 7 Days]
enableSched = 0

[Project Honey Pot - Threatscore Timechart Last 4h]
enableSched = 0

[Project Honey Pot - Unique Visitors Threatscoring_Last 7d]
enableSched = 0

[Project Honey Pot - Unique Visitors Threatscoring_Last 24h]
enableSched = 0

[Project Honey Pot - Unique Visitors Threatscoring_Last Previous Month]
enableSched = 0

[Project Honey Pot - Unique Visitors Threatscoring_Last_Last 30d]
enableSched = 0

[ALERT - Traffic to Bad IP]
disabled = 1
action.email.inline = 1
action.email.reportServerEnabled = 0
action.email.sendresults = 1
action.email.to = test@local.local
alert.digest_mode = False
alert.suppress = 1
alert.suppress.fields = src_ip dst_ip
alert.suppress.period = 30s
alert.track = 1
cron_schedule = * * * * *
dispatch.earliest_time = rt
dispatch.latest_time = rt
displayview = flashtimeline
quantity = 0
relation = greater than
request.ui_dispatch_view = flashtimeline
search = eventtype="ip_check" | stats count by src_ip dst_ip dst_port protocol | lookup threatscore-dst_ip dst_ip | where threatscore>0
vsid = hkax9vk1