# Configurables
# Changing these will change the fields, or style of visualizations or tables.
[cyp_i_o_f]
definition = incident_id status risk_desc src dest signature category last_activity_time
iseval = true
description = This Macro controls the fields that are displayed on the "Incident Overview" view. It is an eval, and should be a list of fields that conforms to the "fields" command.

# DO NOT MODIFY BELOW HERE
[cyphort_idx]
definition = eventtype=cyphort_idx

[cyphort_incident]
definition = eventtype=cyphort_incident

[cyphort_event]
definition = eventtype=cyphort_event

[cyphort_error]
definition = eventtype=cyphort_error

[cyphort_error_panel_base]
definition = `cyphort_error` | table *

[cyphort_internal_error]
definition = index=_internal source=Cyphort*

[cyphort_api]
definition = `cyphort_idx` sourcetype=cyphort:api

[cyp_incident_overview(6)]
args = data_input_name, risk_level, threat, threat_category, fieldlist, incidents
definition = `cyphort_incident` host="$data_input_name$" risk_desc="$risk_level$" signature="$threat$" category="$threat_category$" $incidents$ |  convert mktime(last_activity_time) as tmp_activity_time timeformat="%Y-%m-%d %H:%M:%S.%6N%z" | eval new_activity_time=strftime(tmp_activity_time, "%Y-%m-%d %H:%M:%S.%6N") | fields incident_id $fieldlist$ host incident_key new_activity_time | stats latest(*) as * by incident_key | rename status as "Status" risk_desc as "Risk Level" src as "Threat Source" dest as "Threat Target" signature as "Threat" category as "Threat Category" new_activity_time as "Last Activity Time" | fields incident_id *

[cyp_incident_overview_raw(6)]
args = data_input_name, risk_level, threat, threat_category, fieldlist, select_incident_id
definition = `cyphort_incident` host="$data_input_name$" risk_desc="$risk_level$" signature="$threat$" category="$threat_category$" $select_incident_id$

[cyp_incident_detail(5)]
args = risk_level, threat_category, threat, incident_id, fieldlist
definition = `cyphort_incident` risk_desc="$risk_level$" signature="$threat$" category="$threat_category$" incident_id="$incident_id$" | eval url_id="http://".host."/cyadmin?id=".incident_id | fields incident_id url_id $fieldlist$ host| stats latest(*) as * by incident_id | rename status as "Status" risk_desc as "Risk Level" src as "Threat Source" dest as "Threat Target" signature as "Threat" category as "Threat Category" last_activity_time as "Last Activity Time"

[cyphort_incident_summary(1)]
args = data_input_name
definition = `cyphort_incident` host=$data_input_name$ | stats count by risk_desc

[cyphort_last_checkpoint]
definition = `cyphort_api` | convert ctime(_time) AS checkpoint_time | stats latest(checkpoint_time) as checkpoint_time by host

[cyphort_last_5_checkpoints]
definition = `cyphort_api`| convert ctime(_time) AS checkpoint_time | head 5 | table host,checkpoint_time,total_incidents

[cyp_overview_summary_panel_test]
definition = index=_internal earliest=-4h@h | eval filename = mvindex(split(source,"/"),-1) |eval headline = sourcetype | stats count by headline filename | sort - count | head 10

[cyp_incident_detail_search(1)]
args = id, host
definition = `cyphort_incident` id=$id$ host=$host$ |`cyphort_format_incident_detail`

[cyphort_kill_chain]
definition = eval kill_chain = "" | makemv kill_chain |`cyphort_kc_has_exploit` | `cyphort_kc_has_download` | `cyphort_kc_has_execution` | `cyphort_kc_has_infection` | `cyphort_kc_has_file_submission` | `cyphort_kc_has_data_theft`|eval kill_chain = mvjoin(kill_chain, "+")

[cyphort_kc_has_exploit]
definition = eval kill_chain = if(has_exploit==1,mvappend(kill_chain,"XP"),kill_chain)

[cyphort_kc_has_download]
definition = eval kill_chain = if(has_download==1,mvappend(kill_chain,"DL"),kill_chain)

[cyphort_kc_has_execution]
definition = eval kill_chain = if(has_execution==1,mvappend(kill_chain,"EX"),kill_chain)

[cyphort_kc_has_infection]
definition = eval kill_chain = if(has_infection==1,mvappend(kill_chain,"IN"),kill_chain)

[cyphort_kc_has_file_submission]
definition = eval kill_chain = if(has_file_submission==1,mvappend(kill_chain,"UP"),kill_chain)

[cyphort_kc_has_data_theft]
definition = eval kill_chain = if(has_data_theft==1,mvappend(kill_chain,"DT"),kill_chain)

[cyphort_format_incident_detail]
definition = `cyphort_kill_chain`| fillnull endpoint_os_type collector_name value="unknown" | rename dest_name as Target endpoint_os_type as OS asset_value as "Asset Value" src_name as Source kill_chain as "Kill Chain" severity as Severity relevance as Relevance collector_name as "Collector Name" | table Target,OS,"Asset Value",Source,"Kill Chain",Severity,Relevance,"Collector Name"

[cyphort_incident_detail_search_by_host(1)]
args = key
definition = `cyphort_incident` [ |noop | stats count |eval key = split("$key$","::"), incident_id=mvindex(key, 0), host=mvindex(key,1)| fields incident_id host| format "" "(" "AND" ")" "" ""]|`cyphort_format_incident_detail`

[cyphort_configured_inputs(1)]
args = fieldlist
definition = rest /services/data/inputs/CyphortForSplunk splunk_server=local | stats count by $fieldlist$

[cyphort_mc_health_check_api]
definition = `cyphort_error_panel_base` | stats count AS total_failures, latest(message) as message by host | eval severity_level = case(total_failures == 0, 0, total_failures > 0, 3)| rename host AS instance | fields instance total_failures message severity_level