[defkqlg-command]
syntax = defkqlg api=[queries or hunting] kql="your kql query"
shortdesc = GeneratingCommand to call Advanced Hunting API or Microsoft 365 Defender Advanced Hunting API (By GoAhead Inc.)
example = | defkqlg api="queries" kql="DeviceEvents | limit 10"
example2 = | defkqlg api="hunting" kql="DeviceProcessEvents | limit 10"
description = 
usage = public

[defkqls-command]
syntax = defkqls api=[queries or hunting] primary_field=[splunk event field which the value is matched] kql="kql query which you want to run via Defender API"
shortdesc = StreamingCommand to call Advanced Hunting API or Microsoft 365 Defender Advanced Hunting API (By GoAhead Inc.)
example = '| makeresults | eval pcname="xxx" | defkqls api=queries kql="DeviceProcessEvents | where DeviceName == `pcname` | table *"'
description = 
usage = public
