######################################################
#
# Balabit Shell Control Box App for Splunk
#
######################################################

[Balabit SCB - Summarize Session Start]
action.summary_index = 1
action.summary_index._name = balabit_scb_summary
action.summary_index.report = balabit_scb_session_start_summary
alert.digest_mode = True
alert.expires = 6h
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
cron_schedule = 10,20,30,40,50,0 * * * *
dispatch.earliest_time = -20m
dispatch.latest_time = now
enableSched = 1
realtime_schedule = 0
schedule_window = 5
search = `balabit_scb_all_logs` (tag=start AND tag=session) OR tag=authentication OR (tag=audit AND audit_trail_file=*) | eval authentication_action=if(tag=="authentication", action, '') | stats earliest(_time) AS start_time, latest(connection) AS connection, latest(user) AS user, latest(src_ip) AS src_ip, latest(dest_ip) AS dest_ip, values(authentication_action) AS authentication_action, latest(audit_trail_file) AS "audit_trail_file" by parent_session_id,host,process,process_id | eval has_audit_trail=if(len(audit_trail_file)>0, "yes", "no") | rename host AS orig_host | sort by -start_time

[Balabit SCB - Summarize Session End]
action.summary_index = 1
action.summary_index._name = balabit_scb_summary
action.summary_index.report = balabit_scb_session_end_summary
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
cron_schedule = 10,20,30,40,50,0 * * * *
dispatch.earliest_time = -20m
dispatch.latest_time = now
enableSched = 1
realtime_schedule = 0
schedule_window = 5
search = `balabit_scb_all_logs` tag=end tag=session | eval end_time=_time | stats latest(verdict) AS verdict, latest(end_time) AS end_time by parent_session_id, host, process, process_id | rename host AS orig_host | search verdict!='ZV_REJECT' | sort by -end_time

[Balabit SCB - Summarize Session Audit Events]
action.summary_index = 1
action.summary_index._name = balabit_scb_summary
action.summary_index.report = balabit_scb_session_audit_event_count_summary
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
cron_schedule = 10,20,30,40,50,0 * * * *
dispatch.earliest_time = -20m
dispatch.latest_time = now
enableSched = 1
realtime_schedule = 0
schedule_window = 5
search = `balabit_scb_all_logs` tag=audit vendor_class="proxy-connection-audit" | stats count AS audit_event_count by parent_session_id,host,process,process_id | rename host AS orig_host
