[User metrics]
action.email.useNSSubject = 1
alert.track = 0
dispatch.earliest_time = -7d@h
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","message_type","src_ip","user","src_user","action","fail"]
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = pie
display.visualizations.show = 0
display.visualizations.type = singlevalue
request.ui_dispatch_app = owncloud_app
request.ui_dispatch_view = search
search = index=owncloud sourcetype="owncloud:metrics:json" source="*/etc/apps/TA_owncloud/bin/metrics_all.sh" ocs.meta.statuscode="100"\
| head 1 \
| fields ocs.data.userData.* \
| rename ocs.data.userData.* as * \
| untable name Column Value\
| eval user=mvindex(split(Column,"."),0)\
| rex field=Column mode=sed "s/^[^.]*.//g"\
| eval {Column}=Value\
| stats values(backend) as Backend values(displayName) as "Display Name" values(lastLogin) as "Last Login" values(quota.free) as "Quota Free" values(quota.relative) as "Quota relative" values(quota.used) as "Quota used" values(shares.federatedShareCount) as "Federated Shares" values(shares.groupShareCount) as "Group Shares" values(shares.guestShareCount) as "Guest shares" values(shares.linkShareCount) as "Link Shares" values(shares.userShareCount) as "User shares" by user

[ownCloud: Warning: High Quoata Usage]
alert.severity = 4
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = 15 * * * *
description = Total used quota above 70%
disabled = 1
dispatch.earliest_time = -1h
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","message_type","src_ip","user","src_user","action","fail","targetUser"]
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.type = mapping
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = owncloud_app
request.ui_dispatch_view = search
search = `owncloud-indexes` sourcetype="owncloud:metrics:json" source="*/TA_owncloud/bin/metrics_files.sh"\
| eval used=`toGB('ocs.data.files.storage.used')`, total=`toGB('ocs.data.files.storage.total')`\
| eval Used%=round((used/total)*100)\
| stats latest(Used%) as "Used Quoata in %"\
| search "Used Quoata in %">=10

[ownCloud: Warning: High Quota Usage for User]
alert.digest_mode = 0
alert.severity = 4
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = 15 * * * *
description = Total used quota above 80% for user
disabled = 1
dispatch.earliest_time = -1h
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","message_type","src_ip","user","src_user","action","fail"]
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = pie
display.visualizations.show = 0
display.visualizations.type = singlevalue
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = owncloud_app
request.ui_dispatch_view = search
search = `userMetrics(*)`\
| table user "Display name" "Quota relative"\
| search "Quota relative">=80
