########
#
# XD5 Desktop Lookup Generation
#
########

[View XD5 Desktop Lookup Table]
search = `view_xd5_desktops`
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline

[Update XD5 Desktop Lookup Table]
search = `update_xd5_desktops`
cron_schedule = 45 * * * *
dispatch.earliest_time = -1h@h
dispatch.latest_time = now
displayview = flashtimeline
enableSched = 1
request.ui_dispatch_view = flashtimeline

[Rebuild XD5 Desktop Lookup Table]
search = `rebuild_xd5_desktops`
dispatch.earliest_time = -7d@d
dispatch.latest_time = now
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline

[Update Process Table]
search = `win_index` sourcetype="WMI:ProcessDetails"  Product!="" | inputlookup process_table append=t | rename Product as Application | table Application process_name Path | dedup Application process_name | outputlookup process_table
cron_schedule = 45 3 * * *
dispatch.earliest_time = -1h@h
dispatch.latest_time = now
displayview = flashtimeline
enableSched = 1
request.ui_dispatch_view = flashtimeline

########
#
# User Experience Dashboard Alerts
#
########

[USER EXP - High ICA Session Latency]
action.email.reportServerEnabled = 0
alert.severity = 5
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = 0 * * * *
dispatch.earliest_time = -1h@h
dispatch.latest_time = now
displayview = flashtimeline
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_view = flashtimeline
search = `xendesktop_index` `xd_ica`  InputSessionBandwidth OutputSessionBandwidth LatencySessionAverage InputSessionCompression OutputSessionCompression  UserName!="" UserName!="_Server Total" | stats Max(LatencySessionAverage) as LatencySessionAverage by vm_name user _time | sort - LatencySessionAverage |  dedup user vm_name | `usrexp_icalatency` | eval alert_name="High ICA Session Latency" | eval Value=LatencySessionAverage |  where usrexp<3 | collect `xendesktop_alerts`

[USER EXP - Low ICA Session Bandwidth]
action.email.reportServerEnabled = 0
alert.severity = 5
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = 10 * * * *
dispatch.earliest_time = -1h@h
dispatch.latest_time = now
displayview = flashtimeline
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_view = flashtimeline
search = `xendesktop_index` `xd_ica` InputSessionBandwidth OutputSessionBandwidth LatencySessionAverage InputSessionCompression OutputSessionCompression  UserName!="" user!="_Server Total"| eval SessionBandwidth=InputSessionBandwidth+OutputSessionBandwidth | search SessionBandwidth>0 | bin _time span=1h | stats avg(SessionBandwidth) as "SessionBandwidth" by vm_name user _time | `usrexp_icabw` | where usrexp<3 | eval Value=SessionBandwidth | eval alert_name="Low ICA Session Bandwidth" | collect `xendesktop_alerts`

[USER EXP - RDP or Local (NonBrokeredSession)]
action.email.reportServerEnabled = 0
alert.severity = 5
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = 10 * * * *
dispatch.earliest_time = -1h@h
dispatch.latest_time = now
displayview = flashtimeline
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_view = flashtimeline
search = `xendesktop_index` `xd_sessions_sourcetype` UserSID=S* XD40State="ConsoleLoggedIn" OR SessionState="NonBrokeredSession" | dedup SessionUID | eval alert_name="NonBrokerSession" | eval Value="RDPConnection" |  eval usrexp=3 | table StartTime vm_name Value alert_name user usrexp | collect `xendesktop_alerts`

[USER EXP - Failed DDC Registrations]
action.email.reportServerEnabled = 0
alert.severity = 5
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = 10 * * * *
dispatch.earliest_time = -1h@h
dispatch.latest_time = now
displayview = flashtimeline
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_view = flashtimeline
search = `win_index` sourcetype="WinEventLog:Application" SourceName="Citrix Desktop Service" Type="Error" OR Type="Warning" Message="The Citrix Desktop Service failed to register with any delivery controller.*" | eval vm_name=host | eval alert_name="RegistrationFail" | eval Value="DDC Registration Fail" | eval usrexp=3 | eval user="NoUserLoggedIn" | table _time vm_name Value alert_name user usrexp | collect `xendesktop_alerts`


[USER EXP - CPU Consumption Critical]
action.email.reportServerEnabled = 0
alert.severity = 5
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = 5 * * * *
dispatch.earliest_time = -1h@h
dispatch.latest_time = now
displayview = flashtimeline
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_view = flashtimeline
search = `perfmon_index` `perfmon_cpu` counter="% Processor Time"  | bin _time span=5m | stats avg(Value) as Value by vm_name _time | bin _time span=1h  | stats max(Value) as Value by vm_name _time  | join type=left vm_name [search `xendesktop_index` `xd_sessions_sourcetype` | stats first(user) as user by vm_name ] | eval alert_name ="High CPU Consumption" | `usrexp_cpu`| where usrexp<3 | fillnull user value="NoUserLoggedIn" | collect `xendesktop_alerts`  

[USER EXP - Disk Space Critical]
action.email.reportServerEnabled = 0
alert.severity = 5
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = 45 * * * *
dispatch.earliest_time = -1h@h
dispatch.latest_time = now
displayview = flashtimeline
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_view = flashtimeline
search = `perfmon_logdisk` counter="Free Megabytes" instance!="_Total" | bin _time span=5m | stats first(Value) as Value by vm_name _time instance | bin _time span=1h | stats min(Value) as Value by vm_name _time instance | `usrexp_disk`| where usrexp<4 | join type=left vm_name [search `xendesktop_index` `xd_sessions_sourcetype` | stats first(user) as user by vm_name ] | eval alert_name ="Low Disk Space" | fillnull user value="NoUserLoggedIn" | collect `xendesktop_alerts`

[USER EXP - Available Memory Critical]
action.email.reportServerEnabled = 0
alert.severity = 5
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = 55 * * * *
dispatch.earliest_time = -1h@h
dispatch.latest_time = now
displayview = flashtimeline
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_view = flashtimeline
search = `perfmon_mem` object="Memory" Memory counter="Available Bytes" | eval Value=Value/1024/1024 | bin _time span=5m | stats avg(Value) as Value by vm_name _time | bin _time span=1h | stats max(Value) as Value by vm_name _time | join type=left vm_name [search `xendesktop_index` `xd_sessions_sourcetype` | stats first(user) as user by vm_name ] | `usrexp_mem`| where usrexp<3| eval alert_name ="Low Available Memory"| fillnull user value="NoUserLoggedIn" | collect `xendesktop_alerts`

[USER EXP - High Disk IO]
action.email.reportServerEnabled = 0
alert.severity = 5
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = 55 * * * *
dispatch.earliest_time = -1h@h
dispatch.latest_time = now
displayview = flashtimeline
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_view = flashtimeline
search = `perfmon_logdisk` counter="Disk Reads/Sec" OR counter="Disk Writes/Sec" | bin _time span=5m | stats avg(Value) as Value by vm_name _time | bin _time span=1h | stats max(Value) as Value by vm_name _time | join type=left vm_name [search `xendesktop_index` `xd_sessions_sourcetype` | stats first(user) as user by vm_name ] | `usrexp_io`| where usrexp<3 | eval alert_name ="High Disk I/O" | fillnull user value="NoUserLoggedIn" | collect `xendesktop_alerts`

[USER EXP - Application Crash or Hang]
action.email.reportServerEnabled = 0
alert.severity = 5
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = 55 * * * *
dispatch.earliest_time = -1h@h
dispatch.latest_time = now
displayview = flashtimeline
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_view = flashtimeline
search = `win_index` Type=Error EventCode>999 EventCode<1012 | bin _time span=15m | stats count by EventCode SourceName vm_name _time | rename SourceName as Value | Table _time vm_name Value  | join type=left vm_name [search `xendesktop_index` `xd_sessions_sourcetype` | stats first(user) as user by vm_name ] | eval alert_name ="Application Crash or Hang" |`usrexp_crash` | fillnull user value="NoUserLoggedIn" | collect `xendesktop_alerts`
