[Summary Report Indexed Bytes]
action.email.useNSSubject = 1
action.webhook.enable_allowlist = 0
alert.track = 0
cron_schedule = 4,9,14,19,24,29,34,39,44,49,54,59 * * * *
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
enableSched = 0
search = index="_internal" source="*license_usage.log" sourcetype="splunkd" type="Usage" earliest=-0d@d latest=[makeresults | eval snap=floor(now()/300)*300 | return $snap]\
| stats sum(b) as bytes, max(poolsz) as poolsz by pool\
| eval percent=(bytes/poolsz) * 100\
| eval date_time=(floor(now()/300))*300\
| eval _time=date_time\
| eval date_time_formatted=strftime(date_time, "%Y-%m-%d %H:%M:%S")\
| eval date_time_date=strftime(date_time, "%Y-%m-%d")\
| eval date_time_time=strftime(date_time, "%H:%M:%S")\
| eval date_time_hour=strftime(date_time, "%H")\
| eval date_time_mday=strftime(date_time, "%d")\
| eval date_time_minute=strftime(date_time, "%M")\
| eval date_time_month=strftime(date_time, "%m")\
| eval date_time_second=strftime(date_time, "%S")\
| eval date_time_wday=strftime(date_time, "%A")\
| eval date_time_year=strftime(date_time, "%Y")\
| eval date_time_zone=strftime(date_time, "%z")\
| eval date_time_seconds=(date_time_hour * 60 * 60) + (date_time_minute * 60) + date_time_second\
| collect `indexing_insights_summary_index`

[Summary Report Indexed Bytes by index]
action.email.useNSSubject = 1
action.webhook.enable_allowlist = 0
alert.track = 0
cron_schedule = 4,9,14,19,24,29,34,39,44,49,54,59 * * * *
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
enableSched = 0
search = index="_internal" source="*license_usage.log" sourcetype="splunkd" type="Usage" earliest=-0d@d latest=[makeresults | eval snap=floor(now()/300)*300 | return $snap]\
| stats sum(b) as bytes, max(poolsz) as poolsz by pool, idx\
| eval percent=(bytes/poolsz) * 100\
| eval date_time=(floor(now()/300))*300\
| eval _time=date_time\
| eval date_time_formatted=strftime(date_time, "%Y-%m-%d %H:%M:%S")\
| eval date_time_date=strftime(date_time, "%Y-%m-%d")\
| eval date_time_time=strftime(date_time, "%H:%M:%S")\
| eval date_time_hour=strftime(date_time, "%H")\
| eval date_time_mday=strftime(date_time, "%d")\
| eval date_time_minute=strftime(date_time, "%M")\
| eval date_time_month=strftime(date_time, "%m")\
| eval date_time_second=strftime(date_time, "%S")\
| eval date_time_wday=strftime(date_time, "%A")\
| eval date_time_year=strftime(date_time, "%Y")\
| eval date_time_zone=strftime(date_time, "%z")\
| eval date_time_seconds=(date_time_hour * 60 * 60) + (date_time_minute * 60) + date_time_second\
| collect `indexing_insights_summary_index`

[Summary Report Indexed Bytes by sourcetype]
action.email.useNSSubject = 1
action.webhook.enable_allowlist = 0
alert.track = 0
cron_schedule = 4,9,14,19,24,29,34,39,44,49,54,59 * * * *
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
enableSched = 0
search = index="_internal" source="*license_usage.log" sourcetype="splunkd" type="Usage" earliest=-0d@d latest=[makeresults | eval snap=floor(now()/300)*300 | return $snap]\
| stats sum(b) as bytes, max(poolsz) as poolsz by pool, st\
| eval percent=(bytes/poolsz) * 100\
| eval date_time=(floor(now()/300))*300\
| eval _time=date_time\
| eval date_time_formatted=strftime(date_time, "%Y-%m-%d %H:%M:%S")\
| eval date_time_date=strftime(date_time, "%Y-%m-%d")\
| eval date_time_time=strftime(date_time, "%H:%M:%S")\
| eval date_time_hour=strftime(date_time, "%H")\
| eval date_time_mday=strftime(date_time, "%d")\
| eval date_time_minute=strftime(date_time, "%M")\
| eval date_time_month=strftime(date_time, "%m")\
| eval date_time_second=strftime(date_time, "%S")\
| eval date_time_wday=strftime(date_time, "%A")\
| eval date_time_year=strftime(date_time, "%Y")\
| eval date_time_zone=strftime(date_time, "%z")\
| eval date_time_seconds=(date_time_hour * 60 * 60) + (date_time_minute * 60) + date_time_second\
| collect `indexing_insights_summary_index`

[Summary Report Indexed Count by sourcetype host]
action.email.useNSSubject = 1
action.webhook.enable_allowlist = 0
alert.track = 0
cron_schedule = 4,9,14,19,24,29,34,39,44,49,54,59 * * * *
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
enableSched = 0
search = | tstats count where `indexing_insights_indexes` earliest=-0d@d latest=[makeresults | eval snap=floor(now()/300)*300 | return $snap] by sourcetype, host\
| rename sourcetype as st, host as h\
| eval date_time=(floor(now()/300))*300\
| eval _time=date_time\
| eval date_time_formatted=strftime(date_time, "%Y-%m-%d %H:%M:%S")\
| eval date_time_date=strftime(date_time, "%Y-%m-%d")\
| eval date_time_time=strftime(date_time, "%H:%M:%S")\
| eval date_time_hour=strftime(date_time, "%H")\
| eval date_time_mday=strftime(date_time, "%d")\
| eval date_time_minute=strftime(date_time, "%M")\
| eval date_time_month=strftime(date_time, "%m")\
| eval date_time_second=strftime(date_time, "%S")\
| eval date_time_wday=strftime(date_time, "%A")\
| eval date_time_year=strftime(date_time, "%Y")\
| eval date_time_zone=strftime(date_time, "%z")\
| eval date_time_seconds=(date_time_hour * 60 * 60) + (date_time_minute * 60) + date_time_second\
| collect `indexing_insights_summary_index`

[Summary Report Indexed Count by index host]
action.email.useNSSubject = 1
action.webhook.enable_allowlist = 0
alert.track = 0
cron_schedule = 4,9,14,19,24,29,34,39,44,49,54,59 * * * *
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
enableSched = 0
search = | tstats count where `indexing_insights_indexes` earliest=-0d@d latest=[makeresults | eval snap=floor(now()/300)*300 | return $snap] by index, host\
| rename index as idx, host as h\
| eval date_time=(floor(now()/300))*300\
| eval _time=date_time\
| eval date_time_formatted=strftime(date_time, "%Y-%m-%d %H:%M:%S")\
| eval date_time_date=strftime(date_time, "%Y-%m-%d")\
| eval date_time_time=strftime(date_time, "%H:%M:%S")\
| eval date_time_hour=strftime(date_time, "%H")\
| eval date_time_mday=strftime(date_time, "%d")\
| eval date_time_minute=strftime(date_time, "%M")\
| eval date_time_month=strftime(date_time, "%m")\
| eval date_time_second=strftime(date_time, "%S")\
| eval date_time_wday=strftime(date_time, "%A")\
| eval date_time_year=strftime(date_time, "%Y")\
| eval date_time_zone=strftime(date_time, "%z")\
| eval date_time_seconds=(date_time_hour * 60 * 60) + (date_time_minute * 60) + date_time_second\
| collect `indexing_insights_summary_index`

[Summary Report Windows EventCode Counts]
action.email.useNSSubject = 1
action.webhook.enable_allowlist = 0
alert.track = 0
cron_schedule = 4,9,14,19,24,29,34,39,44,49,54,59 * * * *
enableSched = 0
search = [| tstats count where `indexing_insights_indexes` sourcetype="WinEventLog:Security" OR source="WinEventLog:Security" earliest=@d latest=now by index | fields - count | format | return $search] AND (source="WinEventLog:Security" OR sourcetype="WinEventLog:Security") AND (sourcetype="wineventlog" OR sourcetype="WinEventLog:Security") AND earliest=[makeresults | eval snap=floor(now()/300)*300-300 | return $snap] latest=[makeresults | eval snap=floor(now()/300)*300 | return $snap]\
| stats count by EventCode\
| eval date_time=(floor(now()/300))*300\
| eval _time=date_time\
| eval date_time_formatted=strftime(date_time, "%Y-%m-%d %H:%M:%S")\
| eval date_time_date=strftime(date_time, "%Y-%m-%d")\
| eval date_time_time=strftime(date_time, "%H:%M:%S")\
| eval date_time_hour=strftime(date_time, "%H")\
| eval date_time_mday=strftime(date_time, "%d")\
| eval date_time_minute=strftime(date_time, "%M")\
| eval date_time_month=strftime(date_time, "%m")\
| eval date_time_second=strftime(date_time, "%S")\
| eval date_time_wday=strftime(date_time, "%A")\
| eval date_time_year=strftime(date_time, "%Y")\
| eval date_time_zone=strftime(date_time, "%z")\
| eval date_time_seconds=(date_time_hour * 60 * 60) + (date_time_minute * 60) + date_time_second\
| collect `indexing_insights_summary_index`

[Summary Report Windows EventCode Counts by host]
action.email.useNSSubject = 1
action.webhook.enable_allowlist = 0
alert.track = 0
cron_schedule = 4,9,14,19,24,29,34,39,44,49,54,59 * * * *
enableSched = 0
search = [| tstats count where `indexing_insights_indexes` sourcetype="WinEventLog:Security" OR source="WinEventLog:Security" earliest=@d latest=now by index | fields - count | format | return $search] AND (source="WinEventLog:Security" OR sourcetype="WinEventLog:Security") AND (sourcetype="wineventlog" OR sourcetype="WinEventLog:Security") AND earliest=[makeresults | eval snap=floor(now()/300)*300-300 | return $snap] latest=[makeresults | eval snap=floor(now()/300)*300 | return $snap]\
| stats count by EventCode, host\
| rename host as h\
| eval date_time=(floor(now()/300))*300\
| eval _time=date_time\
| eval date_time_formatted=strftime(date_time, "%Y-%m-%d %H:%M:%S")\
| eval date_time_date=strftime(date_time, "%Y-%m-%d")\
| eval date_time_time=strftime(date_time, "%H:%M:%S")\
| eval date_time_hour=strftime(date_time, "%H")\
| eval date_time_mday=strftime(date_time, "%d")\
| eval date_time_minute=strftime(date_time, "%M")\
| eval date_time_month=strftime(date_time, "%m")\
| eval date_time_second=strftime(date_time, "%S")\
| eval date_time_wday=strftime(date_time, "%A")\
| eval date_time_year=strftime(date_time, "%Y")\
| eval date_time_zone=strftime(date_time, "%z")\
| eval date_time_seconds=(date_time_hour * 60 * 60) + (date_time_minute * 60) + date_time_second\
| collect `indexing_insights_summary_index`

[Summary Report Indexed Count]
action.email.useNSSubject = 1
action.webhook.enable_allowlist = 0
alert.track = 0
cron_schedule = 4,9,14,19,24,29,34,39,44,49,54,59 * * * *
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
enableSched = 0
search = | tstats count where `indexing_insights_indexes` earliest=-0d@d latest=[makeresults | eval snap=floor(now()/300)*300 | return $snap]\
| eval date_time=(floor(now()/300))*300\
| eval _time=date_time\
| eval date_time_formatted=strftime(date_time, "%Y-%m-%d %H:%M:%S")\
| eval date_time_date=strftime(date_time, "%Y-%m-%d")\
| eval date_time_time=strftime(date_time, "%H:%M:%S")\
| eval date_time_hour=strftime(date_time, "%H")\
| eval date_time_mday=strftime(date_time, "%d")\
| eval date_time_minute=strftime(date_time, "%M")\
| eval date_time_month=strftime(date_time, "%m")\
| eval date_time_second=strftime(date_time, "%S")\
| eval date_time_wday=strftime(date_time, "%A")\
| eval date_time_year=strftime(date_time, "%Y")\
| eval date_time_zone=strftime(date_time, "%z")\
| eval date_time_seconds=(date_time_hour * 60 * 60) + (date_time_minute * 60) + date_time_second\
| collect `indexing_insights_summary_index`

[Summary Report Indexed Count by host]
action.email.useNSSubject = 1
action.webhook.enable_allowlist = 0
alert.track = 0
cron_schedule = 4,9,14,19,24,29,34,39,44,49,54,59 * * * *
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
enableSched = 0
search = | tstats count where `indexing_insights_indexes` earliest=-0d@d latest=[makeresults | eval snap=floor(now()/300)*300 | return $snap] by host\
| rename host as h\
| eval date_time=(floor(now()/300))*300\
| eval _time=date_time\
| eval date_time_formatted=strftime(date_time, "%Y-%m-%d %H:%M:%S")\
| eval date_time_date=strftime(date_time, "%Y-%m-%d")\
| eval date_time_time=strftime(date_time, "%H:%M:%S")\
| eval date_time_hour=strftime(date_time, "%H")\
| eval date_time_mday=strftime(date_time, "%d")\
| eval date_time_minute=strftime(date_time, "%M")\
| eval date_time_month=strftime(date_time, "%m")\
| eval date_time_second=strftime(date_time, "%S")\
| eval date_time_wday=strftime(date_time, "%A")\
| eval date_time_year=strftime(date_time, "%Y")\
| eval date_time_zone=strftime(date_time, "%z")\
| eval date_time_seconds=(date_time_hour * 60 * 60) + (date_time_minute * 60) + date_time_second\
| collect `indexing_insights_summary_index`

[Summary Report Indexed Count by index]
action.email.useNSSubject = 1
action.webhook.enable_allowlist = 0
alert.track = 0
cron_schedule = 4,9,14,19,24,29,34,39,44,49,54,59 * * * *
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
enableSched = 0
search = | tstats count where `indexing_insights_indexes` earliest=-0d@d latest=[makeresults | eval snap=floor(now()/300)*300 | return $snap] by index\
| rename index as idx\
| eval date_time=(floor(now()/300))*300\
| eval _time=date_time\
| eval date_time_formatted=strftime(date_time, "%Y-%m-%d %H:%M:%S")\
| eval date_time_date=strftime(date_time, "%Y-%m-%d")\
| eval date_time_time=strftime(date_time, "%H:%M:%S")\
| eval date_time_hour=strftime(date_time, "%H")\
| eval date_time_mday=strftime(date_time, "%d")\
| eval date_time_minute=strftime(date_time, "%M")\
| eval date_time_month=strftime(date_time, "%m")\
| eval date_time_second=strftime(date_time, "%S")\
| eval date_time_wday=strftime(date_time, "%A")\
| eval date_time_year=strftime(date_time, "%Y")\
| eval date_time_zone=strftime(date_time, "%z")\
| eval date_time_seconds=(date_time_hour * 60 * 60) + (date_time_minute * 60) + date_time_second\
| collect `indexing_insights_summary_index`

[Summary Report Indexed Count by sourcetype]
action.email.useNSSubject = 1
action.webhook.enable_allowlist = 0
alert.track = 0
cron_schedule = 4,9,14,19,24,29,34,39,44,49,54,59 * * * *
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
enableSched = 0
search = | tstats count where `indexing_insights_indexes` earliest=-0d@d latest=[makeresults | eval snap=floor(now()/300)*300 | return $snap] by sourcetype\
| rename sourcetype as st\
| eval date_time=(floor(now()/300))*300\
| eval _time=date_time\
| eval date_time_formatted=strftime(date_time, "%Y-%m-%d %H:%M:%S")\
| eval date_time_date=strftime(date_time, "%Y-%m-%d")\
| eval date_time_time=strftime(date_time, "%H:%M:%S")\
| eval date_time_hour=strftime(date_time, "%H")\
| eval date_time_mday=strftime(date_time, "%d")\
| eval date_time_minute=strftime(date_time, "%M")\
| eval date_time_month=strftime(date_time, "%m")\
| eval date_time_second=strftime(date_time, "%S")\
| eval date_time_wday=strftime(date_time, "%A")\
| eval date_time_year=strftime(date_time, "%Y")\
| eval date_time_zone=strftime(date_time, "%z")\
| eval date_time_seconds=(date_time_hour * 60 * 60) + (date_time_minute * 60) + date_time_second\
| collect `indexing_insights_summary_index`

[Summary Report Summary Timings]
action.email.useNSSubject = 1
action.webhook.enable_allowlist = 0
alert.track = 0
cron_schedule = 4,9,14,19,24,29,34,39,44,49,54,59 * * * *
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
enableSched = 0
search = index="_audit" source="audittrail" sourcetype="audittrail" action="search" info="completed" savedsearch_name IN ("Summary Report Indexed Bytes","Summary Report Indexed Bytes by index","Summary Report Indexed Bytes by sourcetype","Summary Report Indexed Count","Summary Report Indexed Count by host","Summary Report Indexed Count by index","Summary Report Indexed Count by index host","Summary Report Indexed Count by sourcetype","Summary Report Indexed Count by sourcetype host","Summary Report Windows EventCode Counts","Summary Report Windows EventCode Counts by host","Summary Report Summary Timings") total_run_time=* earliest=[makeresults | eval snap=floor(now()/300)*300-300 | return $snap] latest=[makeresults | eval snap=floor(now()/300)*300 | return $snap]\
| eval date_time=_time\
| table date_time, savedsearch_name, total_run_time\
| collect `indexing_insights_summary_index`\