#Configurations to set line breaking and timestamp/formatting. 

[incident]
KV_MODE = json
TRUNCATE = 100000
SHOULD_LINEMERGE = false
TIME_PREFIX = \"updated_at": \"
TIME_FORMAT = %Y-%m-%dT%H:%M:%S.%6N
BREAK_ONLY_BEFORE = ^\{
NO_BINARY_CHECK = true
category = Custom
disabled = false
pulldown_type = true



#CIM Aliasing - Ticket Management => Incident
#formatting of the field names is changing depending on the formatting.  Beaware that (_) might be (.) for separaters.

FIELDALIAS-ticket_id = id AS ticket_id
FIELDALIAS-comments = customer_key AS comments
FIELDALIAS-status = incident_status AS status
FIELDALIAS-severity = severity AS severity
FIELDALIAS-time_submitted = matches{}.created_at AS time_submitted
FIELDALIAS-change = updated_at AS change
FIELDALIAS-incident = entity_name AS incident
FIELDALIAS-src_user = entity_owner_email AS src_user
FIELDALIAS-user = entity_owner_name AS user
FIELDALIAS-dest = entity_origin_type AS dest
FIELDALIAS-affect_dest = entity_direct_url AS affect_dest
FIELDALIAS-src_user_bunit = entity_vendor_name AS src_user_bunit
FIELDALIAS-src_user_category = policy_name AS src_user_category

#placeholders - tag is not working.  Might need to be associated with the datamodel.
#FIELDALIAS-tag = matches{}.text AS tag
#FIELDALIAS-dest_category = extra:EventType AS dest_category
