[Z^2: Dedup ML Intel Collection]
action.email.useNSSubject = 1
action.keyindicator.invert = 0
action.logevent = 1
action.logevent.param.event = $trigger_time$ | Z^2:ThreatIntel | INFO | Scheduled search to de-duplicate the threat intel domains found in the ml_intel collection |  unique domains will be kept in the collection.
action.logevent.param.host = $server.serverName$
action.logevent.param.index = _internal
action.logevent.param.sourcetype = Z^2
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.param.verbose = 0
action.threat_add.param.verbose = 0
alert.track = 0
cron_schedule = 0 0 * * *
dispatch.earliest_time = 0
display.general.timeRangePicker.show = 0
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.show = 0
display.visualizations.type = singlevalue
enableSched = 1
request.ui_dispatch_app = SA-Revelation
request.ui_dispatch_view = search
search = | inputlookup ml_intel \
| eval key_domain=_key." ".domain \
| table _time class domain key_domain description threat_key weight user updated confidence \
| sort 0 _time \
| dedup domain class \
| eval list ="*" \
| `ut_parse(domain,list)` \
| `cdn_check(ut_domain)` \
| eval cdn_class = case(isProvider="true" OR ut_tld="in-addr.arpa", "legit", 1=1, "unknown") \
| eval class = case(class==cdn_class, cdn_class, class="dga" and cdn_class="legit", cdn_class, class!=cdn_class, class) \
| fillnull value="z^2" user \
| fillnull value="false" updated \
| outputlookup ml_intel


[Z^2: Dedup Botnet Intel Collection]
action.email.useNSSubject = 1
action.keyindicator.invert = 0
action.logevent = 1
action.logevent.param.event = $trigger_time$ | Z^2:ThreatIntel | INFO | Scheduled search to de-duplicate the threat intel src found in the bot_intel collection |  unique src will be kept in the collection.
action.logevent.param.host = $server.serverName$
action.logevent.param.index = _internal
action.logevent.param.sourcetype = Z^2
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.param.verbose = 0
action.threat_add.param.verbose = 0
alert.track = 0
cron_schedule = 0 0 * * *
dispatch.earliest_time = 0
display.general.timeRangePicker.show = 0
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.show = 0
display.visualizations.type = singlevalue
enableSched = 1
request.ui_dispatch_app = SA-Revelation
request.ui_dispatch_view = search
search = | inputlookup bot_intel \
| eval key_src=_key." ".src \
| table _time class src key_src pcr_info description threat_key weight user updated confidence \
| sort 0 _time \
| dedup src class \
| fillnull value="z^2" user \
| fillnull value="false" updated \
| outputlookup bot_intel

[Z^2: Update Syntax for 095]
action.email.useNSSubject = 1
action.keyindicator.invert = 0
action.logevent = 1
action.logevent.param.event = $trigger_time$ | Z^2:ThreatIntel | INFO | Search to change the convention for update 1 or 0 to true or false in the ml_intel collection |  This only needs to be done once unless there's issues with your tablebutton.js.
action.logevent.param.host = $server.serverName$
action.logevent.param.index = _internal
action.logevent.param.sourcetype = Z^2
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.param.verbose = 0
action.threat_add.param.verbose = 0
alert.track = 0
cron_schedule = 0 0 * * *
dispatch.earliest_time = 0
display.general.timeRangePicker.show = 0
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.show = 0
display.visualizations.type = singlevalue
enableSched = 0
request.ui_dispatch_app = SA-Revelation
request.ui_dispatch_view = search
search = | inputlookup ml_intel where domain="*" | eval key_domain=_key." ".domain  | table _time class domain key_domain description confidence user updated | fillnull value="false" updated | sort 0 - _time| replace 1 with "true" in updated | outputlookup ml_intel

[Z^2: Update Local DGA Model]
action.email.useNSSubject = 1
action.keyindicator.invert = 0
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.param.verbose = 0
action.threat_add.param.verbose = 0
alert.track = 0
cron_schedule = 0 0 * * 6
dispatch.earliest_time = -7d@h
dispatch.latest_time = now
display.general.timeRangePicker.show = 0
display.general.type = statistics
enableSched = 1
request.ui_dispatch_app = SA-Revelation
request.ui_dispatch_view = SA-Revelation
search = | inputlookup ml_intel where confidence="confirmed_dga" | table class domain | `ut_shannon(domain)` | `ut_meaning(domain)` | `ut_domain_parse(domain)` | eval rnd=random() | apply app:base_dga_ngram | apply app:base_dga_pca | table domain class subclass ut_* PC_* | sort 0 rnd | fit RBAClassifier class from ut* PC* batch_size=100 partial_fit=true probabilities=true into app:local_dga_rba_custom hidden_layer_sizes='300' | rename "predicted(class)" as predicted_class | score precision_recall_fscore_support class against predicted_class | transpose 0 column_name=class header_field=Metric | eval _time=now() | join _time [| summary app:local_dga_rba_custom | eval _time=now()]  | collect index=_internal sourcetype=Z^2:training

[Z^2: Update Local Botnet Model]
action.email.useNSSubject = 1
action.keyindicator.invert = 0
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.param.verbose = 0
action.threat_add.param.verbose = 0
alert.track = 0
cron_schedule = 0 0 * * 6
dispatch.earliest_time = -7d@h
dispatch.latest_time = now
display.general.timeRangePicker.show = 0
display.general.type = statistics
enableSched = 1
request.ui_dispatch_app = SA-Revelation
request.ui_dispatch_view = SA-Revelation
search = | tstats summariesonly=true count as numFlows sum(All_Traffic.bytes) as "sumBytes" avg(All_Traffic.bytes) as "avgBytes" sum(All_Traffic.bytes_in) as "bytes_in" avg(All_Traffic.duration) as "avgDuration" sum(All_Traffic.bytes_out) as "bytes_out" dc(All_Traffic.dest_ip) as "uniqueDstIp" dc(All_Traffic.dest_port) as "uniqueDstPort" from datamodel="Network_Traffic" where [|inputlookup bot_intel where class="botnet" updated="true" | table src | rename src as "All_Traffic.src_ip" ] by "All_Traffic.src_ip" _time span=1h | rename "All_Traffic.src_ip" as src | rename avgBytes as x_avgBytes avgDuration as x_avgDuration numFlows as x_numFlows sumBytes as x_sumBytes uniqueDstIp as x_uniqueDstIp uniqueDstPort as x_uniqueDstPort | apply app:base_botnet_scaler | rename SS_* as PC_* | eval class="botnet"| fit RBAClassifier class from PC_* batch_size=64 probabilities=true  partial_fit=true into app:local_botnet_rba_custom hidden_layer_sizes='300' | rename "predicted(class)" as predicted_class | score precision_recall_fscore_support class against predicted_class | transpose 0 column_name=class header_field=Metric | eval _time=now() | join _time [| summary app:local_botnet_rba_custom | eval _time=now()]  | collect index=_internal sourcetype=Z^2:training

[Z^2: Create Base Comparison]
action.email.useNSSubject = 1
action.keyindicator.invert = 0
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.param.verbose = 0
action.threat_add.param.verbose = 0
alert.track = 0
cron_schedule = 0 0 * * 6
dispatch.earliest_time = -7d@h
dispatch.latest_time = now
display.general.timeRangePicker.show = 0
display.general.type = statistics
request.ui_dispatch_app = SA-Revelation
request.ui_dispatch_view = SA-Revelation
search = | inputlookup ml_intel \
| table class domain \
| `ut_shannon(domain)` \
| `ut_meaning(domain)` \
| `ut_domain_parse(domain)` \
| eval rnd=random() \
| apply app:base_dga_ngram \
| apply app:base_dga_pca \
| table domain class subclass ut_* PC_* \
| sort 0 rnd \
| apply  app:base_dga_rba_custom \
| rename "predicted(class)" as predicted_class \
| score precision_recall_fscore_support class against predicted_class \
| transpose 0 column_name=class header_field=Metric \
| eval _time=now() \
| join _time \
    [| summary app:base_dga_rba_custom \
    | eval _time=now()] \
| outputlookup base_dga_comparison

[Z^2: DGA Query Detection Hourly - Rule]
action.correlationsearch.enabled = 1
action.correlationsearch.label = DGA Query Detection Hourly
action.customsearchbuilder.enabled = false
action.notable.param.verbose = 0
action.notable = 1
action.notable.param.drilldown_name = View all DGA queries by system $src$ for the domain $domain$.
action.notable.param.drilldown_search = | from datamodel:"Network_Resolution"."DNS" | search src="$src$" query="$domain$"
action.notable.param.extract_artifacts = {"asset":["src","dest","dvc","orig_host"],"identity":["src_user","user"],"url":["domain"]}
action.notable.param.next_steps = {"version":1,"data":"Confirm the domain is malicious through investigation and confirm by adding it to [[action|threat_add]] \nDomains are also automatically stored in the ml_intel threat collection and can be updated by reviewing the Threat Intelligence dashboard in the base application."}
action.notable.param.rule_description = DGA query detected by machine learning model
action.notable.param.rule_title = Potential ransomware query detected
action.notable.param.security_domain = threat
action.notable.param.severity = high
action.risk = 1
action.risk.param._risk_object = src
action.risk.param._risk_object_type = system
action.risk.param._risk_score = 30
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = 0 * * * *
description = This search will use machine learning models to predict ransomware domains in the Network Resolution Data Model
dispatch.earliest_time = -1h
dispatch.latest_time = now
dispatch.rt_backfill = 1
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = SA-Revelation
request.ui_dispatch_view = SA-Revelation
search = | tstats summariesonly=true sum(DNS.query_count) as "count" from datamodel="Network_Resolution"."DNS" by "DNS.src","DNS.query",_time | rename "DNS.src" as "src","DNS.query" as "domain" | `ut_shannon(domain)` | `ut_meaning(domain)`| `ut_domain_parse(domain)`  | eval list="mozilla" | `ut_parse_extended(domain, list)`| apply app:base_dga_ngram | apply app:base_dga_pca | `apply_base_local(dga)` | `confidence_filter(dga,0.90,0.80,0.70,0.90)` | `ml_intel_check` | `cdn_check(ut_domain)` | search CDN_provider=false | eval description="{class:dga, xref:SA-Revelation}", confidence="dga_probabilty:"+dga_confidence, threat_key="dga_domains"   | table _time src domain probable_class threat_key description confidence | rename probable_class as class  |  outputlookup ml_intel append=true

[Z^2: Botnet Detection Hourly - Rule]
action.correlationsearch.enabled = 1
action.correlationsearch.label = Botnet Detection Hourly
action.customsearchbuilder.enabled = false
action.notable.param.verbose = 0
action.notable = 1
action.notable.param.drilldown_name = View all connections by system $src$ 
action.notable.param.drilldown_search = | from datamodel:"Network_Traffic" | search src="$src$" 
action.notable.param.extract_artifacts = {"asset":["src","dest","dvc","orig_host"],"identity":["src_user","user"],"url":["domain"]}
action.notable.param.next_steps = {"version":1,"data":"Confirm the src is malicious through investigation and confirm by adding it to [[action|threat_add]] \n src_ips are also automatically stored in the bot_intel threat collection and can be updated by reviewing the Threat Intelligence dashboard in the base application."}
action.notable.param.rule_description = Botnet  detected by machine learning model
action.notable.param.rule_title = Potential botnet behavior detected
action.notable.param.security_domain = threat
action.notable.param.severity = high
action.risk = 1
action.risk.param._risk_object = src
action.risk.param._risk_object_type = system
action.risk.param._risk_score = 30
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = 0 * * * *
description = This search will use machine learning models to predict botnet behaviors in the All Traffice Data Model
dispatch.earliest_time = -1h
dispatch.latest_time = now
dispatch.rt_backfill = 1
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = SA-Revelation
request.ui_dispatch_view = SA-Revelation
search = | tstats summariesonly=true count as numFlows sum(All_Traffic.bytes) as "sumBytes" avg(All_Traffic.bytes) as "avgBytes" sum(All_Traffic.bytes_in) as "bytes_in" avg(All_Traffic.duration) as "avgDuration" sum(All_Traffic.bytes_out) as "bytes_out" dc(All_Traffic.dest_ip) as "uniqueDstIp" dc(All_Traffic.dest_port) as "uniqueDstPort" from datamodel="Network_Traffic" by "All_Traffic.src_ip" _time span=1h | rename "All_Traffic.src_ip" as src | rename avgBytes as x_avgBytes avgDuration as x_avgDuration numFlows as x_numFlows sumBytes as x_sumBytes uniqueDstIp as x_uniqueDstIp uniqueDstPort as x_uniqueDstPort | apply app:base_botnet_scaler | rename SS_* as PC_* | `apply_base_local(botnet)` | `confidence_filter(botnet,0.90,0.80,0.70,0.90)` | `pcr(bytes_in,bytes_out)` | eval pcr_info="pcr_range:\""+pcr_range+"\","+" pcr_ratio: "+pcr_ratio | eval description="{class:botnet, xref:SA-Revelation}", confidence="botnet_probabilty:"+botnet_confidence, threat_key="botnet_src" | table _time src pcr_info probable_class threat_key description confidence | rename probable_class as class | outputlookup bot_intel append=true