[Alert - Volume Anomalies]
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = 0 0,6,12,18 * * *
dispatch.earliest_time = -6h@h
dispatch.latest_time = @h
display.general.type = statistics
display.page.search.mode = fast
display.page.search.tab = statistics
display.visualizations.charting.chart = area
display.visualizations.custom.type = flow_map_viz.flow_map_viz
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = allkun_mon_iso8583
request.ui_dispatch_view = search
search = | tstats count from datamodel=ISO8583.ISO8583 where (ISO8583.tag=response AND ISO8583.tag=end AND (ISO8583.tag=financial OR ISO8583.tag=reversal OR ISO8583.tag=authorization)) groupby _time ISO8583.response_status span=1h\
| `drop_dm_object_name("ISO8583")`\
| timechart span=1h sum(count) as transactions\
| fillnull\
| delta transactions as diff\
| eval threshold=80\
| eval final_value=transactions, initial_value=final_value-diff, perc_diff=if(transactions=0, diff, round((((final_value-initial_value)/initial_value)*100),1)), perc_diff=if(isnull(perc_diff), 100, perc_diff), status=if(abs(perc_diff)>threshold, "Anomaly", "OK"), perc_diff=if(perc_diff>0, "+".perc_diff."%", perc_diff."%")\
| search status="Anomaly" AND diff=*\
| fieldformat threshold=threshold."%"\
| rename initial_value as "Initial Value", final_value as "Final Value", diff as "Difference", threshold as "Threshold", perc_diff as "Perc. Difference"\
| table _time, "Initial Value", "Final Value", "Difference", "Threshold", "Perc. Difference"

[Alert - Low Success Rate]
alert.expires = 4h
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = 5 * * * *
dispatch.earliest_time = -1h@h
dispatch.latest_time = @h
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.charting.chart = area
display.visualizations.custom.type = flow_map_viz.flow_map_viz
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = allkun_mon_iso8583
request.ui_dispatch_view = search
search = | tstats count from datamodel=ISO8583.ISO8583 where (ISO8583.tag=response AND ISO8583.tag=end AND (ISO8583.tag=financial OR ISO8583.tag=reversal OR ISO8583.tag=authorization)) groupby ISO8583.response_status, ISO8583.channel\
| `drop_dm_object_name("ISO8583")`\
| xyseries channel, response_status, count\
| eval success_rate=round(((success/(success+failure))*100),1)\
| table channel success failure success_rate\
| search success_rate<80
