
[cybertriage:alert:response]
CHARSET = UTF-8
SHOULD_LINEMERGE = false
category = Structured
pulldown_type = 1
BREAK_ONLY_BEFORE = [\t]{2}\}(,*[\r\n]+)
DATETIME_CONFIG = 
INDEXED_EXTRACTIONS = none
KV_MODE = json
LINE_BREAKER = [\t]{2}\}(,*[\r\n]+)
NO_BINARY_CHECK = true
description = Json output produced by the Cyber Triage action "scan_endpoint"
disabled = false

[cybertriage]
CHARSET = UTF-8
DATETIME_CONFIG = 
EVAL-action = case(NOT isnull(authAction),authAction,ctType=="User Account", "created", type=="activeNetworkConnection", "allowed")
EVAL-app = case(ctType=="Web artifact" AND match(sourcePath,".*/chrome/.*"),"Chrome", ctType=="Web artifact" AND match(sourcePath, ".*/firefox/.*"),"Firefox")
EVAL-date = if(NOT isnull(malwareAttacksSignature),fn_dateCreated,null)
EVAL-dest = if(((type=="User Login" OR type=="rdpEvent" OR type="activeNetworkConnection") AND lower(direction)=="outgoing") OR ctType=="Web artifact",remoteHostName,hostName)
EVAL-dest_ip = if(type==activeNetworkConnection AND lower(direction)=="incoming",remoteIP,localIP)
EVAL-dest_nt_domain = if((type=="User Login" OR type=="rdpEvent") AND lower(direction)=="outgoing",remoteDomain,userDomain)
EVAL-dest_port = if(lower(direction)=="incoming" AND localPort=="*",remotePort,localPort)
EVAL-file_hash = md5hash
EVAL-file_name = mvindex(split(path,"/"),-1)
EVAL-file_path = mvjoin(mvindex(split(path,"/"),0,-2),"/")
EVAL-object = if(ctType=="User Account",userID,null)
EVAL-object_category = if(ctType=="User Account","user",null)
EVAL-object_id = if(ctType=="User Account",userSID,null)
EVAL-process = case(pid==4, "System", pid!=4,path)
EVAL-process_name = case(pid==4, "System",pid!=4,mvindex(split(path,"/"),-1))
EVAL-service = if(isService=="true",name,null)
EVAL-src = if((type=="User Login" OR type=="rdpEvent" OR type="activeNetworkConnection") AND lower(direction)=="outgoing",remoteHostName,hostName)
EVAL-src_ip = if(type==activeNetworkConnection AND lower(direction)=="incoming",remoteIP,localIP)
EVAL-src_nt_domain = if((type=="User Login" OR type=="rdpEvent") AND lower(direction)=="outgoing",userDomain,null)
EVAL-src_port = if(lower(direction)=="incoming" AND type==activeNetworkConnection,remotePort,localPort)
EVAL-src_user = if((type=="User Login" OR type=="rdpEvent") AND lower(direction)=="outgoing",userID,null)
EVAL-status = if(ctType=="User Account","success",null)
EVAL-user = if((type=="User Login" OR type=="rdpEvent") AND lower(direction)=="outgoing",remoteUser,userID)
EVAL-direction = case(lower(direction)=="incoming","inbound",lower(direction)=="outgoing","outbound")
FIELDALIAS-aob_gen_Cyber_Triage_alias_1 = malwareAttacksSignature AS signature
FIELDALIAS-aob_gen_Cyber_Triage_alias_2 = refURL AS http_referrer
INDEXED_EXTRACTIONS = json
KV_MODE = none
LINE_BREAKER = [\t]{2}\}(,*[\r\n]+)
MAX_DAYS_AGO = 10951
MAX_DAYS_HENCE = 10950
MAX_DIFF_SECS_AGO = 2147483646
MAX_DIFF_SECS_HENCE = 2147483646
MAX_TIMESTAMP_LOOKAHEAD = 45
NO_BINARY_CHECK = true
SHOULD_LINEMERGE = false
TIMESTAMP_FIELDS = time, fn_dateCreated, earliestActivityDate, dateAccessed, dateCreated, sessionId
category = Application
description = Json output produced by the Cyber Triage json report feature
pulldown_type = 1
BREAK_ONLY_BEFORE = [\t]{2}\}(,*[\r\n]+)
disabled = false
