[Summary Index - NetWitness App Status - Sessions by Host (Every 15 min)]
action.email.inline = 1
action.email.reportServerEnabled = 0
action.summary_index = 1
action.summary_index.search = netwitness_session_count_by_host
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
cron_schedule = 5,20,35,50 * * * *
dispatch.earliest_time = -20m@m
dispatch.latest_time = -5m@m
enableSched = 1
realtime_schedule = 0
search = sourcetype="netwitness_query" | sitimechart span=5m count(sessionid) as sessions by host

[Summary Index - NetWitness All Traffic - Sessions by Service (Every 15 min)]
action.email.inline = 1
action.email.reportServerEnabled = 0
action.summary_index = 1
action.summary_index.search = netwitness_all_traffic_sessions_by_service
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
cron_schedule = 4,19,34,49 * * * *
dispatch.earliest_time = -19m@m
dispatch.latest_time = -4m@m
enableSched = 1
realtime_schedule = 0
search = sourcetype="netwitness_query" | sitimechart span=5m count by service usenull=f useother=f | lookup lookup_service service OUTPUT service_alias as service_alias

[Summary Index - NetWitness All Traffic - Top Destination and Service (Every 15 min)]
action.email.inline = 1
action.email.reportServerEnabled = 0
action.summary_index = 1
action.summary_index.search = netwitness_all_traffic_top_destination_service
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
cron_schedule = 3,18,33,48 * * * *
dispatch.earliest_time = -18m@m
dispatch.latest_time = -3m@m
enableSched = 1
realtime_schedule = 0
search = sourcetype=netwitness_query | sitop dest_org dest_country service | lookup lookup_service service OUTPUT service_alias

[Summary Index - NetWitness All Traffic - Top Source IP and Service (Every 15 min)]
action.email.inline = 1
action.summary_index = 1
action.summary_index.search = netwitness_all_traffic_top_srcip_service
alert.suppress = 0
alert.track = 0
cron_schedule = 2,17,32,47 * * * *
dispatch.earliest_time = -17m@m
dispatch.latest_time = -2m@m
enableSched = 1
realtime_schedule = 0
search = sourcetype=netwitness_query | sitop src_ip service | lookup lookup_service service OUTPUT service_alias

[Summary Index - NetWitness HTTP Traffic - Top-Rare Destination Host (Every 15 min)]
action.email.inline = 1
action.summary_index = 1
action.summary_index.search = netwitness_http_traffic_top_rare_dest_host
alert.suppress = 0
alert.track = 0
cron_schedule = 1,16,31,46 * * * *
dispatch.earliest_time = -16m@m
dispatch.latest_time = -1m@m
enableSched = 1
realtime_schedule = 0
search = sourcetype=netwitness_query service=80 | sitop dest_host

[Summary Index - NetWitness HTTP Traffic - Top-Rare User-Agent (Every 15 min)]
action.email.inline = 1
action.summary_index = 1
action.summary_index.search = netwitness_http_traffic_top_rare_http_user_agent
alert.suppress = 0
alert.track = 0
cron_schedule = 6,21,36,51 * * * *
dispatch.earliest_time = -21m@m
dispatch.latest_time = -6m@m
enableSched = 1
realtime_schedule = 0
search = sourcetype=netwitness_query service=80 | sitop http_user_agent

[Summary Index - NetWitness HTTP Traffic - Sessions by TLD (Every 15 min)]
action.email.inline = 1
action.summary_index = 1
action.summary_index.search = netwitness_http_traffic_sessions_by_tld
alert.suppress = 0
alert.track = 0
cron_schedule = 7,22,37,52 * * * *
dispatch.earliest_time = -22m@m
dispatch.latest_time = -7m@m
enableSched = 1
realtime_schedule = 0
search = sourcetype=netwitness_query service=80 | eval tld=lower(tld) | rex field=tld "(?<tld>.*)\." | sitimechart span=5m count by tld usenull=f

[Summary Index - NetWitness HTTP Traffic - Sessions by Server (Every 15 min)]
action.email.inline = 1
action.summary_index = 1
action.summary_index.search = netwitness_http_traffic_sessions_by_server
alert.suppress = 0
alert.track = 0
cron_schedule = 8,23,38,53 * * * *
dispatch.earliest_time = -23m@m
dispatch.latest_time = -8m@m
enableSched = 1
realtime_schedule = 0
search = sourcetype=netwitness_query service=80 | sitimechart span=5m count by server usenull=f

[Summary Index - NetWitness OTHER Traffic - Top Dest Port Proto Domain Org Country (Every 15 min)]
action.email.inline = 1
action.summary_index = 1
action.summary_index.search = netwitness_other_traffic_top_port_proto_domain_org_country
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
cron_schedule = 9,24,39,54 * * * *
dispatch.earliest_time = -24m@m
dispatch.latest_time = -9m@m
enableSched = 1
realtime_schedule = 0
search = sourcetype=netwitness_query service=0 | eval dest_domain=if(isnull(dest_domain),if(match(dest_ip,"(^10\.)|(^192\.168\.)|(^172\.1[6-9]\.)|(^172\.2[0-9]\.)|(^172\.3[0-1]\.)"),"RFC1918",if(isnotnull(dest_org),dest_org, dest_ip)), dest_domain) | eval dest_org=if(isnull(dest_org),dest_domain, dest_org) | eval dest_country=if(isnull(dest_country),dest_org, dest_country)|sitop dest_port,proto,dest_domain,dest_org,dest_country 

[Summary Index - NetWitness OTHER Traffic - Destination Org over time (Every 15 min)]
action.email.inline = 1
action.summary_index = 1
action.summary_index.search = netwitness_other_traffic_dest_org_over_time
alert.suppress = 0
alert.track = 0
cron_schedule = 10,25,40,55 * * * *
dispatch.earliest_time = -25m@m
dispatch.latest_time = -10m@m
enableSched = 1
realtime_schedule = 0
search = sourcetype=netwitness_query service=0 | eval dest_domain=if(isnull(dest_domain),if(match(dest_ip,"(^10\.)|(^192\.168\.)|(^172\.1[6-9]\.)|(^172\.2[0-9]\.)|(^172\.3[0-1]\.)"),"RFC1918",if(isnotnull(dest_org),dest_org, dest_ip)), dest_domain) | eval dest_org=if(isnull(dest_org),dest_domain, dest_org) | eval dest_country=if(isnull(dest_country),dest_org, dest_country) | sitimechart span="5m" count by dest_org usenull=f

[Summary Index - NetWitness FileType Traffic - Top Destination Host Filename Country (Every 15 min)]
action.email.inline = 1
action.summary_index = 1
action.summary_index.search = netwitness_filetype_traffic_top_host_filename_country
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
cron_schedule = 11,26,41,56 * * * *
dispatch.earliest_time = -26m@m
dispatch.latest_time = -11m@m
enableSched = 1
realtime_schedule = 0
search = sourcetype=netwitness_query "x86 pe" OR "windows executable" OR "filetype=java_jar" OR "filetype=java" OR "filetype=jar" OR "filetype=pdf" | rex field=_raw max_match=20 "file_name=\"(?<file_name>[^\"]*)\"" |rex field=_raw max_match=10 "file_name=(?<file_name>[^\"]\S+)" | eval dest_host=if(isnotnull(dest_host), dest_host, dest_ip) | sitop dest_host file_name dest_country filetype

[Summary Index - NetWitness FileType Traffic - Top FileType (Every 15 min)]
action.email.inline = 1
action.summary_index = 1
action.summary_index.search = netwitness_filetype_traffic_top_filetype
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
cron_schedule = 12,27,42,57 * * * *
dispatch.earliest_time = -27m@m
dispatch.latest_time = -12m@m
enableSched = 1
realtime_schedule = 0
search = sourcetype=netwitness_query filetype=* | rex field=_raw max_match=20 "filetype=\"(?<filetype>[^\"]*)\"" |rex field=_raw max_match=10 "filetype=(?<filetype>[^\"]\S+)"  | sitop filetype

[Summary Index - NetWitness FileType Traffic - FileType over Time (Every 15 min)]
action.email.inline = 1
action.summary_index = 1
action.summary_index.search = netwitness_filetype_traffic_filetype_over_time
alert.suppress = 0
alert.track = 0
cron_schedule = 13,28,43,58 * * * *
dispatch.earliest_time = -28m@m
dispatch.latest_time = -13m@m
enableSched = 1
realtime_schedule = 0
search = sourcetype=netwitness_query filetype=* | rex field=_raw max_match=20 "filetype=\"(?<filetype>[^\"]*)\"" |rex field=_raw max_match=10 "filetype=(?<filetype>[^\"]\S+)"  | sitimechart span=5m count by filetype

[Summary Index - NetWitness DNS Traffic - Query over Time (Every 15 min)]
action.email.inline = 1
action.summary_index = 1
action.summary_index.search = netwitness_dns_traffic_dest_host_over_time
alert.suppress = 0
alert.track = 0
cron_schedule = 14,29,44,59 * * * *
dispatch.earliest_time = -29m@m
dispatch.latest_time = -14m@m
enableSched = 1
realtime_schedule = 0
search = sourcetype="netwitness" service=53 | sitimechart span=5m count by dest_host

[Summary Index - NetWitness DNS Traffic - DNS Servers over Time (Every 15 min)]
action.email.inline = 1
action.summary_index = 1
action.summary_index.search = netwitness_dns_traffic_dest_ip_over_time
alert.suppress = 0
alert.track = 0
cron_schedule = 15,30,45,0 * * * *
dispatch.earliest_time = -30m@m
dispatch.latest_time = -15m@m
enableSched = 1
realtime_schedule = 0
search = sourcetype="netwitness" service=53 | sitimechart span=5m count by dest_ip

[Summary Index - NetWitness DNS Traffic - DNS Clients over Time (Every 15 min)]
action.email.inline = 1
action.summary_index = 1
action.summary_index.search = netwitness_dns_traffic_src_ip_over_time
alert.suppress = 0
alert.track = 0
cron_schedule = 15,30,45,0 * * * *
dispatch.earliest_time = -30m@m
dispatch.latest_time = -15m@m
enableSched = 1
realtime_schedule = 0
search = sourcetype="netwitness" service=53 | sitimechart span=5m count by src_ip

[Summary Index - NetWitness SMTP Traffic - Top E-mails (Every 15 min)]
action.email.inline = 1
action.summary_index = 1
action.summary_index.search = netwitness_smtp_traffic_top_email
alert.suppress = 0
alert.track = 0
cron_schedule = 1,16,31,46 * * * *
dispatch.earliest_time = -16m@m
dispatch.latest_time = -1m@m
enableSched = 1
realtime_schedule = 0
search = sourcetype=netwitness_query service=25 | rex field=_raw max_match=20 "email=\"(?<email>[^\"]*)\"" |rex field=_raw max_match=20 "email=(?<email>[^\"]\S+)" | sitop email

[Summary Index - NetWitness SMTP Traffic - Top Sender (Every 15 min)]
action.email.inline = 1
action.summary_index = 1
action.summary_index.search = netwitness_smtp_traffic_top_sender
alert.suppress = 0
alert.track = 0
cron_schedule = 2,17,32,47 * * * *
dispatch.earliest_time = -17m@m
dispatch.latest_time = -2m@m
enableSched = 1
realtime_schedule = 0
search = sourcetype=netwitness_query service=25 | rex field=_raw max_match=20 "sender=\"(?<sender>[^\"]*)\"" |rex field=_raw max_match=20 "sender=(?<sender>[^\"]\S+)" | sitop sender

[Summary Index - NetWitness SMTP Traffic - Top Recipient (Every 15 min)]
action.email.inline = 1
action.summary_index = 1
action.summary_index.search = netwitness_smtp_traffic_top_recipient
alert.suppress = 0
alert.track = 0
cron_schedule = 3,18,33,48 * * * *
dispatch.earliest_time = -18m@m
dispatch.latest_time = -3m@m
enableSched = 1
realtime_schedule = 0
search = sourcetype=netwitness_query service=25 | rex field=_raw max_match=20 "recipient=\"(?<recipient>[^\"]*)\"" |rex field=_raw max_match=20 "recipient=(?<recipient>[^\"]\S+)" | sitop recipient

[Summary Index - NetWitness SMTP Traffic - Top Subject (Every 15 min)]
action.email.inline = 1
action.summary_index = 1
action.summary_index.search = netwitness_smtp_traffic_top_subject
alert.suppress = 0
alert.track = 0
cron_schedule = 4,19,34,49 * * * *
dispatch.earliest_time = -19m@m
dispatch.latest_time = -4m@m
enableSched = 1
realtime_schedule = 0
search = sourcetype=netwitness_query service=25 | sitop subject

[Summary Index - NetWitness SMTP Traffic - Top Attachment (Every 15 min)]
action.email.inline = 1
action.summary_index = 1
action.summary_index.search = netwitness_smtp_traffic_top_attachment
alert.suppress = 0
alert.track = 0
cron_schedule = 5,20,35,50 * * * *
dispatch.earliest_time = -20m@m
dispatch.latest_time = -5m@m
enableSched = 1
realtime_schedule = 0
search = sourcetype=netwitness_query service=25 |  rex field=_raw max_match=10 "attachment=\"(?<attachment>[^\"]*)\"" | rex field=_raw max_match=10 "attachment=(?<attachment>[^\"]\S+)"  | sitop attachment

[Summary Index - NetWitness SMTP Traffic - Destination Organisation over Time (Every 15 min)]
action.email.inline = 1
action.summary_index = 1
action.summary_index.search = netwitness_smtp_traffic_dest_org_over_time
alert.suppress = 0
alert.track = 0
cron_schedule = 6,21,36,51 * * * *
dispatch.earliest_time = -21m@m
dispatch.latest_time = -6m@m
enableSched = 1
realtime_schedule = 0
search = sourcetype=netwitness_query service=25 | sitimechart span=5m count by dest_org
