##############################################################################
# THREAT DATA REPORT (TDR) PARSING
##############################################################################

[threat]
category = Custom
TRANSFORMS-devicehostname_ns = protecthostname_ns
INDEXED_EXTRACTIONS = json
KV_MODE = none
AUTO_KV_JSON = false
NO_BINARY_CHECK = 1
TIMESTAMP_FIELDS = "Last Found"
pulldown_type = 1

# Malware CIM Tagging
LOOKUP-action = protect_cim_status_to_action_lookup "File Status" OUTPUT action
FIELDALIAS-classification = Classification AS category
FIELDALIAS-lastFound = "Last Found" AS date
FIELDALIAS-deviceName = "DeviceName" AS dest
FIELDALIAS-fileHash = "SHA256" AS file_hash
FIELDALIAS-fileName = "File Name" AS file_name
FIELDALIAS-filePath = "File Path" AS file_path
FIELDALIAS-severity_id = "Cylance Score" AS severity_id
FIELDALIAS-classification2 = Classification AS signature
FIELDALIAS-detectedBy = "Detected By" AS src
FIELDALIAS-fileOwner = "File Owner" AS user
EVAL-vendor_product = "CylancePROTECT"


[device]
category = Custom
TRANSFORMS-devicehostname = protecthostname
INDEXED_EXTRACTIONS = json
KV_MODE = none
AUTO_KV_JSON = false
NO_BINARY_CHECK = 1
TIMESTAMP_FIELDS = "Last Communicated"
pulldown_type = 1

# Inventory CIM Tagging
FIELDALIAS-dest = "Device Name" AS dest
FIELDALIAS-dest_bunit = "Zones" AS dest_bunit
FIELDALIAS-dest_category = "Policy" AS dest_category
FIELDALIAS-ip = "IP Addresses" AS ip
FIELDALIAS-mac = "Mac Addresses" AS mac
FIELDALIAS-os = "OS Version" AS os
FIELDALIAS-user = "Last Reported User" AS user
FIELDALIAS-serial = "Serial Number" AS serial
FIELDALIAS-version = "Agent Version" AS version


[threat_indicator]
category = Custom
INDEXED_EXTRACTIONS = json
KV_MODE = none
AUTO_KV_JSON = false
NO_BINARY_CHECK = 1
TIMESTAMP_FIELDS = time
pulldown_type = 1


[event]
category = Custom
TRANSFORMS-eventhostname = protecthostname
INDEXED_EXTRACTIONS = json
KV_MODE = none
AUTO_KV_JSON = false
NO_BINARY_CHECK = 1
TIMESTAMP_FIELDS = "Date"
pulldown_type = 1


##############################################################################
# SYSLOG PARSING
##############################################################################

[syslog_protect]
TRANSFORMS-changesourcetype = set_auditlog_sourcetype
TRANSFORMS-changesourcetype2 = set_threatclassification_sourcetype
TRANSFORMS-changesourcetype3 = set_exploit_sourcetype
TRANSFORMS-changesourcetype4 = set_appcontrol_sourcetype
TRANSFORMS-changesourcetype5 = set_threat_sourcetype
TRANSFORMS-changesourcetype6 = set_device_sourcetype
TRANSFORMS-changesourcetype7 = set_devicecontrol_sourcetype
TRANSFORMS-changesourcetype8 = set_scriptcontrol_sourcetype
TRANSFORMS-changesourcetype9 = set_optics_sourcetype
TRANSFORMS-changesourcetype10 = set_mobile_sourcetype
TRANSFORMS-console_syslog_hostname = protecthostname_syslog
NO_BINARY_CHECK = true
category = Custom
description = CylancePROTECT Syslog Data
disabled = false
pulldown_type = true
# Common
EXTRACT-EventType = Event\sType:\s+(?P<EventType>\w+)
EXTRACT-EventName = Event\sName:\s+(?P<EventName>\w+)
EXTRACT-SHA256 = \sSHA256:\s(?<SHA256>[^,]*+)
EXTRACT-FilePath = Path:\s+(?P<FilePath>[^,]+)
FIELDALIAS-source = "source" AS Tenant


[syslog_device_control]
# Device Control
NO_BINARY_CHECK = true
category = Custom
description = CylancePROTECT Syslog Device Control
disabled = false
pulldown_type = true
TRANSFORMS-console_syslog_hostname = protecthostname_syslog
EXTRACT-EventName = Event\sName:\s(?P<EventName>.*?),
EXTRACT-DeviceName = Device\sName:\s(?P<DeviceName>.*?),
EXTRACT-ExternalDeviceType = External\sDevice\sType:\s(?P<ExternalDeviceType>.*?),
EXTRACT-ExternalDeviceVendorID = External\sDevice\sVendor\sID:\s(?P<ExternalDeviceVendorID>.*?),
EXTRACT-ExternalDeviceName = External\sDevice\sName:\s(?P<ExternalDeviceName>.*?),
EXTRACT-ExternalDeviceProductID = External\sDevice\sProduct\sID:\s(?P<ExternalDeviceProductID>.*?),
EXTRACT-ExternalDeviceSN = External\sDevice\sSerial\sNumber:\s(?P<ExternalDeviceSN>.*?),
EXTRACT-ZoneNames = \sZone\sNames:\s\((?P<ZoneNames>.*?)\)
EXTRACT-DeviceID = Device\sId:\s(?<DeviceID>(\w){8}-(\w){4}-(\w){4}-(\w){4}-(\w){12})
EXTRACT-PolicyName = Policy\sName:\s(?<PolicyName>.*)
FIELDALIAS-source = "source" AS Tenant

# Malware CIM Tagging
LOOKUP-eventname_action = protect_cim_eventname_to_action_lookup "EventName" OUTPUT action
FIELDALIAS-dest = "host" AS dest
FIELDALIAS-src = ExternalDeviceName AS src
FIELDALIAS-category = ExternalDeviceType AS category
FIELDALIAS-dest_bunit = ZoneNames AS dest_bunit
EVAL-vendor_product = "CylancePROTECT"


[syslog_app_control]
# Application Control
NO_BINARY_CHECK = true
category = Custom
description = CylancePROTECT Syslog App Control
disabled = false
pulldown_type = true
TRANSFORMS-console_syslog_hostname = protecthostname_syslog
EXTRACT-DeviceName = Device\sName:\s+(?P<DeviceName>.*?),
EXTRACT-EventType = Event\sType:\s+(?P<EventType>.*?),
EXTRACT-EventName = Event\sName:\s+(?P<EventName>.*?),
EXTRACT-SHA256 = \sSHA256:\s(?<SHA256>[^,]*+)
#EXTRACT-FilePath = (?=[^P]*(?:Path:|P.*Path:))^(?:[^,\n]*,){5}\s+\w+:\s+(?P<FilePath>[^,]+)
EXTRACT-FilePath = \sFile\sPath:\s(?<FilePath>.*?),\s
#EXTRACT-IP = (?=[^I]*(?:IP Address:|I.*IP Address:))^[^\(\n]*\((?P<IP>[^\)]+)
EXTRACT-IPv4 = \sIP\sAddress:\s\((?<ipv4>\d{1,3}\.\d{1,3}\.\d{1,3}\.\d{1,3}(,\s\d{1,3}\.\d{1,3}\.\d{1,3}\.\d{1,3})*)
EXTRACT-IPv6 = \sIP\sAddress:\s\(.*?(?<ipv6>(([0-9a-fA-F]{1,4}:){7,7}[0-9a-fA-F]{1,4}|([0-9a-fA-F]{1,4}:){1,7}:|([0-9a-fA-F]{1,4}:){1,6}:[0-9a-fA-F]{1,4}|([0-9a-fA-F]{1,4}:){1,5}(:[0-9a-fA-F]{1,4}){1,2}|([0-9a-fA-F]{1,4}:){1,4}(:[0-9a-fA-F]{1,4}){1,3}|([0-9a-fA-F]{1,4}:){1,3}(:[0-9a-fA-F]{1,4}){1,4}|([0-9a-fA-F]{1,4}:){1,2}(:[0-9a-fA-F]{1,4}){1,5}|[0-9a-fA-F]{1,4}:((:[0-9a-fA-F]{1,4}){1,6})|:((:[0-9a-fA-F]{1,4}){1,7}|:)|fe80:(:[0-9a-fA-F]{0,4}){0,4}%[0-9a-zA-Z]{1,}|::(ffff(:0{1,4}){0,1}:){0,1}((25[0-5]|(2[0-4]|1{0,1}[0-9]){0,1}[0-9])\.){3,3}(25[0-5]|(2[0-4]|1{0,1}[0-9]){0,1}[0-9])|([0-9a-fA-F]{1,4}:){1,4}:((25[0-5]|(2[0-4]|1{0,1}[0-9]){0,1}[0-9])\.){3,3}(25[0-5]|(2[0-4]|1{0,1}[0-9]){0,1}[0-9])))
EXTRACT-ZoneNames = \sZone\sNames:\s\((?P<ZoneNames>.*?)\)
EXTRACT-Action = (?=[^A]*(?:Action:|A.*Action:))^[^\)\n]*\),\s+\w+:\s+(?P<Action>\w+)
EXTRACT-ActionType = \sAction\sType:\s((?P<ActionType>[^)]+))
FIELDALIAS-source = "source" AS Tenant
EXTRACT-DeviceID = Device\sId:\s(?<DeviceID>(\w){8}-(\w){4}-(\w){4}-(\w){4}-(\w){12})
EXTRACT-PolicyName = Policy\sName:\s(?<PolicyName>.*)

# Malware CIM Tagging
LOOKUP-appcontrol_action = protect_cim_actiontype_to_action_lookup "Action Type" OUTPUT action
FIELDALIAS-category = Action AS category
FIELDALIAS-category_action = ActionType ASNEW action
FIELDALIAS-dest = "host" AS dest
FIELDALIAS-dest_bunit = ZoneNames AS dest_bunit
FIELDALIAS-src = IPv4 AS src
FIELDALIAS-file_hash = SHA256 AS file_hash
FIELDALIAS-file_path = FilePath AS file_path
EVAL-vendor_product = "CylancePROTECT"


[syslog_audit_log] # CIM MODEL = alert
# Audit log
NO_BINARY_CHECK = true
category = Custom
description = CylancePROTECT Syslog Audit Log
disabled = false
pulldown_type = true
EXTRACT-EventType = Event\sType:\s+(?P<EventType>\w+)
EXTRACT-EventName = Event\sName:\s+(?P<EventName>\w+)
EXTRACT-Category = Category:\s(?P<Category>.*?),
EXTRACT-Message = (?=[^M]*(?:Message:|M.*Message:))^(?:[^:\n]*:){9}\s+(?P<Message>[^,]+)
EXTRACT-Reason = \sReason:\s((?P<Reason>[^)]+))
#EXTRACT-User = (?=[^U]*(?:User:|U.*User:))^[^\(\n]*\((?P<User>\w+@\w+\.\w+)
EXTRACT-UserName = User:\s(?<UserName>.*?\))
EXTRACT-ipv4 = Source\sIP:\s(?<ipv4>.*?),
EXTRACT-DeviceName = Device:\s(?<DeviceName>.*?)(,|;)
EXTRACT-Provider = Provider:\s(?<Provider>.*?),
EXTRACT-SHA256 = SHA256:\s(?<SHA256>.*?);
EXTRACT-agent_version = Agent\sVersion:\s+(?P<agent_version>.*?),
EXTRACT-tier = Tier:\s+(?P<tier>.*?);
FIELDALIAS-source = "source" AS Tenant

# Alert CIM Tagging
EVAL-app = "CylancePROTECT"
FIELDALIAS-body = Message AS description
EVAL-dest = coalesce(ipv4, DeviceName)
EVAL-severity = "informational"
FIELDALIAS-src = UserName AS src
FIELDALIAS-src_category  = Reason AS src_category
FIELDALIAS-subject = EventName AS signature
EVAL-type = "event"


[syslog_device]
# Devices
NO_BINARY_CHECK = true
category = Custom
description = CylancePROTECT Syslog Device
disabled = false
pulldown_type = true
# Common
EXTRACT-EventType = Event\sType:\s+(?P<EventType>\w+)
EXTRACT-EventName = Event\sName:\s+(?P<EventName>.*?),
EXTRACT-DeviceName = \sDevice\sName:\s(?<DeviceName>.*?),\s
EXTRACT-DeviceRenamed = \sRenamed:\s(?<DeviceName>\'.*?\'),\s #'
EXTRACT-AgentVersion = \sAgent\sVersion:\s(?<AgentVersion>.*?),\s
EXTRACT-ZoneNames = \sZone\sNames:\s\((?P<ZoneNames>.*?)\)
EXTRACT-IPv4 = \sIP\sAddress:\s\((?<ipv4>\d{1,3}\.\d{1,3}\.\d{1,3}\.\d{1,3}(,\s\d{1,3}\.\d{1,3}\.\d{1,3}\.\d{1,3})*)
EXTRACT-IPv6 = \sIP\sAddress:\s\(.*?(?<ipv6>(([0-9a-fA-F]{1,4}:){7,7}[0-9a-fA-F]{1,4}|([0-9a-fA-F]{1,4}:){1,7}:|([0-9a-fA-F]{1,4}:){1,6}:[0-9a-fA-F]{1,4}|([0-9a-fA-F]{1,4}:){1,5}(:[0-9a-fA-F]{1,4}){1,2}|([0-9a-fA-F]{1,4}:){1,4}(:[0-9a-fA-F]{1,4}){1,3}|([0-9a-fA-F]{1,4}:){1,3}(:[0-9a-fA-F]{1,4}){1,4}|([0-9a-fA-F]{1,4}:){1,2}(:[0-9a-fA-F]{1,4}){1,5}|[0-9a-fA-F]{1,4}:((:[0-9a-fA-F]{1,4}){1,6})|:((:[0-9a-fA-F]{1,4}){1,7}|:)|fe80:(:[0-9a-fA-F]{0,4}){0,4}%[0-9a-zA-Z]{1,}|::(ffff(:0{1,4}){0,1}:){0,1}((25[0-5]|(2[0-4]|1{0,1}[0-9]){0,1}[0-9])\.){3,3}(25[0-5]|(2[0-4]|1{0,1}[0-9]){0,1}[0-9])|([0-9a-fA-F]{1,4}:){1,4}:((25[0-5]|(2[0-4]|1{0,1}[0-9]){0,1}[0-9])\.){3,3}(25[0-5]|(2[0-4]|1{0,1}[0-9]){0,1}[0-9])))
EXTRACT-SHA256 = \sSHA256:\s(?<SHA256>[^,]*+)
EXTRACT-FilePath = Path:\s+(?P<FilePath>[^,]+)
FIELDALIAS-source = "source" AS Tenant
EXTRACT-MAC = (?=[^M]*(?:MAC Address:|M.*MAC Address:))^(?:[^\(\n]*\(){2}(?P<MAC>[^\)]+)
EXTRACT-LoggedOnUser = (?=[^L]*(?:Logged On Users:|L.*Logged On Users:))^(?:[^\(\n]*\(){3}(?P<LoggedOnUser>[^\)]+)
EXTRACT-User = User:\s(?P<User>.*?),
EXTRACT-OS = OS:\s(?P<OS>.*),\s
EXTRACT-DeviceNames = (?=[^D]*(?:Device Names:|D.*Device Names:))^[^\(\n]*\((?P<DeviceName>[^\)]+)
EXTRACT-Device = Device:\s(?<DeviceName>.*?)\;
EXTRACT-DeviceID = Device\sId:\s(?<DeviceID>(\w){8}-(\w){4}-(\w){4}-(\w){4}-(\w){12})
EXTRACT-PolicyName = Policy\sName:\s(?<PolicyName>.*)
# TODO: Device Updated
EXTRACT-Policy = Policy\sName:\s(?P<Policy>.*?),
EXTRACT-PolicyChange = Policy\sChanged:\s\'.*?\'\sto\s\'(?P<Policy>.*?)\' #'

# Inventory CIM Tagging
FIELDALIAS-mac = MAC AS mac
FIELDALIAS-os = OS AS os
EVAL-user = coalesce(LoggedOnUser, User)
FIELDALIAS-dest = DeviceName as dest
FIELDALIAS-dest_ip = ipv4 as dest_ip
FIELDALIAS-dest_bunit = ZoneNames as dest_bunit
EVAL-vendor_product = "CylancePROTECT"
FIELDALIAS-version = AgentVersion as version


[syslog_exploit]
# Memory Protection
NO_BINARY_CHECK = true
category = Custom
description = CylancePROTECT Syslog Exploit Attempt
disabled = false
pulldown_type = true
TRANSFORMS-console_syslog_hostname = protecthostname_syslog
EXTRACT-EventType = Event\sType:\s+(?P<EventType>\w+)
EXTRACT-EventName = Event\sName:\s+(?P<EventName>\w+)
#EXTRACT-IP = (?=[^I]*(?:IP Address:|I.*IP Address:))^[^jk\(\n]*\((?P<IP>[^\)]+)
EXTRACT-IPv4 = \sIP\sAddress:\s\((?<ipv4>\d{1,3}\.\d{1,3}\.\d{1,3}\.\d{1,3}(,\s\d{1,3}\.\d{1,3}\.\d{1,3}\.\d{1,3})*)
EXTRACT-IPv6 = \sIP\sAddress:\s\(.*?(?<ipv6>(([0-9a-fA-F]{1,4}:){7,7}[0-9a-fA-F]{1,4}|([0-9a-fA-F]{1,4}:){1,7}:|([0-9a-fA-F]{1,4}:){1,6}:[0-9a-fA-F]{1,4}|([0-9a-fA-F]{1,4}:){1,5}(:[0-9a-fA-F]{1,4}){1,2}|([0-9a-fA-F]{1,4}:){1,4}(:[0-9a-fA-F]{1,4}){1,3}|([0-9a-fA-F]{1,4}:){1,3}(:[0-9a-fA-F]{1,4}){1,4}|([0-9a-fA-F]{1,4}:){1,2}(:[0-9a-fA-F]{1,4}){1,5}|[0-9a-fA-F]{1,4}:((:[0-9a-fA-F]{1,4}){1,6})|:((:[0-9a-fA-F]{1,4}){1,7}|:)|fe80:(:[0-9a-fA-F]{0,4}){0,4}%[0-9a-zA-Z]{1,}|::(ffff(:0{1,4}){0,1}:){0,1}((25[0-5]|(2[0-4]|1{0,1}[0-9]){0,1}[0-9])\.){3,3}(25[0-5]|(2[0-4]|1{0,1}[0-9]){0,1}[0-9])|([0-9a-fA-F]{1,4}:){1,4}:((25[0-5]|(2[0-4]|1{0,1}[0-9]){0,1}[0-9])\.){3,3}(25[0-5]|(2[0-4]|1{0,1}[0-9]){0,1}[0-9])))
EXTRACT-Action = Action:\s(?<Action>.*?),
EXTRACT-DeviceName = Device\sName:\s(?<DeviceName>.*?),
EXTRACT-PID = Process\sID:\s(?<PID>.*?),
EXTRACT-ProcessName = Process\sName:\s(?<ProcessName>.*?),
EXTRACT-UserName = User\sName:\s(?<UserName>.*?),
#EXTRACT-UserName = (?=[^U]*(?:User Name:|U.*User Name:))^(?:[^,\n]*,){7}\s+\w+\s+\w+:\s+(?P<User>\w+)
#EXTRACT-ViolationType = (?=[^V]*(?:Violation Type:|V.*Violation Type:))^(?:[^,\n]*,){8}\s+\w+\s+\w+:\s+(?P<ViolationType>\w+\s+\w+)
EXTRACT-ViolationType = Violation\sType:\s(?<ViolationType>.*?),
EXTRACT-ZoneNames = \sZone\sNames:\s\((?P<ZoneNames>.*?)\)
FIELDALIAS-source = "source" AS Tenant
EXTRACT-DeviceID = Device\sId:\s(?<DeviceID>(\w){8}-(\w){4}-(\w){4}-(\w){4}-(\w){12})
EXTRACT-PolicyName = Policy\sName:\s(?<PolicyName>.*)

# Malware CIM Tagging
LOOKUP-exploit_action = protect_cim_action_to_action_lookup "Action" OUTPUT action
FIELDALIAS-category = ViolationType AS category
FIELDALIAS-dest = "host" AS dest
FIELDALIAS-dest_ip = ipv4 AS src
FIELDALIAS-dest_bunit = ZoneNames AS dest_bunit
FIELDALIAS-file_path = ProcessName AS file_path
FIELDALIAS-user = UserName AS user
EVAL-vendor_product = "CylancePROTECT"


[syslog_script_control]
# Script Control
NO_BINARY_CHECK = true
category = Custom
description = CylancePROTECT Syslog Script Control
disabled = false
pulldown_type = true
EXTRACT-EventType = Event\sType:\s+(?P<EventType>\w+)
EXTRACT-EventName = Event\sName:\s+(?P<EventName>\w+)
EXTRACT-DeviceName = \sDevice\sName:\s(?<DeviceName>.*?),\s
EXTRACT-FilePath = ^(?:[^,\n]*,){3}\s+(?P<FilePath>[^,]+)
EXTRACT-Interpreter = \sInterpreter:\s(?<Interpreter>.*?),\s
EXTRACT-InterpreterVersion = \sInterpreter\sVersion:\s(?<InterpreterVersion>.*?),\s
EXTRACT-ZoneNames = \sZone\sNames:\s\((?P<ZoneNames>.*?)\)
EXTRACT-UserName = User\sName:\s(?<UserName>.*?),
FIELDALIAS-source = "source" AS Tenant
EXTRACT-DeviceID = Device\sId:\s(?<DeviceID>(\w){8}-(\w){4}-(\w){4}-(\w){4}-(\w){12})
EXTRACT-PolicyName = Policy\sName:\s(?<PolicyName>.*)

# Malware CIM Tagging
FIELDALIAS-user = UserName AS user
FIELDALIAS-dest = DeviceName as dest
FIELDALIAS-src = ipv4 as src
FIELDALIAS-dest_bunit = ZoneNames AS dest_bunit
FIELDALIAS-file_path = FilePath as file_path
FIELDALIAS-EventName = EventName as action
EVAL-vendor_product = "CylancePROTECT"


[syslog_threat]
# Threats
NO_BINARY_CHECK = true
category = Custom
description = CylancePROTECT Syslog Threat
disabled = false
pulldown_type = true
# Common
EXTRACT-EventType = Event\sType:\s+(?P<EventType>\w+)
EXTRACT-EventName = Event\sName:\s+(?P<EventName>\w+)
EXTRACT-DeviceName = \sDevice\sName:\s(?<DeviceName>.*?),\s
EXTRACT-IPv4 = \sIP\sAddress:\s\((?<ipv4>\d{1,3}\.\d{1,3}\.\d{1,3}\.\d{1,3}(,\s\d{1,3}\.\d{1,3}\.\d{1,3}\.\d{1,3})*)
EXTRACT-IPv6 = \sIP\sAddress:\s\(.*?(?<ipv6>(([0-9a-fA-F]{1,4}:){7,7}[0-9a-fA-F]{1,4}|([0-9a-fA-F]{1,4}:){1,7}:|([0-9a-fA-F]{1,4}:){1,6}:[0-9a-fA-F]{1,4}|([0-9a-fA-F]{1,4}:){1,5}(:[0-9a-fA-F]{1,4}){1,2}|([0-9a-fA-F]{1,4}:){1,4}(:[0-9a-fA-F]{1,4}){1,3}|([0-9a-fA-F]{1,4}:){1,3}(:[0-9a-fA-F]{1,4}){1,4}|([0-9a-fA-F]{1,4}:){1,2}(:[0-9a-fA-F]{1,4}){1,5}|[0-9a-fA-F]{1,4}:((:[0-9a-fA-F]{1,4}){1,6})|:((:[0-9a-fA-F]{1,4}){1,7}|:)|fe80:(:[0-9a-fA-F]{0,4}){0,4}%[0-9a-zA-Z]{1,}|::(ffff(:0{1,4}){0,1}:){0,1}((25[0-5]|(2[0-4]|1{0,1}[0-9]){0,1}[0-9])\.){3,3}(25[0-5]|(2[0-4]|1{0,1}[0-9]){0,1}[0-9])|([0-9a-fA-F]{1,4}:){1,4}:((25[0-5]|(2[0-4]|1{0,1}[0-9]){0,1}[0-9])\.){3,3}(25[0-5]|(2[0-4]|1{0,1}[0-9]){0,1}[0-9])))
EXTRACT-SHA256 = \sSHA256:\s(?<SHA256>[^,]*+)
EXTRACT-FilePath = Path:\s+(?P<FilePath>[^,]+)
EXTRACT-DeviceID = Device\sId:\s(?<DeviceID>(\w){8}-(\w){4}-(\w){4}-(\w){4}-(\w){12})
EXTRACT-PolicyName = Policy\sName:\s(?<PolicyName>.*)
FIELDALIAS-source = "source" AS Tenant
# Threat
EXTRACT-FileName = File\s\Name:\s+(?P<FileName>[^,]+)
EXTRACT-Status = Status:\s+(?P<Status>\w+)
EXTRACT-Score = Score:\s+(?P<Score>\d+)
EXTRACT-Found = Found\sDate:\s+(?P<Found>[^,]+)
EXTRACT-FileType = File\sType:\s+(?P<FileType>\w+)
EXTRACT-IsRunning = \sIs\sRunning:\s(?P<IsRunning>[^,]+)
EXTRACT-IsMalware = \sIs\sMalware:\s(?P<IsMalware>[^,]+)
EXTRACT-IsUnique = \sIs\sUnique\sTo\sCylance:\s(?P<IsUnique>[^,]+)
EXTRACT-AutoRun = \sAuto\sRun:\s(?P<AutoRun>[^,]+)
EXTRACT-DetectedBy = \sDetected\sBy:\s(?P<DetectedBy>[^,]+)
EXTRACT-ZoneNames = \sZone\sNames:\s\((?P<ZoneNames>.*?)\)
EXTRACT-ThreatClassification = \sThreat\sClassification:\s(?P<ThreatClassification>[^,]+)

# Malware CIM Tagging
LOOKUP-action = protect_cim_status1_to_action_lookup "Status" OUTPUT action
FIELDALIAS-file_name = FileName AS file_name
FIELDALIAS-src = DetectedBy AS src
FIELDALIAS-file_path = FilePath AS file_path
FIELDALIAS-file_hash = SHA256 AS file_hash
FIELDALIAS-dest = "host" AS dest
EVAL-vendor_product = "CylancePROTECT"


[syslog_threat_classification]
# Threat Classifications
NO_BINARY_CHECK = true
category = Custom
description = CylancePROTECT Syslog Threat Classification
disabled = false
pulldown_type = true
EXTRACT-EventType = Event\sType:\s+(?P<EventType>\w+)
EXTRACT-EventName = Event\sName:\s+(?P<EventName>\w+)
EXTRACT-Class = (?=[^T]*(?:Threat Class:|T.*Threat Class:))^(?:[^:\n]*:){9}\s+(?P<Class>\w+)
EXTRACT-Subclass = (?=[^T]*(?:Threat Subclass:|T.*Threat Subclass:))^(?:[^:\n]*:){10}\s+(?P<Subclass>\w+)
EXTRACT-SHA256 = \sSHA256:\s(?<SHA256>[^,]*+)
thFIELDALIAS-source = "source" AS Tenant

# Malware CIM Tagging
FIELDALIAS-fileHash = SHA256 AS file_hash
FIELDALIAS-threatcat = Class as category
FIELDALIAS-subclass = Subclass as signature


[syslog_optics]
# Script Control
NO_BINARY_CHECK = true
category = Custom
description = CylancePROTECT Syslog Optics Events
disabled = false
pulldown_type = true
EXTRACT-EventType = Event\sType:\s+(?P<EventType>\w+)
EXTRACT-EventName = Event\sName:\s+(?P<EventName>\w+)
EXTRACT-DeviceName = \sDevice\sName:\s(?<DeviceName>.*?),\s
EXTRACT-EventId = \sEvent\sId:\s(?<EventId>.*?),\s
EXTRACT-Severity = \sSeverity:\s(?<Severity>.*?),\s
EXTRACT-Description = \sDescription:\s(?<Description>.*?),\s
EXTRACT-InstigatingProcessName = \sInstigating\sProcess\sName:\s(?<InstigatingProcessName>.*?),\s
EXTRACT-InstigatingProcessOwner = \sInstigating\sProcess\sOwner:\s(?<InstigatingProcessOwner>.*?),\s
EXTRACT-InstigatingProcessHash = \sInstigating\sProcess\sImageFileSha256:\s(?<InstigatingProcessHash>.*?)(,\s|$)
EXTRACT-TargetProcessName = \sTarget\sProcess\sName:\s(?<TargetProcessName>.*?),\s
EXTRACT-TargetProcessOwner = \sTarget\sProcess\sOwner:\s(?<TargetProcessOwner>.*?),\s
EXTRACT-TargetProcessHash = \sTarget\sProcess\sImageFileSha256:\s(?<TargetProcessHash>.*?)(,\s|$)
EXTRACT-TargetRegistryKeyPath = \sTarget\sRegistry\sKeyPath:\s(?<TargetRegistryKeyPath>.*?)(,\s|$)
EXTRACT-TargetRegistryValueName = \sTarget\sRegistry\sValueName:\s(?<TargetRegistryValueName>.*?),\s
EXTRACT-TargetFilePath = \sTarget\sFile\sPath:\s(?<TargetFilePath>.*?),\s
EXTRACT-TargetFileOwner = \sTarget\sFile\sOwner:\s(?<TargetFileOwner>.*?),\s
EXTRACT-TargetFileHash = \sTarget\sFile\sSha256:\s(?<TargetFileHash>.*?),\s
EXTRACT-DestinationIP = \sDestination\sIP:\s(?<DestinationIP>.*?),\s
EXTRACT-DestinationPort = \sDestination\sPort:\s(?<DestinationPort>.*?)(,\s|$)
EXTRACT-ZoneNames = \sZone\sNames:\s\((?P<ZoneNames>.*?)\)
EXTRACT-DeviceID = Device\sId:\s(?<DeviceID>(\w){8}-(\w){4}-(\w){4}-(\w){4}-(\w){12})
EXTRACT-PolicyName = Policy\sName:\s(?<PolicyName>.*)
# OpticsCaeWmiEvent specific
EXTRACT-ConsumerText = Consumer\sText:\s(?<ConsumerText>.*?),\sConsumer\sText\sLength:
EXTRACT-ConsumerTextLength = Consumer\sText\sLength:\s(?<ConsumerTextLength>.*?),\s
EXTRACT-Operation = Operation:\s(?<Operation>.*?),\sOperation\sLength:
EXTRACT-OperationLength = Operation\sLength:\s(?<OperationLength>.*?),\s
# OpticsCaeDnsEvent specific
EXTRACT-TargetDomainName = Target\sDomain\sName:\s(?<TargetDomainName>.*?),\s
EXTRACT-ResolvedAddress = Resolved\sAddress:\s(?<ResolvedAddress>.*?),\sResolved\sAddress\sCount:
EXTRACT-ResolvedAddressCount = Resolved\sAddress\sCount:\s(?<ResolvedAddressCount>.*?),\s
# OpticsPowershellTraceEvent specific
EXTRACT-ScriptBlockText = Script\sBlock\sText:\s(?<ScriptBlockText>.*?),\sScript\sBlock\sLength:
EXTRACT-ScriptBlockLength = Script\sBlock\sLength:\s(?<ScriptBlockLength>.*?),
EXTRACT-Payload = Payload:\s(?<Payload>.*?),\s
EXTRACT-PayloadLength = Payload\sLength:\s(?<PayloadLength>.*?),\s
# OpticsCaeLogEvent specific
EXTRACT-WindowsEventId = Windows\sEvent\sId:\s(?<WindowsEventId>.*?),\s
EXTRACT-SecurityProvider = Security\sProvider:\s(?<SecurityProvider>.*?),\s
FIELDALIAS-source = "source" AS Tenant

# Malware CIM Tagging
FIELDALIAS-category = Description AS category
FIELDALIAS-dest = "host" as dest
FIELDALIAS-dest_bunit = ZoneNames AS dest_bunit
EVAL-file_name = coalesce(InstigatingProcessName, TargetProcessName)
EVAL-file_hash = coalesce(InstigatingProcessHash, TargetProcessHash, TargetFileHash)
EVAL-file_path = coalesce(TargetFilePath, TargetProcessName, InstigatingProcessName)
FIELDALIAS-severity = Severity AS severity
FIELDALIAS-signature = Description AS signature
FIELDALIAS-signature_id = EventId AS signature_id
FIELDALIAS-src = DestinationIP AS src
EVAL-user = coalesce(InstigatingProcessOwner, TargetProcessOwner, TargetFileOwner)
EVAL-vendor_product = "CylancePROTECT"


[syslog_mobile]
# Protect Mobile Alerts
NO_BINARY_CHECK = true
category = Custom
description = CylancePROTECT Syslog Protect Mobile Events
disabled = false
pulldown_type = true
# Alert ID - Unique ID associated with the mobile alert (TODO: is this a SHA256?)
EXTRACT-AlertID = \sAlert\sID:\s(?<AlertID>.*?),\s
# Alert Name - One of 11 static or dynamic strings based on the Alert Type and platform (iOS/Android)
EXTRACT-AlertName = \sAlert\sName:\s(?<AlertName>.*?),\s
# Alert Status - either "New" or "Resolved"
EXTRACT-AlertStatus = \sAlert\sStatus:\s(?<AlertStatus>.*?),\s
# Alert Type - One of 9 strings defining the type of alert
EXTRACT-AlertType = \sAlert\sType:\s(?<AlertType>.*?),\s
# Description - One of 10 formats of comma-sep values, not terminated with any specific string
#   (TODO: Figure out how this is terminated; maybe there's no spaces between CSV value commas?)
#   For now only extract the first parameter, following precendent in this file
EXTRACT-Description = \sDescription:\s(?<Description>.*?),\s
# Detected - Date and time alert was detected
#   following "Found" example in threats, above
EXTRACT-Detected = Detected:\s+(?P<Detected>[^,]+)
# Device Id - Unique ID of user's device (TODO: does this follow hyphenated UUID format with Mobile events?)
EXTRACT-DeviceID = Device\sId:\s(?<DeviceID>(\w){8}-(\w){4}-(\w){4}-(\w){4}-(\w){12})
# Device Name - Name of the user's mobile device
EXTRACT-DeviceName = \sDevice\sName:\s(?<DeviceName>.*?),\s
# Event Type - Always "MobileAlert"
EXTRACT-EventType = Event\sType:\s(?P<EventType>.*?),
# Event Name - Always "MobileAlert"
EXTRACT-EventName = Event\sName:\s(?P<EventName>.*?),
# First Name - first name of device user
EXTRACT-FirstName = \sFirst\sName:\s(?<FirstName>.*?),\s
# Last Name - last name of device user
EXTRACT-LastName = \sLast\sName:\s(?<LastName>[^,]+)
#Required for Tenant field on dashboards
FIELDALIAS-source = "source" AS Tenant

# Alert CIM Tagging
EVAL-app = "CylancePROTECT"
FIELDALIAS-description = Description as description
FIELDALIAS-id = AlertID as id
FIELDALIAS-signature = AlertName as signature
EVAL-user = coalesce(LastName + ", " + FirstName, LastName, FirstName) 
FIELDALIAS-dest = DeviceName as dest
FIELDALIAS-username = DeviceID as username
EVAL-severity = "informational"