[ACTI-collect_file (ALL)]
action.email.useNSSubject = 1
action.keyindicator.invert = 0
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.param.verbose = 0
action.send2uba.param.verbose = 0
action.threat_add.param.verbose = 0
alert.track = 0
description = Collect File Hashes from previously downloaded indicators
enableSched = 0
request.ui_dispatch_app = TA-idefense
request.ui_dispatch_view = search
search = | acticollectfile Output_KVstore=True Output_Threatlist=True\
    [| makeresults \
    | addinfo \
    | rename info_max_time as latest, info_min_time as earliest \
    | return latest, earliest]
dispatch.earliest_time = -5y@y
dispatch.latest_time = now

[ACTI-collect_file (Update)]
action.email.useNSSubject = 1
action.keyindicator.invert = 0
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.param.verbose = 0
action.send2uba.param.verbose = 0
action.threat_add.param.verbose = 0
alert.track = 0
cron_schedule = 0 */4 * * *
enableSched = 1
schedule_window = 15
description = Collect File Hashes from previously downloaded indicators
request.ui_dispatch_app = TA-idefense
request.ui_dispatch_view = search
search = | acticollectfile Output_KVstore=True Output_Threatlist=True\
    [| makeresults \
    | addinfo \
    | rename info_max_time as latest, info_min_time as earliest \
    | return latest, earliest]
dispatch.earliest_time = -24h@h
dispatch.latest_time = now

[ACTI-get_domain (ALL)]
action.email.useNSSubject = 1
action.keyindicator.invert = 0
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.param.verbose = 0
action.send2uba.param.verbose = 0
action.threat_add.param.verbose = 0
alert.track = 0
description = Getting all available domains from ACTI ThreatIndicator API
enableSched = 0
request.ui_dispatch_app = TA-idefense
request.ui_dispatch_view = search
search = | actigetdomain Output_KVstore=True Output_Threatlist=True confidence_from=50 severity_from=2\
    [| makeresults \
    | addinfo \
    | rename info_max_time as latest, info_min_time as earliest \
    | return latest, earliest]
dispatch.earliest_time = -5y@y
dispatch.latest_time = now

[ACTI-get_domain (Update)]
action.email.useNSSubject = 1
action.keyindicator.invert = 0
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.param.verbose = 0
action.send2uba.param.verbose = 0
action.threat_add.param.verbose = 0
alert.track = 0
cron_schedule = 0 */4 * * *
enableSched = 1
schedule_window = 15
description = Retrieves new domains (updated in last 4 hours) from ACTI ThreatIndicator API
request.ui_dispatch_app = TA-idefense
request.ui_dispatch_view = search
search = | ACTIgetdomain Output_KVstore=True Output_Threatlist=True confidence_from=50 severity_from=2\
    [| makeresults \
    | addinfo \
    | rename info_max_time as latest, info_min_time as earliest \
    | return latest, earliest]
dispatch.earliest_time = -24h@h
dispatch.latest_time = now


[ACTI-get_url (ALL)]
action.email.useNSSubject = 1
action.keyindicator.invert = 0
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.param.verbose = 0
action.send2uba.param.verbose = 0
action.threat_add.param.verbose = 0
alert.track = 0
description = Getting all available URLs from ACTI ThreatIndicator API
enableSched = 0
request.ui_dispatch_app = TA-idefense
request.ui_dispatch_view = search
search = | actigeturl Output_KVstore=True Output_Threatlist=True confidence_from=50 severity_from=2\
    [| makeresults \
    | addinfo \
    | rename info_max_time as latest, info_min_time as earliest \
    | return latest, earliest]
dispatch.earliest_time = -5y@y
dispatch.latest_time = now

[ACTI-get_url (Update)]
action.email.useNSSubject = 1
action.keyindicator.invert = 0
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.param.verbose = 0
action.send2uba.param.verbose = 0
action.threat_add.param.verbose = 0
alert.track = 0
cron_schedule = 0 */4 * * *
enableSched = 1
schedule_window = 15
description = Retrieves new URLs (updated in last 4 hours) from ACTI ThreatIndicator API
request.ui_dispatch_app = TA-idefense
request.ui_dispatch_view = search
search =  | ACTIgeturl Output_KVstore=True Output_Threatlist=True confidence_from=50 severity_from=2\
    [| makeresults \
    | addinfo \
    | rename info_max_time as latest, info_min_time as earliest \
    | return latest, earliest]
dispatch.earliest_time = -24h@h
dispatch.latest_time = now


[ACTI-get_ip (ALL)]
action.email.useNSSubject = 1
action.keyindicator.invert = 0
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.param.verbose = 0
action.send2uba.param.verbose = 0
action.threat_add.param.verbose = 0
alert.track = 0
description = Getting all available IPs from ACTI ThreatIndicator API
enableSched = 0
request.ui_dispatch_app = TA-idefense
request.ui_dispatch_view = search
search = | actigetip Output_KVstore=True Output_Threatlist=True confidence_from=50 severity_from=2\
    [| makeresults \
    | addinfo \
    | rename info_max_time as latest, info_min_time as earliest \
    | return latest, earliest]
dispatch.earliest_time = -5y@y
dispatch.latest_time = now

[ACTI-get_ip (Update)]
action.email.useNSSubject = 1
action.keyindicator.invert = 0
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.param.verbose = 0
action.send2uba.param.verbose = 0
action.threat_add.param.verbose = 0
alert.track = 0
cron_schedule = 0 */4 * * *
enableSched = 1
schedule_window = 15
description = Retrieves new IPs (updated in last 4 hours) from ACTI ThreatIndicator API
request.ui_dispatch_app = TA-idefense
request.ui_dispatch_view = search
search = | actigetip Output_KVstore=True Output_Threatlist=True confidence_from=50 severity_from=2\
    [| makeresults \
    | addinfo \
    | rename info_max_time as latest, info_min_time as earliest \
    | return latest, earliest]
dispatch.earliest_time = -24h@h
dispatch.latest_time = now

[ACTI-get_vuln (ALL)]
action.email.useNSSubject = 1
action.keyindicator.invert = 0
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.param.verbose = 0
action.send2uba.param.verbose = 0
action.threat_add.param.verbose = 0
alert.track = 0
description = Getting all available Vulnerability from ACTI Vulnerability API
enableSched = 0
request.ui_dispatch_app = TA-idefense
request.ui_dispatch_view = search
search = | acticollectvuln Output_KVstore=True Output_Threatlist=True severity_from=2\
    [| makeresults \
    | addinfo \
    | rename info_max_time as latest, info_min_time as earliest \
    | return latest, earliest]
dispatch.earliest_time = -3y@y
dispatch.latest_time = now

[ACTI-get_vuln (Update)]
action.email.useNSSubject = 1
action.keyindicator.invert = 0
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.param.verbose = 0
action.send2uba.param.verbose = 0
action.threat_add.param.verbose = 0
alert.track = 0
cron_schedule = 0 */4 * * *
enableSched = 1
schedule_window = 15
description = Retrieves new IPs (updated in last 4 hours) from ACTI ThreatIndicator API
request.ui_dispatch_app = TA-idefense
request.ui_dispatch_view = search
search = | acticollectvuln Output_KVstore=True Output_Threatlist=True severity_from=2\
    [| makeresults \
    | addinfo \
    | rename info_max_time as latest, info_min_time as earliest \
    | return latest, earliest]
dispatch.earliest_time = -24h@h
dispatch.latest_time = now

[Threat - ACTI Threat Match]
disabled = 1
action.notable.param.next_steps = {"version":1,"data":"[[action|query_acti]]"}
action.correlationsearch.enabled = 1
action.correlationsearch.label = ACTI Threat Match
action.customsearchbuilder.enabled = false
action.customsearchbuilder.spec = {}
action.notable = 1
action.notable.param.drilldown_name = Search $orig_srctype$ for $threat_match_value$ in field $threat_match_field$
action.notable.param.drilldown_search = index=* sourcetype=$orig_srctype$ $threat_match_field$= $threat_match_value$
action.notable.param.recommended_actions = query_acti
action.notable.param.rule_description = Threat Activity was detected for $threat_display_field_long$ from ACTI Threat Indicator List for sourcetype: $orig_srctype$ and field: $threat_match_field$
action.notable.param.rule_title = ACTI Threat Activity Detected for $threat_display_field_short$ in Sourcetype $orig_srctype$
action.notable.param.security_domain = threat
action.notable.param.severity = high
action.notable.param.verbose = 0
alert.suppress = 1
alert.suppress.fields = threat_match_value,threat_match_field
alert.suppress.period = 86400s
alert.track = 1
counttype = number of events
#change to even time interval
cron_schedule = 40 * * * * 
description = Alerts for indicator matches from the threat activity notable and enriches the notable with ACTI fields.
dispatch.earliest_time = -65m@m
dispatch.latest_time = +0s
dispatch.rt_backfill = 1
enableSched = 1
quantity = 0
realtime_schedule = 0
relation = greater than
request.ui_dispatch_app = TA-idefense
schedule_window = auto
#change to auto
search = index="threat_activity" threat_key="acti_*_ioc" \
| dedup threat_match_field,threat_match_value \
| `get_event_id` \
| rename weight as record_weight \
| `per_panel_filter("ppf_threat_activity","threat_match_field,threat_match_value")` \
| `get_threat_attribution(threat_key)` \
| rename source_* as threat_source_*,description as threat_description, orig_sourcetype as orig_srctype, info_max_time as inmxtme, info_min_time as inmntme \
| eval risk_score=case(isnum(record_weight), record_weight, isnum(weight), weight, 1=1, null()) \
| eval risk_object_type=case(threat_match_field="query" OR threat_match_field=="src" OR threat_match_field=="dest","system",threat_match_field=="src_user" OR threat_match_field=="user","user",1=1,"other") \
| eval risk_object=threat_match_value \
| `acti_enrich_indicator(threat_match_value)` \
| eval threat_display_field_short= case( like(threat_match_field, "file_hash") ,"a filehash", 1==1, acti_key_type + " " + acti_key) \
| eval threat_display_field_long = case( like(threat_match_field, "file_hash") , "filehash that is related to " + acti_ioc_related + " with relationship " + acti_ioc_relationship, 1==1, acti_key_type + " " + acti_key) \
| eval acti_last_published = strftime(acti_last_published, "%x"), acti_last_seen = strftime(acti_last_seen, "%x"), acti_last_modified = strftime(acti_last_modified, "%x")

[ACTI_File_Splunk_TI_Retention]
cron_schedule = 0 0 * * *
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
enableSched = 1
request.ui_dispatch_app = TA-idefense
request.ui_dispatch_view = search
schedule_window = auto
description = Runs query to delete older File IOCs from Splunk Threat Intelligence Framework.
search = | inputlookup file_intel \
| eval lookup_key = mvindex(split(_key,"|"),1) \
| lookup acti_threatindicator_file _key as lookup_key OUTPUT last_published as time2 threat_campaigns.type as threat_campaigns.type1 threat_types as threat_types1 \
| lookup acti_threatindicator_file sha256 as lookup_key OUTPUT last_published as time3 threat_campaigns.type as threat_campaigns.type2 threat_types as threat_types2 \
| lookup acti_threatindicator_file sha1 as lookup_key OUTPUT last_published as time4 threat_campaigns.type as threat_campaigns.type3 threat_types as threat_types3 \
| eval time=coalesce(time4, time4, time2, time), threat_campaigns.type = coalesce(threat_campaigns.type3, threat_campaigns.type2, threat_campaigns.type1), threat_types = coalesce(threat_types1, threat_types2, threat_types3) \
| eval retention_lookup_field = mvappend(threat_campaigns, threat_types) \
| lookup acti_ti_retention Threat_Type as retention_lookup_field output Priority \
| stats values(*) as * min(Priority) as Priority by _key \
| lookup acti_ti_retention Priority output Alerting_Retention \
| where time > relative_time(now(), "-"+Alerting_Retention+"d@d") \
| fields - Alerting_Retention, lookup_key, retention_lookup_field, threat_campaigns.type2, threat_types, threat_types1, threat_types2, threat_types3, time2, time3, time4, Priority \
| outputlookup file_intel

[ACTI_IP-Domain_Splunk_TI_Retention]
cron_schedule = 0 0 * * *
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
enableSched = 1
request.ui_dispatch_app = SplunkEnterpriseSecuritySuite
request.ui_dispatch_view = search
schedule_window = auto
description = Runs query to delete older IP and Domain IOCs from Splunk Threat Intelligence Framework.
search = | inputlookup ip_intel \
| eval lookup_key = mvindex(split(_key,"|"),1) \
| lookup acti_threatindicator_ip _key as lookup_key OUTPUT last_published as time2 threat_campaigns.type threat_types \
| lookup acti_threatindicator_domain _key as lookup_key OUTPUT last_published as time3 threat_campaigns.type as threat_campaigns.type2 threat_types as threat_types2 \
| eval time=coalesce(time3, time2, time), threat_types = coalesce(threat_types, threat_types2), threat_campaigns.type = coalesce(threat_campaigns.type, threat_cmapaigns.type2) \
| eval retention_lookup_field = mvappend(threat_campaigns, threat_types) \
| lookup acti_ti_retention Threat_Type as retention_lookup_field output Priority \
| stats values(*) as * min(Priority) as Priority by _key \
| lookup acti_ti_retention Priority output Alerting_Retention \
| where time > relative_time(now(), "-"+Alerting_Retention+"d@d") OR isnull(Priority) \
| fields - Alerting_Retention, lookup_key, retention_lookup_field, threat_campaigns.type2, threat_types2, time2, time3, Priority \
| outputlookup ip_intel

[ACTI_URL_Splunk_TI_Retention]
cron_schedule = 0 0 * * *
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
enableSched = 1
request.ui_dispatch_app = TA-idefense
request.ui_dispatch_view = search
description = Runs query to delete older URL IOCs from Splunk Threat Intelligence Framework.
search = | inputlookup http_intel \
| eval lookup_key = mvindex(split(_key,"|"),1) \
| lookup acti_threatindicator_url _key as lookup_key OUTPUT last_published as time2 threat_campaigns.type threat_types \
| eval time=coalesce(time2, time) \
| eval retention_lookup_field = mvappend(threat_campaigns, threat_types) \
| lookup acti_ti_retention Threat_Type as retention_lookup_field output Priority \
| stats values(*) as * min(Priority) as Priority by _key \
| lookup acti_ti_retention Priority output Alerting_Retention \
| where time > relative_time(now(), "-"+Alerting_Retention+"d@d") OR isnull(Priority) \
| fields - Alerting_Retention, lookup_key, retention_lookup_field, threat_campaigns.type2, threat_types2, time2, time3, Priority \
| outputlookup http_intel

[ACTI_THREATLIST_REFRESH]
cron_schedule = 0 2 * * *
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
enableSched = 1
request.ui_dispatch_app = TA-idefense
request.ui_dispatch_view = search
description = Delete temporary threat list so it can be re ingested.
search = | outputlookup acti_ip_ioc_lookup \
| append \
    [| outputlookup acti_file_ioc_lookup] \
| append \
    [| outputlookup acti_domain_ioc_lookup] \
| append \
    [| outputlookup acti_url_ioc_lookup]

[ACTI_Internal_Retention]
cron_schedule = 0 0 * * *
description = Search used to delete TI data that is over the threshold period that are held in ACTI lookups.
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","idefense_associated_files","idefense_confidence","idefense_key","idefense_key_type","idefense_last_modified","idefense_last_published","idefense_last_seen","idefense_malware_family","idefense_last_seen_as","idefense_severity","idefense_threat_types","idefense_uuid","acti_associated_files","acti_confidence","acti_key","acti_key_type","acti_last_modified","acti_last_published","acti_last_seen","acti_last_seen_as","acti_malware_family","acti_severity","acti_threat_types","acti_uuid"]
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.show = 0
enableSched = 1
request.ui_dispatch_app = TA-idefense
request.ui_dispatch_view = search
schedule_window = auto
search = | rest splunk_server=local "/services/ta_idefense/delete_old_ti?delete_older_than_months=60"

[Endpoint - Endpoint - ACTI Vuln Match - Rule]
action.correlationsearch.annotations = {}
action.correlationsearch.enabled = 1
action.correlationsearch.label = Endpoint - ACTI Vuln Match
action.customsearchbuilder.enabled = false
action.customsearchbuilder.spec = {}
action.email.show_password = 1
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable = 1
action.notable.param.drilldown_name = View logs for $dest$ in sourcetype $orig_srctype$
action.notable.param.drilldown_search = sourcetype=$orig_srctype$ dest=$dest$
action.notable.param.rule_description = Vulnerability Match for $dest$ from ACTI Vulnerability List for sourcetype: $orig_srctype$ and for $display_text$
action.notable.param.rule_title = ACTI Vulnerability Match for $dest$ in Sourcetype $orig_srctype$ for $cve$
action.notable.param.security_domain = endpoint
action.notable.param.severity = high
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.forceCsvResults = 1
action.risk.param._risk = [{"risk_object_field":"","risk_object_type":"","risk_score":1}]
action.risk.param._risk_score = 0
action.risk.param.verbose = 0
action.send2uba.param.verbose = 0
action.threat_add.param.verbose = 0
alert.digest_mode = 0
alert.suppress = 1
alert.suppress.fields = dest,cve
alert.suppress.period = 86400s
alert.track = 1
counttype = number of events
cron_schedule = 44 * * * *
description = Alerts for vulnerability matches from Vuln Scanners and enriches the notable with ACTI fields
dispatch.earliest_time = -65m@m
dispatch.latest_time = +0s
dispatch.rt_backfill = 1
enableSched = 1
quantity = 0
realtime_schedule = 0
relation = greater than
request.ui_dispatch_app = SplunkEnterpriseSecuritySuite
schedule_window = auto
search = | tstats count values(Vulnerabilities.dest) as dest values(sourcetype) as orig_srctype from datamodel=Vulnerabilities by Vulnerabilities.cve\
| rename Vulnerabilities.* as * \
| lookup acti_vulnerability _key as cve output title as signature description as desc cvss2_base_score cvss3_base_score severity display_text
