[Unmapped Parent Processes]
action.email.useNSSubject = 1
alert.track = 0
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.show = 0
request.ui_dispatch_app = Perficient_TM1_App
request.ui_dispatch_view = search
search = `tm1_index` sourcetype=tm1:serverlog AND ("executed by user" OR "executed by scheduler") NOT [inputlookup process_type | fields process_name] | fields process_name, tm1_instance | stats values(process_name) as process_name dc(process_name) as count by tm1_instance | rename process_name as "Unmapped Processes" tm1_instance as "TM1 App" count as "# of Unique Processes"

[Run Once: Instance Name Mapping]
action.email.useNSSubject = 1
alert.track = 0
cron_schedule = 0 0 1 * *
display.events.fields = ["host","source","sourcetype","ServerName","ServerLogging","DataBaseDirectory","log_dir","tm1_instance"]
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.show = 0
enableSched = 0
request.ui_dispatch_app = Perficient_TM1_App
request.ui_dispatch_view = search
search = `tm1_index` sourcetype=tm1:cfg | stats values(tm1_instance_name) as tm1_instance values(log_dir) as log_dir by cfg_source | outputlookup instance_lookup.csv