[cisco_dc_aci_index]
definition = index IN ("main")

[cisco_dc_nd_index]
definition = index IN ("main")
iseval = 0

[cisco_dc_n9k_index]
definition = index IN ("main")

[summariesonly]
definition = summariesonly=false
iseval = 0

[apic-fault-overview]
definition = tstats `summariesonly` latest(Fault.ack) AS "ack" latest(Fault.nameofnode) AS "node" latest(Fault.rule) AS "rule" latest(Fault.severity) AS "severity" latest(Fault.type) AS "type" latest(Fault.cause) AS "cause" latest(Fault.domain) AS "domain" latest(Fault.Tenant) AS "tenant" latest(Fault.created) AS "creationTime" latest(Fault.lastTransition) AS "lastTransition" latest(Fault.lc) AS "lifecycle" from datamodel=Cisco_DCN_Fault groupby _time,Fault.dn, Fault.apic_host| rename Fault.dn AS dn, Fault.apic_host AS apic_host | reverse

[apic-fabric-overview]
definition = tstats `summariesonly` latest(apic.ack) AS "ack" latest(apic.cause) AS "cause" latest(apic.domain) AS "domain" latest(apic.fabric.node) AS "nodeID" latest(apic.fabric.nameofnode) AS "node" latest(apic.rule) AS "rule" latest(apic.severity) AS "severity" values(apic.twScore) AS "health" latest(apic.cur) AS "CurrentHealth" latest(apic.type) AS "type" latest(apic.role) AS "Role" latest(apic.code) AS "code" latest(apic.id) AS "id" latest(apic.name) AS "name" latest(apic.descr) AS "description" latest(apic.fabric.lcSlot) AS "lcSlot" latest(apic.operSt) AS "state" latest(apic.ser) AS "ser" latest(apic.type) AS Type latest(apic.numP) AS "numP" latest(apic.speed) AS "speed" latest(apic.adSt) AS "adSt" latest(apic.model) AS "model" latest(apic.vendor) AS "vendor" latest(apic.macB) AS "macB" latest(apic.swCId) AS "swCId" latest(apic.volt) AS "volt" latest(apic.fabric.Interface) AS "Interface" latest(apic.rev) AS "Revision" latest(apic.created) AS "Fault Creation Time" latest(apic.normalizedLast) AS "normalizedLast" from datamodel=Cisco_DCN_Health WHERE (apic.component=fabricNode OR  apic.component="eqpt*" OR apic.component=ethpmPhysIf)   groupby apic.dn,_time,apic.component,apic.apic_host | rename apic.dn as dn,apic.component as component,apic.apic_host as apic_host | reverse

[authentication_details]
definition = tstats `summariesonly` values(session.user) AS "user"  values(session.descr) AS "description" values(session.id) AS "Session-ID" values(session.trig) AS "trig" FROM datamodel=Cisco_DCN_Auth groupby _time,session.dn,session.apic_host | rename session.dn AS dn, session.apic_host AS apic_host | reverse

[apic-tenant-overview]
definition = tstats `summariesonly` latest(apic.ack) AS "ack" latest(apic.cause) AS "cause" latest(apic.domain) AS "domain" latest(apic.Tenant.EndPointGroupName) AS "EndPointGroupName" latest(apic.name) AS "name" latest(apic.rule) AS "rule" values(apic.twScore) AS "health" latest(apic.severity) AS "severity" latest(apic.Tenant.ApplicationName)  AS "ApplicationName" latest(apic.code) AS "code" latest(apic.Tenant.group_field) AS "group_field" from datamodel=Cisco_DCN_Health WHERE apic.component="fv*" groupby apic.dn,apic.Tenant.TenantName,apic.component,_time,apic.apic_host | rename apic.Tenant.TenantName AS "TenantName",apic.component AS component,apic.dn AS dn, apic.apic_host AS apic_host | reverse

[home_page_details]
definition = search eventtype=cisco_dc_aci_health ( component=fabricNode OR component=fvTenant OR component=fvAp OR component=fabrichealthTotal OR component=fvEPg OR component=fvBD OR component=vzFilter OR component=vzBrCP OR component=eqptcapacityPolEntry5min OR component=fvCtx OR component=fvAEPg OR component=l3extOut) NOT "code" | SORT _time| fields _time cur dn name role component twScore apic_host
iseval = 0

[critical-faults-count]
definition = tstats `summariesonly` values(Fault.dn) AS "Critical-faults" from datamodel=Cisco_DCN_Fault WHERE Fault.severity="critical" groupby Fault.apic_host | rename Fault.apic_host as apic_host
iseval = 0

[vm_count]
definition = tstats `summariesonly` prestats=true values(classInfo.VM_Relation.VirtualMachine) from datamodel=Cisco_DCN_Systems WHERE classInfo.component=fvRsVm groupby classInfo.dn,classInfo.apic_host | rename classInfo.apic_host as apic_host  
iseval = 0

[end_point_detail]
definition = tstats `summariesonly` latest(classInfo.VM_Relation.Tenant) AS Tenant latest(classInfo.VM_Relation.Application) AS Application latest(classInfo.VM_Relation.EPG) AS EPG latest(classInfo.VM_Relation.EPGHealth) AS EPG-Health values(classInfo.VM_Relation.VirtualMachine) AS VirtualMachine latest(classInfo.VM_Relation.vmState) AS state latest(classInfo.VM_Relation.ESXHost) AS ESX-Host latest(classInfo.VM_Relation.vCenter) AS vCenter latest(classInfo.VM_Relation.cep) AS cep latest(classInfo.VM_Relation.Interface) AS Interface from datamodel=Cisco_DCN_Systems WHERE classInfo.component=fvRsVm groupby classInfo.VM_Relation.mac_addr, classInfo.apic_host | rename classInfo.VM_Relation.mac_addr AS Network-Adapter, classInfo.apic_host AS apic_host

[apic_details]
definition = tstats `summariesonly` latest(classInfo.inbMgmtAddr) AS "In-band management Address" latest(classInfo.fabricMAC) AS "Fabric Mac Address" latest(classInfo.name) AS "Name" latest(classInfo.state) AS "State" latest(classInfo.systemUpTime) AS "System Up Time" latest(classInfo.role) AS "Role" latest(classInfo.mode) AS "Mode" FROM datamodel=Cisco_DCN_Systems WHERE (classInfo.role=controller AND classInfo.component=topSystem) groupby classInfo.oobMgmtAddr, classInfo.apic_host | rename classInfo.oobMgmtAddr AS "Out-of-band Management Address", classInfo.apic_host AS apic_host
iseval = 0

[atomic_counter_details]
definition = tstats `summariesonly`  values(classInfo.src) AS src values(classInfo.Atomic_Counters.srcVM) AS "Source VM" values(classInfo.dst) AS dst values(classInfo.Atomic_Counters.dstVM) AS "Destination VM" values(classInfo.totTxP) AS "Total Transmitted Packets" values(classInfo.totRxP) AS "Total Received Packets" values(classInfo.totDropP) AS "Total Dropped Packets" values(classInfo.totExssP) AS "Total Excess Packets" values(classInfo.component) AS component from datamodel=Cisco_DCN_Counters where (classInfo.component="dbgEpgToEpgRslt" OR classInfo.component="dbgEpToEpRslt") groupby _time,classInfo.dn,classInfo.apic_host| rename classInfo.dn AS dn, classInfo.apic_host AS apic_host
iseval = 0

[vmware_counter_details]
definition = tstats `summariesonly` latest(classInfo.Host_Stats.ESXHost) AS Host latest(classInfo.Host_Stats.VirtualMachine) AS "Virtual Machine"  values(classInfo.Host_Stats.vmID) AS vmID values(classInfo.cpuUsageMin) AS cpuUsageMin values(classInfo.cpuUsageMax) AS cpuUsageMax values(classInfo.cpuUsageTtl) AS cpuUsageTotal values(classInfo.cpuUsageAvg) AS cpuUsageAvg  values(classInfo.memUsageMin) AS memUsageMin values(classInfo.memUsageMax) AS memUsageMax values(classInfo.memUsageTtl) AS memUsageTotal values(classInfo.memUsageAvg) AS memUsageAvg latest(classInfo.component)  AS component from datamodel=Cisco_DCN_Counters  where classInfo.component=compHostStats1h groupby _time,classInfo.apic_host | append [ | tstats `summariesonly` values(classInfo.Trnsmtd_Error_Pkts.ESXHost) AS "Transmitting Host" values(classInfo.Trnsmtd_Error_Pkts.VirtualMachine) AS "Transmitting Virtual Machine"   values(classInfo.Rcvd_Error_Pkts.ESXHost) AS "Receiving Host"  values(classInfo.Rcvd_Error_Pkts.VirtualMachine) AS "Receiving Virtual Machine"  values(classInfo.errorAvg) AS "Errored_Packets" latest(classInfo.component) AS component from datamodel=Cisco_DCN_Counters where classInfo.component=compTrnsmtdErrPkts1h OR  classInfo.component=compRcvdErrPkts1h groupby ,_time,classInfo.apic_host] | rename classInfo.apic_host AS apic_host
iseval = 0

[event-logs-overview]
definition = tstats `summariesonly` latest(Event.cause) AS "cause" latest(Event.severity) AS "severity" latest(Event.ind) AS "ind" latest(Event.user) AS "user" from datamodel=Cisco_DCN_Events groupby _time, Event.dn,Event.apic_host | rename Event.dn AS dn, Event.apic_host AS apic_host | reverse

[phy_inventory_details]
definition = search `cisco_dc_n9k_index` sourcetype=cisco:dc:nexus9k component=nxinventory | rex field=name "Slot\s(?<slot_id>[\d]+)" | lookup cisco_dc_nexus_inventory_lookup device AS device,modwwn AS slot_id OUTPUT sw AS "Software_Version1", hw AS "Hardware_Version1" | lookup cisco_dc_nexus_inventory_lookup device_without_port AS device,modwwn AS slot_id OUTPUT sw AS "Software_Version2", hw AS "Hardware_Version2" | eval "Software_Version" = coalesce(Software_Version1, Software_Version2), "Hardware_Version" = coalesce(Hardware_Version1, Hardware_Version2) | lookup cisco_dc_nexus_version_lookup device AS device OUTPUT platform AS platform1,uptime AS uptime1 | lookup cisco_dc_nexus_version_lookup device_without_port AS device OUTPUT platform AS platform2,uptime AS uptime2 | eval platform = coalesce(platform1, platform2), uptime = coalesce(uptime1, uptime2) | lookup cisco_dc_nexus_power_status_lookup device AS device,modinf AS slot_id OUTPUT status AS Status1 | lookup cisco_dc_nexus_power_status_lookup device_without_port AS device,modinf AS slot_id OUTPUT status AS Status2 | eval Status = coalesce(Status1, Status2) | lookup cisco_dc_nexus_hostname_lookup device AS device OUTPUT hostname AS hostname1 | lookup cisco_dc_nexus_hostname_lookup device_without_port as device OUTPUT hostname as hostname2 | eval hostname = coalesce(hostname1, hostname2) | stats latest(platform) AS platform, latest(uptime) AS uptime, latest(productid) AS productid,latest(Software_Version) AS "Software Version", latest(Hardware_Version) AS "Hardware Version", latest(Status) AS Status, latest(serialnum) AS serialnum ,latest(desc) AS desc by name,device,hostname | rename device AS Device
iseval = 0

[power_details]
definition = search `cisco_dc_n9k_index` sourcetype=cisco:dc:nexus9k component=nxpower | lookup cisco_dc_nexus_hostname_lookup device AS device OUTPUT hostname AS hostname1 | lookup cisco_dc_nexus_hostname_lookup device_without_port as device OUTPUT hostname as hostname2 | eval hostname = coalesce(hostname1, hostname2) | lookup cisco_dc_nexus_temperature_lookup device AS device,model AS mod_model OUTPUT modtype AS modtype_lookup1 | lookup cisco_dc_nexus_temperature_lookup device_without_port AS device,model AS mod_model OUTPUT modtype AS modtype_lookup2 | eval modtype_lookup = coalesce(modtype_lookup1, modtype_lookup2) | stats latest(hostname) as Hostname values(psnum) as "Slot" values(tot_pow_input_actual_draw) as tot_pow_input_actual_draw values(tot_pow_out_actual_draw) as tot_pow_out_actual_draw latest(tot_pow_alloc_budgeted) AS "Total Power Allocated(budget)" latest(tot_pow_input_actual_draw) AS "Total Power Input(actual draw)" latest(tot_pow_out_actual_draw) AS "Total Power Output(actual draw)" latest(ps_redun_mode) as "Power Supply redundancy mode (configured)"  values(tot_pow_capacity) AS "Total Power Capacity" latest(ps_oper_mode) AS "Power Supply redundancy mode (operational)"  values(actual_input) as "Actual input(Watts)" values(actual_out) as "Actual output(Watts)"  values(ps_status) as Status  values(actual_draw) as actual_draw values(allocated) as allocated values(modstatus) as modstatus values(modtype_lookup) as modtype_lookup values(mod_model) as mod_model values(modnum) as modnum values(psmodel) as Model by _time,device | rename device as Device
iseval = 0

[interface_details]
definition = search `cisco_dc_n9k_index` sourcetype=cisco:dc:nexus9k component=nxinterface | lookup cisco_dc_nexus_hostname_lookup device AS device OUTPUT hostname AS hostname1 | lookup cisco_dc_nexus_hostname_lookup device_without_port as device OUTPUT hostname as hostname2 | eval hostname = coalesce(hostname1, hostname2) | stats values(state) as state values(admin_state) as admin_state values(desc) as desc values(eth_speed) as eth_speed values(eth_inbcast) as eth_inbcast values(eth_inmcast) as eth_inmcast values(eth_inerr) as eth_inerr values(eth_inpkts) as eth_inpkts values(eth_indiscard) as eth_indiscard values(eth_inrate1_pkts) as eth_inrate1_pkts values(eth_inucast) as eth_inucast values(eth_outbcast) as eth_outbcast values(eth_outmcast) as eth_outmcast values(eth_outerr) as eth_outerr values(eth_outpkts) as eth_outpkts values(eth_outdiscard) as eth_outdiscard values(eth_outrate1_pkts) as eth_outrate1_pkts values(eth_outucast) as eth_outucast by _time,hostname,device,interface | rename interface as Interface device as Device hostname as Hostname
iseval = 0

[temperature_details]
definition = search `cisco_dc_n9k_index` sourcetype=cisco:dc:nexus9k component=nxtemperature | lookup cisco_dc_nexus_hostname_lookup device AS device OUTPUT hostname AS hostname1 | lookup cisco_dc_nexus_hostname_lookup device_without_port as device OUTPUT hostname as hostname2 | eval hostname = coalesce(hostname1, hostname2) | lookup cisco_dc_nexus_temperature_lookup modinf AS tempmod OUTPUT model AS Model ,modtype AS ModuleType | stats latest(hostname) AS Hostname latest(curtemp) as "Current Temperature(Celsius)", values(Model) as Model, values(ModuleType) as ModuleType, latest(majthres) as "Major Threshold(Celsius)", latest(minthres) as "Minor Threshold(Celsius)", latest(alarmstatus) as Status by device,tempmod,sensor,_time | rename device as Device

[home_page_details_nexus_9k]
definition = `cisco_dc_n9k_index` sourcetype=cisco:dc:nexus9k:syslog | lookup cisco_dc_nexus_severity_lookup severity_id as severity_id OUTPUT severity_name as severity_name| stats count(severity) AS "Count of Severity" by _time,mnemonics,severity_name,host | rename host as device mnemonics as mnemonic severity_name as severity