###### Splunk Windows Event Log ######
## Splunk multi-line text files (.windows)
[force_sourcetype_for_windows_txt]
DEST_KEY = MetaData:Sourcetype
REGEX = Log(Name|file)=(\S+)
FORMAT = sourcetype::WinEventLog:$2

[force_sourcetype_application_sophos_for_windows_txt]
DEST_KEY = MetaData:Sourcetype
REGEX = Log(Name|file)=Application([^\r\n]*[\r\n])*SourceName=Sophos\s+Anti-Virus
FORMAT = sourcetype::WinEventLog:Application:sophos

[force_sourcetype_application_sav_for_windows_txt]
DEST_KEY = MetaData:Sourcetype
REGEX = Log(Name|file)=Application([^\r\n]*[\r\n])*SourceName=Symantec\s+AntiVirus
FORMAT = sourcetype::WinEventLog:Application:sav

[force_sourcetype_application_trendmicro_for_windows_txt]
DEST_KEY = MetaData:Sourcetype
REGEX = Log(Name|file)=Application([^\r\n]*[\r\n])*SourceName\=Trend\s+Micro\s+OfficeScan\s+Server
FORMAT = sourcetype::WinEventLog:Application:trendmicro

[force_sourcetype_system_ias_for_windows_txt]
DEST_KEY = MetaData:Sourcetype
REGEX = Log(Name|file)=System([^\r\n]*[\r\n])*SourceName=IAS
FORMAT = sourcetype::WinEventLog:System:IAS

[force_host_for_windows_txt]
DEST_KEY = MetaData:Host
REGEX = ComputerName=(\S+)
FORMAT = host::$1

[force_source_for_windows_txt]
DEST_KEY = MetaData:Source
REGEX = Log(Name|file)\=(\S+)
FORMAT = source::WinEventLog:$2

## IAS (Currently WinEventLog Support Only)
[force_sourcetype_system_ias_for_wineventlog]
DEST_KEY = MetaData:Sourcetype
REGEX = SourceName\=IAS
FORMAT = sourcetype::WinEventLog:System:IAS


###### All Windows Event Log ######

## Lookups
[windows_signature_lookup]
filename = windows_signatures.csv

[windows_signature_lookup2]
filename = windows_signatures_substatus.csv

[windows_vendor_info_lookup]
filename = windows_vendor_info.csv


## Add EventCodeDescription ##
[windows_event_descriptions]
filename = windows_event_descriptions.csv

## REPORT
[file_path-file_name_for_windows]
SOURCE_KEY = Image_File_Name
REGEX = ^(.*[\\/]+)*(.*)$
FORMAT = file_path::$1 file_name::$2


####### Windows Security Event Log ######

## Lookups
[windows_action_lookup]
filename = windows_actions.csv

[windows_app_lookup]
filename = windows_apps.csv

[windows_privilege_lookup]
filename = windows_privileges.csv

## REPORT
[vendor_privilege_sv_for_windows_security]
SOURCE_KEY = Message
REGEX = (?s)^\s*(Privileges|Assigned):?\s+(.*?)(^[^:]+:)
FORMAT = vendor_privilege::$2

[vendor_privilege_mv_for_windows_security]
SOURCE_KEY = Message
REGEX = (?s)^\s*(Privileges|Assigned):\s+(.*)
FORMAT = vendor_privilege::$2

[privilege_id_for_windows_security]
SOURCE_KEY = vendor_privilege
REGEX = ^([^\r\n]+)
FORMAT = privilege_id::$1
MV_ADD = True

[Token_Elevation_Type_id_for_windows_security]
SOURCE_KEY = Token_Elevation_Type
REGEX = \((\d+)\)
FORMAT = Token_Elevation_Type_id::$1

## Aliases
[Target_Server_Name_as_dest]
SOURCE_KEY = Target_Server_Name
REGEX = ([\\]+)?([^-].*)
FORMAT = dest::"$2"

[ComputerName_as_dest]
SOURCE_KEY = ComputerName
REGEX = ([\\]+)?([^-].*)
FORMAT = dest::"$2"

[Target_Server_Name_as_dest_nt_host]
SOURCE_KEY = Target_Server_Name
REGEX = ([\\]+)?([^-].*)
FORMAT = dest_nt_host::"$2"

[ComputerName_as_dest_nt_host]
SOURCE_KEY = ComputerName
REGEX = ([\\]+)?([^-].*)
FORMAT = dest_nt_host::"$2"

[Target_Domain_as_dest_nt_domain]
SOURCE_KEY = Target_Domain
REGEX = (.+)
FORMAT = dest_nt_domain::"$1"

[Primary_Domain_as_dest_nt_domain]
SOURCE_KEY = Primary_Domain
REGEX = (.+)
FORMAT = dest_nt_domain::"$1"

[Account_Domain_as_dest_nt_domain]
SOURCE_KEY = Account_Domain
REGEX = ([^\n]+)\n(.*)
FORMAT = dest_nt_domain::"$2"

[New_Domain_as_dest_nt_domain]
SOURCE_KEY = New_Domain
REGEX = (.+)
FORMAT = dest_nt_domain::"$1"

[Domain_as_dest_nt_domain]
SOURCE_KEY = Domain
REGEX = (.+)
FORMAT = dest_nt_domain::"$1"

[Workstation_Name_as_src]
SOURCE_KEY = Workstation_Name
REGEX = ([\\]+)?([^-].*)	
FORMAT = src::"$2"

[Caller_Machine_Name_as_src]
SOURCE_KEY = Caller_Machine_Name
REGEX = ([\\]+)?([^-].*)	
FORMAT = src::"$2"

[Client_Machine_Name_as_src]
SOURCE_KEY = Client_Machine_Name
REGEX = ([\\]+)?([^-].*)	
FORMAT = src::"$2"

[Source_Network_Address_as_src]
SOURCE_KEY = Source_Network_Address
REGEX = ([\\]+)?([^-].*)
FORMAT = src::"$2"

[Client_Address_as_src]
SOURCE_KEY = Client_Address
REGEX = ([\\]+)?([^-].*)
FORMAT = src::"$2"

[ComputerName_as_src]
SOURCE_KEY = ComputerName
REGEX = ([\\]+)?([^-].*)
FORMAT = src::"$2"

[Source_Network_Address_as_src_ip]
SOURCE_KEY = Source_Network_Address
REGEX = ([\\]+)?([^-].*)
FORMAT = src_ip::"$2"

[Client_Address_as_src_ip]
SOURCE_KEY = Client_Address
REGEX = ([\\]+)?([^-].*)
FORMAT = src_ip::"$2"

[Caller_Domain_as_src_nt_domain]
SOURCE_KEY = Caller_Domain
REGEX = (.+)
FORMAT = src_nt_domain::"$1"

[Client_Domain_as_src_nt_domain]
SOURCE_KEY = Client_Domain
REGEX = (.+)
FORMAT = src_nt_domain::"$1"

[Account_Domain_as_src_nt_domain]
SOURCE_KEY = Account_Domain
REGEX = ([^\n]+)\n
FORMAT = src_nt_domain::"$1"

[Domain_as_src_nt_domain]
SOURCE_KEY = Domain
REGEX = (.+)
FORMAT = src_nt_domain::"$1"

[Workstation_Name_as_src_nt_host]
SOURCE_KEY = Workstation_Name
REGEX = ([\\]+)?([^-].*)	
FORMAT = src_nt_host::"$2"

[Caller_Machine_Name_as_src_nt_host]
SOURCE_KEY = Caller_Machine_Name
REGEX = ([\\]+)?([^-].*)	
FORMAT = src_nt_host::"$2"

[Client_Machine_Name_as_src_nt_host]
SOURCE_KEY = Client_Machine_Name
REGEX = ([\\]+)?([^-].*)	
FORMAT = src_nt_host::"$2"

[Caller_User_Name_as_src_user]
SOURCE_KEY = Caller_User_Name
REGEX = (.+)
FORMAT = src_user::"$1"

[Client_User_Name_as_src_user]
SOURCE_KEY = Client_User_Name
REGEX = (.+)
FORMAT = src_user::"$1"

[Account_Name_as_src_user]
SOURCE_KEY = Account_Name
REGEX = ([^\n]+)\n
FORMAT = src_user::"$1"

[User_Name_as_src_user]
SOURCE_KEY = User_Name
REGEX = (.+)
FORMAT = src_user::"$1"

[Target_User_Name_as_user]
SOURCE_KEY = Target_User_Name
REGEX = (.+)
FORMAT = user::"$1"

[Primary_User_Name_as_user]
SOURCE_KEY = Primary_User_Name
REGEX = (.+)
FORMAT = user::"$1"

[Target_Account_Name_as_user]
SOURCE_KEY = Target_Account_Name
REGEX = (.+)
FORMAT = user::"$1"

[New_Account_Name_as_user]
SOURCE_KEY = New_Account_Name
REGEX = (.+)
FORMAT = user::"$1"

[User_Name_as_user]
SOURCE_KEY = User_Name
REGEX = (.+)
FORMAT = user::"$1"

[Account_Name_as_user]
SOURCE_KEY = Account_Name
REGEX = ([^\n]+)\n(.*)
FORMAT = user::"$2"

[User_as_user]
SOURCE_KEY = User
REGEX = ([^\\]+\\)?(.+)
FORMAT = user::"$2"


###### Windows System Event Log ######
[package_title_for_windows_system_update]
REGEX = Windows successfully installed the following update:\s+(.*)
FORMAT = package_title::"$1"

[user_for_windows_system_ias]
REGEX = Message\=User\s+([^\/\\]+[\/\\])?([^.]+).*?was
FORMAT = user::"$2"

## IAS (Currently WinEventLog Support Only)
[auto_kv_for_windows_system_ias]
SOURCE_KEY = Message
REGEX = \n([^=\n\r\s]+)\s+\=\s+([^\n]*)
FORMAT = $1::$2
MV_ADD = TRUE


###### Update ######
[windows_update_status_lookup]
filename = windows_update_statii.csv

[package_message_for_windowsupdatelog]
REGEX = (Content\s+Install\s+((Restart\s+Required)|(Installation\s+Ready)).*)
FORMAT = package_message::"$1" vendor_status::"$2"

[package_title_for_windowsupdatelog]
REGEX = Content\s+Install\s+(Installation\s+(Successful|Failure)):\s+Windows.*the\s+following\s+update.*?:\s+(.*)
FORMAT = vendor_status::"$1" package_title::"$3"

[package_title_for_windowsupdatelog_restartrequired]
REGEX = Content\s+Install\s+(Installation\s+successful\s+and\s+restart\s+required)\s+for\s+the\s+following\s+update:\s+(.*)
FORMAT = vendor_status::"$1" package_title::"$2"

[package_title_for_windowsupdatelog_package_message]
SOURCE_KEY = package_message
REGEX = \-\s+([^)]+\)(\,\s+\d+\-[bB]it\s+Edition)?)
FORMAT = package_title::"$1"
MV_ADD = True

[package_for_windowsupdatelog]
SOURCE_KEY = package_title
REGEX = (KB\d+)
FORMAT = package::$1
MV_ADD = True

[pid-tid-component_for_windowsupdatelog]
REGEX = ^\S+\s+\S+\s+(\S+)\s+(\S+)\s+(\S+)
FORMAT = pid::$1 tid::$2 component::$3


###### Windows Firewall Log ######
[Transform_Windows_FW]

DELIMS = " "

FIELDS  = "date" "time" "action" "protocol" "src-ip" "dst-ip" "src-port" "dst-port" "size" "tcpflags" "tcpsyn" "tcpack" "tcpwin" "icmptype" "icmpcode" "info" "path"
