#SYSTEM HEALTH (COPIED FROM MONITORING CONSOLE)
[dmc_rename_introspection_fields]
definition = eval process = 'data.process' | eval args = 'data.args' | eval pid = 'data.pid' | eval ppid = 'data.ppid' | eval elapsed = 'data.elapsed' | eval mem_used = 'data.mem_used' | eval mem = 'data.mem' | eval pct_memory = 'data.pct_memory' | eval pct_cpu = 'data.pct_cpu' | eval sid = 'data.search_props.sid' | eval app = 'data.search_props.app' | eval label = 'data.search_props.label' | eval type = 'data.search_props.type' | eval mode = 'data.search_props.mode' | eval user = 'data.search_props.user' | eval role = 'data.search_props.role' | eval label = if(isnotnull('data.search_props.label'), 'data.search_props.label', "") | eval provenance = if(isnotnull('data.search_props.provenance'), 'data.search_props.provenance', "unknown") | eval search_head = case(isnotnull('data.search_props.search_head') AND 'data.search_props.role' == "peer", 'data.search_props.search_head', isnull('data.search_props.search_head') AND 'data.search_props.role' == "head", "_self", isnull('data.search_props.search_head') AND 'data.search_props.role' == "peer", "_unknown") | eval workload_pool = if(isnotnull('data.workload_pool'), 'data.workload_pool', "UNDEFINED")
iseval = 0

[dmc_convert_runtime(1)]
args = runtime
definition = case( round($runtime$ / (3600*24) - 0.5) > 0, round($runtime$ / (3600*24) - 0.5)."d ".round(($runtime$ % (3600*24)) / 3600 - 0.5)."h ".round(($runtime$ % 3600) / 60 - 0.5)."min ".round($runtime$ % 60, 2)."s", round(($runtime$ % (3600*24)) / 3600 - 0.5) > 0, round(($runtime$ % (3600*24)) / 3600 - 0.5)."h ".round(($runtime$ % 3600) / 60 - 0.5)."min ".round($runtime$ % 60, 2)."s", round(($runtime$ % 3600) / 60 - 0.5) > 0, round(($runtime$ % 3600) / 60 - 0.5)."min ".round($runtime$ % 60, 2)."s", 1 = 1, round($runtime$ % 60, 2)."s" )
iseval = 0

#NETWORK MACROS
[zeek_index]
definition = index=*
iseval = 0

[rita_index]
definition = index=*
iseval = 0

[snort_index]
definition = index=*
iseval = 0

[suricata_index]
definition = index=*
iseval = 0

[stream_index]
definition = index=*
iseval = 0

[sguild_index]
definition = index=*
iseval = 0

[ossec_index]
definition = index=*
iseval = 0

#HOST MACROS
[win_index]
definition = index=*
iseval = 0

[nix_index]
definition = index=*
iseval = 0

[scripts_index]
definition = index=*
iseval = 0

[sysmon_index]
definition = index=*
iseval = 0

[src_internal]
definition = src_ip IN ("10.0.0.0/8","172.16.0.0/12","192.168.0.0/16")
iseval = 0

[dest_internal]
definition = dest_ip IN ("10.0.0.0/8","172.16.0.0/12","192.168.0.0/16")
iseval = 0

#Allowed List
[process_whitelist]
definition = lookup process_whitelist.csv parent_process_name AS parent_process_name process_name AS process_name OUTPUT parent_process_name AS parent_null process_name AS process_null\
| where isnull(parent_null) AND isnull(process_null)

