[stash_common_action_model]
TRUNCATE = 0
# only look for ***SPLUNK*** on the first line
HEADER_MODE = firstline
# we can summary index past data, but rarely future data
MAX_DAYS_HENCE      = 2
MAX_DAYS_AGO        = 10000
# 5 years difference between two events
MAX_DIFF_SECS_AGO   = 155520000
MAX_DIFF_SECS_HENCE = 155520000
MAX_TIMESTAMP_LOOKAHEAD = 64
LEARN_MODEL = false
# break .stash_new custom format into events
SHOULD_LINEMERGE       = false
BREAK_ONLY_BEFORE_DATE = false
LINE_BREAKER           = (\r?\n==##~~##~~  1E8N3D4E6V5E7N2T9 ~~##~~##==\r?\n)

TRANSFORMS-0parse_cam_header    = orig_action_name_for_stash_cam,orig_sid_for_stash_cam,orig_rid_for_stash_cam,sourcetype_for_stash_cam
TRANSFORMS-1sinkhole_cam_header = sinkhole_cam_header

[dtex_st_activities]
TIME_PREFIX = "Activity_Time":
TIME_FORMAT = %Y-%m-%dT%H:%M:%S.%3NZ
TZ = UTC
FIELDALIAS-rule = tags{}.rule as Rule
FIELDALIAS-Category_ID = tags{}.category_id as Category_ID
TRUNCATE = 0
KV_MODE = json
SHOULD_LINEMERGE = false
EVAL-Destination_File_Checksum_SHA256 = coalesce('Destination_File_Checksum_SHA256','Destination_File_Hash_Digest')
EVAL-Process_Checksum_SHA256 = coalesce('Process_Checksum_SHA256','Process_Hash_Digest')
EVAL-Source_File_Checksum_SHA256 = coalesce('Source_File_Checksum_SHA256','Source_File_Hash_Digest')
# replace empty strings in file extension fields to fix pie chart visual bug
EVAL-Destination_File_Extension = if(Destination_File_Extension == "", "No Extension", Destination_File_Extension)
EVAL-Source_File_Extension = if(Source_File_Extension == "", "No Extension", Source_File_Extension)
REPORT-devicenameext = domain_and_devicename_ext
REPORT-usernameext = domain_and_username_ext
REPORT-website_query = ext_website_query
EVAL-process= coalesce('Process_Parameters','Process_Drive'.replace(Process_Directory,"(\\\\)","\\\\\1").'Process_Name')
EVAL-parent_process = Parent_Process_Drive.Parent_Process_Directory.Parent_Process_Name
FIELDALIAS-orig_file_name = Image_Details as original_file_name

# CIM Mapping (Endpoint.Ports) for NetworkActivity (PortAccessed)
EVAL-transport_dest_port = case( 'Activity_Type' == "PortAccessed",'Network_L4_Protocol'."/".'Network_Local_Port')
EVAL-dest = case('Activity_Type' == "PortAccessed",'Network_Local_IP', 'Activity_Type' == "WebPageAccessed",'Network_Remote_IP',1==1,coalesce(device, device_only))
EVAL-dest_nt_domain = case('Activity_Type' == "PortAccessed",null(), 'Activity_Type' == "WebPageAccessed",null(),1==1, device_domain)
EVAL-dest_port = case('Activity_Type' == "PortAccessed",'Network_Local_Port','Activity_Type' == "WebPageAccessed",'Network_Remote_Port')
EVAL-src = case('Activity_Type' == "PortAccessed",'Network_Remote_IP','Activity_Type' == "WebPageAccessed" OR 'Activity_Group'=="FileSystemActivity" OR 'Activity_Group'=="SessionActivity",coalesce(device, device_only),in('tags{}.category_id',"EXF-AL-FTPTFR-T1048","EXF-AL-SHRAPP-T1011","EXF-AL-SHRWEB-T1011","EXF-AL-PRSWML-T1011","EXF-AL-USBTFR-T1052","EXF-AL-DTACPR-T1002","BSD-AL-SENSTV"),coalesce(device, device_only))
EVAL-src_port = case('Activity_Type' == "PortAccessed",'Network_Remote_Port','Activity_Type' == "WebPageAccessed",'Network_Local_Port')
FIELDALIAS-transport = Network_L4_Protocol AS transport
EVAL-process_id = case(EventLog_Event_ID IN (4634,4798,4800,4801,4726,4724,4698,1102,5140,4781,4732,4733,104,12),'EventLog_Execution.ProcessID',EventLog_Event_ID IN (4657,4688,4689),'EventLog_Details.ProcessId',1==1,'Process_Details.ProcessId')
EVAL-creation_time = strptime(Activity_Time, "%Y-%m-%dT%H:%M:%S.%3N%Z")
EVAL-user = case('Activity_Group'== "RegistryActivity",coalesce(coalesce(username, username_only),'User_Name_Impersonated'),EventLog_Event_ID IN (4634,4798,4800,4801,4726,4724,4738,4720,4698,1102,5140,4719,4781,4689,4688,4657,4624,4625,4732,4733,104,12),User_Name,1==1,coalesce(username, username_only))
EVAL-src_nt_domain = case('Activity_Group'== "RegistryActivity",null(),1==1,username_domain)

# CIM Mapping Network_Sessions.All_Sessions,All_Traffic,Web.Web for NetworkActivity(WebPageAccessed)
EVAL-vendor_product = "Dtex"
EVAL-dest_ip = case('Activity_Type' == "WebPageAccessed",'Network_Remote_IP')
EVAL-src_ip = case('Activity_Type' == "WebPageAccessed",'Network_Local_IP')

FIELDALIAS-site = Website_Primary_URL AS site
FIELDALIAS-url = Website_Query AS url
EVAL-url_length = len('Website_Query')
FIELDALIAS-http_content_type = Network_Activity_Details.ContentType AS http_content_type
FIELDALIAS-http_method = Network_Activity_Details.HttpRequestMethod AS http_method
FIELDALIAS-http_referrer = Network_Activity_Details.Referrer AS http_referrer
FIELDALIAS-http_user_agent = Network_Activity_Details.UserAgent AS http_user_agent
EVAL-status = case('Activity_Type' == "HttpRequest",'Network_Activity_Details.HttpResponseStatus','Activity_Group'=="RegistryActivity","Success")

# CIM Mapping (Endpoint.Filesystem,Change.All_Changes) for FileSystemActivity
LOOKUP-action = dtex_action_field_lookup Activity_Type OUTPUT action
EVAL-file_access_time = case(in('Activity_Type',"DirectoryAccessDenied", "FileAccessDenied", "DirectoryCopied", "FileOpened", "FileCopied", "FileRead"),strptime('Activity_Time',"%Y-%m-%dT%H:%M:%S.%3N%Z"))
EVAL-file_create_time = case(in('Activity_Type', "FileCreated", "DirectoryCreated", "HardLinked" ),strptime('Activity_Time',"%Y-%m-%dT%H:%M:%S.%3N%Z"))
EVAL-file_modify_time = case(in('Activity_Type',"FileRenamed","DirectoryRenamed","FileMoved","FileSecurityChanged","DirectoryMoved","FileModified","FileDeleted","DirectoryDeleted","DirectorySecurityChanged"), strptime('Activity_Time', "%Y-%m-%dT%H:%M:%S.%3N%Z"))
EVAL-file_hash = coalesce('Source_File_Checksum_SHA256','Source_File_Hash_Digest')
EVAL-file_name = case(EventLog_Event_ID IN (4738),'EventLog_Details.HomeDirectory',1==1,Source_File_Name)
EVAL-file_path = case(EventLog_Event_ID IN (4738),'EventLog_Details.HomePath',1==1,Source_File_Directory)
FIELDALIAS-file_size = Source_File_Size AS file_size

EVAL-change_type = case('Activity_Group'=="FileSystemActivity","filesystem")
EVAL-object_category = case(in('Activity_Type',"FileCopied", "FileCreated", "FileDeleted", "FileMoved", "FileRenamed", "FileOpened", "FileRead", "FileModified", "FileSecurityChanged", "FileDead", "HardLinked"),"file",in('Activity_Type', "DirectoryRenamed", "DirectoryMoved", "DirectoryDeleted","DirectoryCopied","DirectoryCreated"),"directory" )
EVAL-object_path = case('Activity_Group' == "FileSystemActivity",Source_File_Directory)
EVAL-object = case('Activity_Group' == "FileSystemActivity",Source_File_Name,EventLog_Event_ID IN (4634,4798,4800,4726,4724,4738,4720,1102,4719,4781,4625,4732,4733,104,12),Device_Name)
EVAL-object_id = case(EventLog_Event_ID IN (4634,4798,4800,4726,4724,4738,4720,1102,4719,4781,4625,4732,4733,104,12),Device_ID)
EVAL-user_name = case(EventLog_Event_ID IN (4634,4798,4800,4726,4724,4738,4720,1102,4719,4781,4625,4732,4733,104,12),User_Name)


# CIM Mapping (Endpoint.Processes) for ProcessActivity
EVAL-parent_process_name = case(EventLog_Event_ID IN (4798),'EventLog_Details.CallerProcessName',1==1,Parent_Process_Name)
FIELDALIAS-process_name = Process_Name AS process_name
EVAL-os = 'Logical_Device_Info.OsPlatform'."/".'Logical_Device_Info.OsVersion'
EVAL-parent_process_path = Parent_Process_Drive.Parent_Process_Directory.Parent_Process_Name
EVAL-process_path = Process_Drive.Process_Directory.Process_Name
EVAL-parent_process_id = case(EventLog_Event_ID IN (4798),'EventLog_Details.CallerProcessId',1==1,'Parent_Process.ProcessId')
FIELDALIAS-user_id = User_Name_ID AS user_id
EVAL-process_hash = coalesce('Process_Checksum_SHA256','Process_Hash_Digest')

# CIM Mapping (Inventory.User ,Inventory.Network, Inventory.Inventory.All_Inventory ) for All Activities.
FIELDALIAS-mac = Device_Details.MACAddresses{} AS mac
FIELDALIAS-family = Logical_Device_Info.OsArchitecture AS family

# CIM Mapping (Signatures.Signatures) for WindowsEventLogActivity.
EVAL-signature_id = case('Activity_Group'=="WindowsEventLogActivity",'EventLog_Event_ID')

# CIM Mapping (Authentication.Authentication) for SessionActivity
EVAL-authentication_method = case('Activity_Group'=="SessionActivity","Password")
EVAL-authentication_service = case('Activity_Group'=="SessionActivity","Active Directory")
EVAL-reason =  case('Activity_Group'=="SessionActivity",'Activity_Type')
EVAL-vendor_account = "Dtex"

# CIM Mapping (DLP_Incidents) for All activities with category_id related to data loss
EVAL-dlp_type = case(in('tags{}.category_id',"EXF-AL-FTPTFR-T1048","EXF-AL-SHRAPP-T1011","EXF-AL-SHRWEB-T1011","EXF-AL-PRSWML-T1011","EXF-AL-USBTFR-T1052","EXF-AL-DTACPR-T1002","BSD-AL-SENSTV"),"Endpoint")
EVAL-dvc = case(in('tags{}.category_id',"EXF-AL-FTPTFR-T1048","EXF-AL-SHRAPP-T1011","EXF-AL-SHRWEB-T1011","EXF-AL-PRSWML-T1011","EXF-AL-USBTFR-T1052","EXF-AL-DTACPR-T1002","BSD-AL-SENSTV"),coalesce(device, device_only),'Activity_Group'=="FileSystemActivity" OR 'Activity_Type' == "WebPageAccessed",coalesce(device, device_only),EventLog_Event_ID IN (4634,4798,4800,4726,4724,4738,4720,1102,4719,4781,4625,4732,4733,104,12),EventLog_Computer)
EVAL-severity = case(in('tags{}.category_id',"EXF-AL-FTPTFR-T1048","EXF-AL-SHRAPP-T1011","EXF-AL-SHRWEB-T1011","EXF-AL-PRSWML-T1011","EXF-AL-USBTFR-T1052","EXF-AL-DTACPR-T1002","BSD-AL-SENSTV"),"Urgent")
EVAL-src_user = case(in('tags{}.category_id',"EXF-AL-FTPTFR-T1048","EXF-AL-SHRAPP-T1011","EXF-AL-SHRWEB-T1011","EXF-AL-PRSWML-T1011","EXF-AL-USBTFR-T1052","EXF-AL-DTACPR-T1002","BSD-AL-SENSTV"),'User_Name')
EVAL-category = case(in('tags{}.category_id',"EXF-AL-FTPTFR-T1048","EXF-AL-SHRAPP-T1011","EXF-AL-SHRWEB-T1011","EXF-AL-PRSWML-T1011","EXF-AL-USBTFR-T1052","EXF-AL-DTACPR-T1002","BSD-AL-SENSTV"),'tags{}.category_id')

# CIM Mapping (Endpoint.Registry) for RegistryActivity
FIELDALIAS-registry_hive =  Registry_Key_Path AS registry_hive
FIELDALIAS-registry_path = Registry_Key_Path AS registry_path
EVAL-registry_key_name = coalesce('Registry_Details.KeyName','Registry_Details.KeyNameNew')
FIELDALIAS-registry_value_data = Registry_Details.ValueData AS registry_value_data
FIELDALIAS-registry_value_name = Registry_Details.ValueName AS registry_value_name
FIELDALIAS-registry_value_type = Registry_Details.ValueType AS registry_value_type

#CIM Mapping (Data Access)
FIELDALIAS-user_group = User_Group{} AS user_group

[dtex_st_alerts]
TIME_PREFIX = "occurred_at":
TIME_FORMAT = %Y-%m-%dT%H:%M:%S.%3NZ
TZ = UTC
TRUNCATE = 0
KV_MODE = json
SHOULD_LINEMERGE = false
REPORT-alertext = domain_and_username_alert_ext

# CIM Mapping ( Datamodel : Alerts.alert)
EVAL-type = "alert"
EVAL-app = "Dtex"
EVAL-src_name = coalesce(alert_username, alert_username_only)
FIELDALIAS-vendor_severity = severity AS vendor_severity
FIELDALIAS-severity_id = risk_score AS severity_id
EVAL-severity = case('severity' == "Urgent","critical",'severity' == "Low","low",'severity' == "Medium","medium",'severity' == "High","high",1==1,'severity')
EVAL-body = category_id." - \"".category."\" (".risk_score.") : ".risk_area." : ".vendor_severity
# timestamp needs urlencoding to make it work with workflow action
EVAL-subject = host."/explore#/dashboard/Forensic-Investigation-User?_a=(filters:!((meta:(alias:!n,disabled:!f,index:activities,key:User_Name,negate:!f,value:".user_name."),query:(match:(User_Name:(query:".user_name.",type:phrase)))),(meta:(alias:!n,disabled:!f,index:activities,key:tags.category_id,negate:!f,value:".category_id."),query:(match:(tags.category_id:(query:".category_id.",type:phrase))))))&_g=(refreshInterval:(pause:!t,value:0),time:(from:'".replace(replace(min_activity_occurred,":","%3A"),"\+","%2B")."',mode:absolute,to:'".replace(replace(max_activity_occurred,":","%3A"),"\+","%2B")."'))"