[mssql-failed-logins(2)]
args = instance,user
definition = eventtype=mssql-audit server_instance_name="$instance$" session_server_principal_name="$user$" class_type="LX" | eval flc=if(succeeded=="false",1,0) | eval slc=if(succeeded=="true",1,0) | eval src_ip=if(src_ip=="<local machine>",host + " (Local)",src_ip) | stats latest(_time) as last_attempt, sum(flc) as flc, sum(slc) as slc by src_ip | where flc > 0 | eval slc=if(slc>0,"Yes","") | eval last_attempt=strftime(last_attempt,"%F %T") | table src_ip,last_attempt, flv, slv, slc | rename src_ip as "Source", last_attempt as "Last Attempt", slc as "Successful?"
[mssql-perf-cpu-kpi]
definition = eventtype=perfmon (object=Processor counter="% Processor Time" instance="_Total") | stats latest(Value) as Value by host | eval Statistic="% Processor Time" | eval range=case(Value>90.0,"severe",Value>80.0,"elevated",isnotnull(Value),"low",isnull(Value),"")

[mssql-perf-process-kpi]
definition = eventtype=perfmon sourcetype="PerfmonMk:process-sql" instance="sql*" | stats latest(%_Processor_Time) as Value by instance,host | stats sum(Value) as Value by host | eval Statistic="SQL % Processor Time" | eval range=case(Value>70.0,"severe",Value>60.0,"elevated",isnotnull(Value),"low",isnull(Value),"")

[mssql-perf-qlen-kpi]
definition = eventtype=perfmon (object=LogicalDisk counter="Avg. Disk Queue Length" instance="_Total") | stats latest(Value) as Value by host | eval Statistic="Disk Queue Length" | eval range=case(Value>2.0,"severe",Value>1.0,"elevated",isnotnull(Value),"low",isnull(Value),"")

[mssql-perf-space-kpi]
definition = eventtype=perfmon (object=LogicalDisk counter="% Free Space") | stats latest(Value) as Value by instance,host | stats min(Value) as Value by host | eval Statistic="Disk Min % Free Space" | eval range=case(Value<10.0,"severe",Value<25.0,"elevated",isnotnull(Value),"low",isnull(Value),"")
