[ThousandEyes / SNOW Integration #1]
action.email.show_password = 1
action.email.useNSSubject = 1
alert.track = 0
cron_schedule = * * * * *
description = This search will identify alerts and SNMP traps that have occurred over the previous minute and create a new SNOW incident, or add to an open incident.
dispatch.earliest_time = -10m@m
dispatch.latest_time = @m
enableSched = 1
search = index=snmptrap sourcetype=snmptrap test_group=* type="AAR"\
| eval current_time = now()\
| eval window_end = current_time - (current_time % 60)\
| eval window_start = window_end - 60\
| dedup source_ip\
| rex field=_raw "SNMPv2-SMI::enterprises\.41916\.100\.1\.1\.0\s=\sHex-STRING:\s(?<event_time_hex>[A-F|0-9|\s]*)"\
| eval event_time_str=printf("%04d",tonumber(substr(event_time_hex,1,2).substr(event_time_hex,4,2),16))."-".printf("%02d",tonumber(substr(event_time_hex, 7,2),16))."-".printf("%02d",tonumber(substr(event_time_hex,10,2),16))." ".printf("%02d",tonumber(substr(event_time_hex,13,2),16)).":".printf("%02d",tonumber(substr(event_time_hex,16,2),16)).":".printf("%02d",tonumber(substr(event_time_hex,19,2),16))." ".if(substr(event_time_hex,25,2) == "2B", "+" , if(substr(event_time_hex,25,2) == "2D", "-", "?")).printf("%02d",tonumber(substr(event_time_hex,28,2),16)).":".printf("%02d",tonumber(substr(event_time_hex,31,2),16))\
| eval _raw=replace(_raw, event_time_hex, event_time_str)\
| where ((_time >= window_start) And (_time < window_end))\
| append [search index=snmptrap sourcetype=snmptrap test_group=* type="BFD" new_state=1\
| eval current_time = now()\
| eval window_end = current_time - (current_time % 60)\
| eval window_start = window_end - 60\
| eval status=case(flap_reason=4,"up",1=1,"down")\
| sort _time\
| streamstats current=f window=1 global=f last(status) as last_status by source_ip, dest_ip\
| sort -_time\
| where ((status != last_status) Or (IsNull(last_status))) And ((_time >= window_start) And (_time < window_end))\
| dedup test_group, status\
| rex field=_raw "SNMPv2-SMI::enterprises\.41916\.100\.1\.1\.0\s=\sHex-STRING:\s(?<event_time_hex>[A-F|0-9|\s]*)"\
| eval event_time_str=printf("%04d",tonumber(substr(event_time_hex,1,2).substr(event_time_hex,4,2),16))."-".printf("%02d",tonumber(substr(event_time_hex, 7,2),16))."-".printf("%02d",tonumber(substr(event_time_hex,10,2),16))." ".printf("%02d",tonumber(substr(event_time_hex,13,2),16)).":".printf("%02d",tonumber(substr(event_time_hex,16,2),16)).":".printf("%02d",tonumber(substr(event_time_hex,19,2),16))." ".if(substr(event_time_hex,25,2) == "2B", "+" , if(substr(event_time_hex,25,2) == "2D", "-", "?")).printf("%02d",tonumber(substr(event_time_hex,28,2),16)).":".printf("%02d",tonumber(substr(event_time_hex,31,2),16))\
| eval _raw=replace(_raw, event_time_hex, event_time_str)]\
| append [search index=thousandeyes sourcetype="thousandeyes:alerts" include=1 "alert.agents{}.metricsAtEnd"!="N/A (agent removed from test)"\
| eval current_time = now()\
| eval window_end = current_time - (current_time % 60)\
| eval window_start = window_end - 60\
| rename alert.agents{}.agentName As agentName\
| sort _time\
| streamstats current=f window=1 global=f last(eventType) as last_eventType by alert.ruleId\
| sort -_time\
| where ((eventType != last_eventType) Or (IsNull(last_eventType))) And ((_time >= window_start) And (_time < window_end))]\
| append [search index=thousandeyes sourcetype="thousandeyes:enriched_alerts"\
| eval current_time = now()\
| eval window_end = current_time - (current_time % 60)\
| eval window_start = window_end - 60\
| dedup agentName, ruleName]\
| eval events=_raw . "---"\
| eval urlLength = len(viewUrl)\
| eval snapshotlink = case(urlLength=0,"",urlLength>0,"---The ThousandEyes snapshot can be viewed at: [code]<a href=\"" . viewUrl. "\">" . viewUrl . "</a>[/code]---")\
| where ((_time >= window_start) And (_time < window_end))\
| transaction test_group\
| eval comments="The following ThousandEyes alerts and/or SNMP traps were received during the previous minute:---" . mvjoin('events',"")\
| eval comments=case(isnull(snapshotlink), comments, 1=1, comments . snapshotlink)\
| rex mode=sed field=comments "s/---/\n\n/g"\
| rex mode=sed field=comments "s/SNMPv2-MIB::snmpTrapOID.0/\nSNMPv2-MIB::snmpTrapOID.0/g"\
| rex mode=sed field=comments "s/SNMPv2-SMI::enterprises.41916.100.1.1.0 = Hex-STRING: /\nEvent Time: /g"\
| rex mode=sed field=comments "s/SNMPv2-SMI::enterprises.41916.100.1.2.0 = INTEGER: /\nSeverity: /g"\
| rex mode=sed field=comments "s/SNMPv2-SMI::enterprises.41916.100.1.4.0 = STRING: /\nSource IP: /g"\
| rex mode=sed field=comments "s/SNMPv2-SMI::enterprises.41916.100.1.94.0 = STRING: /\nSource IP: /g"\
| rex mode=sed field=comments "s/SNMPv2-SMI::enterprises.41916.100.1.5.0 = STRING: /\nDestination IP: /g"\
| rex mode=sed field=comments "s/SNMPv2-SMI::enterprises.41916.100.1.95.0 = STRING: /\nDestination IP: /g"\
| rex mode=sed field=comments "s/SNMPv2-SMI::enterprises.41916.100.1.6.0 = INTEGER: /\nProto: /g"\
| rex mode=sed field=comments "s/SNMPv2-SMI::enterprises.41916.100.1.96.0 = INTEGER: /\nProto: /g"\
| rex mode=sed field=comments "s/SNMPv2-SMI::enterprises.41916.100.1.7.0 = Gauge32: /\nSource Port: /g"\
| rex mode=sed field=comments "s/SNMPv2-SMI::enterprises.41916.100.1.97.0 = Gauge32: /\nSource Port: /g"\
| rex mode=sed field=comments "s/SNMPv2-SMI::enterprises.41916.100.1.8.0 = Gauge32: /\nDestination Port: /g"\
| rex mode=sed field=comments "s/SNMPv2-SMI::enterprises.41916.100.1.98.0 = Gauge32: /\nDestination Port: /g"\
| rex mode=sed field=comments "s/SNMPv2-SMI::enterprises.41916.100.1.9.0 = STRING: /\nLocal System IP: /g"\
| rex mode=sed field=comments "s/SNMPv2-SMI::enterprises.41916.100.1.99.0 = STRING: /\nLocal System IP: /g"\
| rex mode=sed field=comments "s/SNMPv2-SMI::enterprises.41916.100.1.10.0 = STRING: /\nLocal Color: /g"\
| rex mode=sed field=comments "s/SNMPv2-SMI::enterprises.41916.100.1.100.0 = STRING: /\nLocal Color: /g"\
| rex mode=sed field=comments "s/SNMPv2-SMI::enterprises.41916.100.1.11.0 = STRING: /\nRemote System IP: /g"\
| rex mode=sed field=comments "s/SNMPv2-SMI::enterprises.41916.100.1.101.0 = STRING: /\nRemote System IP: /g"\
| rex mode=sed field=comments "s/SNMPv2-SMI::enterprises.41916.100.1.12.0 = STRING: /\nRemote Color: /g"\
| rex mode=sed field=comments "s/SNMPv2-SMI::enterprises.41916.100.1.102.0 = STRING: /\nRemote Color: /g"\
| rex mode=sed field=comments "s/SNMPv2-SMI::enterprises.41916.100.1.103.0 = Gauge32: /\nMean Loss: /g"\
| rex mode=sed field=comments "s/SNMPv2-SMI::enterprises.41916.100.1.104.0 = Gauge32: /\nMean Latency: /g"\
| rex mode=sed field=comments "s/SNMPv2-SMI::enterprises.41916.100.1.137.0 = Gauge32: /\nMean Jitter: /g"\
| rex mode=sed field=comments "s/SNMPv2-SMI::enterprises.41916.100.1.105.0 = STRING: /\nSLA Classes: /g"\
| rex mode=sed field=comments "s/SNMPv2-SMI::enterprises.41916.100.1.153.0 = STRING: /\nOld SLA Classes: /g"\
| rex mode=sed field=comments "s/SNMPv2-SMI::enterprises.41916.100.1.13.0 = INTEGER: /\nNew State: /g"\
| rex mode=sed field=comments "s/SNMPv2-SMI::enterprises.41916.100.1.126.0 = INTEGER: /\nDeleted: /g"\
| rex mode=sed field=comments "s/SNMPv2-SMI::enterprises.41916.100.1.164.0 = INTEGER: /\nFlap Reason: /g"\
| join test_group type="left" [search index=thousandeyes_alertId_lookup earliest=-7d\
| dedup test_group]\
| eval next_correlation_index=now()\
| eval correlation_index = if(correlation_index > 0,correlation_index, next_correlation_index)\
| eval correlation_id = test_group . "_" . correlation_index\
| join correlation_id type="left" [search index=main sourcetype="snow:incident" correlation_display=Splunk earliest=-7d\
| dedup correlation_id]\
| eval dv_active = if(dv_active="false","false","true")\
| eval current_correlation_index = if(dv_active="true", correlation_index, next_correlation_index)\
| eval correlation_id = test_group . "_" . current_correlation_index\
| eval time_of_event=_time\
| eval category="Network"\
| eval contact_type="None"\
| eval priority="3"\
| eval short_description="ThousandEyes alerts / SNMP traps triggered for test group: " . test_group\
| eval account=if(isnull(comments),null(),"thousandeyes")\
| fields correlation_id, short_description, comments, account, category, priority\
| snowincidentstream\
| rex field="Correlation ID" "(?<test_group>[^_]*)_(?<new_correlation_index>.*)"\
| convert num(new_correlation_index) As new_correlation_index\
| eval correlation_index = new_correlation_index\
| eval _time = now()\
| table _time, test_group, correlation_index\
| collect index=thousandeyes_alertId_lookup

[ThousandEyes / SNOW Integration #2]
alert.track = 0
cron_schedule = * * * * *
dispatch.earliest_time = -2m@m
dispatch.latest_time = -1m@m
enableSched = 1
search = index=snmptrap sourcetype=snmptrap test_group=* type="AAR"\
| dedup test_group\
| eval description=description1 . " " . description2\
| where sla_classes = "None"\
| append [search index=snmptrap sourcetype=snmptrap test_group=* type="BFD"\
| dedup test_group\
| eval description=description1 . " " . description2\
| where flap_reason!=4]\
| append [search index=thousandeyes sourcetype="thousandeyes:alerts" include=1\
| dedup test_group, alert.ruleId\
| where eventType="ALERT_NOTIFICATION_TRIGGER"]\
| append [search index=thousandeyes sourcetype="thousandeyes:enriched_alerts"\
| sort -_time\
| dedup test_group\
| eval description = description . " " . details\
| where eventType="ALERT_NOTIFICATION_TRIGGER"]\
| transaction rule_group mvlist=t\
| eval max_weight = max(weight)\
| eval weight_index = mvfind(weight, max_weight)\
| eval max_description = mvindex(description, weight_index)\
| eval test_group = mvindex(test_group, 0)\
| join test_group type="left" [search index=thousandeyes_alertId_lookup earliest=-30d\
| dedup test_group]\
| eval correlation_id = test_group . "_" . correlation_index\
| join correlation_id type="left" [search index=thousandeyes_incident_values_lookup earliest=-30d\
| dedup correlation_id\
| eval stored_weight = weight]\
| eval current_weight_value = if(isNull(stored_weight),0,stored_weight)\
| eval account=if(max_weight > current_weight_value,"thousandeyes",null())\
| rename max_weight As weight\
| eval _time = now()\
| rename max_description As description\
| table _time, correlation_id, weight, description, account\
| collect index=thousandeyes_incident_values_lookup\
| rename description As comments\
| eval comments = "The problem has been identified as:---" . comments\
| rex mode=sed field=comments "s/---/\n\n/g"\
| fields correlation_id, account, comments\
| snowincidentstream


[ThousandEyes Alerts to Metrics]
action.email.show_password = 1
action.email.useNSSubject = 1
alert.track = 0
cron_schedule = * * * * *
dispatch.earliest_time = -30d@d
dispatch.latest_time = now
display.general.timeRangePicker.show = 0
enableSched = 1
schedule_priority = higher
search = index=thousandeyes sourcetype=thousandeyes:alerts earliest=-30d\
| dedup alert.testId, alert.ruleId\
| rename alert.agents{}.agentName as agentName\
| eval event_time=_time\
| eval _time=now()\
| eval state=case(eventType="ALERT_NOTIFICATION_CLEAR",1,eventType="ALERT_NOTIFICATION_TRIGGER",2)\
| eval event_time_str=strftime(event_time,"%Y-%m-%d %H:%M:%S")\
| eval duration=_time-event_time\
| eval days = floor(duration / (24 * 60 * 60))\
| eval hours = floor((duration - (days * 24 * 60 * 60)) / (60 * 60))\
| eval minutes = floor((duration - (days * 24 * 60 * 60) - (hours * 60 * 60)) / 60)\
| eval duration_str = days . "d " . hours . "h " . minutes . "m"\
| table _time, event_time_str, agentName, duration, duration_str, test_group, alert.testId, alert.testName, category, eventId, alert.alertId, alert.ruleId, alert.ruleName, alert.ruleExpression, eventType, state, weight, score\
| collect index=thousandeyes_alert_status
