[FIM Added Modified Removed]
dispatch.earliest_time = -30d@d
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","ElementId","NodeIp","Result State","Test Name","NodeName","NodeType","AccessType","Actual Value","Approval ID","AppType","AssociatedObjects","Attributes","C","Change Type","ChangeType","CN","command","date_hour","date_mday","date_minute","date_month","date_second","date_wday","date_year","date_zone","Description","Element","Element Name","ElementName","End","eventtype","EventType","EXTRA_FIELD_11","HostName","ids_type","index","L","linecount","LogCategory","LogId","LogUser","meta","Msg","Node Name","Node Type","NodeId","O","Only","OU","Parent Test Group","Policy","product","punct","Range","Remediation","Result Time","Results","ResultState","Rule Name","RuleName","severity","Severity","Severity Name","SeverityName","signature","splunk_server","src","ST","tag","tag::eventtype","TestName","timeendpos","timestamp","timestartpos","user","Users","vendor","VerId","Version Time","Weights","Approval ID","Approval ID","Approval ID"]
display.events.maxLines = 0
display.general.type = visualizations
display.page.search.mode = verbose
display.statistics.drilldown = row
display.statistics.overlay = heatmap
display.statistics.wrap = 0
display.visualizations.chartHeight = 388
display.visualizations.charting.chart = bar
display.visualizations.charting.chart.stackMode = stacked
display.visualizations.charting.legend.placement = top
request.ui_dispatch_app = te
request.ui_dispatch_view = search
search = index="te" sourcetype=te_fim_csv "Change Type"!="Change Type" | table _time  ChangeType "Element Name" NodeName "Node Type" "Rule Name" Severity "Severity Name" Users "Version Time" assetviewid tenodetype make model version | chart count over NodeName  by ChangeType  | addtotals fieldname=temp_sort  *  | sort - temp_sort   | fields - temp_sort

[FIM Added Modified Removed Trending]
dispatch.earliest_time = -30d@d
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","ElementId","NodeIp","Result State","Test Name","NodeName","NodeType","AccessType","Actual Value","Approval ID","AppType","AssociatedObjects","Attributes","C","Change Type","ChangeType","CN","command","date_hour","date_mday","date_minute","date_month","date_second","date_wday","date_year","date_zone","Description","Element","Element Name","ElementName","End","eventtype","EventType","EXTRA_FIELD_11","HostName","ids_type","index","L","linecount","LogCategory","LogId","LogUser","meta","Msg","Node Name","Node Type","NodeId","O","Only","OU","Parent Test Group","Policy","product","punct","Range","Remediation","Result Time","Results","ResultState","Rule Name","RuleName","severity","Severity","Severity Name","SeverityName","signature","splunk_server","src","ST","tag","tag::eventtype","TestName","timeendpos","timestamp","timestartpos","user","Users","vendor","VerId","Version Time","Weights","Approval ID","Approval ID","Approval ID"]
display.events.maxLines = 0
display.general.type = visualizations
display.page.search.mode = verbose
display.statistics.drilldown = row
display.statistics.wrap = 0
display.visualizations.chartHeight = 388
display.visualizations.charting.axisY.scale = log
display.visualizations.charting.axisY2.scale = log
display.visualizations.charting.layout.splitSeries = 1
request.ui_dispatch_app = te
request.ui_dispatch_view = search
search = index="te" sourcetype=te_fim_csv "Change Type"!="Change Type" | table _time  ChangeType "Element Name" NodeName "Node Type" "Rule Name" Severity "Severity Name" Users "Version Time" assetviewid tenodetype make model version | timechart sum(eval(ChangeType =tostring(`gettext_added`))) AS Added sum(eval(ChangeType =tostring(`gettext_modified`))) AS Modified sum(eval(ChangeType =tostring(`gettext_removed`))) AS Removed

[FIM Authorized v Unauthorized Changes Trending]
dispatch.earliest_time = -30d@d
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","ElementId","NodeIp","Result State","Test Name","NodeName","NodeType","AccessType","Actual Value","Approval ID","AppType","AssociatedObjects","Attributes","C","Change Type","ChangeType","CN","command","date_hour","date_mday","date_minute","date_month","date_second","date_wday","date_year","date_zone","Description","Element","Element Name","ElementName","End","eventtype","EventType","EXTRA_FIELD_11","HostName","ids_type","index","L","linecount","LogCategory","LogId","LogUser","meta","Msg","Node Name","Node Type","NodeId","O","Only","OU","Parent Test Group","Policy","product","punct","Range","Remediation","Result Time","Results","ResultState","Rule Name","RuleName","severity","Severity","Severity Name","SeverityName","signature","splunk_server","src","ST","tag","tag::eventtype","TestName","timeendpos","timestamp","timestartpos","user","Users","vendor","VerId","Version Time","Weights","Approval ID","Approval ID","Approval ID"]
display.events.maxLines = 0
display.general.type = visualizations
display.page.search.mode = verbose
display.statistics.drilldown = row
display.statistics.overlay = heatmap
display.statistics.wrap = 0
display.visualizations.chartHeight = 388
display.visualizations.charting.axisY.scale = log
display.visualizations.charting.chart.overlayFields = NO
request.ui_dispatch_app = te
request.ui_dispatch_view = search
search = index=te sourcetype="te_fim_csv" NodeName=*   | rename "Version Time" as VersionTime,"Change Type" as ChangeType,"Approval ID" as ApprovalID | eval appidlen=len(ApprovalID)| eval Authorized=if(appidlen>0,"YES","NO") | table VersionTime Authorized NodeName RuleName ElementName ApprovalID SeverityName ChangeType assetviewid tenodetype make model version _time  | timechart count by Authorized

[FIM Authorized v Unauthorized Changes by User]
dispatch.earliest_time = -30d@d
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","ElementId","NodeIp","Result State","Test Name","NodeName","NodeType","AccessType","Actual Value","Approval ID","AppType","AssociatedObjects","Attributes","C","Change Type","ChangeType","CN","command","date_hour","date_mday","date_minute","date_month","date_second","date_wday","date_year","date_zone","Description","Element","Element Name","ElementName","End","eventtype","EventType","EXTRA_FIELD_11","HostName","ids_type","index","L","linecount","LogCategory","LogId","LogUser","meta","Msg","Node Name","Node Type","NodeId","O","Only","OU","Parent Test Group","Policy","product","punct","Range","Remediation","Result Time","Results","ResultState","Rule Name","RuleName","severity","Severity","Severity Name","SeverityName","signature","splunk_server","src","ST","tag","tag::eventtype","TestName","timeendpos","timestamp","timestartpos","user","Users","vendor","VerId","Version Time","Weights","Approval ID","Approval ID","Approval ID"]
display.events.maxLines = 0
display.general.type = visualizations
display.page.search.mode = verbose
display.statistics.drilldown = row
display.statistics.overlay = heatmap
display.statistics.wrap = 0
display.visualizations.chartHeight = 495
display.visualizations.charting.axisLabelsX.majorLabelStyle.overflowMode = ellipsisMiddle
display.visualizations.charting.axisLabelsX.majorLabelStyle.rotation = 45
display.visualizations.charting.axisY.scale = log
display.visualizations.charting.chart = line
display.visualizations.charting.chart.overlayFields = YES
display.visualizations.charting.legend.labelStyle.overflowMode = ellipsisEnd
display.visualizations.charting.legend.placement = top
request.ui_dispatch_app = te
request.ui_dispatch_view = search
search = index=te sourcetype="te_fim_csv" Users!=Users   | rename "Version Time" as VersionTime,"Change Type" as ChangeType,"Approval ID" as ApprovalID | eval appidlen=len(ApprovalID)| eval Authorized=if(appidlen>0,"YES","NO") | table Users VersionTime Authorized NodeName RuleName  ElementName SeverityName ChangeType assetviewid tenodetype make model version _time | stats  sum(eval(Authorized="NO")) AS NO sum(eval(Authorized="YES")) AS YES by Users | sort -NO

[FIM Changes by Rule Name]
dispatch.earliest_time = -30d@d
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","ElementId","NodeIp","Result State","Test Name","NodeName","NodeType","AccessType","Actual Value","Approval ID","AppType","AssociatedObjects","Attributes","C","Change Type","ChangeType","CN","command","date_hour","date_mday","date_minute","date_month","date_second","date_wday","date_year","date_zone","Description","Element","Element Name","ElementName","End","eventtype","EventType","EXTRA_FIELD_11","HostName","ids_type","index","L","linecount","LogCategory","LogId","LogUser","meta","Msg","Node Name","Node Type","NodeId","O","Only","OU","Parent Test Group","Policy","product","punct","Range","Remediation","Result Time","Results","ResultState","Rule Name","RuleName","severity","Severity","Severity Name","SeverityName","signature","splunk_server","src","ST","tag","tag::eventtype","TestName","timeendpos","timestamp","timestartpos","user","Users","vendor","VerId","Version Time","Weights","Approval ID","Approval ID","Approval ID"]
display.events.maxLines = 0
display.general.type = visualizations
display.page.search.mode = verbose
display.statistics.wrap = 0
display.visualizations.chartHeight = 388
display.visualizations.charting.axisY.scale = log
display.visualizations.charting.chart = area
display.visualizations.charting.legend.placement = bottom
request.ui_dispatch_app = te
request.ui_dispatch_view = search
search = index=te sourcetype=te_fim_csv | table _time ChangeType ElementName "Node Type" NodeName RuleName Severity SeverityName Users "Version Time" assetviewid tenodetype make model version | timechart count by RuleName useother=f usenull=f

[FIM Changes by Severity]
dispatch.earliest_time = -30d@d
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","ElementId","NodeIp","Result State","Test Name","NodeName","NodeType","AccessType","Actual Value","Approval ID","AppType","AssociatedObjects","Attributes","C","Change Type","ChangeType","CN","command","date_hour","date_mday","date_minute","date_month","date_second","date_wday","date_year","date_zone","Description","Element","Element Name","ElementName","End","eventtype","EventType","EXTRA_FIELD_11","HostName","ids_type","index","L","linecount","LogCategory","LogId","LogUser","meta","Msg","Node Name","Node Type","NodeId","O","Only","OU","Parent Test Group","Policy","product","punct","Range","Remediation","Result Time","Results","ResultState","Rule Name","RuleName","severity","Severity","Severity Name","SeverityName","signature","splunk_server","src","ST","tag","tag::eventtype","TestName","timeendpos","timestamp","timestartpos","user","Users","vendor","VerId","Version Time","Weights","Approval ID","Approval ID","Approval ID"]
display.events.maxLines = 0
display.general.type = visualizations
display.page.search.mode = verbose
display.statistics.wrap = 0
display.visualizations.chartHeight = 388
display.visualizations.charting.axisY.scale = log
display.visualizations.charting.chart = area
display.visualizations.charting.legend.placement = bottom
request.ui_dispatch_app = te
request.ui_dispatch_view = search
search = index=te  sourcetype=te_fim_csv | table _time ChangeType ElementName "Node Type" NodeName RuleName Severity SeverityName Users "Version Time" assetviewid tenodetype make model version |  timechart count by "SeverityName" useother=f usenull=f

[FIM Frequently Changed Nodes]
dispatch.earliest_time = -30d@d
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","ElementId","NodeIp","Result State","Test Name","NodeName","NodeType","AccessType","Actual Value","Approval ID","AppType","AssociatedObjects","Attributes","C","Change Type","ChangeType","CN","command","date_hour","date_mday","date_minute","date_month","date_second","date_wday","date_year","date_zone","Description","Element","Element Name","ElementName","End","eventtype","EventType","EXTRA_FIELD_11","HostName","ids_type","index","L","linecount","LogCategory","LogId","LogUser","meta","Msg","Node Name","Node Type","NodeId","O","Only","OU","Parent Test Group","Policy","product","punct","Range","Remediation","Result Time","Results","ResultState","Rule Name","RuleName","severity","Severity","Severity Name","SeverityName","signature","splunk_server","src","ST","tag","tag::eventtype","TestName","timeendpos","timestamp","timestartpos","user","Users","vendor","VerId","Version Time","Weights","Approval ID","Approval ID","Approval ID"]
display.events.maxLines = 0
display.general.type = visualizations
display.page.search.mode = verbose
display.statistics.drilldown = row
display.statistics.overlay = heatmap
display.statistics.wrap = 0
display.visualizations.chartHeight = 495
display.visualizations.charting.axisLabelsX.majorLabelStyle.overflowMode = ellipsisMiddle
display.visualizations.charting.axisLabelsX.majorLabelStyle.rotation = 45
display.visualizations.charting.chart = bar
display.visualizations.charting.chart.stackMode = stacked
display.visualizations.charting.legend.labelStyle.overflowMode = ellipsisEnd
display.visualizations.charting.legend.placement = top
request.ui_dispatch_app = te
request.ui_dispatch_view = search
search = index=te sourcetype="te_fim_csv" ChangeType!=ChangeType ChangeType!="Change Type" | rename "Version Time" as VersionTime | table VersionTime NodeName ChangeType ElementName "Node Type" RuleName SeverityName assetviewid tenodetype make model version | chart count over NodeName by ChangeType | addtotals  | sort -Total  | fields - Total

[SCM %Passed %Failed Trending]
dispatch.earliest_time = -30d@d
dispatch.latest_time = now

display.events.fields = ["host","source","sourcetype","ElementId","NodeIp","Result State","Test Name","NodeName","NodeType","AccessType","Actual Value","Approval ID","AppType","AssociatedObjects","Attributes","C","Change Type","ChangeType","CN","command","date_hour","date_mday","date_minute","date_month","date_second","date_wday","date_year","date_zone","Description","Element","Element Name","ElementName","End","eventtype","EventType","EXTRA_FIELD_11","HostName","ids_type","index","L","linecount","LogCategory","LogId","LogUser","meta","Msg","Node Name","Node Type","NodeId","O","Only","OU","Parent Test Group","Policy","product","punct","Range","Remediation","Result Time","Results","ResultState","Rule Name","RuleName","severity","Severity","Severity Name","SeverityName","signature","splunk_server","src","ST","tag","tag::eventtype","TestName","timeendpos","timestamp","timestartpos","user","Users","vendor","VerId","Version Time","Weights","Approval ID","Approval ID","Approval ID"]
display.events.maxLines = 0
display.general.type = visualizations
display.page.search.mode = verbose
display.statistics.drilldown = row
display.statistics.overlay = heatmap
display.statistics.wrap = 0
display.visualizations.chartHeight = 388
display.visualizations.charting.axisY.scale = log
display.visualizations.charting.chart.overlayFields = Failed,%Failed
display.visualizations.charting.legend.placement = top
request.ui_dispatch_app = te
request.ui_dispatch_view = search
search = index=te sourcetype="te_scm_csv" "Result State"=passed OR "Result State"=failed | rename "Version Time" as VersionTime,"Change Type" as ChangeType,"Approval ID" as ApprovalID,"Result State" as ResultState | table  _time NodeName NodeType "Actual Value" "Parent Test Group" ResultState TestName Element assetviewid tenodetype make model version  | timechart count(ResultState) AS Count count(eval(ResultState="passed")) AS Passed count(eval(ResultState="failed")) AS Failed | where Count>=1  | eval %Failed=round(Failed / Count * 100,2) | eval %Passed=round(Passed / Count * 100,2)

[SCM Parent Test Groups]
dispatch.earliest_time = -30d@d
dispatch.latest_time = now

display.events.fields = ["host","source","sourcetype","ElementId","NodeIp","Result State","Test Name","NodeName","NodeType","AccessType","Actual Value","Approval ID","AppType","AssociatedObjects","Attributes","C","Change Type","ChangeType","CN","command","date_hour","date_mday","date_minute","date_month","date_second","date_wday","date_year","date_zone","Description","Element","Element Name","ElementName","End","eventtype","EventType","EXTRA_FIELD_11","HostName","ids_type","index","L","linecount","LogCategory","LogId","LogUser","meta","Msg","Node Name","Node Type","NodeId","O","Only","OU","Parent Test Group","Policy","product","punct","Range","Remediation","Result Time","Results","ResultState","Rule Name","RuleName","severity","Severity","Severity Name","SeverityName","signature","splunk_server","src","ST","tag","tag::eventtype","TestName","timeendpos","timestamp","timestartpos","user","Users","vendor","VerId","Version Time","Weights","Approval ID","Approval ID","Approval ID"]
display.events.maxLines = 0
display.general.type = visualizations
display.page.search.mode = verbose
display.statistics.drilldown = row
display.statistics.wrap = 0
display.visualizations.chartHeight = 388
display.visualizations.charting.chart = pie
request.ui_dispatch_app = te
request.ui_dispatch_view = search
search = index=te sourcetype="te_scm_csv" ResultState=failed | table ResultState "Actual Value" Element NodeName NodeType Policy "Parent Test Group" TestName assetviewid tenodetype make model version _time | chart count by  Policy | sort -count

[SCM Parent Test Groups Trending]
dispatch.earliest_time = -30d@d
dispatch.latest_time = now

display.events.fields = ["host","source","sourcetype","ElementId","NodeIp","Result State","Test Name","NodeName","NodeType","AccessType","Actual Value","Approval ID","AppType","AssociatedObjects","Attributes","C","Change Type","ChangeType","CN","command","date_hour","date_mday","date_minute","date_month","date_second","date_wday","date_year","date_zone","Description","Element","Element Name","ElementName","End","eventtype","EventType","EXTRA_FIELD_11","HostName","ids_type","index","L","linecount","LogCategory","LogId","LogUser","meta","Msg","Node Name","Node Type","NodeId","O","Only","OU","Parent Test Group","Policy","product","punct","Range","Remediation","Result Time","Results","ResultState","Rule Name","RuleName","severity","Severity","Severity Name","SeverityName","signature","splunk_server","src","ST","tag","tag::eventtype","TestName","timeendpos","timestamp","timestartpos","user","Users","vendor","VerId","Version Time","Weights","Approval ID","Approval ID","Approval ID"]
display.events.maxLines = 0
display.general.type = visualizations
display.page.search.mode = verbose
display.statistics.drilldown = row
display.statistics.wrap = 0
display.visualizations.chartHeight = 388
display.visualizations.charting.axisY.scale = log
display.visualizations.charting.legend.placement = top
request.ui_dispatch_app = te
request.ui_dispatch_view = search
search = index=te sourcetype="te_scm_csv" ResultState=failed | table ResultState "Actual Value" Element NodeName NodeType Policy "Parent Test Group" TestName assetviewid tenodetype make model version _time | timechart count by Policy  useother=f usenull=f

[SCM Passed or Failed Table]
dispatch.earliest_time = -30d@d
dispatch.latest_time = now

display.events.fields = ["host","source","sourcetype","ElementId","NodeIp","Result State","Test Name","NodeName","NodeType","AccessType","Actual Value","Approval ID","AppType","AssociatedObjects","Attributes","C","Change Type","ChangeType","CN","command","date_hour","date_mday","date_minute","date_month","date_second","date_wday","date_year","date_zone","Description","Element","Element Name","ElementName","End","eventtype","EventType","EXTRA_FIELD_11","HostName","ids_type","index","L","linecount","LogCategory","LogId","LogUser","meta","Msg","Node Name","Node Type","NodeId","O","Only","OU","Parent Test Group","Policy","product","punct","Range","Remediation","Result Time","Results","ResultState","Rule Name","RuleName","severity","Severity","Severity Name","SeverityName","signature","splunk_server","src","ST","tag","tag::eventtype","TestName","timeendpos","timestamp","timestartpos","user","Users","vendor","VerId","Version Time","Weights","Approval ID","Approval ID","Approval ID"]
display.events.maxLines = 0
display.general.enablePreview = 0
display.general.type = statistics
display.page.search.mode = verbose
display.statistics.drilldown = row
display.statistics.overlay = heatmap
display.statistics.wrap = 0
display.visualizations.chartHeight = 388
display.visualizations.charting.chart = line
display.visualizations.show = 0
request.ui_dispatch_app = te
request.ui_dispatch_view = search
search = index=te sourcetype=te_scm_csv NodeName=* Policy="*" ResultState="passed" OR ResultState="failed" | table "Policy","Result Time",NodeName,"Parent Test Group",TestName, Element ResultState assetviewid tenodetype make model version  | eval  numericstate=if(ResultState="passed",1,0) | stats count by "Policy","Result Time","NodeName","Parent Test Group","TestName", Element "ResultState" | sort -"Result Time"

[SCM Passed v Failed]
dispatch.earliest_time = -30d@d
dispatch.latest_time = now

display.events.fields = ["host","source","sourcetype","ElementId","NodeIp","Result State","Test Name","NodeName","NodeType","AccessType","Actual Value","Approval ID","AppType","AssociatedObjects","Attributes","C","Change Type","ChangeType","CN","command","date_hour","date_mday","date_minute","date_month","date_second","date_wday","date_year","date_zone","Description","Element","Element Name","ElementName","End","eventtype","EventType","EXTRA_FIELD_11","HostName","ids_type","index","L","linecount","LogCategory","LogId","LogUser","meta","Msg","Node Name","Node Type","NodeId","O","Only","OU","Parent Test Group","Policy","product","punct","Range","Remediation","Result Time","Results","ResultState","Rule Name","RuleName","severity","Severity","Severity Name","SeverityName","signature","splunk_server","src","ST","tag","tag::eventtype","TestName","timeendpos","timestamp","timestartpos","user","Users","vendor","VerId","Version Time","Weights","Approval ID","Approval ID","Approval ID"]
display.events.maxLines = 0
display.general.type = visualizations
display.page.search.mode = verbose
display.statistics.wrap = 0
display.visualizations.chartHeight = 388
display.visualizations.charting.axisY2.enabled = 1
display.visualizations.charting.axisY2.scale = log
display.visualizations.charting.chart.overlayFields = failed
display.visualizations.charting.legend.placement = top
request.ui_dispatch_app = te
request.ui_dispatch_view = search
search = index=te sourcetype=te_scm_csv ResultState="passed" OR ResultState="failed" | table  _time NodeName NodeType "Actual Value" "Parent Test Group" ResultState TestName Element assetviewid tenodetype make model version | timechart  count by ResultState | where failed>=1 OR passed>=1

[SYSLOG Activities Trending]
dispatch.earliest_time = -30d@d
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","ElementId","NodeIp","Result State","Test Name","NodeName","NodeType","AccessType","Actual Value","Approval ID","AppType","AssociatedObjects","Attributes","C","Change Type","ChangeType","CN","command","date_hour","date_mday","date_minute","date_month","date_second","date_wday","date_year","date_zone","Description","Element","Element Name","ElementName","End","eventtype","EventType","EXTRA_FIELD_11","HostName","ids_type","index","L","linecount","LogCategory","LogId","LogUser","meta","Msg","Node Name","Node Type","NodeId","O","Only","OU","Parent Test Group","Policy","product","punct","Range","Remediation","Result Time","Results","ResultState","Rule Name","RuleName","severity","Severity","Severity Name","SeverityName","signature","splunk_server","src","ST","tag","tag::eventtype","TestName","timeendpos","timestamp","timestartpos","user","Users","vendor","VerId","Version Time","Weights","Approval ID","Approval ID","Approval ID"]
display.events.maxLines = 0
display.general.type = visualizations
display.page.search.mode = verbose
display.statistics.drilldown = row
display.statistics.overlay = heatmap
display.statistics.wrap = 0
display.visualizations.chartHeight = 495
display.visualizations.charting.legend.labelStyle.overflowMode = ellipsisEnd
display.visualizations.charting.legend.placement = top
request.ui_dispatch_app = te
request.ui_dispatch_view = search
search = index=te sourcetype=te_syslog LogCategory!="Audit Event" | rex field=_raw " Msg=\"(?<Msg>.+)" | table _time HostName LogCategory LogUser Msg |  timechart count by LogCategory useother=f usenull=f

[SYSLOG Audit Event Rate]
dispatch.earliest_time = -30d@d
dispatch.latest_time = now

display.events.fields = ["host","source","sourcetype","ElementId","NodeIp","Result State","Test Name","NodeName","NodeType","AccessType","Actual Value","Approval ID","AppType","AssociatedObjects","Attributes","C","Change Type","ChangeType","CN","command","date_hour","date_mday","date_minute","date_month","date_second","date_wday","date_year","date_zone","Description","Element","Element Name","ElementName","End","eventtype","EventType","EXTRA_FIELD_11","HostName","ids_type","index","L","linecount","LogCategory","LogId","LogUser","meta","Msg","Node Name","Node Type","NodeId","O","Only","OU","Parent Test Group","Policy","product","punct","Range","Remediation","Result Time","Results","ResultState","Rule Name","RuleName","severity","Severity","Severity Name","SeverityName","signature","splunk_server","src","ST","tag","tag::eventtype","TestName","timeendpos","timestamp","timestartpos","user","Users","vendor","VerId","Version Time","Weights","Approval ID","Approval ID","Approval ID"]
display.events.maxLines = 0
display.general.enablePreview = 0
display.general.type = visualizations
display.page.search.mode = verbose
display.statistics.drilldown = row
display.statistics.wrap = 0
display.visualizations.chartHeight = 388
display.visualizations.charting.axisTitleY.visibility = collapsed
display.visualizations.charting.legend.placement = top
request.ui_dispatch_app = te
request.ui_dispatch_view = search
search = index=te sourcetype=te_syslog LogCategory="Audit Event" | rex field=_raw " Msg=\"(?<Msg>.+)" | table _time LogUser EventType  AppType NodeName LogCategory NodeIp Msg | timechart count by NodeName useother=f usenull=f

[FIM Change Type by Node]
dispatch.earliest_time = -30d@d
dispatch.latest_time = now

request.ui_dispatch_app = te
request.ui_dispatch_view = search
search = index=te sourcetype=te_fim_csv ChangeType!="Change Type" | table _time ChangeType ElementName "Node Type" NodeName RuleName Severity SeverityName Users "Version Time" assetviewid tenodetype make model version | chart count over NodeName by ChangeType | sort -Added -Modified -Removed

[FIM Expected Observed Hashes]
dispatch.earliest_time = -30d@d
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","ElementId","NodeIp","Result State","Test Name","NodeName","NodeType","AccessType","Actual Value","Approval ID","AppType","AssociatedObjects","Attributes","C","Change Type","ChangeType","CN","command","date_hour","date_mday","date_minute","date_month","date_second","date_wday","date_year","date_zone","Description","Element","Element Name","ElementName","End","eventtype","EventType","EXTRA_FIELD_11","HostName","ids_type","index","L","linecount","LogCategory","LogId","LogUser","meta","Msg","Node Name","Node Type","NodeId","O","Only","OU","Parent Test Group","Policy","product","punct","Range","Remediation","Result Time","Results","ResultState","Rule Name","RuleName","severity","Severity","Severity Name","SeverityName","signature","splunk_server","src","ST","tag","tag::eventtype","TestName","timeendpos","timestamp","timestartpos","user","Users","vendor","VerId","Version Time","Weights","Approval ID","Approval ID","Approval ID"]
display.events.maxLines = 0
display.general.enablePreview = 0
display.general.type = statistics
display.page.search.mode = verbose
display.statistics.drilldown = row
display.statistics.rowNumbers = 1
display.statistics.wrap = 0
display.visualizations.chartHeight = 495
display.visualizations.charting.legend.labelStyle.overflowMode = ellipsisEnd
display.visualizations.show = 0
request.ui_dispatch_app = te
request.ui_dispatch_view = search
search = index=te (SHA-1 OR MD5) * NodeName="*" ElementName="*" Users="*" RuleName="*"| rex mode=sed field=Attributes "s/\;/,/g" | rex mode=sed field=Attributes "s/\"//g" | rex field=Attributes "Observed\=(?<Observed_Hash>[A-Fa-f0-9]{40})" | rex field=Attributes "Expected\=(?<Expected_Hash>[A-Fa-f0-9]{40})"|rename ElementName as "File Name"| table _time,"Node Name","Change Type","File Name","Users","Rule Name","Expected_Hash","Observed_Hash" assetviewid tenodetype make model version | search (Expected_Hash= "*" OR Observed_Hash="*")


[TE Assets Lookup Table Builder]
dispatch.earliest_time = -120d@d
dispatch.latest_time = now
action.lookup = 1
action.lookup.filename = te_assets.csv
alert.track = 0
cron_schedule = 0 * * * *
enableSched = 1
search = index=te_assets_lookuptable_builder sourcetype=te_assets | outputlookup te_assets.csv

