[RHEBO-AL-01]
action.email = 1
action.email.message.alert = The alert condition for '$name$' was triggered.\
\
Alert-ID: $name$\

action.email.priority = 2
action.email.subject.alert = $name$ | Potential MACFlooding
action.email.useNSSubject = 1
action.webhook.enable_allowlist = 0
alert.expires = 7d
alert.severity = 4
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = */10 * * * *
description = The detection of multiple new MAC-adresses in a considerably short amount of time should be monitored. An unusual amount of new MAC-adresses has to be alerted.
dispatch.earliest_time = -10m@m
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","signature"]
display.general.type = statistics
display.page.search.tab = statistics
enableSched = 1
quantity = 20
relation = greater than
request.ui_dispatch_app = rhebo-app
request.ui_dispatch_view = search
search = eventtype="rhebo_syslog" signature="MAC_ACTIVE" earliest=-10m@m | stats count as "New MAC's"

[RHEBO-AL-02]
action.email = 1
action.email.message.alert = The alert condition for '$name$' was triggered.\
\
Alert-ID: $name$\

action.email.priority = 2
action.email.subject.alert = $name$ | Potential IP-Flooding (DOS)
action.email.useNSSubject = 1
action.webhook.enable_allowlist = 0
alert.expires = 7d
alert.severity = 4
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = */10 * * * *
description = The detection of multiple new IP-adresses in a considerably short amount of time should be monitored. An unusual amount of new IP-adresses has to be alerted.
dispatch.earliest_time = -10m@m
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","signature"]
display.general.type = statistics
display.page.search.tab = statistics
enableSched = 1
quantity = 20
relation = greater than
request.ui_dispatch_app = rhebo-app
request.ui_dispatch_view = search
search = eventtype="rhebo_syslog" signature="IP_ACTIVE" earliest=-10m@m | stats count as "New IP's"

[RHEBO-AL-03]
action.email = 1
action.email.message.alert = The alert condition for '$name$' was triggered.\
\
Alert-ID: $name$\

action.email.priority = 2
action.email.subject.alert = $name$ | Potential DNS Amplification Attacks
action.email.useNSSubject = 1
action.webhook.enable_allowlist = 0
alert.expires = 7d
alert.severity = 4
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = */10 * * * *
description = Unsolicited DNS responses have to be monitored. An unusual amount has to be alerted.
dispatch.earliest_time = -10m@m
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","signature"]
display.general.type = statistics
display.page.search.tab = statistics
enableSched = 1
quantity = 5
relation = greater than
request.ui_dispatch_app = rhebo-app
request.ui_dispatch_view = search
search = eventtype="rhebo_syslog" signature="DNS_UNSOLICITED_RESPONSE" earliest=-10m@m | stats count as "unsolicited DNS responses"

[RHEBO-AL-04]
action.email = 1
action.email.message.alert = The alert condition for '$name$' was triggered.\
\
Alert-ID: $name$\

action.email.priority = 2
action.email.subject.alert = $name$ | Cyclic Message Anomalies
action.email.useNSSubject = 1
action.webhook.enable_allowlist = 0
alert.expires = 7d
alert.severity = 4
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = 1 */10 * * *
description = The detection of multiple anomalies concerning cyclic messages should be monitored. An unusual amount that occur consecutively has to be alerted.
dispatch.earliest_time = -10h@m
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","signature"]
display.general.type = statistics
display.page.search.tab = statistics
enableSched = 1
quantity = 5
relation = greater than
request.ui_dispatch_app = rhebo-app
request.ui_dispatch_view = search
search = eventtype="rhebo_syslog" (signature="CYCLIC_MESSAGE_MISSING" OR signature="CYCLIC_MESSAGE_DOUBLE" OR signature="CYCLIC_MESSAGE_OUT_OF_ORDER" OR signature="CYCLIC_MESSAGE_TOO_EARLY" OR signature="CYCLIC_MESSAGE_TOO_LATE") earliest=-1h@m | stats count as "Cyclic Message Anomalies"

[RHEBO-AL-05]
action.email = 1
action.email.message.alert = The alert condition for '$name$' was triggered.\
\
Alert-ID: $name$\

action.email.priority = 2
action.email.subject.alert = $name$ | Potential TCP SYN flood attack
action.email.useNSSubject = 1
action.webhook.enable_allowlist = 0
alert.expires = 7d
alert.severity = 4
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = */30 * * * *
description = The detection of multiple TCP-SYN-Portscans in a considerably short amount of time should be monitored. An unusual amount of TCP-SYN-Portscans has to be alerted.
dispatch.earliest_time = -30m@m
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","signature"]
display.general.type = statistics
display.page.search.tab = statistics
enableSched = 1
quantity = 3
relation = greater than
request.ui_dispatch_app = rhebo-app
request.ui_dispatch_view = search
search = eventtype="rhebo_syslog" signature="TCP_SYN_PORT_SCAN" earliest=-30m@m| stats count as "TCP Syn Port Scan"

[RHEBO-AL-06]
action.email = 1
action.email.message.alert = The alert condition for '$name$' was triggered.\
\
Alert-ID: $name$\

action.email.priority = 2
action.email.subject.alert = $name$ | Potential teardrop attack
action.email.useNSSubject = 1
action.webhook.enable_allowlist = 0
alert.expires = 7d
alert.severity = 4
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = 5 */10 * * *
description = The detection of IP-fragments and invalid field lengths in a considerably short amount of time should be monitored. An unusual amount of IP-fragments and occuring invalid field lengths has to be alerted.
dispatch.earliest_time = -60m@m
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","signature","smac","dmac","dvc","dst","src"]
display.general.type = statistics
display.page.search.tab = statistics
enableSched = 1
quantity = 3
relation = greater than
request.ui_dispatch_app = rhebo-app
request.ui_dispatch_view = search
search = eventtype="rhebo_syslog" signature="IP_FRAGMENT" earliest=-60m@m| stats count as "IPFrag"| eval IPCheck=case(IPFrag>0,"true")| map search="search index=rhebo signature="IEC60870_5_104_INVALID_LENGTH_FIELD" earliest=-60m@m | stats count as "teardrops" | eval IPCheck=\"$IPCheck$\"| fields - IPCheck"

[RHEBO-AL-07]
action.email = 1
action.email.message.alert = The alert condition for '$name$' was triggered.\
\
Alert-ID: $name$\

action.email.priority = 2
action.email.subject.alert = $name$ | Potential smurf attack
action.email.useNSSubject = 1
action.webhook.enable_allowlist = 0
alert.expires = 7d
alert.severity = 4
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = 7 */10 * * *
description = The detection of an IP-address using another MAC-address in combination with ICMP address scan alerts has to be alerted.
dispatch.earliest_time = -60m@m
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","signature","smac","dmac","dvc","dst","src"]
display.general.type = statistics
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = rhebo-app
request.ui_dispatch_view = search
search = eventtype="rhebo_syslog" signature="IP_MAC" earliest=-60m@m| stats count as "IPMAC"| eval IPCheck=case(IPMAC>0,"true")| map search="search index=rhebo signature="ICMP_ADDRESS_SCAN" earliest=-60m@m | stats count as "Smurf Attacks" | eval IPCheck=\"$IPCheck$\"| fields - IPCheck"

[RHEBO-AL-08]
action.email = 1
action.email.message.alert = The alert condition for '$name$' was triggered.\
\
Alert-ID: $name$\

action.email.priority = 2
action.email.subject.alert = $name$ | Potential session hijacking attack
action.email.useNSSubject = 1
action.webhook.enable_allowlist = 0
alert.expires = 7d
alert.severity = 4
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = 9 */10 * * *
description = An IP address switching MAC address in an open session has to be alerted as an attacker might be communicating with the server.
dispatch.earliest_time = -60m@m
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","signature","smac","dmac","dvc","dst","src"]
display.general.type = statistics
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = rhebo-app
request.ui_dispatch_view = search
search = eventtype="rhebo_syslog" signature="SESSION" earliest=-60m@m | stats count as "SESSION" | eval IPCheck=case(SESSION>0,"true") | map search="search index=rhebo signature="IP_MAC" earliest=-60m@m | stats count as "Session Hijacking Attacks" | eval IPCheck=\"$IPCheck$\"| fields - IPCheck"

[RHEBO-AL-09]
action.email = 1
action.email.message.alert = The alert condition for '$name$' was triggered.\
\
Alert-ID: $name$\

action.email.priority = 2
action.email.subject.alert = $name$ | Potential replay attack
action.email.useNSSubject = 1
action.webhook.enable_allowlist = 0
alert.expires = 7d
alert.severity = 4
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = */30 * * * *
description = The detection of an IP-address using another MAC-address in combination with repeating cyclic messages has to be alerted.
dispatch.earliest_time = -30m@m
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","signature","smac","dmac","dvc","dst","src"]
display.general.type = statistics
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = rhebo-app
request.ui_dispatch_view = search
search = eventtype="rhebo_syslog" signature="IP_MAC" earliest=-30m@m | stats count as "IPFrag"| eval IPCheck=case(IPFrag>0,"true") | map search="search index=rhebo signature IN ("CYCLIC_MESSAGE_MISSING", "CYCLIC_MESSAGE_DOUBLE", "CYCLIC_MESSAGE_OUT_OF_ORDER", "CYCLIC_MESSAGE_TOO_EARLY", "CYCLIC_MESSAGE_TOO_LATE") earliest=-30m@m | stats count as "Replay Attacks" | eval IPCheck=\"$IPCheck$\"| fields - IPCheck"

[RHEBO-AL-10]
action.email = 1
action.email.message.alert = The alert condition for '$name$' was triggered.\
\
Alert-ID: $name$\

action.email.priority = 2
action.email.subject.alert = $name$ | Potential password attack
action.email.useNSSubject = 1
action.webhook.enable_allowlist = 0
alert.expires = 7d
alert.severity = 4
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = 0 0 * * 1
description = The detection of an insecure login or plain text password in combination with an IP-address using another MAC-address has to be alerted.
dispatch.earliest_time = -7d@d
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","signature","smac","dmac","dvc","dst","src"]
display.general.type = statistics
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = rhebo-app
request.ui_dispatch_view = search
search = eventtype="rhebo_syslog" signature="IP_MAC" earliest=-7d@d| stats count as "IPMAC"| eval IPCheck=case(IPMAC>0,"true")| map search="search index=rhebo signature IN ("INSECURE_LOGIN", "PLAIN_TEXT_PASSWORD") earliest=-7d@d | stats count as "Password Attacks" | eval IPCheck=\"$IPCheck$\"| fields - IPCheck"

[RHEBO-AL-11]
action.email = 1
action.email.message.alert = The alert condition for '$name$' was triggered.\
\
Alert-ID: $name$\

action.email.priority = 2
action.email.subject.alert = $name$ | Potential hardware failure
action.email.useNSSubject = 1
action.webhook.enable_allowlist = 0
alert.expires = 7d
alert.severity = 4
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = */15 * * * *
description = The detection of IP, DNP3, ICMP or TCP checksum errors should be monitored. An unusual amount of checksum errors has to be alerted.
dispatch.earliest_time = -15m@m
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","signature","smac","dmac","dvc","dst","src"]
display.general.type = statistics
display.page.search.tab = statistics
enableSched = 1
quantity = 5
relation = greater than
request.ui_dispatch_app = rhebo-app
request.ui_dispatch_view = search
search = eventtype="rhebo_syslog" signature IN ("IP_CHECKSUM_ERROR", "TCP_CHECKSUM_ERROR", "DNP3_CHECKSUM_ERROR", "ICMP_CHECKSUM_ERROR") earliest=-15m@m | stats count as "Hardware Failures"
