[nfo_get_exporter_name(1)]
args = result
definition = lookup interfaces_20003_lookup nfo_hostname exp_ip OUTPUT SNMPDeviceName \
            | eval SNMPDeviceName=mvindex(SNMPDeviceName,0) \
            | fillnull value="unknown" SNMPDeviceName \
            | eval $result$ = if(SNMPDeviceName=="unknown", exp_ip, SNMPDeviceName) \
            | eval $result$ = if(($result$==exp_ip),exp_ip,exp_ip." (".$result$.")")
disabled = False

[nfo_get_iface_name(2)]
args = result, param
definition = lookup exporters_devices_lookup nfo_hostname exp_ip OUTPUT management_ip \
            | eval management_ip = if(management_ip=="Unassigned", exp_ip, management_ip) \
            | lookup interfaces_lookup nfo_hostname management_ip snmp_index as $param$ OUTPUT if_name as ifname_interfaces \
            | lookup interfaces_20003_lookup nfo_hostname exp_ip ifIndex as $param$ OUTPUT ifName as ifname_20003 \
            | eval ifname_20003=if(ifname_20003=="unknown",$param$,ifname_20003) \
            | fillnull value="unknown" ifname_20003 \
            | eval $result$ = if(ifname_interfaces=="unknown",ifname_20003,ifname_interfaces)\
            | eval $result$ = if($result$==$param$,$param$,$param$." ( ".$result$." )")\
            | eval $result$ = mvindex($result$,0)
disabled = False
iseval = 0

[nfo_get_iface_speed(2)]
args = result, param
definition = lookup exporters_devices_lookup nfo_hostname exp_ip OUTPUT management_ip \
            | eval management_ip = if(management_ip=="Unassigned", exp_ip, management_ip) \
            | lookup interfaces_lookup nfo_hostname management_ip snmp_index as $param$ OUTPUT if_speed as ifspeed_interfaces \
            | lookup interfaces_20003_lookup nfo_hostname exp_ip ifIndex as $param$ OUTPUT ifSpeed as ifspeed_20003 \
            | fillnull value="unknown" ifname_20003 \
            | eval ifspeed_20003=if(ifspeed_20003=="unknown","SNMP query failed",ifspeed_20003) \
            | eval $result$ = if(ifspeed_interfaces=="unknown",ifspeed_20003/1000000,ifspeed_interfaces) \
            | eval $result$ = mvindex($result$,0)
disabled = False

[nfo_netflow_index]
definition = index=flowintegrator sourcetype=flowintegrator
disabled = False

[nfo_netflow_index_metrics]
definition = index=netflow_metrics sourcetype=netflow_metrics
disabled = False

[netflow_search_rule_20062]
definition = `nfo_netflow_index` nfc_id=20062

[netflow_search_rule_20067]
definition = `nfo_netflow_index` nfc_id=20067

[netflow_search_rule_20103]
definition = `nfo_netflow_index` nfc_id=20103

[nfo_sampling(1)]
args = param
definition = lookup sampling_lookup nfo_hostname exp_ip flow_smpl_id OUTPUT smpl_int | eval $param$=if(isnull(smpl_int),$param$,$param$*smpl_int)
disabled = False

[populate_nfo_hostnames]
definition = inputlookup nfo_exp-group_exp_lookup | stats count by nfo_hostname | fields - count

[populate_snmp_nfo_hostnames]
definition = inputlookup snmp-devices_lookup | stats count by nfo_hostname | fields - count

[populate_snmp_device_group_list_by_nfo_hostname(1)]
args = nfo_hostname
definition = inputlookup snmp-devices_lookup | search nfo_hostname="$nfo_hostname$" | stats count by device_group   | fields - count

[populate_exporter_list_by_nfo_hostname(2)]
args = exp_group,nfo_hostname
definition = inputlookup nfo_exp-group_exp_lookup | search exp_group="$exp_group$" nfo_hostname="$nfo_hostname$"                    \
            | `get_exporter_name(name)`                                                                                             \
            | table exp_ip name                                                                                                     \
            | dedup exp_ip                                                                                                          \
            | sort name                                                                                                             \
            | eval name=if((name==exp_ip),exp_ip,if(exp_ip=="*","All",name))

[populate_exporter_group_list_by_nfo_hostname(1)]
args = nfo_hostname
definition = inputlookup nfo_exp-group_exp_lookup | search nfo_hostname="$nfo_hostname$" | stats count by exp_group   | fields - count

[populate_snmp_device_list_by_nfo_hostname(2)]
args = device_group,nfo_hostname
definition = inputlookup snmp-devices_lookup | search device_group="$device_group$" nfo_hostname="$nfo_hostname$"                   \
            | eval device_sysname = (((mgmt_ip . " (") . sysName) . ")")                                                            \
            | stats count by device_sysname   | fields - count

[is_local_lookup]
definition = local=false

[get_exporter_name(1)]
args = result
definition = lookup `is_local_lookup` interfaces_20003_lookup nfo_hostname exp_ip OUTPUT SNMPDeviceName \
            | eval SNMPDeviceName=mvindex(SNMPDeviceName,0) \
            | fillnull value="unknown" SNMPDeviceName \
            | eval $result$ = if(SNMPDeviceName=="unknown", exp_ip, SNMPDeviceName) \
            | eval $result$ = if(($result$==exp_ip),exp_ip,exp_ip." (".$result$.")")

[dedup_timechart_events]
definition =  fillnull value="" input_snmp \
            | dedup src_ip src_port dest_ip dest_port transport _time

[format_ip_column(3)]
args = result, ip, host
definition = eval $result$=if(isnull($host$),$ip$,$ip$." (".$host$.")")

[commas_formatting(2)]
args = result, amount
definition = eval "$result$" = round($amount$,0) | fieldformat "$result$" = tostring('$result$',"commas")

[commas_formatting(3)]
args = result, amount, decimals
definition = eval "$result$" = round($amount$,$decimals$) | fieldformat "$result$" = tostring('$result$',"commas")

[format_port_column(2)]
args = result, port
definition = lookup `is_local_lookup` port_lookup port AS $port$ OUTPUT service AS service | strcat $port$ "/" transport " (" service ")" $result$

[set_span]
definition = head 1                                                                               \
            | addinfo                                                                             \
            | eval range = if(info_max_time="+Infinity",3600,info_max_time-info_min_time)         \
            | eval span = if(range<3600,"span=30s","span=" . round(range/120) . "s")              \
            | eval span_int=if(range<3600,30,round(range/120))                                    \
            | eval all_time_latest=if(info_max_time="+Infinity",_time,info_max_time)              \
            | eval all_time_earliest=if(info_max_time="+Infinity",_time-3600,info_min_time)       \
            | eval t_int_seconds = round(t_int/1000)

[basesearch_20062(10)]
args = exp_ip,nfo_hostname,advanced_filter,exp_group,src_ip,src_port,dest_ip,dest_port,protocol_name,span_token
definition = `netflow_search_rule_20062` exp_ip="$exp_ip$" nfo_hostname="$nfo_hostname$" \
                                | fillnull value=0 bytes_out packets_out app_id \
                                | fillnull value="unknown" app_name username \
                                | eval bytes = bytes_in + bytes_out \
                                | eventstats sum(bytes) as sum_by_exp by exp_ip nfo_hostname \
                                | search $advanced_filter$ \
                                | lookup `is_local_lookup` exporters_devices_lookup nfo_hostname exp_ip OUTPUT device_group AS exp_group \
                                | search exp_group="$exp_group$" (src_ip="$src_ip$" OR src_host="$src_ip$") \
                                (dest_ip="$dest_ip$" OR dest_host="$dest_ip$") \
                                src_port="$src_port$" dest_port="$dest_port$" \
                                | fillnull value="" transport idp src_vm_name dest_vm_name \
                                | search transport="$protocol_name$" \
                                | bin _time $span_token$ \
                                | stats sum(bytes) as sum_bytes sum(bytes_in) as sum_bytes_in sum(packets_in) as sum_packets_in \
                                    sum(bytes_out) as sum_bytes_out sum(packets_out) as sum_packets_out \
                                    sum(flow_count) as sum_flow_count avg(duration) as avg_duration \
                                    by nfo_hostname exp_ip app_id app_name username idp src_ip src_port src_host src_vm_name dest_ip dest_port \
                                        dest_host dest_vm_name transport flow_type sum_by_exp _time

[per_second_chart(3)]
args = timechart_expr, span_token, span_int
definition =  timechart $span_token$ limit=10  useother="f" $timechart_expr$  \
            | foreach *  \
                [ eval <<FIELD>> = case("<<FIELD>>"=="_time", _time, 1==1, '<<FIELD>>'*8/($span_int$*1000000)) ]

[default_preparation_for_comma_formatted_table]
definition = `get_exporter_name(exp_ip_name)` \
            | eval TrafficSpeed=AverageSpeed/1000000 \
            | eval TrafficAmount=TrafficAmount/1024/1024 \
            | eval MaxTraffic=MaxTraffic/1000000 \
            | `commas_formatting(Total Connections, Connections)` \
            | `commas_formatting(Average Mbps, TrafficSpeed, 2)` \
            | `commas_formatting(Max Mbps, MaxTraffic, 2)` \
            | `commas_formatting(Total Traffic MB, TrafficAmount)` \
            | `commas_formatting(Average Packets/s, PacketsSpeed, 2)` \
            | `commas_formatting(Total Packets, PacketsAmount)`

[traffic_topology]
definition = | `dedup_timechart_events`                                                           \
            | eventstats latest(src_host) as l_src_host by nfo_hostname exp_ip src_ip             \
            | eventstats latest(dest_host) as l_dest_host by nfo_hostname exp_ip dest_ip          \
            | `format_ip_column(src_ip_string, src_ip, l_src_host)`                               \
            | `format_ip_column(dest_ip_string, dest_ip, l_dest_host)`                            \
            | stats sum(sum_bytes_in) as TrafficBytes by dest_ip_string, src_ip_string            \
            | sort - TrafficBytes                                                                 \
            | head 100

[traffic_bubble]
definition = | `dedup_timechart_events`                                                           \
            | eventstats latest(src_host) as l_src_host by nfo_hostname exp_ip src_ip             \
            | eventstats latest(dest_host) as l_dest_host by nfo_hostname exp_ip dest_ip          \
            | `format_ip_column(src_ip_string, src_ip, l_src_host)`                               \
            | `format_ip_column(dest_ip_string, dest_ip, l_dest_host)`                            \
            | stats dc(dest_ip_string) as "# of Destination IPs"                                  \
                sum(sum_bytes_in) as "Total Bytes" sum(sum_flow_count) as "Flow Count"            \
                    by src_ip_string                                                              \
            | sort - "Total Bytes"                                                                \
            | head 25                                                                             \
            | table src_ip_string "# of Destination IPs" "Flow Count" "Total Bytes"

[sampling(1)]
args = param
definition = lookup sampling_lookup nfo_hostname exp_ip flow_smpl_id OUTPUT smpl_int | eval $param$=if(isnull(smpl_int),$param$,$param$*smpl_int)

[conversation(4)]
args = pct_aggregated_field,span_token,span_int,range
definition = fillnull value="" src_host dest_host transport                                             \
            | eventstats latest(dest_host) as dest_host latest(src_host) as src_host                    \
                        by nfo_hostname exp_ip dest_ip src_ip                                           \
            | bin _time $span_token$                                                                    \
            | stats  sum(bytes_in) as sumbytes                                                          \
                    sum(packets_in) as sumpacketsin                                                     \
                    sum(flow_count) as sumflowcount                                                     \
                        by  src_ip dest_ip src_host dest_host src_port dest_port                        \
                        transport nfo_hostname exp_ip  sum_by_exp _time                                 \
            | eval avgbits= sumbytes*8/($span_int$)                                                     \
            | stats sum(sumbytes) AS TrafficAmount                                                      \
                    max(avgbits) as MaxTraffic                                                          \
                    sum(sumpacketsin) AS PacketsAmount                                                  \
                    sum(sumflowcount) AS Connections                                                    \
                    perc95(avgbits) as p95                                                              \
                        by src_ip dest_ip src_host dest_host src_port dest_port                         \
                        transport nfo_hostname exp_ip  sum_by_exp                                       \
            | sort 0 - $pct_aggregated_field$                                                           \
            | eval pct = $pct_aggregated_field$*100/sum_by_exp                                          \
            | `commas_formatting(pct, pct, 2)`                                                          \
            | head 100                                                                                  \
            | eval AverageSpeed=(TrafficAmount)*8/$range$                                               \
            | eval PacketsSpeed=(PacketsAmount)/$range$                                                 \
            | eval p95=p95/1000000                                                                      \
            | `commas_formatting(95pct Mbps, p95, 2)`                                                   \
            | `format_port_column(src_port_string, src_port)`                                           \
            | `format_port_column(dest_port_string, dest_port)`                                         \
            | eval TrafficSpeed=AverageSpeed/1000000                                                    \
            | eval TrafficAmount=TrafficAmount/1024/1024                                                \
            | eval MaxTraffic=MaxTraffic/1000000                                                        \
            | `commas_formatting(Total Connections, Connections)`                                       \
            | `commas_formatting(Average Mbps, TrafficSpeed, 2)`                                        \
            | `commas_formatting(Max Mbps, MaxTraffic, 2)`                                              \
            | `commas_formatting(Total Traffic MB, TrafficAmount)`                                      \
            | `commas_formatting(Average Packets/s, PacketsSpeed, 2)`                                   \
            | `commas_formatting(Total Packets, PacketsAmount)`                                         \
            | table  src_ip src_host src_port_string dest_ip dest_host dest_port_string                 \
                "Max Mbps" "95pct Mbps" "Average Mbps" "Total Traffic MB" pct                           \
                "Average Packets/s" "Total Packets" "Total Connections"                                 \
            | rename src_ip as "Source IP"                                                              \
            | rename src_host as "Source Host"                                                          \
            | rename src_port_string as "Source Port"                                                   \
            | rename dest_ip as "Destination IP"                                                        \
            | rename dest_host as "Destination Host"                                                    \
            | rename dest_port_string as "Destination Port"                                             \
            | rename pct as "% of Total"
