######################################################
#
# Lookup table builders
#
######################################################
[cisco_catalyst_location]
action.email.inline = 1
alert.suppress = 0
alert.track = 0
cron_schedule = 0 * * * *
description = Updates the cisco_catalyst_ise_location.csv lookup file
dispatch.earliest_time = -3d@d
dispatch.latest_time = now
enableSched = 1
run_on_startup = true
search = | tstats fillnull_value="N/A" `summariesonly` count as "Count" from datamodel=Cisco_Catalyst_App where nodename IN (Cisco_Catalyst_Dataset.Cisco_Catalyst_Authentication_Events, Cisco_Catalyst_Dataset.Cisco_Catalyst_Device_Events) AND (Cisco_Catalyst_Dataset.Cisco_Catalyst_Authentication_Events.authentication_location="*" OR Cisco_Catalyst_Dataset.Cisco_Catalyst_Device_Events.device_location="*") by Cisco_Catalyst_Dataset.Cisco_Catalyst_Authentication_Events.authentication_location Cisco_Catalyst_Dataset.Cisco_Catalyst_Device_Events.device_location \
| eval Location=coalesce('Cisco_Catalyst_Dataset.Cisco_Catalyst_Authentication_Events.authentication_location', 'Cisco_Catalyst_Dataset.Cisco_Catalyst_Device_Events.device_location') \
| fields Location \
| append [ | inputlookup cisco_catalyst_ise_location.csv | fields Location ] \
| dedup Location \
| outputlookup cisco_catalyst_ise_location.csv

[cisco_catalyst_sdwan_netflow]
cron_schedule = 0 */24 * * *
description = To populate the lookup table with app and app_tag mapping
dispatch.earliest_time = -3d@d
dispatch.latest_time = now
display.page.search.mode = fast
enableSched = 1
run_on_startup = 1
search = | tstats `summariesonly` count from datamodel=Cisco_Catalyst_App by Cisco_Catalyst_Dataset.Cisco_Catalyst_Application_Usage.app_usage_app, Cisco_Catalyst_Dataset.Cisco_Catalyst_Application_Usage.app_usage_app_tag \
| rename Cisco_Catalyst_Dataset.Cisco_Catalyst_Application_Usage.app_usage_app as app, Cisco_Catalyst_Dataset.Cisco_Catalyst_Application_Usage.app_usage_app_tag as "app_tag" \
| fillnull value="unclassified" app \
| eval key=app_tag \
| outputlookup cisco_catalyst_sdwan_application_tag key_field=key append=true

[cisco_catalyst_sdwan_policy]
cron_schedule = 0 */24 * * *
description = Savedsearch to populate the lookup cisco_catalyst_sdwan_policy_mapping
dispatch.earliest_time = -3d@d
dispatch.latest_time = now
display.page.search.mode = fast
enableSched = 1
run_on_startup = 1
search = | tstats `summariesonly` count as "Count" from datamodel=Cisco_Catalyst_App where nodename=Cisco_Catalyst_Dataset.Cisco_Catalyst_Policy_Events Cisco_Catalyst_Dataset.Cisco_Catalyst_Policy_Events.policy_fw_policy != "00000000" by Cisco_Catalyst_Dataset.Cisco_Catalyst_Policy_Events.policy_fw_policy, Cisco_Catalyst_Dataset.Cisco_Catalyst_Policy_Events.policy_fw_policy_rule \
| rename Cisco_Catalyst_Dataset.Cisco_Catalyst_Policy_Events.policy_fw_policy as "policy", Cisco_Catalyst_Dataset.Cisco_Catalyst_Policy_Events.policy_fw_policy_rule as "policy_rule" \
| append \
    [| tstats `summariesonly` count as "Count" from datamodel=Cisco_Catalyst_App by Cisco_Catalyst_Dataset.Cisco_Catalyst_Policy_Events.policy_cisco_hsl_fw_class_id, Cisco_Catalyst_Dataset.Cisco_Catalyst_Policy_Events.policy_cisco_hsl_fw_class_name \
    | rename Cisco_Catalyst_Dataset.Cisco_Catalyst_Policy_Events.policy_cisco_hsl_fw_class_id as "policy", Cisco_Catalyst_Dataset.Cisco_Catalyst_Policy_Events.policy_cisco_hsl_fw_class_name as "policy_rule"] \
| eval key=policy \
| outputlookup cisco_catalyst_sdwan_policy_mapping key_field=key append=true
