[wsus_change_UpdateID]
REGEX = UpdateID:(?P<update_id>\S+)

[wsus_change_Revision_Number]
REGEX = Revision\s+Number:(?P<revision_number>\S+) 

[wsus_change_TargetGroup]
REGEX = TargetGroup:(?P<target_group>\S+)

[wsus_change_deployment_type]
REGEX = deployment\((?P<deployment_type>[^\)]+)

[wsus_change_KB]
REGEX = \((?P<kb_id>KB[^\)]+)

[wsus_change_domain_src]
REGEX = \)\s+by\s(?P<dest_nt_domain>[^\\]+)\\(?P<dest_nt_host>\S+)\s

[wsus_distrib_extractions]
REGEX = \d{4}-\d{2}-\d{2}\s\d{2}:\d{2}:\d{2}\.\d{3}\s+\w{3}\s+(?P<serverity>\w+)\s+(?P<web_process_id>\S+)\s+(?P<module>\S+)\s+(?P<message>.*)

