[SourceTypes  Collected by Host]
action.email.reportServerEnabled = 0
alert.track = 0
dispatch.earliest_time = -15m
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","time_prefix","weblog_message","src","breaker","dvchost","shost","user","prefixer","mailto","mailfrom","sender","sender_domain","subject","total_bytes","signature_id","severity_id","signature","signature_uuid","src_ip","dvc_segment","dvc_slot","time_prefix","session_id","index","Calling_Station_ID","Called_Station_ID","message","dest","bytes_in","bytes_out","duration","startevent","queue_id","esn","status","msg","act","user","vendor_action","detected_timestamp","detected_timestamp_converted"]
display.general.type = statistics
display.page.search.mode = verbose
display.visualizations.charting.chart = line
display.visualizations.show = 0
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = | metasearch index=* | dedup host sourcetype | stats values(sourcetype) AS sourcetypes by host

