[Citrix NetScaler - APPFW - DataCube]
search = eventtype="netscaler" log_type=APPFW | stats count by violation src_ip url host profile msg msg_description log_type msg_format action _time
is_visible = false

[Citrix NetScaler - APPFW - DataCube - Summary Index]
cron_schedule = 0 */6 * * *
dispatch.earliest_time = -6h
dispatch.latest_time = +0s
enableSched = 1
action.summary_index = 1
action.summary_index.marker = ns_appfw
realtime_schedule = 0
search = `ns_appfw`|  bin _time span=15m | sistats count by violation src_ip url host profile msg msg_description log_type msg_format action _time
is_visible = false

[Citrix NetScaler - VPN - DataCube]
search = eventtype="netscaler" log_type=SSLVPN | stats count by host src_ip log_type msg_description msg_type total_bytes_send total_bytes_recv user vserver destination _time
is_visible = false

[Citrix NetScaler - VPN - DataCube - Summary Index]
cron_schedule = 0 */6 * * *
dispatch.earliest_time = -6h
dispatch.latest_time = +0s
enableSched = 1
action.summary_index = 1
action.summary_index.marker = ns_vpn
realtime_schedule = 0
search = `ns_sslvpn` | bin _time span=15m |  sistats count by host src_ip log_type msg_description msg_type total_bytes_send total_bytes_recv user vserver destination _time
is_visible = false

[Citrix NetScaler - System - DataCube]
search = eventtype="netscaler" | stats count by command src_ip host msg_description log_type msg_format user status _time 
is_visible = false

#[Citrix NetScaler - VPN - DataCube - Summary Index]   # This is probably a wrong name, should be "System"
[Citrix NetScaler - System - DataCube - Summary Index]
cron_schedule = 0 */6 * * *
dispatch.earliest_time = -6h
dispatch.latest_time = +0s
enableSched = 1
action.summary_index = 1
action.summary_index.marker = ns_system
realtime_schedule = 0
search = eventtype="netscaler" | bin _time span=15m |  stats count by command src_ip host msg_description log_type msg_format user status _time 
is_visible = false


[Citrix NetScaler - App Firewall - Top Violations by Client]
search = `ns_appfw` startmonthsago=3 | top limit=100 src_ip violation

[Citrix NetScaler - App Firewall - Top Violations by Device]
search = `ns_appfw`  | top limit=100 host msg_description

[Citrix NetScaler - App Firewall - Top Violations by Profile]
search = `ns_appfw`  | top limit=100 profile

[Citrix NetScaler - App Firewall - Top Violations by Type]
search = `ns_appfw` startmonthsago=3 | top msg_description

[Citrix NetScaler - App Firewall - Top Violations by URL]
search = `ns_appfw`  | top limit=100 msg_description url

[Citrix NetScaler - App Firewall - Top Violations by field]
search = `ns_appfw`  | top msg


[Citrix NetScaler - VPN - VPN Events]
search = eventtype="netscaler" log_type="SSLVPN"

[Citrix NetScaler - VPN - Comprimised VPN Accounts]
search =  SSLVPN [ search log_type="APPFW" | fields + log_type ] | top user showperc=f

[Citrix NetScaler - App Firewall - Comprimised VPN Accounts]
search =  SSLVPN [ search log_type="APPFW" | fields + log_type ] | top user showperc=f

[Citrix NetScaler - VPN - Bytes Transfered]
search = `ns_sslvpn` | stats 

[Citrix NetScaler - VPN - Bytes Recieved]
search = `ns_sslvpn`

[Citrix NetScaler - VPN - Connections by Vserer]
search = `ns_sslvpn`

[Citrix NetScaler - VPN - Connections by User]
search = `ns_sslvpn`


[Citrix NetScaler - Events]
search = eventtype="netscaler"

[Citrix NetScaler - Events - DataCube]
search = eventtype="netscaler" | fillnull | eval destination=dst_ip.":".dst_port | stats count by destination user msg_id msg_type dst_ip dst_port src_ip src_port total_bytes_recv total_bytes_send

[Citrix NetScaler - Audit - System Events]
search = eventtype="netscaler" (log_type="UI_CMD" OR log_type="UI")

[Citrix NetScaler - Audit - Commands by User]
search = eventtype="netscaler"  (log_type="UI_CMD" OR log_type="UI")

###############################################
#             AppFlow Security                #
###############################################

[Zero Byte Connections over Time]
disabled = 1
enableSched = 1
cron_schedule = */10 * * * *
dispatch.earliest_time = -6h
dispatch.latest_time = +0s
action.email.inline = 1
action.email.reportServerEnabled = 0
alert.suppress = 0
alert.suppress.period = h
alert.track = 0
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = eventtype="netscaler_appflow" NOT syslogMessage | timechart count by destinationIPv4Address

[connection count by src ip]
action.email.inline = 1
action.email.reportServerEnabled = 0
alert.suppress = 0
alert.suppress.period = h
alert.track = 1
displayview = report_builder_display
request.ui_dispatch_view = report_builder_display
search = eventtype="netscaler_appflow" NOT syslogMessage | timechart limit=10 count by sourceIPv4Address usenull=f | fields - OTHER

[connection count by dest server]
action.email.inline = 1
action.email.reportServerEnabled = 0
alert.suppress = 0
alert.suppress.period = h
alert.track = 0
displayview = report_builder_display
request.ui_dispatch_view = report_builder_display
search = eventtype="netscaler_appflow" NOT syslogMessage | timechart limit=10 count by destinationIPv4Address usenull=f | fields - OTHER

[slow post]
action.email.reportServerEnabled = 0
alert.track = 1
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = eventtype="netscaler_appflow" httpRequestMethod=POST NOT syslogMessage octetDeltaCount | timechart sum(octetDeltaCount) by sourceIPv4Address usenull=f where sum < 600 | fields - OTHER

[slow post 2]
action.email.reportServerEnabled = 0
alert.suppress = 0
alert.track = 0
displayview = report_builder_display
request.ui_dispatch_view = report_builder_display
search = eventtype="netscaler_appflow" httpRequestMethod=POST NOT syslogMessage octetDeltaCount | timechart sum(octetDeltaCount) by sourceIPv4Address usenull=f where sum < 600 | fields - OTHER

###############################################
#                AppFlow                      #
###############################################

[AppFlow DataCube]
is_visible = false
search = eventtype=netscaler_appflow | bin _time span=5m | fillnull httpUserAgent httpRequestURL httpRequestUrlPath | stats count by sourceIPv4Address destinationIPv4Address tcpSourcePort tcpDestinationPort transactionId flowId observationPointId httpUserAgent httpRequestURL flowStartMicroSeconds flowEndMicroSeconds httpRequestUrlPath

[AppFlow Traffic Analysis DataCube]
is_visible = false
search = eventtype="netscaler_appflow" httpRequestURL | bin _time span=5m | stats count by flowEndMicroSeconds flowStartMicroSeconds connectionId octetDeltaCount packetDeltaCount httpRequestHost appID 

[AppFlow HTTP Request DataCube]
is_visible = false
search = eventtype="netscaler_appflow" httpRequestURL | bin _time span=5m | stats count by observationPointId exportingProcessId flowId transactionId connectionId ipVersion protocolIdentifier sourceIPv4Address destinationIPv4Address tcpSourcePort tcpDestinationPort packetDeltaCount octetDeltaCount tcpControlBits flowFlags flowStartMicroSeconds flowEndMicroSeconds ingressInterface egressInterface appID httpRequestURL httpRequestCookie httpRequestReferer httpRequestMethod httpRequestHost httpUserAgent

[AppFlow HTTP Response DataCube]
is_visible = false
search = eventtype="netscaler_appflow" httpResponseStatus | bin _time span=5m | stats count by observationPointId exportingProcessId flowId transactionId connectionId ipVersion protocolIdentifier sourceIPv4Address destinationIPv4Address tcpSourcePort tcpDestinationPort packetDeltaCount octetDeltaCount tcpControlBits flowFlags flowStartMicroSeconds flowEndMicroSeconds ingressInterface egressInterface httpResponseStatus httpResponseLen httpResponseTimeToFirstByte httpResponseTimeToLastByte appID

[AppFlow Outputlookup AppID]
enableSched = 1
cron_schedule = */10 * * * *
dispatch.earliest_time = -30m
dispatch.latest_time = +0s
action.populate_lookup = 1
action.populate_lookup.dest = appid_lookup
run_on_startup = true
search = eventtype="netscaler_appflow" appName | stats values(appName) AS "appName" by appID | outputlookup appid_lookup.csv

[Transaction and Flow per Observation ID]
search = eventtype="netscaler_appflow" | stats distinct_count(transactionId) AS "No. of Transactions" distinct_count(flowId) AS "No. of Flows" by observationPointId

[Citrix NetScaler - AppFlow - Avg Round Trip Time]
search = eventtype="netscaler_appflow" | timechart avg(tcpRTT) by destinationIPv4Address

[AppFlow Utilization per Server]
search = eventtype="netscaler_appflow" NOT incarnationNumber NOT roundTripTime | stats distinct_count(connectionId) AS "Connections" sum(octetDeltaCount) AS "Traffic Inbound" sum(packetDeltaCount) AS "Packets Inbound" by appID | appendcols [search eventtype="netscaler_appflow" roundTripTime | stats distinct_count(connectionId) AS "Connections2" sum(octetDeltaCount) AS "Traffic Outbound" sum(packetDeltaCount) AS "Packets Outbound" by appID] | eval Connections=Connections+Connections2 | eventstats sum(Connections) AS total_con | eval perc_con = round(Connections * 100 / total_con, 2) | rename perc_con AS "Percent of Connections" | lookup appid_lookup appID OUTPUT appName | eval appName = if(isnull(appName), appID, appName) | fields appName, "Traffic Inbound", "Traffic Outbound", "Packets Inbound", "Packets Outbound", "Connections", "Percent of Connections" | rename appName AS "Server"
