[pps_log]
category = Email
pulldown_type = true
description = Output produced by Proofpoint Protection Server
SHOULD_LINEMERGE=false
TRANSFORMS-set_sourcetype= set_filter, set_mta


[pps_mail_log]
category = Email
SHOULD_LINEMERGE = false
pulldown_type = true
description = Output produced by Proofpoint Protection Server MTA process

# Merge lines that start with space or tab into the previous line
LINE_BREAKER = ([\r\n]+)[^ \t]

REPORT-ppsmaillog-mta = ppsmaillog-mta-process-qid, ppsmaillog-mta-syserr, ppsmaillog-mta-stat, ppsmaillog-mta-stat-reason


[pps_filter_log]
category = Email
description = Output produced by Proofpoint Protection Server email filtering process
pulldown_type = true
KV_MODE = none
SHOULD_LINEMERGE=false

REPORT-kv = custom_kv
EXTRACT-dest_bunit = ^.*rcpt=.*\s+suborg=(?<dest_bunit>.+)
EVAL-duration = if(mod=="session", if(cmd=="disconnect", elapsed, null()), null())
EVAL-file_name = if(mod=="mail", if(cmd=="attachment", file, null()), null())
EVAL-file_size = if(mod=="mail", if(cmd=="attachment", size, null()), null())
EVAL-filter_action = if(mod=="mail", if(cmd=="msg", action, null()), null())
EVAL-filter_score = score
EVAL-internal_message_id = if(mod=="mail", if(cmd=="msg", guid, null()), null())
EVAL-message_id = if(mod=="mail", if(cmd=="msg", hdr_mid, null()), null())
EVAL-message_session_id = s
EVAL-protocol = if(mod=="session", if(cmd=="connect", prot, null()), null())
EVAL-orig_recipient = if(mod=="mail", if(cmd=="env_rcpt", value, null()), null())
EVAL-orig_src = if(mod=="mail", if(cmd=="env_from", value, null()), null())
EVAL-recipient = if(mod=="session", if(cmd=="data", rcpt, null()), null())
EVAL-recipient_count = if(cmd=="disconnect", rcpts, null())
EVAL-signature = if(mod=="mail", if(cmd=="msg", module, null()), null())
EVAL-signature_id = if(mod=="mail", if(cmd=="msg", rule, null()), null())
EVAL-size = if(mod=="mail", if(cmd=="msg", size, null()), null())
EVAL-src = if(mod=="session", if(cmd=="connect", ip, null()), null())
EVAL-src_user = if(mod=="session", if(cmd=="data", from, null()), null())
EXTRACT-src_user_bunit = ^.*from=.*\s+suborg=(?<src_user_bunit>.+)
EVAL-subject = if(mod=="mail", if(cmd=="msg", subject, null()), null())

EVAL-from = if(cmd=="env_from", value, null())
EVAL-to = if(cmd=="env_rcpt", value, null())

EXTRACT-spf = \s+mod=spf\s+cmd=run\s+rule=(?<spf>(none|pass|fail|permerror|temperror))
EVAL-dmarc = if(module=="dmarc", rule, null())
EXTRACT-av = \s+module=av\s+rule=(?<av>(clean|notcleaned))\s+action=add-header
EVAL-dkim = dkimresult
EVAL-firewall = if(module=="access", if(cmd=="dispose", rule, null()), null())

EXTRACT-host = \shost=(?<Host>\S*)

EXTRACT-internal_use = ^.*mod=session.*\s+cmd=disconnect\s+(?<internal_use>\w+=)
LOOKUP-internal_use = internal_use internal_use AS internal_use OUTPUTNEW process AS process user AS user vendor_product AS vendor_product


