[ftp_banned]
action.email.reportServerEnabled = 0
alert.track = 0
dispatch.earliest_time = 0
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = sourcetype="FileZilla_FTP" ftp_msg="*banned*" | stats count(ftp_msg)

[ftp_failed_longins_count]
action.email.inline = 1
action.email.reportServerEnabled = 0
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
dispatch.latest_time = 0
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = sourcetype="FileZilla_FTP" 530 | stats count(ftp_msg)

[ftp_top_logons]
action.email.inline = 1
action.email.reportServerEnabled = 0
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
dispatch.latest_time = 0
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = sourcetype="FileZilla_FTP" ftp_msg="*230 Logged on"  | rename ftp_usr as User | top User | Fields - percent

[ftp_top_ips]
action.email.inline = 1
action.email.reportServerEnabled = 0
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
dispatch.earliest_time = -30d@d
dispatch.latest_time = now
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = sourcetype="FileZilla_FTP" Connected | top ftp_src_ip | Fields - percent

[ftp_top_uploads]
action.email.inline = 1
action.email.reportServerEnabled = 0
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
dispatch.latest_time = 0
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = index=ftp sourcetype="FileZilla_FTP" ftp_msg="*STOR*" | rename ftp_pMsg as uploads | top uploads | Fields - percent

[ftp_stats_by_command]
action.email.reportServerEnabled = 0
alert.track = 0
dispatch.earliest_time = 0
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = index=ftp | stats count(ftp_command) by ftp_command

[ftp_stats_codes]
action.email.reportServerEnabled = 0
alert.track = 0
dispatch.earliest_time = 0
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = index=ftp | stats count(ftp_code) by ftp_code

[ftp_chart_command]
action.email.reportServerEnabled = 0
alert.track = 0
dispatch.earliest_time = 0
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = index=ftp | chart count(ftp_command) by ftp_command

[ftp_chart_code]
action.email.reportServerEnabled = 0
alert.track = 0
dispatch.earliest_time = 0
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = index=ftp | chart count(ftp_code) by ftp_code

[ftp_removed_dirs_by_name]
action.email.inline = 1
action.email.reportServerEnabled = 0
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
dispatch.earliest_time = 0
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = index="ftp" sourcetype="filezilla_ftp" ftp_command="RMD" | stats count(ftp_command) by ftp_pMsg | rename ftp_pMsg as "removed directories" | Fields - count(ftp_command)

[ftp_created_dir]
action.email.inline = 1
action.email.reportServerEnabled = 0
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
dispatch.earliest_time = 0
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = index="ftp" sourcetype="filezilla_ftp" ftp_code=257 created* | stats count(ftp_code) by ftp_pMsg | rename ftp_pMsg as "created directories" | Fields - count(ftp_code)

[ftp_removed_files_by_name]
action.email.inline = 1
action.email.reportServerEnabled = 0
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
dispatch.earliest_time = 0
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = index="ftp" sourcetype="filezilla_ftp" ftp_command="DELE" | chart count(ftp_command) by ftp_pMsg | rename ftp_pMsg as "removed files" | Fields - count(ftp_command)

[ftp_uc_user_by_computer]
action.email.reportServerEnabled = 0
alert.track = 0
dispatch.earliest_time = 0
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = index="ftp" sourcetype="filezilla_ftp" 226 | stats count(ftp_code) by ftp_usr, ftp_src_ip | rename ftp_usr as user | rename ftp_src_ip as computer | rename count(ftp_code) as ammount

[ftp_renamed_files]
alert.digest_mode = 1
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
display.general.type = statistics
display.page.search.mode = fast
display.page.search.tab = statistics
request.ui_dispatch_view = search
search = index=ftp sourcetype="FileZilla_FTP" ftp_command="RNFR" \
| append [search ftp_command="RNTO"] \
| append [search ftp_code=350] \
| sort by _time \
| transaction maxevents=3 maxspan=2s \
|eval typ=mvindex(ftp_pMsg,0) \
|eval oname=mvindex(ftp_pMsg,2) \
|eval nname=mvindex(ftp_pMsg,1) \
| rename oname as "old name" \
| rename nname as "new name" \
| search typ="File*" \
| table "old name","new name"

[ftp_renamed_Dirs]
action.email.inline = 1
action.email.reportServerEnabled = 0
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
dispatch.earliest_time = 0
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = index=ftp sourcetype="FileZilla_FTP" ftp_command="RNFR" | append [search ftp_command="RNTO"] | append [search ftp_code=350] | sort by _raw | transaction mvlist=t maxevents=3 maxspan=2s |eval typ=mvindex(ftp_pMsg,2) |eval oname=mvindex(ftp_pMsg,1) |eval nname=mvindex(ftp_pMsg,0) | rename oname as "old name" | rename nname as "new name" | search typ="Dir*" | table "old name","new name"

[ftp_failed_uploads]
action.email.reportServerEnabled = 0
alert.track = 0
dispatch.earliest_time = 0
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = index=ftp sourcetype="FileZilla_FTP" ftp_command="RNFR" | append [search ftp_command="RNTO"] | append [search ftp_code=350] | sort by _raw | transaction mvlist=t maxevents=3 maxspan=2s |eval typ=mvindex(ftp_pMsg,2) |eval oname=mvindex(ftp_pMsg,1) |eval nname=mvindex(ftp_pMsg,0) | rename oname as "old name" | rename nname as "new name" | search typ="File*" | table "old name","new name"

[ftp_logons]
auto_summarize.dispatch.earliest_time = -1d@h
dispatch.earliest_time = 
dispatch.latest_time = 
search = sourcetype="FileZilla_FTP" ftp_msg="*230 Logged on"  | rename ftp_usr as User | stats count(User)

[ftp_wrong_PWDs]
action.email.inline = 1
action.email.reportServerEnabled = 0
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
dispatch.earliest_time = 
dispatch.latest_time = 0
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = sourcetype="FileZilla_FTP" 530 | timechart count(ftp_msg)

[ftp_connection_timed_out]
action.email.inline = 1
alert.digest_mode = True
alert.suppress = 0
dispatch.earliest_time = 
dispatch.latest_time = 0
search = sourcetype="FileZilla_FTP" 421 | stats count(ftp_msg) | Fields - percent

[ftp_downloaded_files]
action.email.inline = 1
alert.digest_mode = True
alert.suppress = 0
auto_summarize.dispatch.earliest_time = -1d@h
search = sourcetype="FileZilla_FTP" RETR | rename ftp_pMsg as downloads | stats count(downloads) by downloads

[ftp_uploaded_files]
action.email.inline = 1
action.email.reportServerEnabled = 0
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
dispatch.earliest_time = 0
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = index=ftp sourcetype="FileZilla_FTP" ftp_msg="*STOR*" | append [search ftp_code=550] | sort by _time | transaction maxevents=2 maxspan=2s |  search NOT 550 | rename ftp_pMsg as "uploaded files" | stats count("uploaded files") by "uploaded files"

[ftp_login_dur]
action.email.reportServerEnabled = 0
alert.track = 0
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = index=ftp ftp_code=230 OR ftp_command="disconnected" | transaction ftp_src_ip startswith="Logged on" endswith="disconnected." | rename ftp_usr as user | rename ftp_src_ip as source | rename duration as "sec loged in"| table user,source,"sec loged in"

[ftp_usr_by_ip]
action.email.reportServerEnabled = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
auto_summarize.timespan = 1m
dispatch.earliest_time = 0
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = index=ftp | rename ftp_src_ip as source | rename ftp_usr as user |  stats count(source) by source,user | Fields - count(source)

[ftp_list_usr_by_source]
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
display.general.timeRangePicker.show = 0
display.general.type = statistics
display.page.search.mode = fast
display.page.search.tab = statistics
request.ui_dispatch_view = search
search = index=ftp ftp_code="230" | rename ftp_src_ip as source | rename ftp_usr as user | transaction source | stats list(user) as user by source

[ftp_src_by_usr]
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
display.general.timeRangePicker.show = 0
display.general.type = statistics
display.page.search.mode = fast
display.page.search.tab = statistics
request.ui_dispatch_view = search
search = index=ftp ftp_code="230" | rename ftp_src_ip as source | rename ftp_usr as user | transaction source | stats list(source) as source by user

[ftp_bans_by_src]
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
display.general.timeRangePicker.show = 0
display.general.type = statistics
display.page.search.mode = fast
display.page.search.tab = statistics
request.ui_dispatch_view = search
search = sourcetype="FileZilla_FTP" banned | Rename ftp_src_ip as source | stats count(source) as banned by source

[ftp_top_10_downloaded_files]
auto_summarize.dispatch.earliest_time = -1d@h
dispatch.earliest_time = 
dispatch.latest_time = 0
search = sourcetype="FileZilla_FTP" RETR | top ftp_pMsg

[ftp_wrong_pwd_by_source_and_usr]
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
display.general.timeRangePicker.show = 0
display.general.type = statistics
display.page.search.mode = fast
display.page.search.tab = statistics
request.ui_dispatch_view = search
search = sourcetype="FileZilla_FTP" 331 | append[search 530] | sort by _time | rename ftp_src_ip as source | transaction source maxevents=2 startswith="530" endswith="331" | eval errmsg=mvindex(ftp_pMsg,1) | stats list(errmsg) as errmsg by source | rename list(emsg) as user

[ftp_gmap]
action.email.inline = 1
action.email.reportServerEnabled = 0
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
dispatch.earliest_time = 0
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = index=ftp sourcetype=FileZilla_FTP Connected | geoip ftp_src_ip | top geo_info | Fields - percent

[ftp_100]
action.email.reportServerEnabled = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
auto_summarize.timespan = 1m
dispatch.earliest_time = 0
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = sourcetype="FileZilla_FTP" ftp_code>="100" AND ftp_code<="199" | stats count(ftp_code)
vsid = hgez6be7

[ftp_200]
action.email.reportServerEnabled = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
auto_summarize.timespan = 1m
dispatch.earliest_time = 0
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = sourcetype="FileZilla_FTP" ftp_code>="200" AND ftp_code<="299" | stats count(ftp_code)
vsid = hgez74ii

[ftp_400]
action.email.reportServerEnabled = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
auto_summarize.timespan = 1m
dispatch.earliest_time = 0
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = sourcetype="FileZilla_FTP" ftp_code>="400" AND ftp_code<="499" | stats count(ftp_code)
vsid = hgez8z0e

[ftp_500]
action.email.reportServerEnabled = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
auto_summarize.timespan = 1m
dispatch.earliest_time = 0
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = sourcetype="FileZilla_FTP" ftp_code>="500" AND ftp_code<="599" | stats count(ftp_code)
vsid = hgez9ilh

[ftp_300]
action.email.inline = 1
action.email.reportServerEnabled = 0
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
auto_summarize.timespan = 1m
dispatch.earliest_time = 0
displayview = flashtimeline
request.ui_dispatch_view = flashtimeline
search = sourcetype="FileZilla_FTP" ftp_code>="300" AND ftp_code<="399" | stats count(ftp_code)
vsid = hgez7n1z

[ftp_Geomap]
action.email.inline = 1
action.email.reportServerEnabled = 0
action.email.useNSSubject = 1
alert.suppress = 0
alert.track = 0
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
display.general.type = visualizations
display.page.search.mode = verbose
display.page.search.tab = visualizations
display.statistics.show = 0
display.visualizations.type = mapping
displayview = flashtimeline
request.ui_dispatch_app = tFTP
request.ui_dispatch_view = search
search = sourcetype="FileZilla_FTP" ftp_msg="*230 Logged on" \
| rename ftp_src_ip as clientip \
| iplocation clientip \
| geostats count by City



