### APM Summaries and Reports ###

[F5 - APM -  ActiveSync by User  - Report]
action.email.sendresults = 0
cron_schedule = */59 * * * *
#dispatch.earliest_time = -1h
#dispatch.latest_time = +0s
displayview = search
enableSched = 0 
request.ui_dispatch_view = search
search = sourcetype="apm_log" User="*" | chart count by User | sort - count


[F5 - APM -  ActiveSync by Device  - Report]
action.email.sendresults = 0
cron_schedule = */59 * * * *
#dispatch.earliest_time = -1h
#dispatch.latest_time = +0s
displayview = search
enableSched = 0
request.ui_dispatch_view = search
search = sourcetype="apm_log" DeviceType="*" | chart count by DeviceType | sort - count


[F5 - APM   -  Geolocation by state  - Report]
action.email.sendresults = 0
cron_schedule = */59 * * * *
#dispatch.earliest_time = -1h
#dispatch.latest_time = +0s
displayview = search
enableSched = 0
request.ui_dispatch_view = search
search = sourcetype="apm_log" "New session" | rex field=_raw "\(ST=(?<geo_state>.*)/CC=(?<geo_country>.*)/C=(?<geo_region>.*)\) at VIP (?<vip>\\d+\.\\d+\.\\d+\.\\d+)" | where len(geo_state) > 0 | chart count over geo_state by geo_country


[F5 - APM   -  Geolocation by country  - Report]
action.email.sendresults = 0
cron_schedule = */59 * * * *
#dispatch.earliest_time = -1h
#dispatch.latest_time = +0s
displayview = search
enableSched = 0
request.ui_dispatch_view = search
search = sourcetype="apm_log" "New session" | rex field=_raw "\(ST=(?<geo_state>.*)/CC=(?<geo_country>.*)/C=(?<geo_region>.*)\) at VIP (?<vip>\\d+\.\\d+\.\\d+\.\\d+)" | where len(geo_country) > 0 | chart count over geo_country by geo_region


[F5 - APM   -  Geolocation by region  - Report]
action.email.sendresults = 0
cron_schedule = */59 * * * *
#dispatch.earliest_time = -1h
#dispatch.latest_time = +0s
displayview = search
enableSched = 0
request.ui_dispatch_view = search
search = sourcetype="apm_log" "New session" | rex field=_raw "\(ST=(?<geo_state>.*)/CC=(?<geo_country>.*)/C=(?<geo_region>.*)\) at VIP (?<vip>\\d+\.\\d+\.\\d+\.\\d+)" | where len(geo_region) > 0 | chart count by geo_region | sort - count


[F5 - APM -  Allow ACL  - Report]
action.email.sendresults = 0
cron_schedule = */59 * * * *
#dispatch.earliest_time = -1h
#dispatch.latest_time = +0s
displayview = search
enableSched = 0
request.ui_dispatch_view = search
search = sourcetype="apm_log" "allow ACL" | rex field=_raw "packet: (?<url>.\\S+) (?<net_protocol>.\\w+) (?<clntip>.\\d+\.\\d+\.\\d+\.\\d+:\\d+) -> (?<svrip>.\\d+\.\\d+\.\\d+\.\\d+:\\d+)" | chart count by url | sort - count


[F5 - APM  -  Session Variables  - Summary]
action.email.sendresults = 0
cron_schedule = */59 * * * *
#dispatch.earliest_time = -1h
#dispatch.latest_time = +0s
displayview = search
enableSched = 0
request.ui_dispatch_view = search
search = sourcetype="apm_log" session.* | rex "(?<sess_var>session\..\\S+) is (?<sess_var_val>.*\\Z)" | top limit=100 sess_var
#vsid = fx3rsu63


[F5 - APM  -  Session Variables  - By Session Id]
action.email.sendresults = 0
cron_schedule = */59 * * * *
#dispatch.earliest_time = -1h
#dispatch.latest_time = +0s
displayview = search
enableSched = 0
request.ui_dispatch_view = search
search = sourcetype="apm_log" session.* | rex "(?<sess_var>session\..\\S+) is (?<sess_var_val>.*\\Z)" | chart count by session_id | sort - count


[F5 - APM  -  Session Duration  - Report]
action.email.sendresults = 0
cron_schedule = */59 * * * *
#dispatch.earliest_time = -1h
#dispatch.latest_time = +0s
displayview = search
enableSched = 0
request.ui_dispatch_view = search
search = sourcetype="apm_log" ((New session) OR (Session deleted)) | transaction session_id startswith="New session" endswith="Session deleted" | concurrency duration=duration | sort - duration | eval str_duration=tostring(duration, "duration") | join session_id [search sourcetype="apm_log" Username | rex field=_raw "Username '(?<username>.\\S+)'" | where len(username) > 0] | table username, str_duration


[F5 - APM  -  Active Session  - Report]
action.email.sendresults = 0
cron_schedule = */59 * * * *
#dispatch.earliest_time = -1h
#dispatch.latest_time = +0s
displayview = search
enableSched = 0
request.ui_dispatch_view = search
search = sourcetype="apm_log" ((New session) OR (Session deleted)) | transaction session_id startswith="New session" endswith="Session deleted" keepevicted=t | search eventcount="1" NOT deleted


[F5 - APM  -  Max Concurrent Sessions  - Report]
action.email.sendresults = 0
cron_schedule = */59 * * * *
#dispatch.earliest_time = -1h
#dispatch.latest_time = +0s
displayview = search
enableSched = 0
request.ui_dispatch_view = search
search = sourcetype="apm_log" ((New session) OR (Session deleted)) | transaction session_id startswith="New session" endswith="Session deleted" keepevicted=t| concurrency duration=duration | eval duration=tostring(duration, "duration") | fields session_id, duration, concurrency | chart max(concurrency) over _time


[F5 - APM  -  Session Throughput  - Report]
action.email.sendresults = 0
cron_schedule = */59 * * * *
#dispatch.earliest_time = -1h
#dispatch.latest_time = +0s
displayview = search
enableSched = 0
request.ui_dispatch_view = search
search = sourcetype="apm_log" statistics NOT "0," | rex field=_raw "bytes in: (?<bytes_in>\\d+), bytes out: (?<bytes_out>\\d+)" | table _time, bytes_in, bytes_out | sort + _time


[F5 - APM -  Access Type  - Report]
action.email.sendresults = 0
cron_schedule = */59 * * * *
#dispatch.earliest_time = -1h
#dispatch.latest_time = +0s
displayview = search
enableSched = 0
request.ui_dispatch_view = search
search = sourcetype="apm_log" "Access policy result:" | rex field=_raw "Access policy result: (?<access_type>.*$)" | chart count by access_type


[F5 - APM -  Top Users by login  - Report]
action.email.sendresults = 0
cron_schedule = */59 * * * *
#dispatch.earliest_time = -1h
#dispatch.latest_time = +0s
displayview = search
enableSched = 0
request.ui_dispatch_view = search
search = sourcetype="apm_log" Username | rex field=_raw "Username '(?<login_name>.\\S+)'" | where len(login_name) > 0 | stats count by login_name | sort - count


[F5 - APM -  Top Users by Throughput  - Report]
action.email.sendresults = 0
cron_schedule = */59 * * * *
#dispatch.earliest_time = -1h
#dispatch.latest_time = +0s
displayview = search
enableSched = 0
request.ui_dispatch_view = search
search = sourcetype="apm_log" Username | rex field=_raw "Username '(?<username>.\\S+)'" | where len(username) > 0 | join session_id [search sourcetype="apm_log" statistics NOT "0," | rex field=_raw "bytes in: (?<bytes_in>\\d+), bytes out: (?<bytes_out>\\d+)" | eval throughput=bytes_in+bytes_out ] | chart max(throughput) over username | sort - max(throughput)


[F5 - APM -  Auth Success vs. Failed  - Report]
action.email.sendresults = 0
cron_schedule = */59 * * * *
#dispatch.earliest_time = -1h
#dispatch.latest_time = +0s
displayview = search
enableSched = 0
request.ui_dispatch_view = search
search =  sourcetype="apm_log" "Access policy result:" | rex field=_raw "Access policy result: (?<access_type>.*$)" | chart count(eval(access_type="Logon_Deny")) AS "Auth Failed", count(eval(NOT access_type="Logon_Deny")) AS "Auth Success" by host



[F5 - APM -  Access by User Agent  - Report]
action.email.sendresults = 0
cron_schedule = */59 * * * *
#dispatch.earliest_time = -1h
#dispatch.latest_time = +0s
displayview= search
enableSched = 0
request.ui_dispatch_view = search
search = sourcetype="apm_log" session.user.agent | rex field=_raw "session.user.agent is (?<user_agent>.*$)" | stats count by user_agent | sort - count



[F5 - APM -  Client Type over Platform - Report]
action.email.sendresults = 0
cron_schedule = */59 * * * *
#dispatch.earliest_time = -1h
#dispatch.latest_time = +0s
displayview = search
enableSched = 0
request.ui_dispatch_view = search
search =  sourcetype="apm_log" session.client.browscap_info | chart count over ctype by cplatform 


[F5 - APM -  Access by IP - Report]
action.email.sendresults = 0
cron_schedule = */59 * * * *
#dispatch.earliest_time = -1h
#dispatch.latest_time = +0s
displayview = search
enableSched = 0
request.ui_dispatch_view = search
search = sourcetype=apm_log New session | rex "client IP (?<client_ip>[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3})"|chart count by client_ip | sort limit=20 - count


[F5 - APM  -  PPP tunnels]
display.visualizations.show = false
search = sourcetype=apm_log ((PPP tunnel started) OR (PPP tunnel closed)) |rex field=_raw "PPP tunnel (?<tunnel_id>0x[a-f0-9]+) "| transaction session_id, tunnel_id startswith="started" endswith="closed"| concurrency duration=duration| sort - duration | eval str_duration=tostring(duration,"duration")| table _time, session_id, tunnel_id, str_duration


[F5 - APM  -  PPP tunnels IP adresses per session]
display.visualizations.show = false
search = sourcetype=apm_log PPP IPv4| rex field=_raw "PPP IPv4: (?<tunnel_ip>[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3})"|sort - _time|table _time, session_id, tunnel_ip

[F5 - APM     - Unique IP addresses]
search = sourcetype=apm_log "client IP"| rex field=_raw "IP (?<client_ip>[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3})" | stats dc(client_ip) as uniqIP
### Firepass Summaries and Reports ###

[F5 - FirePass - Connections Over Time - Report]
action.email.sendresults = 0
cron_schedule = */10 * * * *
#dispatch.earliest_time = -1h
#dispatch.latest_time = +0s
displayview = search
enableSched = 0 
request.ui_dispatch_view = search
search = sourcetype="firepass_log" eventtype="*" | timechart count by eventtype


[F5 - Firepass  -  Connections by User  - Report]
action.email.sendresults = 0
cron_schedule = */59 * * * *
#dispatch.earliest_time = -1h
#dispatch.latest_time = +0s
displayview = search
enableSched = 0 
request.ui_dispatch_view = search
search = sourcetype="firepass_log" eventtype="connection_success" | where NOT user="_fpuser" | top user | head 20


[F5 - Firepass  - Failed Connections by User  - Report]
action.email.sendresults = 0
cron_schedule = */59 * * * *
#dispatch.earliest_time = -1h
#dispatch.latest_time = +0s
displayview = search
enableSched = 0 
request.ui_dispatch_view = search
search = sourcetype="firepass_log" eventtype="connection_failed" | where NOT user="_fpuser" | top user | head 20


[F5 - Firepass - Session Duration - Report]
action.email.sendresults = 0
cron_schedule = */59 * * * *
#dispatch.earliest_time = -1h
#dispatch.latest_time = +0s
displayview = search
enableSched = 0
request.ui_dispatch_view = search
search = sourcetype="firepass_log" logged (on OR out) | transaction sid startswith="logged on" endswith="logged out" | concurrency duration=duration | sort - duration | eval str_duration=tostring(duration, "duration") | join sid [search sourcetype="firepass_log" | where len(user) > 0 AND NOT user="_fpuser"] | table user, str_duration


[F5 - Firepass - Active Session - Report]
action.email.sendresults = 0
cron_schedule = */59 * * * *
#dispatch.earliest_time = -1h
#dispatch.latest_time = +0s
displayview = search
enableSched = 0
request.ui_dispatch_view = search
search =  sourcetype="firepass_log" logged (on OR out) | transaction sid startswith="logged on" endswith="logged out" keepevicted=t | search eventcount="1" NOT out | where NOT user="_fpuser" | stats count by user | sort - count


[F5 - Firepass - Max Concurrent Sessions - Report]
action.email.sendresults = 0
cron_schedule = */59 * * * *
#dispatch.earliest_time = -1h
#dispatch.latest_time = +0s
displayview = search
enableSched = 0
request.ui_dispatch_view = search
search = sourcetype="firepass_log" logged (on OR out) | transaction sid startswith="logged on" endswith="logged out" keepevicted=t | concurrency duration=duration | eval duration=tostring(duration, "duration") | fields sid, duration, concurrency | chart max(concurrency) over _time


[F5 - Firepass - Top Users by Access - Report]
action.email.sendresults = 0
cron_schedule = */59 * * * *
#dispatch.earliest_time = -1h
#dispatch.latest_time = +0s
displayview = search
enableSched = 0
request.ui_dispatch_view = search
search = sourcetype="firepass_log" | where len(user) > 0 AND NOT user="_fpuser" | stats count by user | sort - count


[F5 - Firepass - Connection Success vs Failed - Report]
action.email.sendresults = 0
cron_schedule = */59 * * * *
#dispatch.earliest_time = -1h
#dispatch.latest_time = +0s
displayview = search
enableSched = 0
request.ui_dispatch_view = search
search = sourcetype="firepass_log" eventtype="*" | chart count(eval(eventtype="connection_success")) AS "Connection Success", count(eval(eventtype="connection_failed")) AS "Connection Failed" by host


[F5 - Firepass - Possible Intrusion by IP - Report]
action.email.sendresults = 0
cron_schedule = */59 * * * *
#dispatch.earliest_time = -7d
#dispatch.latest_time = +0s
displayview = search
enableSched = 0
request.ui_dispatch_view = search
search = sourcetype="firepass_log" eventtype="possible_intrusion" | stats count by src_ip | sort - count


[F5 - Firepass - Logon Denied - Report]
action.email.sendresults = 0
cron_schedule = */59 * * * *
#dispatch.earliest_time = -3d
#dispatch.latest_time = +0s
displayview = search
enableSched = 0
request.ui_dispatch_view = search
search = sourcetype="firepass_log" logon denied | stats count by src_ip | sort - count


[F5 - Firepass - GarbageCollection by Reason - Report]
action.email.sendresults = 0
cron_schedule = */59 * * * *
#dispatch.earliest_time = -1h
#dispatch.latest_time = +0s
displayview = search
enableSched = 0
request.ui_dispatch_view = search
search= sourcetype=firepass_log access_type=GarbageCollection | stats count by reason | sort - count


[F5 - Firepass - Network Access by IP - Report]
action.email.sendresults = 0
cron_schedule = */59 * * * *
#dispatch.earliest_time = -1h
#dispatch.latest_time = +0s
displayview = search
enableSched = 0
request.ui_dispatch_view = search
search= sourcetype=firepass_log access_type=NetworkAccess open | stats count by remote_ip, user | sort - count

#######################################################################
####################       SWG Saved searches        ##################
#######################################################################
[F5 - SWG - Top url requested  - Report]
action.email.sendresults = 0
cron_schedule = */59 * * * *
#dispatch.earliest_time = -1h
#dispatch.latest_time = +0s
displayview = search
enableSched = 0
request.ui_dispatch_view = search
search = sourcetype="swg_log" | chart count by destination_url | sort limit=25 - count

[F5 - SWG - Top url blocked  - Report]
action.email.sendresults = 0
cron_schedule = */59 * * * *
#dispatch.earliest_time = -1h
#dispatch.latest_time = +0s
displayview = search
enableSched = 0
request.ui_dispatch_view = search
search = sourcetype="swg_log" action=Blocked | chart count by destination_url | sort limit=25 - count

[F5 - SWG - Top categories requested  - Report]
action.email.sendresults = 0
cron_schedule = */59 * * * *
#dispatch.earliest_time = -1h
#dispatch.latest_time = +0s
displayview = search
enableSched = 0
request.ui_dispatch_view = search
search = sourcetype="swg_log" | rex field=url_category "(.*/|)(?<Category>.*)"|chart count by Category| sort limit=20 - count

[F5 - SWG - Top 10 hostname requested - Report]
action.email.sendresults = 0
cron_schedule = */59 * * * *
#dispatch.earliest_time = -1h
#dispatch.latest_time = +0s
displayview = search
enableSched = 0
request.ui_dispatch_view = search
search = sourcetype="swg_log" | rex field=destination_url "[?:http|https]://(?<hostname>[^/]*)" | chart count by hostname | sort limit=10 - count 


[F5 - SWG - Top categories by blocked requests  - Report]
action.email.sendresults = 0
cron_schedule = */59 * * * *
#dispatch.earliest_time = -1h
#dispatch.latest_time = +0s
displayview = search
enableSched = 0
request.ui_dispatch_view = search
search = sourcetype="swg_log" action=Blocked | rex field=url_category "(.*/|)(?<Category>.*)"|chart count by Category| sort limit=20 - count


[F5 - SWG  -  Top user by allowed requests  - Report]
action.email.sendresults = 0
cron_schedule = */59 * * * *
#dispatch.earliest_time = -1h
#dispatch.latest_time = +0s
displayview = search
enableSched = 0
request.ui_dispatch_view = search
search = sourcetype="swg_log" action=Allowed |chart count by username| sort limit=20 - count



[F5 - SWG  -  Top user by blocked requests  - Report]
action.email.sendresults = 0
cron_schedule = */59 * * * *
#dispatch.earliest_time = -1h
#dispatch.latest_time = +0s
displayview = search
enableSched = 0
request.ui_dispatch_view = search
search = sourcetype="swg_log" action=Blocked |chart count by username| sort limit=20 - count

[F5 - SWG   -  Allowed requests per ip address  - Report]
action.email.sendresults = 0
cron_schedule = */59 * * * *
#dispatch.earliest_time = -1h
#dispatch.latest_time = +0s
displayview = search
enableSched = 0
request.ui_dispatch_view = search
search = sourcetype="swg_log" action=Allowed |chart count by source_ip


[F5 - SWG   -  Blocked requests per ip address  - Report]
action.email.sendresults = 0
cron_schedule = */59 * * * *
#dispatch.earliest_time = -1h
#dispatch.latest_time = +0s
displayview = search
enableSched = 0
request.ui_dispatch_view = search
search = sourcetype="swg_log" action=Blocked |chart count by source_ip

[F5 - SWG   -  Recent 5 active session  - Report]
action.email.sendresults = 0
cron_schedule = */59 * * * *
#dispatch.earliest_time = -1h
#dispatch.latest_time = +0s
displayview = search
enableSched = 0
request.ui_dispatch_view = search
search = sourcetype="swg_log"| dedup username, session_id, source_ip| sort limit=5 - _time | table username, session_id, source_ip

[F5 - SWG    -  Unique client IP count  - Report]
search = sourcetype=swg_log *| stats dc(source_ip) as "UniqueIPs"


[F5 - SWG    -  Security blocks - Report]
search = sourcetype="securityCategories"| rename cat_name as url_category|table url_category | join type=outer [search sourcetype=swg_log earliest=-24h |stats count by url_category]|fillnull value=0 count|stats sum(count) as "blocks"

[F5  -  SWG - Security stats - Report]
search = sourcetype="securityCategories" earliest=1| rename cat_name as url_category|table url_category | join type=outer [search sourcetype=swg_log|stats count by url_category]|fillnull value=0 count|sort - count 

[F5 - SWG - Http/Https requests - Report]
action.email.sendresults = 0
cron_schedule = */59 * * * *
#dispatch.earliest_time = -1h
#dispatch.latest_time = +0s
displayview = search
enableSched = 0
request.ui_dispatch_view = search
search =  sourcetype=swg_log | chart count(eval(match(destination_url,"https://.*"))) as "https", count(eval(match(destination_url,"http://.*"))) as "http" by host

#######################################################################
#################### INPUTS DASHBOARD SAVED SEACHES ###################
#######################################################################


[Inputs - Recent Changed Files]
dispatch.earliest_time = -24h
search = index=_internal ("/" OR "\\") group=per_source_thruput earliest=-24h source=*metrics.log NOT splunk | dedup series | fields series | rename series as Filename  


[Inputs - Recent Ignored Files]
dispatch.earliest_time = -24h
search = index=_internal source=*splunkd.log earliest=-24h component="fileclassifiermanager" message="invalid file*" | fields message 


[Inputs - Crawl]
search = | crawl | fields source, sourcetype, size


#######################################################################
#################### ADMIN DASHBOARD SAVED SEACHES ####################
#######################################################################

[Admin - System Info]
search = index=_internal source=*splunkd.log component="loader" message="system info*"| head 1 | fields message | fields - _*

[Admin - Splunkd Errors This Hour]
dispatch.earliest_time = -1h
search = index=_internal source="*splunkd.log" earliest=-1h log_level="error" | stats count | rangemap field=count low=0-0 elevated=1-9 default=severe

[Admin - Splunkd Avg Access Delay This Hour]
dispatch.earliest_time = -1h
search = index=_internal source="*splunkd_access.log" earliest=-1h | rex "(?<delay>\d+)ms$" | stats avg(delay) as d | eval d = round(d, 3) | rangemap field=d low=0-250 elevated=250-499 default=severe

[Admin - Splunkd Avg Uptime]
dispatch.earliest_time=1
search = source="*splunkd.log" index=_internal "splunkd starting" OR "shutting down splunkd" | transaction startswith="splunkd starting" endswith="shutting down splunkd" | stats avg(duration) as avgdur | eval avgdur = round(avgdur/3600,3) | rangemap field=avgdur low=24-99999999 elevated=1-23.999 default=severe 

[Admin - Splunkd Recent Errors]
dispatch.earliest_time = -24h
search = index=_internal source=*splunkd.log (log_level="fatal" OR log_level="error")| dedup punct| head 100 | fields message

[Admin - Recent Timestamping Issues]
dispatch.earliest_time = -24h
search = index=_internal source=*splunkd.log component="dateparserverbose" | dedup message | fields message 

[Admin - Splunkweb 404s This Hour]
dispatch.earliest_time = -1h
search = index=_internal 404 source="*web_access.log" earliest=-1h | stats count | rangemap field=count low=0-0 elevated=1-100 default=severe

[Admin - Splunkweb Recent Unhandled Exceptions]
dispatch.earliest_time = -24h
search = index=_internal source=*web_service.log message="*Traceback*" AND log_level=ERROR | dedup component,line|rename message as _raw

[Admin - Splunkweb Recent Errors]
dispatch.earliest_time = -24h
search = index=_internal source=*web_service.log log_level=error NOT traceback NOT "request headers"| dedup message | fields message

[Admin - Splunkweb Browser Usage]
search = index=_internal source=*web_service.log  useragent=* earliest=-24h| timechart count by useragent


#############################################
# ALERTS                                    #
#############################################

[F5 - SWG|Security Alert]
cron_schedule = */10 * * * *
enableSched = 0
counttype = number of events
relation = rises by
quantity = 1
action.email = 1
action.email.to = enter_valid_email_here
action.email.subject = Security Alert
action.email.sendresults = true
action.email.from = splunk@somehost.com
alert.track = 1
action.email.inline = true
action.email.preprocess_results =sort limit=20 - _time| table _time,username, source_ip,url_category, destination_url
search = sourcetype="swg_log" [search sourcetype="securityCategories"|rename cat_name as url_category| fields url_category]

[F5 - SWG|Blocked URLs digest]
cron_schedule = 0 */1 * * *
enableSched = 0
counttype = number of events
relation = greater than
quantity = 0
action.email = 1
action.email.to = enter_valid_email_here
action.email.subject = Blocked URLs digest
action.email.sendresults = true
action.email.from = splunk@somehost.com
alert.track = 1
action.email.inline = true
action.email.preprocess_results = sort - _time| table _time, username, source_ip, url_category, destination_url
search = sourcetype="swg_log" action="Blocked" earliest=-1h


[F5 - SWG|Expectation value of URLs requests count from specified category]
cron_schedule = 0 */1 * * *
enableSched = 0
counttype = number of events
relation = greater than
quantity = 0
action.email = 1
action.email.to = enter_valid_email_here
action.email.subject = Users that makes more requests on specified category that expected
action.email.sendresults = true
action.email.from = splunk@somehost.com
alert.track = 1
action.email.inline = true
search = sourcetype="swg_log" earliest=-1h| where url_category="/Common/Search_Engines_and_Portals"|stats count by source_ip,username, url_category| rename count as cnt|search cnt > 30

[F5 - SWG|Unique IP count changed]
cron_schedule = 0 */1 * * *
enableSched  = 0
counttype = number of events
relation = greater than
quantity = 0
action.email = 1
action.email.to = enter_valid_email_here
action.email.subject = New IP address was connected
action.email.sendresults = true
action.email.from = splunk@somehost.com
alert.track = 1
action.email.inline = true
search = sourcetype="swg_log" earliest=-1h | table _time, source_ip| dedup source_ip | join type=outer [search latest=-1h sourcetype="swg_log"|stats count by source_ip]| fillnull value=0 count | where count=0| fields _time, source_ip 
