

[Corelight_Suricata_Detections]
action.digest_mode = 0
action.logevent.param.event = Corelight Detection - $result.did$
action.logevent.param.source = Corelight: $name$
action.logevent.param.sourcetype = corelight_alerts
action.suppress = 0
action.track = 1
action.webhook.enable_allowlist = 0
counttype = number of events
cron_schedule = */15 * * * *
description = Corelight Detections: Initial alert from connections containing one or more suri_ids values on conn log events. Correlated with conn, dns, ssl, http, files matched with uids. Enriched by corelight_detection_enrichment lookup, filtered by impact_score greater than 3. Creates a hash and validates if the hash exists on the corelight_suri_aggregations sourcetype and collects only what does not match.
disabled = 1
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","is_dest_internal_ip","is_src_internal_ip"]
display.general.type = statistics
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = TA-CorelightForSplunk
request.ui_dispatch_view = search
search = eventtype IN (corelight_conn, corelight_suri, corelight_files, corelight_http, corelight_smb*, corelight_ssl, corelight_dns)  [ search eventtype IN (corelight_suri) suri_id=*     | lookup corelight_alert_aggregations sid AS signature_id OUTPUT impact_score    | where impact_score > 3     | stats count by uid     | fields - count     | format] | fields uid ts src_ip dest_ip suri_id sourcetype sensor_name signature signature_id | stats values(signature_id) as signature_ids values(sourcetype) as paths values(signature) as signatures values(src_ip) as orig_h values(dest_ip) as resp_h values(ts) as ts values(sensor_name) as sensor by uid | eval sids_sorted = mvjoin(mvsort(signature_ids), ",") | eval did = substr(sha1(sids_sorted), 2, 8) | eval dethash = sha1(sids_sorted + "," + uid + "," + tostring(ts) + ",") | search NOT     [ search eventtype=corelight_aggregations     | stats count by dethash     | fields - count     | format ] | eval _raw = json_object( "sid", signature_ids, "signatures", signatures, "uid", uid, "id.orig_h", orig_h, "id.resp_h", resp_h, "did", did, "ts", ts, "dethash", dethash, "paths", paths, "sensor", sensor ) | fields _raw | collect [ rest /servicesNS/-/-/configs/conf-corelightforsplunk_settings splunk_server=local | search title="app_settings" | stats values(indexes) as idx | eval t=split(mvjoin(idx,","),","), idx = "index=".mvindex(mvfilter(!match(t,"any_index")),0) |table idx | return $idx] sourcetype=corelight_suri_aggregations
action.logevent.param.index = corelight
action.email.useNSSubject = 1
alert.track = 0
display.page.search.mode = fast
display.visualizations.charting.chart = line
display.visualizations.show = 0

[corelight_dns_port_lookup_gen]
action.email.useNSSubject = 1
alert.track = 0
cron_schedule = 11 * * * *
disabled = 1
dispatch.earliest_time = -60m@m
dispatch.latest_time = now
display.general.type = statistics
display.page.search.mode = fast
display.page.search.tab = statistics
display.visualizations.charting.chart = line
display.visualizations.show = 0
enableSched = 1
request.ui_dispatch_app = TA-CorelightForSplunk
request.ui_dispatch_view = search
search = `corelight_idx` `corelight_dns_port_lookup_gen`

[corelight_dns_record_type_lookup_gen]
action.email.useNSSubject = 1
alert.track = 0
cron_schedule = 41 * * * *
disabled = 1
dispatch.earliest_time = -60m@m
dispatch.latest_time = now
display.general.type = statistics
display.page.search.mode = fast
display.page.search.tab = statistics
display.visualizations.charting.chart = line
display.visualizations.show = 0
enableSched = 1
request.ui_dispatch_app = TA-CorelightForSplunk
request.ui_dispatch_view = search
search = `corelight_idx` `corelight_dns_record_type_lookup_gen`

[corelight_files_mime_type_lookup_gen]
action.email.useNSSubject = 1
alert.track = 0
cron_schedule = 21 * * * *
disabled = 1
dispatch.earliest_time = -60m@m
dispatch.latest_time = now
display.general.type = statistics
display.page.search.mode = fast
display.page.search.tab = statistics
display.visualizations.charting.chart = line
display.visualizations.show = 0
enableSched = 1
request.ui_dispatch_app = TA-CorelightForSplunk
request.ui_dispatch_view = search
search = `corelight_idx` `corelight_files_mime_type_lookup_gen`

[corelight_sensor_lookup_gen]
action.email.useNSSubject = 1
alert.track = 0
cron_schedule = 1 * * * *
disabled = 1
dispatch.earliest_time = -60m@m
dispatch.latest_time = now
display.general.type = statistics
display.page.search.mode = fast
display.page.search.tab = statistics
display.visualizations.charting.chart = line
display.visualizations.show = 0
enableSched = 1
request.ui_dispatch_app = TA-CorelightForSplunk
request.ui_dispatch_view = search
search = `corelight_idx` `corelight_sensor_lookup_gen`

[corelight_service_lookup_gen]
action.email.useNSSubject = 1
alert.track = 0
cron_schedule = 51 * * * *
disabled = 1
dispatch.earliest_time = -60m@m
dispatch.latest_time = now
display.general.type = statistics
display.page.search.mode = fast
display.page.search.tab = statistics
display.visualizations.charting.chart = line
display.visualizations.show = 0
enableSched = 1
request.ui_dispatch_app = TA-CorelightForSplunk
request.ui_dispatch_view = search
search = `corelight_idx` `corelight_service_lookup_gen`

[corelight_software_types_lookup_gen]
action.email.useNSSubject = 1
alert.track = 0
cron_schedule = 31 * * * *
disabled = 1
dispatch.earliest_time = -60m@m
dispatch.latest_time = now
display.general.type = statistics
display.page.search.mode = fast
display.page.search.tab = statistics
display.visualizations.charting.chart = line
display.visualizations.show = 0
enableSched = 1
request.ui_dispatch_app = TA-CorelightForSplunk
request.ui_dispatch_view = search
search = `corelight_idx` `corelight_software_types_lookup_gen`