{"basic_builder": {"appname": "TA-microsoft-365-defender-advanced-hunting", "friendly_name": "Microsoft 365 Defender Advanced Hunting", "version": "1.0.1", "author": "Jimmy Pedersen", "description": "Run Kusto queries against MS365 Defender Advanced Hunting tables.\n \nFind out more here: https://docs.microsoft.com/en-us/microsoft-365/security/defender/api-advanced-hunting?view=o365-worldwide\n\nQuota Limitations: https://docs.microsoft.com/en-us/microsoft-365/security/defender/api-advanced-hunting?view=o365-worldwide#quotas-and-resource-allocation", "theme": "#000000", "large_icon": "iVBORw0KGgoAAAANSUhEUgAAAEgAAABICAYAAABV7bNHAAAAAXNSR0IArs4c6QAAD31JREFUeF7tnAl0VFWax//v1V6Vyr7HbECAsIZNgoACnT4CgsaGcUZABlpHHXA5ysBAYyMqKI3d2IojLgO2oyOtYmPskX2QpREQQTaBAIEkkIRKZaskldreu3fOfS8VqrJVJamqzJnxnpNzSOW+e7/7e992v3sLjlJK8XPrkAD3M6DOtaO3ANEGEaTMTrl6p8iLzUrcWOcEKMBzHIxaBU2LUJEEPc9+5XpLyUMKiAK0qImSnywCX2wjwpE6yt20OpVOUbbyC9+ZQAmg4DjcEakhkzL0wp0pauXAWDVyEjScXsWFHFTIANW5IH5R7uR/tIjkh1qXgrTj+tyAPLWF4zgMT9KJkzK0/MKcCJIVreI5hE6jQgLoLyaRHK920m/NTgXpJCS0B8gNi+nO5Aw9mZBhpCvGRyhCZXJBBVQnQNxcYuf2VApctZMAlHZqIp0BcgNhvumedB3+ODVBTDEqlMEGFTRA+2sI+bjUQS83uHiH2DkY9yL9AcT6chxHB8Zp6NxhkXRJbnhQtSnggKwiyNZyJ9lSbFcwpfGlNZ4a4C8g6RmOoyoFkN/fSF+/N54mGPiggAoIIGY8dhH4qVEUnj5nUwmC2C3N7xIgjxkUCh5rpsQJC4Yb+TA1zyl5GWG3hGj1ULcBsZBtEUDrnIQrtRHXa1cdarNN6JFM3QXknjTGoMKqu6Nd41N1ymi9gmkVx7Mw2IPmNyBCGRBKzC7A4hQVNhHi/hpR3FfpVNpdRH5nPWw9BeQ5fV4/o/OJEeG8Ts0pI7VKkmxUkFg9z6t4rkuyegEyOyk9W0/QwJwqy1OkkCzHZRcFKbIS19lG8KWNLpVdZA4msC2QgNySqRQc0qO04phktZATr1YaNR6+SlIuDjoVT3MS1XRgjKoNvBZAVhG0wCSQLaVOrs5JeBkQgxO6vWwwAHX6CiVl4qBX83TOEKO48u5oLrGVs28BdK2JkFcv28npOlfQc4uOhA45IA9B4gxK19q8ePLI0DCNp3wtgC40iOSFizaxtElUBdZw/B+tNwFRcM4XJ8XSFROifgbU3iv7GZAPRQ4qIAUHfDEmzEuE4iYR/17iwIWGttEuJ1yBFwfqwNJJFgzdYcDa6EJhlROfna/HoVIbWBnE6ZFzfv1wMvrHaCASikqrgJcPVuPbYlu7Sz+/KANKDuB5DnuKrPjt/irU2juOvD4BXWwkIvNBJVZB7b/XkHs+lKzCsv76No+9UtiEggpXm89zo5R4e7ih02kaHCL+dNqC9UdqUdUkU1oxIQrLJ8ZCreDgEAg+PVePRd9UthlHp+RQszyr5fMPf7Rg0TemTuejHOd48Z4YumJCtLZdJ11oJcKqi3ahqNHl1cEfWAVjw5CiU8BFKOpcFHEaOZ343WUbvix3ovV78wcQe57VjDafsuClA1WothHEG3icX5QJo0bedu0tsuL+rWVtRJydHYaPZyVLn9tcBO+cqMML+6t8AbK+PDmWLLsryhhwQAcmhCNMyaHSQbCn0ol5qTLjggoHNl13oMrpnUu1BnSsxoVKB4Wl0oaMSBUmpt/WRmZKz+yoREFhozSmaWlfhDcDOlDchNmflcHq8h5/3/w7MD5NHuO8yYHFO27h+zJH7wAaGMbjgxFh0Ck4ML/zfrEdrw6SzafaQbDspyacqffevLYG9MxZK47XCrh0tBIDY1T49YhIPDE6smVBK/aZselEHRwixc55KZiUIY9/qcqB53ZV4kArP+QJcd81K/K3lqG5qtshJMpxwdGgtdk65MWrpDpykVXEhqs2bBxmkArvrD11xopjtd6b2NaA3H3ceRCrQR//p3TJ17C2+VQdXjlYDZNVxIQ0LfbOT5M+b3IR/Nv3tVj1bXXLwplylT4vaxk70dp91YoHPyv36SmCBujPo8PQ1yD7nMuNIl66ZMNvB+qQbZQT8vWXbfiqwglPK/MFKCtahQMLUhGtl8f4urABy/eacb1OAGPWuLJ/y4JbO+D8gQZseSCJ7a9QaxOx5lC15IN8NZ+ArjRR1+pCh6vQ4mgbjjoYXcsDH48KQ6ZBdtAflTqkn3mpajyRqZOeulAvSGZ2y3HbT/gC1C9ahf3/mIo4gwxox+VGLN1rxrVaOSJaV2a1aOgnZyx4aocJjmYr3jE3Bfek66XwXljlwMQtN9AgVe46b5TjLWvz4oQlYyNiPHu2bDW6A2hWkgqL+mgRoeLRJFDkH29AjYsiP0mFFwbInFkk+vsTjbjedFvIngJalxeLZ3OjpfHP3LLjX/eacbBEzodOPp6O7Dg1K8vigtmBUe+V+GIj/Z1yirpX8+KE58eGxwYM0MZheoyLlrdujQLFpL/VS/++P5EB0rW85YdPNOCKNXCAwtU8TMv6SXOxpJGZ0bq/1Ujmd0ICJCeTTPMe2lYRGEBdzYNYlvrmUD3GNgOqcxE8cKxBEmZUpBLP9tUiXS/nK5/esGPjNQerKUmtpxpkVHOo+Jd+ULATMkACtPZQNWZkGbBxegISjUpYnQTTP7mJ78vtfgIKcBQbYuSxcoAOWWGynyizidhlkn2EUclhdJQSfQwyIKtAMO1oA5oT4h4D0qs4HFqYisHxcr711rFavHSwCm9Mjcc/DDZCreRR7xCR8HqRX3BkEwswoCczNJibqpHyH3/aPYctsDY7Ul8alBWjwuGFaYjQyoC3X2wAy4VKLHK6wKacO8yI92YmSb//UG7H0j2V+M3EGPyyr5wjXTQ7MNJP/9MMqPGVKXHi0nGREZ7raXHSN+xUXH/VIR6tcvi1F2M+Jj/Jr67SfIvPNOJ4rUzIF6BhCRp892haiwm9eawG64/UoMZ2249lx6px6skMaTy7QLBktxmzB4VhcqYM6NmdJrx/0uLPu5P66DVKy/pfxguP5oS1H8VqXJS+V+KkX960+yxqx2s4LM/S4e7YZgftInjjmretx6t53BuvQkazmZ23uLDgx6Z2AW24YpOy7etnqzEiUYu8PgbMHHC7OvDcLhM+OGnxyoalXGlhKqJ1solvOlGLcXfokJMkm13i61dhcfgO726Co5K1jjemJpIxyWo5P2luLRpkJ1T8zxtOcdN1u0+1mJmowuJMLWKbN6XbyhxYd8UbkE4B/Ka/DtMS5OFYuL/zoBzlWmtQuU2UzM9udSHBoER8s19jfVmofn5XZUsYdwsereOxZnIsFo6UtySnym1ICVchoflZ3ZrLfmsP65ifbRTeuS+eRmkVXhXVFkCsRL+9wklfLbT51KDH0jV4PEPTEsZnHq1HhUci6JastRmOO2iRIpm/u3m2lfjDdzXYcLQWdsF7Q8oC2H1ZBnz+UIo0HSt/KHlOMsttP9Xjke23ugRo/vBw+u7MRHZG7rV+r2OfrypcWFPIEq7OTzIYnMczbldFPB2wp1TL+mkxK1nd4kvevW6Ximj+ALpc7ZS2F2yz6erAUvL66PHXOXe0AZG98RqKmx26v5QW5ERg04yENt29AO0qtJBntpfQ61W2Ds+5Wfo/qa8RGR617beOVEpvsHXLitViUh8jIpm9SW+Z4q0jJmRGazB7aFSb/orqm7hSVov/PlsGZ0dUPJ5KitbjvtHpCNd7e4W3vzkPp8v/4++ocB1ZOnskXTxjWJt1ewGqsQriym9K6QdHzb1y9GMoPgkuhOdwbtZjBiSQ/1g2TUyKNrQ50Wlz9Pzavgq6eudNiIT4l+D4q8N+9OsNQOwqzdQxmdi6Ylq7620DaMdFC1laUIpCU5NPZ+3HmrvUpTcARRq09IW5Y8lj04a061baALI5CXni8+v49GTV/wtA/ZKj6IHf/x0J07HbRm1bu7c7thyvFlftvMHdsjhCCinUGqRU8PSZ/JFk1byxHQaldgHV2UTy4ObL3OGi+pD6oVADMmjV9PS782hchK5DRejwftBHJ2qEZQXFimqrK2SQQg1o5dxcYensUZ1G7A4BCQR0xOvncPFW0/9ZQOZt/0xV7qJSB+Gk0xtmF8wO111/OKdsdIghgRQqDWIHLjvWzBLGDUr0me/5vII368MiWnDWHJLL7aEClJudTLevngmdmtVFO28+AYmEioPXneOumn1vYn1N5uvvoQCUEhNGC15+gPRLjpSvl/UUEHv+rxcs4ryPriisnlctfI3cjb8HG5BWrcTKObnk0amDOb3Gt/awJfjUINbJKRCs3l2O9fvaXhToBocOHwk2oFkTs7D6kXFIjfO6n9DpEvwCxEaotgp0xX/dwJZjlT7VsrvQgglock4qXbtgPAalx3RJfr8BsYLauQobfe4vJTh41RKUDDtYgAakRpPV8+/CvSPTOOnreV1ofgNiY7oIpZ+frqPLvi6FyeK7dt0FOaSuwQBk1GvIkzOG0yWzRvJa922ILgjWJUBsXJZAvnnIhFd23eQaHT376kFrOQMNSKXk8eDE/vTtRZPZWVmXNMctW5cBuR98vqAUmw7fgsvXxZsuvK1AAmKGlJudgp1r87sggZ+7eX9HfPrLYvzpuFm65haIFihATFVyByVh59pf9VisbmuQe+antxVj87FK6UZqT1sgALFbHb/IScW2VTN7Ko70fI8BsUGWfFWCjYdNIJ19IdUPcXsKiAWo/PH98M7TU8CSwkC0gABigry4swwbD91Cvb37jrsngPQaFWbf3R+r5o5FbITX4WiPOAUMEHPW7x8103X7b5GK2o6PjTqTtruA2LHN/LzBWDRjKJ8Q5fcFOb/ABQwQm83monR3YT3deLCiW8lkdwCxJHDx/SPpfXem8zHh2m6F8s5IBRSQO5ksMjvomj1l+POprhX+uwpoWGYc/eOiSXRQWgzXnSTQHxUKOKDmSSk7S3/qyxLuo+OV0nVcf1pXAA3JjMOe135FdRolq1kEXHN6nCj6s2DWZ8Mhs7Bhfxl/y+Lk2D2unvogvUZF5+QNEX7/2F0h+V5bsDTIi8ONOqcw+8MrirNlTXCJHZ/YdqZBSoWCpsUb8cny6eKgtKjAxHA/3nJIALnlWLi1hHxfXI/CyvZPbTsClBJnJKP7J+J3v57AJUbrg2ZO7fEKKSD21fLD16zCGwfKlQeu1KPRIXgttjUgrVpJR/SNx2PTh4pTR2fwBm3zfxngx5sPVJeQAnILXWZx0U9PVtPtZ2twoqSBd7twT0Bp8RF0zpQBZPqdmfywzNiQao0n3F4BxARwCoT+eLMJX5ytpVt/MHOmBidnKD4FlYKjD0/JJvfn9uEnDk2hWpUiKMU5fzWs1wC5BaxuEuglkw0v7TbV1V06LaxfmBs7MC0aiVGh9TUdAet1QG7BKupdguB00tTYtpeY/H3bwej3vwZQMBYXiDH/ByXgwKF1P/vQAAAAAElFTkSuQmCC", "small_icon": "iVBORw0KGgoAAAANSUhEUgAAACQAAAAkCAYAAADhAJiYAAAAAXNSR0IArs4c6QAABcpJREFUWEfNl3lsVEUcx7/v7W7pbssW2tIUaGlpKUFCuESgyGUpoKJViSZGkCvREEz5AyJIC4QUsKVBFEGOeEQOEalWBCVCYyqHQa6GQwTaXWjZpa302Lbb3X17vBnz3rqPvXdfSQzzz25mfu/3+8x3fvObGYZSSvEENeZxgA42U9sxg0Xd2WpDS4MFBcMTuQ1TtbGPMz/ZQASgZXV2UvmAU3gCtzdb0aQzSxy5gzTk5Pw0RsWCkQsnC+iGmZLFV7pY/yD+QJ7x4/PSSf5gdYB9OMiogFwU5CO9nVYYH6ni7TQUkGAzb2QfftecFMQoICnaY6AWB3Wuu2VV1nS4GBIm9cMBCcGFdZs8SEPKZqXwY1NjVFEBTf+TA+VdAOFBwFBOSBZKo8qBSEDeAIJDtYqlCgYMWBZglbi/PJ3GKhkxlrhkG27bHD83O2LkJmCopJbrhzBsl714iPYJAmLM9uKc3lEB9VUxqJwQL05a103wzlWLJED15N4QcosQoK7FjlN6CzafbcfT/XvhxPw0nDfY8OrhRsn+n/ezwTIM+pXrfEQkjB9Qqc5h/cFo0wSTuiBVhfXDNOh0EqgYBlPPdUlml6cnBHyy44IJq6taYF07VBxTb6oVfyelx+K3hYPwS203Xj/yCFIYo6yyiSvK6i8pFA5o2wgNpiaroLfwyI5TYNzvnT5AQv/M4w/FwmgtzoHVSZFcrkP1wjRMTNcgsawONhfFotFa7H4pFWP31ONWq8NnIgFAW3ROS4XRGhdMIUGFNgfBJzobNg6Pw4obFpxpc4mmwpg3UNeaHBBK0adMh+IpiVg7LRkDtupg4ghOL0rH+DQ1UsrrYHb41hDKKg1cUVa6pNDH9aTrm3qzmOXebWAsg58malFWa8P3jQ4R4Hy7E4XXrRGBMhKUuF2YhfMGK/L2GWFbOxQWBxHV829UEVPLrckU11jc9qGW7NlEBbaPjMeeexyudLjw+Zh4dDkJ8v5wn1vhFBLGzUU5ULIMcj69i7rlWVh16iF2XOwIBPLPoXK9q/uIweLeSl7twjQtFO565dM8eeQPZCnOgd1FkbjFrcLxtwYiPytOzJuapZko+NaIKr1bXe9GWWUDV5SVISn0t5nnF1zpDjhrhIDC7prxnyJ5yUqUj4jD7nscvmywiwq1Owj23uzG29lqpGlVqDc58NRn9WK8zXlJWDEpCbsumrBsfF9px/kDVb45gH9hSLwYXzpcvXeP5wMh4NEmBzbdsYldGgVwZkoCjjU5UHLHJgJ5t2vNHCZ+cd+nT8gdoZ2pt2L2QWOAOkKHUJ+0vdx6SEDKFRd8jPvFKTEwIQZtVhcMHe5tyjLAyP7ucnW10YrRA9z/FRYTmmrvoNPqDAg4anCS2Ndu5mBofVRUvQ1bK5ZSlZBs3kAZJdfpA5MtqsPUP6rS3ILYtoags4/U2S8hjtZ9vUiKKylkthPa94NL/zvQ0Q2v0Omj0gKBhJlkllwjRhMn64YnfNdThZJ6q6l+/xIfEXxujDebbXTUluuyVeop0OGiOfT5ZzJDAwmzXXzoLjlwqUWWSj0BGpOdQqu3vhEw+YA7NU9BE1ZfYjgniZSP0rhcIKHWtlQso8ogVTfoJd9kddGU4hpQRHeFlQuk27eEJmvVQVMj5Ktj+9lWfmWlPqqXghygwtfG8RsXTAjpN+wz6MOqRqw/YYi4dNECzc8fjp3vPRfWX8R3WWnVA6w7EbzkezxHAzR3cg6+Wjkr4uQiAgkeSk42ouRXI0WInIoE9HLuEBxYNTsijM/REcm6Wt/Nz9x5M+jahwPav2oOX5CbGVUuygISjO0ugmGlfxFDu82nTgUDSu6jIVWlc9nBqYEPgXCTj2rJvB3whNLlP97H3nPN0rb1B5oxNoMcXvMi4znBI6nvPS4byPOxxSEcxpeFSz3jDWQ89C6NV6tkHz8evz0G8jjYdvohX/JdDSmckMBuXJgbda6EUu2xgeQsRzS2/wK4wFTCK/c6pAAAAABJRU5ErkJggg==", "visible": true, "tab_version": "4.1.1", "tab_build_no": "0", "build_no": 6}, "data_input_builder": {"datainputs": [{"index": "default", "sourcetype": "ms365:defender:advancedhunting:json", "interval": "300", "use_external_validation": true, "streaming_mode_xml": true, "name": "ms365_defender_advanced_hunting", "title": "MS365 Defender Advanced Hunting", "description": "Collect output of Kusto queries from MS365 Defender Advanced Hunting.", "type": "customized", "parameters": [{"name": "account", "label": "Account", "help_string": "", "required": true, "possible_values": [], "format_type": "global_account", "default_value": "", "placeholder": "", "type": "global_account", "value": "account0"}, {"name": "tenant_id", "label": "Tenant ID", "help_string": "", "required": true, "format_type": "text", "default_value": "", "placeholder": "", "type": "text", "value": "cb356782-ad9a-47fb-878b-7ebceb85b86c"}, {"name": "my_sourcetype", "label": "Sourcetype", "help_string": "", "required": true, "format_type": "text", "default_value": "ms365:defender:advancedhunting:json", "placeholder": "", "type": "text", "value": "ms365:defender:advancedhunting:json"}, {"name": "custom_query", "label": "Custom Query", "help_string": "Enter your query here. If you want to use a datetime checkpoint insert  '@@@' where it is needed. Example \"EmailEvents | where Timestamp > @@@\"", "required": true, "format_type": "text", "default_value": "", "placeholder": "EmailEvents |  ....", "type": "text", "value": "EmailEvents | where EmailDirection != \"Intra-org\" | where Timestamp > datetime(@@@) | sort by Timestamp asc | take 100"}, {"name": "checkpoint_column", "label": "Checkpoint column", "help_string": "Name of the column where to find the latest checkpoint", "required": false, "format_type": "text", "default_value": "Timestamp", "placeholder": "", "type": "text", "value": "Timestamp"}], "data_inputs_options": [{"type": "customized_var", "name": "account", "title": "Account", "description": "", "required_on_edit": false, "required_on_create": true, "possible_values": [], "format_type": "global_account", "default_value": "", "placeholder": ""}, {"type": "customized_var", "name": "tenant_id", "title": "Tenant ID", "description": "", "required_on_edit": false, "required_on_create": true, "format_type": "text", "default_value": "", "placeholder": ""}, {"type": "customized_var", "name": "my_sourcetype", "title": "Sourcetype", "description": "", "required_on_edit": false, "required_on_create": true, "format_type": "text", "default_value": "ms365:defender:advancedhunting:json", "placeholder": ""}, {"type": "customized_var", "name": "custom_query", "title": "Custom Query", "description": "Enter your query here. If you want to use a datetime checkpoint insert  '@@@' where it is needed. Example \"EmailEvents | where Timestamp > @@@\"", "required_on_edit": false, "required_on_create": true, "format_type": "text", "default_value": "", "placeholder": "EmailEvents |  ...."}, {"type": "customized_var", "name": "checkpoint_column", "title": "Checkpoint column", "description": "Name of the column where to find the latest checkpoint", "required_on_edit": false, "required_on_create": false, "format_type": "text", "default_value": "Timestamp", "placeholder": ""}], "code": "\n# encoding = utf-8\n\nimport os\nimport sys\nimport time\nfrom datetime import datetime, timezone, timedelta\nfrom dateutil import parser\nimport json\nimport urllib.request\nimport urllib.parse\nimport requests\n\n'''\nboilerplate code is from https://docs.microsoft.com/en-us/microsoft-365/security/defender-endpoint/run-advanced-query-sample-python?view=o365-worldwide\n'''\n\n\ndef validate_input(helper, definition):\n    pass\n    \ndef collect_events(helper, ew):\n  \n    # Get bearer token\n    account = helper.get_arg('account')\n    tenantId = helper.get_arg('tenant_id')\n    clientId = account['username']\n    appSecret = account['password']\n    proxy_settings = helper.get_proxy()\n    if proxy_settings:\n        use_proxy = True\n    else:\n        use_proxy = False\n\n    url = \"https://login.windows.net/%s/oauth2/token\" % (tenantId)\n    method = \"POST\"\n    body = {\n        'grant_type' : 'client_credentials',\n        'resource' : 'https://api.security.microsoft.com',\n        'client_id' : clientId,\n        'client_secret' : appSecret\n        \n    }\n    # data = urllib.parse.urlencode(body).encode(\"utf-8\")\n    \n    try:\n        helper.log_info(\"Getting AAD token\")\n        response = requests.request(method, url, data=body)\n        jsonResponse = response.json()\n        aadToken = jsonResponse[\"access_token\"]\n        \n    except Exception as e:\n        helper.log_error(\"Failed getting AAD token.\")\n        helper.log_error(\"Error was: %s\" % e)\n        exit()\n    \n    \n\n    # Handle query and checkpoint\n    query = helper.get_arg('custom_query')\n    # query = \"EmailEvents | where EmailDirection != \"Intra-org\" | where Timestamp > ago(7m) and Timestamp < ago(5m) | sort by Timestamp asc | take 10000\"\n    \n    # Check query has a checkpoint\n    if \"@@@\" in query:\n        has_checkpoint = True\n    else:\n        has_checkpoint = False\n    \n    # if it has checkpoint.\n    #   get latest checkpoint or create a new\n    if has_checkpoint:\n        checkpoint_name = helper.get_app_name() + \":\"+ helper.get_input_type() + \":\" + helper.get_input_stanza_names()\n        checkpoint_column = helper.get_arg('checkpoint_column')\n\n        # get the current value of the checkpoint\n        query_from = helper.get_check_point(checkpoint_name)\n\n        # If no current checkpoint, check for initial from config\n        if isinstance(query_from,str) == False:\n            query_from = (datetime.utcnow() - timedelta(days=1)).isoformat()\n            \n            # at the end, save the checkpoint with updated value\n            helper.save_check_point(checkpoint_name, query_from)\n            query_from = helper.get_check_point(checkpoint_name)\n        \n        tmp_ts = parser.isoparse(query_from)\n        \n        # Update query\n        query = query.replace(\"@@@\", query_from)\n        helper.log_debug(\"Query has been updated with checkpoint. Query: %s\" % query)\n\n        \n    # Run query\n    try:   \n        helper.log_debug(\"Will attempt to run query: %s\" % query)\n        \n        url = \"https://api.security.microsoft.com/api/advancedhunting/run\"\n        method = \"POST\"\n        headers = { \n            'Content' : 'application/json',\n            'Authorization' : \"Bearer \" + aadToken\n        }\n        data = {\n            'Query' : query\n        }\n        # helper.log_debug(\"Payload being sent: %s\" % json.dumps(data))\n        response = requests.request(method, url, headers=headers, json=data)\n    except Exception as e:\n        helper.log_error(\"Exception: \" + str(e))\n        \n    # Handle response\n    if response.status_code == 200:\n        try:\n            jsonResponse = response.json()\n            stats = jsonResponse[\"Stats\"]\n            schema = jsonResponse[\"Schema\"]\n            results = jsonResponse[\"Results\"]\n            helper.log_info(\"Query: \\\"%s\\\" took %s to complete.\" % (query, str(stats[\"ExecutionTime\"])))\n            helper.log_info(\"Resource Usage: %s\" % (str(stats[\"resource_usage\"])))\n        except JSONDecodeError:\n            helper.log_error(\"Couldn't decode response as JSON. Response was: \" + response.text)\n        except Exception as e:\n            helper.log_error(\"Exception occured when parsing response: %s\" % response.text)\n    else:\n        helper.log_error(\"Response: %s\" % response.text)\n        exit()\n\n    # Send to splunk\n    try:\n        st = helper.get_arg(\"my_sourcetype\")\n        \n        if len(results) > 0:\n            for result in results:\n                # helper.log_debug(\"Result: \" + str(result))\n\n                event = helper.new_event(source=helper.get_input_type(), index=helper.get_output_index(), sourcetype=st, data=json.dumps(result))\n                ew.write_event(event)\n                \n                # Update checkpoint\n                if has_checkpoint:\n                    try:\n                        helper.log_debug(\"result timestamp: %s\" % str(parser.isoparse(result[checkpoint_column])))\n                        helper.log_debug(\"tmp_ts timestamp: %s\" % str(tmp_ts))\n                        if parser.isoparse(result[checkpoint_column]).replace(tzinfo=timezone.utc) > tmp_ts.replace(tzinfo=timezone.utc):\n                            tmp_ts = parser.isoparse(result[checkpoint_column])\n                            new_checkpoint = tmp_ts.isoformat()\n                            \n                    except Exception as e:\n                        helper.log_debug(\"something failed when checking the timestamps: %s\" % str(e))\n            \n            # save checkpoint\n            if has_checkpoint:\n                helper.log_debug(\"Updating checkpoint to %s.\" % str(new_checkpoint))\n                helper.save_check_point(checkpoint_name, new_checkpoint)\n                \n        else:\n            helper.log_info(\"No results returned for the query: \\\"%s\\\"\" % query) \n      \n    except Exception as e:\n        helper.log_error(\"There was an error iterating the results. Enable debug to see the results.\")\n        helper.log_debug(\"Failed to iterate the returned results:\\n%s\" % str(results))\n        \n    \n    \n", "customized_options": [{"name": "account", "value": "account0"}, {"name": "tenant_id", "value": "cb356782-ad9a-47fb-878b-7ebceb85b86c"}, {"name": "my_sourcetype", "value": "ms365:defender:advancedhunting:json"}, {"name": "custom_query", "value": "EmailEvents | where EmailDirection != \"Intra-org\" | where Timestamp > datetime(@@@) | sort by Timestamp asc | take 100"}, {"name": "checkpoint_column", "value": "Timestamp"}], "uuid": "6a772261f36b45b8857fd7a49be433c4", "sample_count": "1454440"}]}, "field_extraction_builder": {"ms365:defender:advancedhunting:json": {"data_format": "json"}}, "global_settings_builder": {"global_settings": {"log_settings": {"log_level": "DEBUG"}, "credential_settings": []}}, "sourcetype_builder": {"ms365:defender:advancedhunting:json": {"metadata": {"event_count": 0, "data_input_name": "ms365_defender_advanced_hunting", "extractions_count": 0, "cims_count": 0}}}, "validation": {"validators": ["best_practice_validation", "data_model_mapping_validation", "field_extract_validation", "app_cert_validation"], "status": "job_started", "validation_id": "v_1658190973_13", "progress": 0.5714285714285714}}