[source::...ta-ms-defender*.log*]
sourcetype = ta:ms:defender:log

[source::...ta_ms_defender*.log*]
sourcetype = ta:ms:defender:log

[ms:defender:atp:alerts]
EVAL-app = "ms:defender"
EVAL-type = "alert"
FIELDALIAS-aob_gen_ms_defender_atp_alerts_alias_1 = description AS body
FIELDALIAS-aob_gen_ms_defender_atp_alerts_alias_2 = title AS subject
FIELDALIAS-aob_gen_ms_defender_atp_alerts_alias_3 = computerDnsName AS src
SHOULD_LINEMERGE = 0
category = Splunk App Add-on Builder
pulldown_type = 1
TIME_PREFIX = \"alertCreationTime"\:\s*\"
MAX_TIMESTAMP_LOOKAHEAD = 30
KV_MODE = json

[m365:defender:incident]
EVAL-app = "ms:defender"
FIELDALIAS-aob_gen_m365_defender_incident_alias_1 = alerts{}.alertId AS id
FIELDALIAS-aob_gen_m365_defender_incident_alias_2 = alerts{}.category AS type
FIELDALIAS-aob_gen_m365_defender_incident_alias_3 = alerts{}.description AS body
KV_MODE = json
MAX_TIMESTAMP_LOOKAHEAD = 30
SHOULD_LINEMERGE = 0
TIME_PREFIX = \"lastUpdateTime"\:\s*\"
TRUNCATE = 0
category = Splunk App Add-on Builder
pulldown_type = 1

[source::...defender_advanced_hunting_modalert.log*]
sourcetype = tamsdefender:log

[source::...defender_update_incident_modalert.log*]
sourcetype = tamsdefender:log

[m365:defender:incident:advanced_hunting]
# Credit Mikael Bjerkeland - https://github.com/splunk/TA-microsoft-365-defender-advanced-hunting-add-on
KV_MODE = json
TIME_PREFIX = Timestamp
# Common fields for all datasets
FIELDALIAS-ms_defender_advancedhunting_cim_endpoint_common_dest = DeviceName AS dest
EVAL-action = case('$table'=="DeviceProcessEvents","allowed", '$table'=="DeviceFileEvents" AND 'ActionType' == "FileCreated", "created", '$table'=="DeviceFileEvents" AND 'ActionType' == "FileModified", "modified", '$table'=="DeviceFileEvents" AND 'ActionType' == "FileDeleted", "deleted", '$table'=="DeviceFileEvents" AND 'ActionType' == "FileRenamed", "renamed", '$table'=="DeviceRegistryEvents" AND in('ActionType',"RegistryValueDeleted","RegistryKeyDeleted"), "deleted", '$table'=="DeviceRegistryEvents" AND in('ActionType',"RegistryValueSet","RegistryKeyCreated"), "created", 1==1, "unknown")
EVAL-user = case('$table'=="DeviceProcessEvents", 'AccountName', '$table'=="DeviceImageLoadEvents", 'InitiatingProcessAccountName', '$table'=="DeviceNetworkEvents", 'InitiatingProcessAccountName', '$table'=="DeviceFileEvents", 'InitiatingProcessAccountName', '$table'=="DeviceRegistryEvents", 'InitiatingProcessAccountName')
EVAL-vendor_product = "Microsoft Defender for Endpoint"
# Ports node
FIELDALIAS-ms_defender_advancedhunting_cim_endpoint_ports_dest_ip = LocalIP AS dest_ip
FIELDALIAS-ms_defender_advancedhunting_cim_endpoint_ports_dest_port = LocalPort as dest_port
FIELDALIAS-ms_defender_advancedhunting_cim_endpoint_ports_src = RemoteIP AS src
FIELDALIAS-ms_defender_advancedhunting_cim_endpoint_ports_src_port = RemotePort as src_port
EVAL-creation_time = case('$table'=="DeviceNetworkEvents",'Timestamp')
EVAL-state = case('$table'=="DeviceNetworkEvents","listening")
EVAL-transport = lower('Protocol')
# Filesystem node
EVAL-file_access_time = case('$table'=="DeviceFileEvents",'Timestamp')
EVAL-file_acl = case('$table'=="DeviceFileEvents",'InitiatingProcessTokenElevation')
EVAL-file_create_time = case('$table'=="DeviceFileEvents" AND 'ActionType' == "FileCreated",'Timestamp')
EVAL-file_hash = case('MD5' != "null", 'MD5', 'SHA1' != "null", 'SHA1', 'SHA256' != "null", 'SHA256')
EVAL-file_modify_time = case('$table'=="DeviceFileEvents" AND 'ActionType' == "FileModified",'Timestamp')
EVAL-file_name = case('$table'=="DeviceFileEvents",'FileName')
EVAL-file_path = case('$table'=="DeviceFileEvents",'FolderPath')
EVAL-file_size = case('$table'=="DeviceFileEvents" AND 'FileSize' != "null",'FileSize')
# Registry node
# REPORT-0defender-registry-path = defender-registry-path
FIELDALIAS-ms_defender_advancedhunting_cim_endpoint_registry = RegistryValueType as registry_value_type
EVAL-registry_hive = case('$table'=="DeviceRegistryEvents", if(isnull('RegistryKey') OR 'RegistryKey'="", replace('PreviousRegistryKey',"(HKEY[_\w]+(\\\\(SAM|SECURITY|SOFTWARE|SYSTEM|\.DEFAULT))?).*","\1"), replace('RegistryKey',"(HKEY[_\w]+(\\\\(SAM|SECURITY|SOFTWARE|SYSTEM|\.DEFAULT))?).*","\1")))
EVAL-registry_key_name = case('$table'=="DeviceRegistryEvents", replace('RegistryKey',".+\\\\",""))
EVAL-registry_path = case('$table'=="DeviceRegistryEvents", if(isnull('RegistryKey') OR 'RegistryKey'="", 'PreviousRegistryKey', 'RegistryKey'))
EVAL-registry_value_name = case('$table'=="DeviceRegistryEvents", 'RegistryValueName')
EVAL-registry_value_type = case('$table'=="DeviceRegistryEvents", 'RegistryValueType')
# Processes node
REPORT-0defender-process-parent_process_name_args = defender-process-parent_process_name_args
REPORT-0defender-process-parent_process_path_no_filename = defender-process-parent_process_path_no_filename
REPORT-0defender-process-process_name_args = defender-process-process_name_args
REPORT-0defender-process-process_path_no_filename = defender-process-process_path_no_filename
FIELDALIAS-ms_defender_advancedhunting_cim_endpoint_processes_cmdline = ProcessCommandLine AS cmdline
FIELDALIAS-ms_defender_advancedhunting_cim_endpoint_processes_parent_process_id = InitiatingProcessId AS parent_process_id
FIELDALIAS-ms_defender_advancedhunting_cim_endpoint_processes_parent_process_name = InitiatingProcessFileName AS parent_process_name
FIELDALIAS-ms_defender_advancedhunting_cim_endpoint_processes_parent_process_path = InitiatingProcessFolderPath AS parent_process_path
FIELDALIAS-ms_defender_advancedhunting_cim_endpoint_processes_process_id = ProcessId as process_id
FIELDALIAS-ms_defender_advancedhunting_cim_endpoint_processes_process_integrity_level = ProcessIntegrityLevel AS process_integrity_level
FIELDALIAS-ms_defender_advancedhunting_cim_endpoint_processes_process_name = FileName AS process_name
FIELDALIAS-ms_defender_advancedhunting_cim_endpoint_processes_process_path = FolderPath AS process_path
FIELDALIAS-ms_defender_advancedhunting_cim_endpoint_processes_user_id = AccountUpn AS user_id
EVAL-process_hash = "MD5=" . 'MD5' . ",SHA1=" . 'SHA1' . ",SHA256=" . 'SHA256'
EVAL-parent_process_hash = "MD5=" . 'InitiatingProcessMD5' . ",SHA1=" . 'InitiatingProcessSHA1' . ",SHA256=" . 'InitiatingProcessSHA256'
# Not 100% sure about these two
EVAL-process_guid = case('AccountObjectId' == "null", null(), isnotnull('AccountObjectId'), "{" . upper('AccountObjectId') . "}")
EVAL-parent_process_guid = case('InitiatingProcessAccountObjectId' == "null", null(), isnotnull('InitiatingProcessAccountObjectId'), "{" . upper('InitiatingProcessAccountObjectId') . "}")
# I am making a lot of assumptions here
EVAL-process = coalesce(process_path_no_filename, "") .  "\\" . coalesce(trim(process_name_extracted, "\""), process_name, "") . case('FileName' == trim(process_args2, "\""), "", isnotnull(process_args2), " " . process_args2, isnotnull(process_args), " " . process_args, 1==1, "")
#EVAL-process = coalesce(process_path_no_filename, "") .  "\\" . coalesce(trim(process_name_extracted, "\""), "") . if(isnotnull(process_args), " " . process_args, "")
EVAL-parent_process = coalesce(parent_process_path_no_filename, "") .  "\\" . coalesce(trim(parent_process_name_extracted, "\""), parent_process_name, "") . case('InitiatingProcessFileName' == trim(parent_process_args2, "\""), "", isnotnull(parent_process_args2), " " . parent_process_args2, isnotnull(parent_process_args), " " . parent_process_args, 1==1, "")
#EVAL-parent_process = coalesce(parent_process_path_no_filename, "") .  "\\" . coalesce(trim(parent_process_name_extracted, "\""), "") . if(isnotnull(parent_process_args), " " . parent_process_args, "")
EVAL-parent_process_exec = replace('InitiatingProcessFolderPath',"(.*\\\)(?=.*(\.\w*)$|(\w+)$)","")
EVAL-process_exec = replace('FolderPath',"(.*\\\)(?=.*(\.\w*)$|(\w+)$)","")

