
[reset_lookup(1)]
args = type
definition = makeresults\
| table $type$,token,description,firstSeen,lastOnline,firstEnrichedOn,createdOn,riskLevel,blah lookup_time_logic\
| outputlookup $type$_threat_list
iseval = 0

[tego_threat_char_limit]
definition = 500
iseval = 0

[tego_summary_hits]
definition = `tego_index` sourcetype=stash_hec version::`tego_summary_version` type::* search_name::Tego*Hits*
iseval = 0

[tego_summary_version]
definition = 1.3
iseval = 0

[tego_hits_summary_backfill_earliest_latest]
definition = inputlookup tego_summary_backfill_current_run.csv\
| lookup tego_summary_backfill_current_state.csv run_start_time\
| eval last_run_time=now()\
| eval latest_lookup=coalesce(earliest_lookup,run_start_time)\
| eval earliest_lookup=latest_lookup-(starting_span_hours*60*60)\
| foreach latest_lookup earliest_lookup [ eval <<FIELD>>=if('<<FIELD>>'<=backfill_to,backfill_to,'<<FIELD>>') ]\
| foreach *_time *_lookup backfill_to [ eval <<FIELD>>_readable=strftime('<<FIELD>>',"%Y-%m-%d %H:%M:%S") ]\
```| eval search_type="presearch", name=$name$\
| addinfo```\
| eval _time=now()\
| rename backfill_number_of_days AS backfill_number_of_days_runtime starting_span_hours AS starting_span_hours_runtime\
| fields - backfill_number_of_days_runtime backfill_to starting_span_hours_runtime _time info_* search_type earliest latest\
| outputlookup tego_summary_backfill_current_state.csv
iseval = 0

[tego_summary_backfill_restart(2)]
args = backfill_number_of_days,starting_span_hours
definition = eval run_start_time=now() \
| eval backfill_number_of_days=$backfill_number_of_days$ \
| eval backfill_to=run_start_time-(backfill_number_of_days*(60*60*24)) \
| eval starting_span_hours=$starting_span_hours$ \
| table run_start_time backfill_number_of_days backfill_to starting_span_hours\
| outputlookup tego_summary_backfill_current_run.csv
iseval = 0

[tego_backfill_span_hours]
definition = 24
iseval = 0


[tego_get_threat_list_stats]
definition = rest splunk_server=local /services/server/introspection/kvstore/collectionstats \
| mvexpand data \
| spath input=data \
| search ns=tegoguardian* \
| rex field=ns "(?<App>.*)\.(?<Collection>.*)" \
| rex field=Collection "(?<type>\w+)_threat_list"\
| search Collection=*_threat_list\
| eval dbsize=round(size/1024/1024, 2) \
| eval indexsize=round(totalIndexSize/1024/1024, 2) \
| table type count dbsize indexsize App, Collection
iseval = 0

[tego_summary_spl_meta(3)]
args = testmode, search_name,marker
definition = fields _time domain dest dest_name url_domain url ip dest_ip hash file_hash _raw host source sourcetype index raw_time_hash\
| eval tego_summary_hit=if(`tego_index` AND sourcetype="stash_hec",1,0)\
| foreach domain,dest,dest_name,url_domain,dest_ip,hash,file_hash \
    [ eval <<FIELD>>=if('<<FIELD>>'="" OR '<<FIELD>>'="null" OR '<<FIELD>>'="-", null(), <<FIELD>> ) ] \
| eval domain_lookup_field=if(tego_summary_hit=0,mvappend(domain,dest,dest_name,url_domain), null())\
| eval url_lookup_field=if(tego_summary_hit=0,mvappend(url,dest,dest_name,url_domain), null())\
| eval ip_lookup_field=if(tego_summary_hit=0,mvappend(ip,dest,dest_ip), null())\
| eval hash_lookup_field=if(tego_summary_hit=0,mvappend(hash,file_hash), null())\
| eval @lookup_field=mvdedup(if(tego_summary_hit=0,mvappend(domain,dest,dest_name,url_domain,url,ip,dest_ip,hash,file_hash), null()))\
| fields _time *lookup_field domain dest dest_name url_domain url ip dest_ip hash file_hash host source sourcetype index _raw tego_summary_hit raw_time_hash\
| foreach *lookup_field \
    [ eval <<FIELD>>=if(tego_summary_hit=0,if(len('<<FIELD>>')>500,substr('<<FIELD>>',1,500),'<<FIELD>>'),null()) ] \
| lookup ip_threat_list ip AS ip_lookup_field OUTPUTNEW ip as threat_ip, _key AS token, _key AS token_ip, description, riskLevel \
| lookup url_threat_list url AS url_lookup_field OUTPUTNEW url as threat_url, _key AS token, _key AS token_url, description, riskLevel \
| lookup domain_threat_list domain AS domain_lookup_field OUTPUTNEW domain as threat_domain, _key AS token, _key AS token_domain, description, riskLevel \
| lookup hash_threat_list hash AS hash_lookup_field OUTPUTNEW hash as threat_hash, _key AS token, _key AS token_hash,description, riskLevel \
| foreach threat_* \
    [ eval counter_<<FIELD>>=if(tego_summary_hit=0,if(isnotnull('<<FIELD>>'),1,0),null()) ] \
| fillnull value=0 counter_threat_hash counter_threat_ip counter_threat_domain counter_threat_url\
| eval type_hits=counter_threat_hash+counter_threat_ip+counter_threat_domain+counter_threat_url\
| eval token=mvappend(token_ip,token_url,token_domain,token_hash)\
| eval type=mvappend(if(counter_threat_ip=1,"ip",null()),if(counter_threat_url=1,"url",null()),if(counter_threat_domain=1,"domain",null()),if(counter_threat_hash=1,"hash",null())) \
| search ( type=* riskLevel=* ) OR tego_summary_hit=1\
| eval raw_time_hash=if(isnull(raw_time_hash),sha256(_time." ".host." "._raw),raw_time_hash)\
| fields _time type type_hits token* *lookup_field threat_* riskLevel host source sourcetype index raw_time_hash _raw tego_summary_hit\
| stats count AS raw_time_hash_count values(_time) AS _time values(*) AS * values(_raw) AS _raw max(tego_summary_hit) AS tego_summary_hit by raw_time_hash\
| fields _time tego_summary_hit type type_hits raw_time_hash_count token* *lookup_field threat_* riskLevel host source sourcetype index raw_time_hash _raw\
| search tego_summary_hit=0\
| eval time=strftime(_time,"%F %T %Z"), _raw=time.","._raw\
| fields - token_* tego_summary_hit time\
| eval summary_type="threat_hit", version=`tego_summary_version`, orig_sourcetype=sourcetype, orig_host=host, orig_index=index, orig_source=source, sourcetype=stash_hec, search_name="$search_name$", metafield="$marker$"\
| collect testmode=$testmode$ `tego_index` output_format="hec"
iseval = 0

[tego_index]
definition = index="tegoguardian" ```it is critical that quotes are used around index value in tego_index macro e.g. index="xyz"```
iseval = 0

[tego_reset_max_backfill_days]
definition = 30
iseval = 0

[tego_threat_list]
definition = `tego_index` sourcetype=tegoguardian
iseval = 0

[tego_append_lookup(2)]
args = type,eventlimit
definition = `tego_index` type=$type$ sourcetype=tegoguardian\
| lookup $type$_threat_list $type$ output _time AS lookup_time \
| eval lookup_time_logic=if(isnull(lookup_time) OR _time>lookup_time,1,0) ```checking if this is a newer record for this value of this type```\
| search lookup_time_logic=1 ```filter only for those not in lookup```\
| head $eventlimit$\
| fields $type$,token,description,firstSeen,lastOnline,firstEnrichedOn,createdOn,riskLevel,_time lookup_time_logic\
| stats latest(_time) AS _time latest(*) AS * by $type$\
| fields - lookup_time_logic\
| eval $type$_full=if(len($type$)>`tego_threat_char_limit`,'$type$',null())\
| eval $type$=if(len($type$)>`tego_threat_char_limit`,substr('$type$',1,`tego_threat_char_limit`),'$type$')\
| fields $type$*,token,description,firstSeen,lastOnline,firstEnrichedOn,createdOn,riskLevel,_time \
| table $type$*,token,description,firstSeen,lastOnline,firstEnrichedOn,createdOn,riskLevel,_time\
| outputlookup append=t key_field=token $type$_threat_list \
| stats earliest(_time) AS earliest latest(_time) AS latest count as eventcount\
| eval type="$type$"\
| foreach earliest latest  [ eval <<FIELD>>_readable=strftime('<<FIELD>>',"%Y-%m-%d %H:%M:%S") ]\
| `tego_lookback_collect`
iseval = 0

[tego_lookback_collect]
definition = eval _time=now()\
| collect `tego_index` marker="version=1.0"
iseval = 0

[tego_hits_lookback_lag_overlap(1)]
args = maxlookback
definition = [ | tstats latest(_time) AS earliest where `tego_summary_hits` \
    | eval earliest=earliest-`tego_raw_event_lag` \
    | append \
        [| makeresults \
        | eval earliest=now()-$maxlookback$ \
        | fields earliest] \
    | stats first(earliest) AS earliest ]
iseval = 0

[tego_raw_event_lag]
definition = 60
iseval = 0

[tego_find_raw_indexing_lag]
definition = [ `tego_index_list` ] earliest=-90m\
| eval indexing_lag=floor(_indextime - _time) | stats perc98(indexing_lag) AS "Recommended Monitoring Lag" max(indexing_lag) AS "Maximum Indexing Lag" avg(indexing_lag) AS "Average Indexing Lag" min(indexing_lag) AS "Minimum Indexing Lag"
iseval = 0

[tego_index_list]
definition = [| rest server=local servicesNS/nobody/tegoguardian/configs/conf-app/install \
    | fields indexestomonitor \
    | eval index=split(indexestomonitor, ",") \
    | mvexpand index \
    | search index!="" \
    | dedup index \
    | sort +index \
    | table index]
iseval = 0