# names of all collected firewall fields, used to avoid repetition  
[firewall_fields]
definition = slot, net_src_ip, net_src_ip_rdomain, net_src_user, net_dst_ip, net_dst_domain, \
  net_dst_port, net_dst_url, net_l4proto, net_app, net_blocked, net_device_ip, net_device_id, \
  net_device_types, net_device_vendor

# this will get CIM firewall events and normalize them to the unaggregated format Magnet expects
[firewall_normalize]
definition = \
  eval slot=`strftime_utc(_time, "%Y%m%d%H")` \
  | eval agg_first=`strftime_utc(_time, "%H:%M:%S")` \
  | eval agg_last=agg_first \
  | eval agg_length=len(_raw) \
  | fields - _* \
  | eval net_src_ip=case(isnotnull(src_ip), src_ip, NOT isnull(src) AND cidrmatch("0.0.0.0/0", src), src, \
    NOT isnull(srcip) AND cidrmatch("0.0.0.0/0", srcip), srcip, 1==1, "NA") \
  | eval net_src_ip_rdomain=case(isnotnull(src_nt_host), src_nt_host, isnotnull(src_host), src_host, \
    NOT isnull(src) AND NOT cidrmatch("0.0.0.0/0", src), src, 1==1, "NA") \
  | eval net_src_user = coalesce(user, "NA") \
  | eval net_dst_ip=case(isnotnull(dest_ip), dest_ip, NOT isnull(dest) AND cidrmatch("0.0.0.0/0", dest), dest, \
    NOT isnull(destip) AND cidrmatch("0.0.0.0/0", destip), destip, \
    NOT isnull(dstip) AND cidrmatch("0.0.0.0/0", dstip), dstip, 1==1, "NA") \
  | eval net_dst_domain=case(isnotnull(dest_host), dest_host, NOT isnull(dest) AND NOT cidrmatch("0.0.0.0/0", dest), dest, \
    isnotnull(dest_domain), dest_domain, 1==1, "NA") \
  | eval net_dst_port=coalesce(dest_port, dstport, "NA") \
  | eval net_dst_url=coalesce(url, "NA") \
  | eval net_l4proto=case(isnotnull(transport) AND transport != "unknown", upper(transport), isnotnull(proto), upper(proto), \
    isnotnull(protocol), upper(protocol), 1==1, "NA") \
  | eval net_app = coalesce(app, "NA") \
  | eval net_blocked=case(isnull(action), "NA", match(action, "(?i)block|drop|den(y|ied)|reset"), "TRUE", 1==1, "FALSE") \
  | eval net_device_ip=case(isnotnull(dvc_ip), dvc_ip, NOT isnull(dvc) AND cidrmatch("0.0.0.0/0", dvc), dvc, 1==1, "NA") \
  | eval net_device_id=coalesce(dvc, dvc_ip, "NA") \
  | eval net_device_types="firewall" \
  | eval net_device_vendor=coalesce(vendor_product, vendor, "NA") \
  | fields agg_first, agg_last, agg_length, `firewall_fields` \
  | script niddelparseurl

[firewall_pre_filter]
definition = where tag == "network" AND tag == "communicate" \
  AND NOT searchmatch("TCP packet out of state")

# this will get normalized firewall events and aggregate them appropriately
[firewall_aggregate]
definition = \
  eval agg_count=max(1, coalesce(agg_count, 1)) \
  | stats sum(agg_count) as agg_count, min(agg_first) as agg_first, max(agg_last) as agg_last, \
    sum(agg_length) as agg_length by `firewall_fields`

# names of all collected proxy fields, used to avoid repetition
[proxy_fields]
definition = slot, net_src_ip, net_src_ip_rdomain, net_src_user, net_dst_ip, net_dst_domain, \
  net_dst_port, net_dst_url, net_l4proto, net_l7proto_request, net_l7proto_outcome, \
  net_l7proto_referrer, net_l7proto_user_agent, net_l7proto_content_type, net_blocked, \
  net_device_ip, net_device_id, net_device_types, net_device_vendor

# this will get CIM web proxy events and normalize them to the unaggregated format Magnet expects
[proxy_normalize]
definition = \
  eval slot=`strftime_utc(_time, "%Y%m%d%H")` \
  | eval agg_first=`strftime_utc(_time, "%H:%M:%S")` \
  | eval agg_last=agg_first \
  | eval agg_length=len(_raw) \
  | fields - _* \
  | eval net_src_ip=case(isnotnull(src_ip), src_ip, NOT isnull(src) AND cidrmatch("0.0.0.0/0", src), src, \
    NOT isnull(srcip) AND cidrmatch("0.0.0.0/0", srcip), srcip, 1==1, "NA") \
  | eval net_src_ip_rdomain=case(isnotnull(src_nt_host), src_nt_host, isnotnull(src_host), src_host, \
    NOT isnull(src) AND NOT cidrmatch("0.0.0.0/0", src), src, 1==1, "NA") \
  | eval net_src_user = coalesce(user, "NA") \
  | eval net_dst_ip=case(isnotnull(dest_ip), dest_ip, NOT isnull(dest) AND cidrmatch("0.0.0.0/0", dest), dest, \
    NOT isnull(destip) AND cidrmatch("0.0.0.0/0", destip), destip, \
    NOT isnull(dstip) AND cidrmatch("0.0.0.0/0", dstip), dstip, 1==1, "NA") \
  | eval net_dst_domain=case(isnotnull(dest_host), dest_host, NOT isnull(dest) AND NOT cidrmatch("0.0.0.0/0", dest), dest, \
    isnotnull(dest_domain), dest_domain, 1==1, "NA") \
  | eval net_dst_port=coalesce(dest_port, dstport, "NA") \
  | eval net_dst_url=coalesce(url, "NA") \
  | eval net_l4proto=case(isnotnull(transport) AND transport != "unknown", upper(transport), isnotnull(proto), upper(proto), \
    isnotnull(protocol), upper(protocol), 1==1, "NA") \
  | eval net_l7proto_request=coalesce(upper(http_method), "NA") \
  | eval net_l7proto_outcome=if(match(status, "^\\d{3}$"), status, "NA") \
  | eval net_l7proto_referrer=coalesce(http_referrer, http_referer, referrer, referer, "NA") \
  | eval net_l7proto_user_agent=coalesce(http_user_agent, user_agent, "NA") \
  | eval net_l7proto_content_type=coalesce(http_content_type, content_type, "NA") \
  | eval net_blocked=case(NOT isnull(sc_filter_result) AND match(sc_filter_result, "(?i)denied"), "TRUE", \
    NOT isnull(sc_filter_result) AND match(sc_filter_result, "(?i)observed|proxied"), "FALSE", \
    isnull(action), "NA", match(action, "(?i)block|drop|den(y|ied)|reset"), "TRUE", 1==1, "FALSE") \
  | eval net_device_ip=case(isnotnull(dvc_ip), dvc_ip, NOT isnull(dvc) AND cidrmatch("0.0.0.0/0", dvc), dvc, 1==1, "NA") \
  | eval net_device_id=coalesce(dvc, dvc_ip, "NA") \
  | eval net_device_types="web-proxy" \
  | eval net_device_vendor=coalesce(vendor_product, vendor, "NA") \
  | fields agg_first, agg_last, agg_length, `proxy_fields` \
  | script niddelparseurl

[proxy_pre_filter]
definition = where (tag == "web" AND tag == "proxy") \
  OR (sourcetype == "pan:threat" AND log_subtype == "url")

# this will get normalized proxy events and aggregate them appropriately
[proxy_aggregate]
definition = \
  eval agg_count=max(1, coalesce(agg_count, 1)) \
  | stats sum(agg_count) as agg_count, min(agg_first) as agg_first, max(agg_last) as agg_last, \
    sum(agg_length) as agg_length by `proxy_fields`

# names of all collected DNS fields, used to avoid repetition
[dns_fields]
definition = slot, net_src_ip, net_src_ip_rdomain, net_src_user, net_dst_ip, \
  net_dst_domain, dns_flags, dns_protocol, dns_rcode, \
  dns_type_name, dns_rdata, net_app, \
  net_blocked, net_device_ip, net_device_id, net_device_types, net_device_vendor

# this will get CIM DNS events and normalize them to the unaggregated format Magnet expects
[dns_normalize]
definition = \
  eval slot=`strftime_utc(_time, "%Y%m%d%H")` \
  | eval agg_first=`strftime_utc(_time, "%H:%M:%S")` \
  | eval agg_last=agg_first \
  | eval agg_length=len(_raw) \
  | fields - _* \
  | eval net_src_ip=case(isnotnull(dns_response_client_ip), dns_response_client_ip, \
    NOT isnull(src) AND cidrmatch("0.0.0.0/0", src), src, \
    NOT isnull(src_resp) AND cidrmatch("0.0.0.0/0", src_resp), src_resp, 1==1, "NA") \
  | eval net_src_ip_rdomain=case(isnotnull(src_nt_host), src_nt_host, isnotnull(src_host), src_host, \
    NOT isnull(src) AND NOT cidrmatch("0.0.0.0/0", src), src, 1==1, "NA") \
  | eval net_src_user = coalesce(user, "NA") \
  | mvexpand dns_rdata \
  | rex field=dns_rdata "(?<net_dst_ip>[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3})$" \
  | where net_dst_ip != "" \
  | eval net_dst_ip=case(isnotnull(net_dst_ip) AND cidrmatch("0.0.0.0/0", net_dst_ip), net_dst_ip, 1==1, "NA") \
  | eval net_dst_domain=case(isnotnull(dns_response_queried_domain), dns_response_queried_domain, \
    isnotnull(query), query, 1==1, "NA") \
  | eval dns_flags=coalesce(dns_response_flags, "NA") \
  | eval dns_protocol=case(isnotnull(dns_response_protocol), dns_response_protocol, \
    isnotnull(transport), transport, 1==1, "NA") \
  | eval dns_rcode=case(isnotnull(dns_response_rcode), dns_response_rcode, \
    isnotnull(reply_code), reply_code, 1==1, "NA") \
  | eval dns_type=case(isnotnull(dns_type), dns_type, 1==1, "NA") \
  | eval dns_type_name=case(isnotnull(dns_response_type_name), dns_response_type_name, \
    isnotnull(record_type_resp), record_type_resp, isnotnull(dns_type), dns_type, 1==1, "NA") \
  | eval dns_rdata=coalesce(dns_rdata, "NA") \
  | eval dns_record=coalesce(dns_record, "NA") \
  | eval dns_answer_name=case(isnotnull(dns_answer_name), dns_answer_name, isnotnull(answer), answer, 1==1, "NA") \
  | eval net_app = coalesce(app, "NA") \
  | eval net_blocked=case(isnull(action), "NA", match(action, "(?i)block|drop|den(y|ied)|reset"), "TRUE", 1==1, "FALSE") \
  | eval net_device_ip=case(isnotnull(dvc_ip), dvc_ip, NOT isnull(dvc) AND cidrmatch("0.0.0.0/0", dvc), dvc, isnotnull(server_ip), server_ip,1==1, "NA") \
  | eval net_device_id=coalesce(dvc, dvc_ip, server_ip, "NA") \
  | eval net_device_types="recursive-dns" \
  | eval net_device_vendor=coalesce(vendor_product, vendor, "NA") \
  | fields agg_first, agg_last, agg_length, `dns_fields` 

[dns_pre_filter]
definition = where (tag == "network" AND (tag == "resolution" OR tag == "dns") \
  AND message_type == "response") AND NOT searchmatch("TCP packet out of state") \
  AND dns_response_type_name=="A"

# this will get normalized DNS events and aggregate them appropriately
[dns_aggregate]
definition = \
  eval agg_count=max(1, coalesce(agg_count, 1)) \
  | stats min(agg_count) as agg_count, min(agg_first) as agg_first, max(agg_last) as agg_last, \
    max(agg_length) as agg_length by `dns_fields`

# post normalization filter, will discard events which we determine not to be outbound
[post_filter]
definition = where (net_dst_ip != "NA" OR net_dst_domain != "NA") \
  AND (`internal_ipv4(net_src_ip)` OR `public_subnets(net_src_ip)`) \
  AND NOT (`internal_ipv4(net_dst_ip)` OR `public_subnets(net_dst_ip)`) \
  AND NOT `domains(net_dst_domain)`

[post_filter_v2(1)]
args = orgid
definition = where (net_dst_ip != "NA" OR net_dst_domain != "NA") \
  AND (`internal_ipv4(net_src_ip)` OR `public_subnets-$orgid$(net_src_ip)`) \
  AND NOT (`internal_ipv4(net_dst_ip)` OR `public_subnets-$orgid$(net_dst_ip)`) \
  AND NOT `domains-$orgid$(net_dst_domain)`

# perform reverse DNS lookup of source IP if necessary
[reverse_dns_lookup]
definition = lookup dnslookup clientip AS net_src_ip OUTPUTNEW clienthost AS net_src_ip_rdomain

[internal_ipv4(1)]
args = ip
definition = (cidrmatch("10.0.0.0/8", $ip$) OR cidrmatch("192.168.0.0/16", $ip$) OR cidrmatch("172.16.0.0/12", $ip$) \
  OR cidrmatch("127.0.0.0/8", $ip$))

[public_subnets(1)]
args = ip
definition = false()

[domains(1)]
args = domain
definition = false()

[strftime_utc(2)]
args = field, format
definition = "strftime($field$ - (strptime(strftime($field$, \"%Y-%m-%dT%H:%M:%SZ\"), \"%Y-%m-%dT%H:%M:%S%Z\")-strptime(strftime($field$, \"%Y-%m-%dT%H:%M:%S\"), \"%Y-%m-%dT%H:%M:%S\")), \"$format$\")"
iseval = true
