[message_for_sep11_log_files]
REGEX = ^\d+\-\d\d\-\d\d\s\d\d:\d\d:\d\d,(Info,|Error,|Minor,|Major,|Critical,)?(.*)
FORMAT = message::$2

[message_for_sep11_syslog]
REGEX = SymantecServer\s(\S+):\s(.*)
FORMAT = device_id::$1 message::$2

[sep11_action_lookup]
filename = sep_actions.csv

[sep11_vendor_info_lookup]
filename = sep_vendor_info.csv

## These extracts apply to cases where the field name is within the data
## for example " ,Computer name: foobar," becomes a dest_nt_host of foobar
## They are "generic" in that they apply to multiple SEP engines, hence the "_all"

[dest_nt_host_for_sep11_all]
REGEX = Computer(\s[nN]ame)?:\s([^,]+)
FORMAT = dest_nt_host::$2

[dest_nt_domain_for_sep11_all]
REGEX = Domain:\s([^,\(]+)
FORMAT = dest_nt_domain::$1

[user_for_sep11_all]
REGEX = ,User:\s([^,]+)
FORMAT = user::$1

[dvc_nt_host_for_sep11_all]
REGEX = Server:\s([^,]+)
FORMAT = dvc_nt_host::$1

[group_name_for_sep11_all]
REGEX = Group:\s([^,]+)
FORMAT = group_name::$1



###### SEP Admin ######
## CSV Headers; original SEP field names replaced to with CIM
[csv_header_for_sep11_admin]
SOURCE_KEY = message
DELIMS = ","
FIELDS = "site name","server name","domain name","admin","signature"

[dest_nt_host_for_sep11_admin]
REGEX = ,Server,:\s([^,]+)
FORMAT = dest_nt_host::$1

[user_for_sep11_admin]
REGEX = Admin:\s([^,]+)
FORMAT = user::$1


###### SEP Agent ######
[csv_header_for_sep11_agent]
SOURCE_KEY = message
DELIMS = ","
FIELDS = "dest_nt_host","event_description"

[exclamation_fields_for_sep11_agent]
REGEX = !([^!]+)!\s([^,]+),
FORMAT = $1::$2
MV_ADD = True

[src_dest_addr_inbound_for_sep11_agent]
REGEX =  Local:\s(\d+\.\d+\.\d+\.\d+),Local:\s(\S+),Remote:\s(\S+)?,Remote:\s(\d+\.\d+\.\d+\.\d+),Remote:\s(\S+),(Inbound)
FORMAT = dest_ip::$1 dest_mac::$2 src_ip::$4 src_mac::$5 direction::$6

[src_dest_addr_outbound_for_sep11_agent]
REGEX =  Local:\s(\d+\.\d+\.\d+\.\d+),Local:\s(\S+),Remote:\s(\S+)?,Remote:\s(\d+\.\d+\.\d+\.\d+),Remote:\s(\S+),(Outbound)
FORMAT = src_ip::$1 src_mac::$2 dest_ip::$4 dest_mac::$5 direction::$6

[begin_time_for_sep11_agent]
REGEX = Begin:\s([^,]+)
FORMAT = begin_time::$1

[end_time_for_sep11_agent]
REGEX = End:\s([^,]+)
FORMAT = end_time::$1

[occurrences_for_sep11_agent]
REGEX = ,Occurrences:\s(\d+),
FORMAT = occurrences::$1

[application_for_sep11_agent]
REGEX = ,Application:\s([^,]+),
FORMAT = application::$1

[location_for_sep11_agent]
REGEX = ,Location:\s([^,]+),
FORMAT = location::$1

[user_for_sep11_agent]
REGEX = ,User:\s([^,]+),
FORMAT = src_user::$1

[domain_for_sep11_agent]
REGEX = ,Domain:\s([^,]+),
FORMAT = dest_nt_domain::$1

###### SEP AGT System ######
[csv_header_for_sep11_agt_system]
SOURCE_KEY = message
DELIMS = ","
FIELDS = "dest_nt_host","category_field","event_source","agt_info"

[name_dvc_ip_for_sep11_agt_system]
SOURCE_KEY = sep11_name
REGEX = ([^\(]+)(\(([^\)]+))?
FORMAT = name::$1 dvc_ip::$3

[product_version_for_sep11_agt_system]
REGEX = Engine\sversion:\s(\S+)
FORMAT = product_version::$1

[sig_version_for_sep11_agt_system]
REGEX = definition file loaded\.\s+Version\:\s+(.*?)\.
FORMAT = signature_version::$1

[category_for_sep11_agt_system]
REGEX = Category:\s([^,]+),
FORMAT = category::$1

###### SEP Behavior ######
[csv_header_for_sep11_behavior]
SOURCE_KEY = message
DELIMS = ","
FIELDS = "dest_nt_host","action","description","api","begin_time","end_time","rule name","pid","process","return address","return module","parameter","user_name","domain name"

[signature_for_sep11_behavior]
REGEX = ,Rule:\s([^,]+)
FORMAT = signature::$1 

[file_name_path_for_sep11_behavior]
SOURCE_KEY = process
REGEX = (.+)(\\|/)([^,]+)
#(.*)/([^,]+)
FORMAT = file_path::$1 file_name::$3


###### SEP IDS ######
[csv_header_for_sep11_security]
SOURCE_KEY = message
DELIMS = ","
FIELDS = "dest_nt_host","sep11_name","local_host_ip","local_host_mac","remote_host_name","remote_host_ip","remote_host_mac","traffic_direction","network_protocol","hack_type","begin_time","end_time","occurrences","application_name","location","user_name","sep11_domain"

[exclamation_fields_for_sep11_ids]
REGEX = !([^!]+)!\s([^,]+),
FORMAT = $1::$2
MV_ADD = True

[sep11_name_as_signature]
REGEX = \[SID:\s+(\d+)\]\s+([^\.,]+)
FORMAT = signature_id::$1 signature::$2

[src_dest_addr_inbound_for_sep11_security]
REGEX =  Local:\s(\d+\.\d+\.\d+\.\d+),Local:\s(\S+),Remote:\s(\S+)?,Remote:\s(\d+\.\d+\.\d+\.\d+),Remote:\s(\S+),Inbound
FORMAT = dest_ip::$1 dest_mac::$2 src_ip::$4 src_mac::$5

[src_dest_addr_outbound_for_sep11_security]
REGEX =  Local:\s(\d+\.\d+\.\d+\.\d+),Local:\s(\S+),Remote:\s(\S+)?,Remote:\s(\d+\.\d+\.\d+\.\d+),Remote:\s(\S+),Outbound
FORMAT = src_ip::$1 src_mac::$2 dest_ip::$4 dest_mac::$5

[application_file_for_sep11_security]
REGEX = Application:\s((([^,]+)/)?([^,]+))
FORMAT = application::$1 file_path::$3 file_name::$4

[action_for_sep11_security]
REGEX = has\s+been\s+(allowed|blocked)
FORMAT = action::$1


###### SEP Policy ######
[csv_header_for_sep11_policy]
SOURCE_KEY = message
DELIMS = ","
FIELDS = "site name","dest_nt_host","sep11_nt_domain","admin name","change","object_name"
## the user is "admin: user_id" so we use a report extract instead of CSV header
[user_for_sep11_policy]
REGEX = ,Admin:\s([^,]+)
FORMAT = user::$1
## Command is the policy "change" plus "object"

[command_for_sep11_policy]
REGEX = Admin:\s[^,]+,(.*)
FORMAT = command::$1

[vendor_action_success_for_sep11_policy]
REGEX = (Policy\s+has\s+been\s+edited|Add\s+shared\s+policy)
FORMAT = vendor_action::"$1"


###### SEP Proactive ######
[csv_header_for_sep11_proactive]
SOURCE_KEY = message
DELIMS = ","
FIELDS = "name","comp_name_field"

[application_name_for_sep11_proactive]
REGEX = Application\sname:\s([^,]+)
FORMAT = application_name::$1

[application_type_for_sep11_proactive]
REGEX = Application\stype:\s([^,]+)
FORMAT = application_type::$1

[application_version_for_sep11_proactive]
REGEX = Application\sversion:\s([^,]+)
FORMAT = application_type::$1

[company_name_for_sep11_proactive]
REGEX = Company\sname:\s([^,]+),
FORMAT = company_name::$1

[hash_type_for_sep11_proactive]
REGEX = Hash\stype:\s([^,]+),
FORMAT = hash_type::$1

[hash_value_for_sep11_proactive]
REGEX = Application\shash:\s([^,]+),
FORMAT = hash_value::$1

[file_size_for_sep11_proactive]
REGEX = File\ssize\s\(bytes\):\s(\d+)
FORMAT = file_size::$1

[detection_type_for_sep11_proactive]
REGEX = Detection\stype:\s([^,]+),
FORMAT = detection_type::$1

[detection_score_for_sep11_proactive]
REGEX = Detection\sscore:\s([^,]+),
FORMAT = detection_score::$1

[computer_name_for_sep11_proactive]
REGEX = Computer\sname:\s([^,]+),
FORMAT = computer_name::$1

###### SEP Risk ###### 
[risk_type_for_sep11_risk]
SOURCE_KEY = message
REGEX = ^([^,]+),
FORMAT = risk_type::$1

[dest_ip_for_sep11_risk]
REGEX = ,IP\sAddress:\s([^,]+),
FORMAT = dest_ip::$1

[scan_type_for_sep11_risk]
REGEX = ,Source:\s([^,]+)
FORMAT = scan_type::$1

[signature_for_sep11_risk]
REGEX = Risk\sname:\s([^,]+)
FORMAT = signature::$1

[occurrences_for_sep11_risk]
REGEX = ,Occurrences:\s(\d+),
FORMAT = occurrences::$1

[process_for_sep11_risk]
REGEX = ,(\w:\\[^,]+)
FORMAT = process::$1

[file_name_path_for_sep11_risk]
SOURCE_KEY = process
REGEX = ((.+)(\\|/))?([^,]+)
FORMAT = file_path::$1 file_name::$4

[event_time_for_sep11_risk]
SOURCE_KEY=message
REGEX = ,Event\stime:\s([^,]+),
FORMAT = event_time::$1

[insert_time_for_sep11_risk]
SOURCE_KEY=message
REGEX = ,Inserted:\s([^,]+),
FORMAT = insert_time::$1

[end_time_for_sep11_risk]
SOURCE_KEY=message
REGEX = ,End:\s([^,]+),
FORMAT = end_time::$1

[last_update_time_for_sep11_risk]
SOURCE_KEY=message
REGEX = ,Last\supdate\stime:\s([^,]+),
FORMAT = last_update_time::$1

[actual_action_for_sep11_risk]
REGEX = Actual\saction:\s([^,]+)
FORMAT = actual_action::$1

[requested_action_for_sep11_risk]
REGEX = Requested action:\s([^,]+)
FORMAT = requested_action::$1

[secondary_action_for_sep11_risk]
REGEX = Secondary action:\s([^,]+)
FORMAT = secondary_action::$1

[disposition_for_sep11_risk]
REGEX = Disposition:\s([^,]+),
FORMAT = disposition::$1

[prevalence_for_sep11_risk]
REGEX = Prevalence:\s([^,]+),
FORMAT = prevalence::$1

[confidence_for_sep11_risk]
REGEX = Confidence:\s([^,]+),
FORMAT = confidence::$1

[first_seen_for_sep11_risk]
REGEX = First\sSeen:\s([^,]+),
FORMAT = first_seen::$1

[download_site_for_sep11_risk]
REGEX = Download\sSite:\s([^,]+),
FORMAT = download_site::$1

[web_domain_for_sep11_risk]
REGEX = Web\sdomain:\s([^,]+),
FORMAT = web_domain::$1

[downloaded_by_for_sep11_risk]
REGEX = Downloaded\sby:\s([^,]+),
FORMAT = downloaded_by::$1

[url_tracking_status_for_sep11_risk]
REGEX = URL\sTracking\sStatus:\s([^,]+),
FORMAT = downloaded_by::$1

[hash_type_for_sep11_risk]
REGEX = Hash\stype:\s([^,]+),
FORMAT = hash_type::$1

[hash_value_for_sep11_risk]
REGEX = Application\shash:\s([^,]+),
FORMAT = hash_value::$1

[file_size_for_sep11_risk]
REGEX = File\ssize\s\(bytes\):\s(\d+)
FORMAT = file_size::$1

###### SEP Scan ######
[csv_header_for_sep11_scan]
SOURCE_KEY = message
DELIMS = ","
FIELDS = "scan_id","begin_time_field","end_time_field","status","duration","client_user_1","client_user_2","start_message","stop_message","command","threats","infected","total_files","omitted","computer_name","dest_ip_field","domain_name","group_name_field","server_name"

[begin_time_for_sep11_scan]
REGEX = Begin:\s([^,]+)
FORMAT = begin_time::$1

[end_time_for_sep11_scan]
REGEX = End:\s([^,]+)
FORMAT = end_time::$1

[dest_nt_host_for_sep11_scan]
REGEX = Computer:\s([^,]+)
FORMAT = dest_nt_host::$1

[dest_ip_for_sep11_scan]
REGEX = ,IP\sAddress:\s([^,]+)
FORMAT = dest_ip::$1

[user_for_sep11_scan]
REGEX = User1:\s([^,]+)
FORMAT = user::$1

[duration_for_sep11_scan]
REGEX = Duration\s\(seconds\):\s(\d+)
FORMAT = duration_secs::$1

[infected_count_for_sep11_scan]
REGEX = Infected:\s(\d+)
FORMAT = infected_count::$1

[threat_count_for_sep11_scan]
REGEX = Threats:\s(\d+)
FORMAT = threat_count::$1

[total_file_count_for_sep11_scan]
REGEX = Total\sfiles:\s(\d+)
FORMAT = total_file_count::$1

[dest_ip_for_sep11_scan]
REGEX = IP\sAddress:\s(\d+\.\d+\.\d+\.\d+)
FORMAT = dest_ip::$1


###### SEP SCM System ######
[csv_header_for_sep11_scm_system]
SOURCE_KEY = message
DELIMS = ","
FIELDS = "site_name","sep11_server","domain_field","event description","dest_nt_host", "user_name","domain_name"

[version_for_sep11_scm_system]
REGEX = Win\d\d\s(\S+)
FORMAT = version::$1


###### SEP Traffic ######
[csv_header_for_sep11_traffic]
SOURCE_KEY = message
DELIMS = ","
FIELDS = "dest_nt_host","sep_action"

[src_nt_host_outbound_for_sep11_traffic]
SOURCE_KEY = message
REGEX = ^([^,]+).*,Outbound
FORMAT = src_nt_host::$1

[dest_nt_host_inbound_for_sep11_traffic]
SOURCE_KEY = message
REGEX = ^([^,]+).*,Inbound
FORMAT = dest_nt_host::$1

[inbound_addresses_for_sep11_traffic]
REGEX = Local:\s+(\d+\.\d+\.\d+\.\d+),Local:\s+(\S+),Remote:\s(\S+)?,Remote:\s+(\d+\.\d+\.\d+\.\d+)?,Remote:\s+([a-fA-f0-9]+)?,(Inbound|Unknown),.*Domain:\s([^,]+)?
FORMAT = dest_ip::$1 dest_mac::$2 src_ip::$4 src_mac::$5 vendor_direction::$6 dest_nt_domain::$7

[outbound_addresses_for_sep11_traffic]
REGEX = Local:\s+(\d+\.\d+\.\d+\.\d+),Local:\s+(\S+),Remote:\s(\S+)?,Remote:\s+(\d+\.\d+\.\d+\.\d+)?,Remote:\s+([a-fA-f0-9]+)?,(Inbound|Unknown),.*Domain:\s([^,]+)?
FORMAT = src_ip::$1 src_mac::$2 dest_ip::$4 dest_mac::$5 vendor_direction::$6 src_nt_domain::$7

[sep11_direction_lookup]
filename = sep_directions.csv

[vendor_action_for_sep11_traffic]
REGEX = Action:\s(\w+)
FORMAT = vendor_action::$1

###### SEP Antivirus ######
#[csv_header_for_sep11_antivirus]
#SOURCE_KEY = message
#DELIMS = ","
#FIELDS = "dest_nt_host", "category_field", "event_source", "event_field"
#
#[category_for_sep11_antivirus]
#REGEX = Category:\s([^,]+),
#FORMAT = category::$1
#

## SEP Actions - map to allow, block, deferred
## For details: http://service1.symantec.com/SUPPORT/ent-security.nsf/docid/2006112010562148

[message_for_sep12_log_files]
REGEX = ^\d+\-\d\d\-\d\d\s\d\d:\d\d:\d\d,(Info,|Error,|Minor,|Major,|Critical,|Warning,)?(.*)
FORMAT = message::$2

[message_for_sep12_syslog]
REGEX = SymantecServer\s(\S+):\s(.*)
FORMAT = device_id::$1 message::$2

[sep12_action_lookup]
filename = sep_actions.csv

[sep12_vendor_info_lookup]
filename = sep_vendor_info.csv

## These extracts apply to cases where the field name is within the data
## for example " ,Computer name: foobar," becomes a dest_nt_host of foobar
## They are "generic" in that they apply to multiple SEP engines, hence the "_all"

[dest_nt_host_for_sep12_all]
REGEX = Computer(\s[nN]ame)?:\s([^,]+)
FORMAT = dest_nt_host::$2

[dest_nt_domain_for_sep12_all]
REGEX = Domain:\s([^,\(]+)
FORMAT = dest_nt_domain::$1

[user_for_sep12_all]
REGEX = ,User:\s([^,]+)
FORMAT = user::$1

[dvc_nt_host_for_sep12_all]
REGEX = Server:\s([^,]+)
FORMAT = dvc_nt_host::$1

[group_name_for_sep12_all]
REGEX = Group:\s([^,]+)
FORMAT = group_name::$1



###### SEP Admin ######
## CSV Headers; original SEP field names replaced to with CIM
[csv_header_for_sep12_admin]
#SOURCE_KEY = message
DELIMS = ","
FIELDS = "site name","server name","domain name","admin","signature"

[dest_nt_host_for_sep12_admin]
REGEX = ,Server,:\s([^,]+)
FORMAT = dest_nt_host::$1

[user_for_sep12_admin]
REGEX = Admin:\s([^,]+)
FORMAT = user::$1


###### SEP Agent ######
[csv_header_for_sep12_agent]
#SOURCE_KEY = message
DELIMS = ","
FIELDS = "dest_nt_host","event_description"

[exclamation_fields_for_sep12_agent]
REGEX = !([^!]+)!\s([^,]+),
FORMAT = $1::$2
MV_ADD = True

[src_dest_addr_inbound_for_sep12_agent]
REGEX =  Local:\s(\d+\.\d+\.\d+\.\d+),Local:\s(\S+),Remote:\s(\S+)?,Remote:\s(\d+\.\d+\.\d+\.\d+),Remote:\s(\S+),(Inbound)
FORMAT = dest_ip::$1 dest_mac::$2 src_ip::$4 src_mac::$5 direction::$6

[src_dest_addr_outbound_for_sep12_agent]
REGEX =  Local:\s(\d+\.\d+\.\d+\.\d+),Local:\s(\S+),Remote:\s(\S+)?,Remote:\s(\d+\.\d+\.\d+\.\d+),Remote:\s(\S+),(Outbound)
FORMAT = src_ip::$1 src_mac::$2 dest_ip::$4 dest_mac::$5 direction::$6

[begin_time_for_sep12_agent]
REGEX = Begin:\s([^,]+)
FORMAT = begin_time::$1

[end_time_for_sep12_agent]
REGEX = End:\s([^,]+)
FORMAT = end_time::$1

[occurrences_for_sep12_agent]
REGEX = ,Occurrences:\s(\d+),
FORMAT = occurrences::$1

[application_for_sep12_agent]
REGEX = ,Application:\s([^,]+),
FORMAT = application::$1

[location_for_sep12_agent]
REGEX = ,Location:\s([^,]+),
FORMAT = location::$1

[user_for_sep12_agent]
REGEX = ,User:\s([^,]+),
FORMAT = src_user::$1

[domain_for_sep12_agent]
REGEX = ,Domain:\s([^,]+),
FORMAT = dest_nt_domain::$1

###### SEP AGT System ######
[csv_header_for_sep12_agt_system]
SOURCE_KEY = message
DELIMS = ","
FIELDS = "dest_nt_host","category_field","event_source","agt_info"

[name_dvc_ip_for_sep12_agt_system]
SOURCE_KEY = sep12_name
REGEX = ([^\(]+)(\(([^\)]+))?
FORMAT = name::$1 dvc_ip::$3

[product_version_for_sep12_agt_system]
REGEX = Engine\sversion:\s(\S+)
FORMAT = product_version::$1

[sig_version_for_sep12_agt_system]
REGEX = definition file loaded\.\s+Version\:\s+(.*?)\.
FORMAT = signature_version::$1

[category_for_sep12_agt_system]
REGEX = Category:\s([^,]+),
FORMAT = category::$1

###### SEP Behavior ######
[csv_header_for_sep12_behavior]
SOURCE_KEY = message
DELIMS = ","
FIELDS = "dest_nt_host","action","description","api","begin_time","end_time","rule name","pid","process","return address","return module","parameter","user_name","domain name"

[signature_for_sep12_behavior]
REGEX = ,Rule:\s([^,]+)
FORMAT = signature::$1 

[file_name_path_for_sep12_behavior]
SOURCE_KEY = process
REGEX = (.+)(\\|/)([^,]+)
#(.*)/([^,]+)
FORMAT = file_path::$1 file_name::$3


###### SEP IDS ######
[csv_header_for_sep12_security]
SOURCE_KEY = message
DELIMS = ","
FIELDS = "dest_nt_host","sep12_name","local_host_ip","local_host_mac","remote_host_name","remote_host_ip","remote_host_mac","traffic_direction","network_protocol","hack_type","begin_time","end_time","occurrences","application_name","location","user_name","sep12_domain"

[exclamation_fields_for_sep12_ids]
REGEX = !([^!]+)!\s([^,]+),
FORMAT = $1::$2
MV_ADD = True

[sep12_name_as_signature]
REGEX = \[SID:\s+(\d+)\]\s+([^\.,]+)
FORMAT = signature_id::$1 signature::$2

[src_dest_addr_inbound_for_sep12_security]
REGEX =  Local:\s(\d+\.\d+\.\d+\.\d+),Local:\s(\S+),Remote:\s(\S+)?,Remote:\s(\d+\.\d+\.\d+\.\d+),Remote:\s(\S+),Inbound
FORMAT = dest_ip::$1 dest_mac::$2 src_ip::$4 src_mac::$5

[src_dest_addr_outbound_for_sep12_security]
REGEX =  Local:\s(\d+\.\d+\.\d+\.\d+),Local:\s(\S+),Remote:\s(\S+)?,Remote:\s(\d+\.\d+\.\d+\.\d+),Remote:\s(\S+),Outbound
FORMAT = src_ip::$1 src_mac::$2 dest_ip::$4 dest_mac::$5

[application_file_for_sep12_security]
REGEX = Application:\s((([^,]+)/)?([^,]+))
FORMAT = application::$1 file_path::$3 file_name::$4

[action_for_sep12_security]
REGEX = has\s+been\s+(allowed|blocked)
FORMAT = action::$1


###### SEP Policy ######
[csv_header_for_sep12_policy]
SOURCE_KEY = message
DELIMS = ","
FIELDS = "site name","dest_nt_host","sep12_nt_domain","admin name","change","object_name"
## the user is "admin: user_id" so we use a report extract instead of CSV header
[user_for_sep12_policy]
REGEX = ,Admin:\s([^,]+)
FORMAT = user::$1
## Command is the policy "change" plus "object"

[command_for_sep12_policy]
REGEX = Admin:\s[^,]+,(.*)
FORMAT = command::$1

[vendor_action_success_for_sep12_policy]
REGEX = (Policy\s+has\s+been\s+edited|Add\s+shared\s+policy)
FORMAT = vendor_action::"$1"


###### SEP Proactive ######
[csv_header_for_sep12_proactive]
SOURCE_KEY = message
DELIMS = ","
FIELDS = "name","comp_name_field"

[application_name_for_sep12_proactive]
REGEX = Application\sname:\s([^,]+)
FORMAT = application_name::$1

[application_type_for_sep12_proactive]
REGEX = Application\stype:\s([^,]+)
FORMAT = application_type::$1

[application_version_for_sep12_proactive]
REGEX = Application\sversion:\s([^,]+)
FORMAT = application_type::$1

[company_name_for_sep12_proactive]
REGEX = Company\sname:\s([^,]+),
FORMAT = company_name::$1

[hash_type_for_sep12_proactive]
REGEX = Hash\stype:\s([^,]+),
FORMAT = hash_type::$1

[hash_value_for_sep12_proactive]
REGEX = Application\shash:\s([^,]+),
FORMAT = hash_value::$1

[file_size_for_sep12_proactive]
REGEX = File\ssize\s\(bytes\):\s(\d+)
FORMAT = file_size::$1

[detection_type_for_sep12_proactive]
REGEX = Detection\stype:\s([^,]+),
FORMAT = detection_type::$1

[detection_score_for_sep12_proactive]
REGEX = Detection\sscore:\s([^,]+),
FORMAT = detection_score::$1

[computer_name_for_sep12_proactive]
REGEX = Computer\sname:\s([^,]+),
FORMAT = computer_name::$1

###### SEP Risk ###### 
[risk_type_for_sep12_risk]
SOURCE_KEY = message
REGEX = ^([^,]+),
FORMAT = risk_type::$1

[dest_ip_for_sep12_risk]
REGEX = ,IP\sAddress:\s([^,]+),
FORMAT = dest_ip::$1

[scan_type_for_sep12_risk]
REGEX = ,Source:\s([^,]+)
FORMAT = scan_type::$1

[signature_for_sep12_risk]
REGEX = Risk\sname:\s([^,]+)
FORMAT = signature::$1

[occurrences_for_sep12_risk]
REGEX = ,Occurrences:\s(\d+),
FORMAT = occurrences::$1

[process_for_sep12_risk]
REGEX = ,(\w:\\[^,]+)
FORMAT = process::$1

[file_name_path_for_sep12_risk]
SOURCE_KEY = process
REGEX = ((.+)(\\|/))?([^,]+)
FORMAT = file_path::$1 file_name::$4

[event_time_for_sep12_risk]
#SOURCE_KEY=message
REGEX = ,Event\stime:\s([^,]+),
FORMAT = event_time::$1

[insert_time_for_sep12_risk]
#SOURCE_KEY=message
REGEX = ,Inserted:\s([^,]+),
FORMAT = insert_time::$1

[end_time_for_sep12_risk]
#SOURCE_KEY=message
REGEX = ,End:\s([^,]+),
FORMAT = end_time::$1

[last_update_time_for_sep12_risk]
#SOURCE_KEY=message
REGEX = ,Last\supdate\stime:\s([^,]+),
FORMAT = last_update_time::$1

[actual_action_for_sep12_risk]
REGEX = Actual\saction:\s([^,]+)
FORMAT = actual_action::$1

[requested_action_for_sep12_risk]
REGEX = Requested action:\s([^,]+)
FORMAT = requested_action::$1

[secondary_action_for_sep12_risk]
REGEX = Secondary action:\s([^,]+)
FORMAT = secondary_action::$1

[disposition_for_sep12_risk]
REGEX = Disposition:\s([^,]+),
FORMAT = disposition::$1

[prevalence_for_sep12_risk]
REGEX = Prevalence:\s([^,]+),
FORMAT = prevalence::$1

[confidence_for_sep12_risk]
REGEX = Confidence:\s([^,]+),
FORMAT = confidence::$1

[first_seen_for_sep12_risk]
REGEX = First\sSeen:\s([^,]+),
FORMAT = first_seen::$1

[download_site_for_sep12_risk]
REGEX = Download\sSite:\s([^,]+),
FORMAT = download_site::$1

[web_domain_for_sep12_risk]
REGEX = Web\sdomain:\s([^,]+),
FORMAT = web_domain::$1

[downloaded_by_for_sep12_risk]
REGEX = Downloaded\sby:\s([^,]+),
FORMAT = downloaded_by::$1

[url_tracking_status_for_sep12_risk]
REGEX = URL\sTracking\sStatus:\s([^,]+),
FORMAT = downloaded_by::$1

[hash_type_for_sep12_risk]
REGEX = Hash\stype:\s([^,]+),
FORMAT = hash_type::$1

[hash_value_for_sep12_risk]
REGEX = Application\shash:\s([^,]+),
FORMAT = hash_value::$1

[file_size_for_sep12_risk]
REGEX = File\ssize\s\(bytes\):\s(\d+)
FORMAT = file_size::$1

###### SEP Scan ######
[csv_header_for_sep12_scan]
SOURCE_KEY = message
DELIMS = ","
FIELDS = "scan_id","begin_time_field","end_time_field","status","duration","client_user_1","client_user_2","start_message","stop_message","command","threats","infected","total_files","omitted","computer_name","dest_ip_field","domain_name","group_name_field","server_name"

[begin_time_for_sep12_scan]
REGEX = Begin:\s([^,]+)
FORMAT = begin_time::$1

[end_time_for_sep12_scan]
REGEX = End:\s([^,]+)
FORMAT = end_time::$1

[dest_nt_host_for_sep12_scan]
REGEX = Computer:\s([^,]+)
FORMAT = dest_nt_host::$1

[dest_ip_for_sep12_scan]
REGEX = ,IP\sAddress:\s([^,]+)
FORMAT = dest_ip::$1

[user_for_sep12_scan]
REGEX = User1:\s([^,]+)
FORMAT = user::$1

[duration_for_sep12_scan]
REGEX = Duration\s\(seconds\):\s(\d+)
FORMAT = duration_secs::$1

[infected_count_for_sep12_scan]
REGEX = Infected:\s(\d+)
FORMAT = infected_count::$1

[threat_count_for_sep12_scan]
REGEX = Threats:\s(\d+)
FORMAT = threat_count::$1

[total_file_count_for_sep12_scan]
REGEX = Total\sfiles:\s(\d+)
FORMAT = total_file_count::$1

[dest_ip_for_sep12_scan]
REGEX = IP\sAddress:\s(\d+\.\d+\.\d+\.\d+)
FORMAT = dest_ip::$1


###### SEP SCM System ######
[csv_header_for_sep12_scm_system]
SOURCE_KEY = message
DELIMS = ","
FIELDS = "site_name","sep12_server","domain_field","event description","dest_nt_host", "user_name","domain_name"

[version_for_sep12_scm_system]
REGEX = Win\d\d\s(\S+)
FORMAT = version::$1


###### SEP Traffic ######
[csv_header_for_sep12_traffic]
SOURCE_KEY = message
DELIMS = ","
FIELDS = "dest_nt_host","sep_action"

[src_nt_host_outbound_for_sep12_traffic]
SOURCE_KEY = message
REGEX = ^([^,]+).*,Outbound
FORMAT = src_nt_host::$1

[dest_nt_host_inbound_for_sep12_traffic]
SOURCE_KEY = message
REGEX = ^([^,]+).*,Inbound
FORMAT = dest_nt_host::$1

[inbound_addresses_for_sep12_traffic]
REGEX = Local:\s+(\d+\.\d+\.\d+\.\d+),Local:\s+(\S+),Remote:\s(\S+)?,Remote:\s+(\d+\.\d+\.\d+\.\d+)?,Remote:\s+([a-fA-f0-9]+)?,(Inbound|Unknown),.*Domain:\s([^,]+)?
FORMAT = dest_ip::$1 dest_mac::$2 src_ip::$4 src_mac::$5 vendor_direction::$6 dest_nt_domain::$7

[outbound_addresses_for_sep12_traffic]
REGEX = Local:\s+(\d+\.\d+\.\d+\.\d+),Local:\s+(\S+),Remote:\s(\S+)?,Remote:\s+(\d+\.\d+\.\d+\.\d+)?,Remote:\s+([a-fA-f0-9]+)?,(Inbound|Unknown),.*Domain:\s([^,]+)?
FORMAT = src_ip::$1 src_mac::$2 dest_ip::$4 dest_mac::$5 vendor_direction::$6 src_nt_domain::$7

[sep12_direction_lookup]
filename = sep_directions.csv

[vendor_action_for_sep12_traffic]
REGEX = Action:\s(\w+)
FORMAT = vendor_action::$1

###### SEP Antivirus ######
#[csv_header_for_sep12_antivirus]
#SOURCE_KEY = message
#DELIMS = ","
#FIELDS = "dest_nt_host", "category_field", "event_source", "event_field"
#
#[category_for_sep12_antivirus]
#REGEX = Category:\s([^,]+),
#FORMAT = category::$1
#

