[qintel_index]
definition = index="main"
description = "This macro is used to configure where Qintel PMI Add-on for Splunk stores enriched data."

[qintel_source_indexes]
definition = ()

[qintel_fields]
definition = qintel_cve_actors, qintel_cve_actor_types, qintel_cve_affected_system, \
             qintel_cve_affected_version, qintel_cve_patches, qintel_cve_exploit_types, \
             qintel_cve_first_observed, qintel_cve_last_observed, qintel_cve_recently_observed

iseval = 0

[qintel_shrink_cve_fields]
definition = eval qintel_cve_actor_types=mvjoin(qintel_cve_actor_types, ",") \
| eval qintel_cve_actors=mvjoin(qintel_cve_actors, ",") \
| eval qintel_cve_affected_version=mvjoin(qintel_cve_affected_version, ",") \
| eval qintel_cve_exploit_types=mvjoin(qintel_cve_exploit_types, ",") \
| eval qintel_cve_patches=mvjoin(qintel_cve_patches, ",")

iseval = 0

[qintel_expand_cve_fields]
definition = eval qintel_cve_actor_types=split(qintel_cve_actor_types, ",") \
| eval qintel_cve_actors=split(qintel_cve_actors, ",") \
| eval qintel_cve_affected_version=split(qintel_cve_affected_version, ",") \
| eval qintel_cve_exploit_types=split(qintel_cve_exploit_types, ",") \
| eval qintel_cve_patches=split(qintel_cve_patches, ",")

iseval = 0

[qintel_cve_friendly_fields]
definition = \
rename qintel_cve_actor_types as "Actor Type", qintel_cve_actors as "Actor", \
qintel_cve_affected_system as "Affected System", qintel_cve_affected_version as "Affected Versions", \
qintel_cve_exploit_types as "Exploit Type", qintel_cve_first_observed as "First Observed", \
qintel_cve_last_observed as "Last Observed" qintel_cve_patches as "Patch", \
qintel_cve_recently_observed as "Recently Observed", Vulnerabilities.cve as "CVE", Vulnerabilities.cvss as "CVSS", \
Vulnerabilities.category as "Category", Vulnerabilities.signature as "Signature", \
Vulnerabilities.severity as "Severity", Vulnerabilities.dest as "Dest"
