[Change Events]
action.email.useNSSubject = 1
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
display.visualizations.show = 0
request.ui_dispatch_app = sonicwall_sma1000_ta
request.ui_dispatch_view = search
search = sourcetype="sonicwall:sma1000:audit:change"

[Disconnects by User]
action.email.show_password = 1
action.email.useNSSubject = 1
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
display.general.type = visualizations
display.page.search.tab = visualizations
display.statistics.show = 1
display.visualizations.charting.axisLabelsY.majorUnit = 1
display.visualizations.charting.chart = bar
request.ui_dispatch_app = sonicwall_sma1000_ta
request.ui_dispatch_view = search
search = sourcetype="sonicwall:sma1000:audit:tunnel" AND type="session" AND error_id=* | fields user, error, error_description | lookup sonicwall_sma1000_traffic_codes description AS error_description | eval user_error = user . " / " . error | stats count(user_error) as error_count by user_error, error_description

[Disconnects by Source IP]
action.email.show_password = 1
action.email.useNSSubject = 1
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
display.general.type = visualizations
display.page.search.tab = visualizations
display.statistics.show = 1
display.visualizations.charting.axisLabelsY.majorUnit = 1
display.visualizations.charting.chart = bar
request.ui_dispatch_app = sonicwall_sma1000_ta
request.ui_dispatch_view = search
search = sourcetype="sonicwall:sma1000:audit:tunnel" AND type="session" AND error_id=* | fields src_ip, error, error_description | lookup sonicwall_sma1000_traffic_codes description AS error_description | eval src_ip_error = src_ip . " / " . error | stats count(src_ip_error) as error_count by src_ip_error, error_description
workload_pool = undefined

[New Sessions by Location]
action.email.show_password = 1
action.email.useNSSubject = 1
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
display.general.type = visualizations
display.page.search.mode = verbose
display.page.search.tab = visualizations
display.statistics.show = 0
display.visualizations.type = mapping
request.ui_dispatch_app = sonicwall_sma1000_ta
request.ui_dispatch_view = search
search = eventtype="sma1000_session_start" | fields src_ip | iplocation src_ip | geostats latfield=lat longfield=lon count
workload_pool = undefined

[Uptime by Appliance]
action.email.show_password = 1
action.email.useNSSubject = 1
dispatch.earliest_time = rt-1h
dispatch.latest_time = rt
display.general.timeRangePicker.show = 0
display.general.type = visualizations
display.page.search.mode = verbose
display.page.search.tab = visualizations
display.statistics.show = 0
display.visualizations.charting.axisTitleX.visibility = collapsed
display.visualizations.charting.axisTitleY.visibility = collapsed
display.visualizations.charting.axisTitleY2.visibility = collapsed
display.visualizations.charting.chart = bar
display.visualizations.charting.legend.placement = none
display.visualizations.singlevalue.rangeColors = ["0x53a051","0x0877a6","0xf8be34","0xf1813f","0xdc4e41"]
display.visualizations.trellis.enabled = 1
display.visualizations.type = singlevalue
request.ui_dispatch_app = sonicwall_sma1000_ta
request.ui_dispatch_view = search
search = eventtype=sma1000_system_status | fields uptime, host | stats latest(uptime) as uptime by host | fillnull uptime value=0 | eval uptime_days = round(uptime/86400, 2) . " days" | fields host, uptime_days
workload_pool = undefined

[Authentication Failures by User]
action.email.show_password = 1
action.email.useNSSubject = 1
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
display.general.type = visualizations
display.page.search.mode = verbose
display.page.search.tab = visualizations
display.statistics.show = 0
display.visualizations.charting.axisLabelsY.majorUnit = 1
display.visualizations.charting.chart = bar
request.ui_dispatch_app = sonicwall_sma1000_ta
request.ui_dispatch_view = search
search = eventtype=sma1000_auth action=failure | fields user, action | stats count(action) as failures by user

[Average CPU Load by Appliance]
action.email.show_password = 1
action.email.useNSSubject = 1
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
display.general.type = visualizations
display.page.search.mode = verbose
display.page.search.tab = visualizations
display.statistics.show = 0
display.visualizations.charting.axisTitleX.visibility = collapsed
display.visualizations.charting.axisTitleY.visibility = collapsed
display.visualizations.charting.axisTitleY2.visibility = collapsed
display.visualizations.charting.chart = radialGauge
display.visualizations.charting.chart.style = minimal
display.visualizations.charting.legend.placement = none
display.visualizations.trellis.enabled = 1
request.ui_dispatch_app = sonicwall_sma1000_ta
request.ui_dispatch_view = search
search = eventtype=sma1000_system_status | fields cpu_load_percent, host | stats avg(cpu_load_percent) as cpu_load_percent by host | eval cpu_load_percent = cpu_load_percent
workload_pool = undefined

[Average Sessions by Appliance]
action.email.show_password = 1
action.email.useNSSubject = 1
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
display.general.type = visualizations
display.page.search.mode = verbose
display.page.search.tab = visualizations
display.statistics.show = 0
display.visualizations.charting.chart = area
display.visualizations.charting.chart.nullValueMode = zero
display.visualizations.charting.chart.stackMode = stacked
display.visualizations.charting.chart.style = minimal
request.ui_dispatch_app = sonicwall_sma1000_ta
request.ui_dispatch_view = search
search = eventtype=sma1000_system_status | fields active_user_count, host | timechart avg(active_user_count) as active_user_count by host span=15m

[Average Traffic by Appliance]
action.email.show_password = 1
action.email.useNSSubject = 1
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
display.general.type = visualizations
display.page.search.mode = verbose
display.page.search.tab = visualizations
display.statistics.show = 0
display.visualizations.charting.chart = area
display.visualizations.charting.chart.nullValueMode = zero
display.visualizations.charting.chart.stackMode = stacked
display.visualizations.charting.chart.style = minimal
request.ui_dispatch_app = sonicwall_sma1000_ta
request.ui_dispatch_view = search
search = eventtype=sma1000_system_status | fields thruput, host | timechart avg(thruput) as thruput by host span=15m
workload_pool = undefined

[Total Traffic by Source IP]
action.email.show_password = 1
action.email.useNSSubject = 1
alert.track = 0
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
display.general.type = visualizations
display.page.search.mode = verbose
display.page.search.tab = visualizations
display.statistics.show = 0
request.ui_dispatch_app = sonicwall_sma1000_ta
request.ui_dispatch_view = search
search = eventtype=sma1000_traffic action=allowed | fields session_id, bytes | join session_id overwrite=true [search eventtype=sma1000_session_start | fields session_id, src_ip] | stats sum(bytes) as bytes by src_ip | eval megabytes=round(bytes / 1048576, 2) | fields src_ip, megabytes

[Total Traffic by Source IP & Destination]
action.email.show_password = 1
action.email.useNSSubject = 1
alert.track = 0
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
display.general.type = visualizations
display.page.search.mode = verbose
display.page.search.tab = visualizations
display.statistics.show = 0
display.visualizations.charting.chart = bar
request.ui_dispatch_app = sonicwall_sma1000_ta
request.ui_dispatch_view = search
search = eventtype=sma1000_traffic action=allowed | fields session_id, bytes, dest | join session_id overwrite=true [search eventtype=sma1000_session_start | fields session_id, src_ip] | eval src_ip_dest = src_ip . " / " . dest | stats sum(bytes) as bytes by src_ip_dest | eval megabytes=round(bytes / 1048576, 2) | fields src_ip_dest, megabytes
workload_pool = undefined

[Total Traffic by User & Destination]
action.email.show_password = 1
action.email.useNSSubject = 1
alert.track = 0
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
display.general.type = visualizations
display.page.search.mode = verbose
display.page.search.tab = visualizations
display.statistics.show = 0
display.visualizations.charting.chart = bar
request.ui_dispatch_app = sonicwall_sma1000_ta
request.ui_dispatch_view = search
search = eventtype=sma1000_traffic action=allowed user=* | fields user, dest, bytes | eval user_dest = user . " / " . dest | stats sum(bytes) as bytes by user_dest | eval megabytes=round(bytes / 1048576, 2) | fields user_dest, megabytes
