#
# Seckit Identity Management Common for ES  - A utility add on to properly format Assets and
# Identifies for ES
#
# Copyright 2017-2018 Splunk Inc, <rfaircloth@splunk.com>
#
# Licensed under the Apache License, Version 2.0 (the "License");
# you may not use this file except in compliance with the License.
# You may obtain a copy of the License at
#
#   http://www.apache.org/licenses/LICENSE-2.0
#
# Unless required by applicable law or agreed to in writing, software
# distributed under the License is distributed on an "AS IS" BASIS,
# WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
# See the License for the specific language governing permissions and
# limitations under the License.
#
[seckit_idm_common_assets_networks_lookup_gen]
action.customsearchbuilder.routine = make_lookup_generating_search:makeLookupGeneratingSearch
action.customsearchbuilder.spec = {}
cron_schedule = 0 */4 * * *
dispatch.earliest_time = -2h
dispatch.latest_time = now
dispatch.ttl = 10
enableSched = true
request.ui_dispatch_app = SecKit_SA_idm_common
request.ui_dispatch_view = search
schedule_window = auto
allow_skew = 100%
realtime_schedule = 1
search = | inputlookup seckit_idm_pre_cidr_location_by_str_lookup\
| eval ip=cidr\
| rex field=ip "(?<lip>.*)\/"\
| lookup seckit_idm_combined_cidr_category_by_cidr_lookup cidr as lip OUTPUT cidr_pci_domain as pci_domain cidr_category as category cidr_priority cidr_bunit as bunit cidr_owner as owner\
| eval category=mvjoin(category,"|")\
| makemv delim="|" category\
| eval priority=mvappend(priority,cidr_priority)\
| append [ | inputlookup append=t seckit_idm_combined_cidr_category_by_str_lookup\
  | rename  cidr_pci_domain as pci_domain cidr_category as category cidr_priority as priority cidr_bunit as bunit cidr_owner as owner\
  | eval ip=cidr\
  | rex field=ip "(?<lip>.*)\/"\
  | lookup seckit_idm_pre_cidr_location_by_str_lookup cidr as lip OUTPUT lat,long,city,state,country\
  | eval priority=mvappend(priority,priority2)\
]\
| makemv delim="|" category\
| stats first(lat) as latx, first(long) as long, first(city) as city,first(country) as country,values(category) as category mode(priority) as priority first(bunit) as bunit first(owner) as owner first(pci_domain) as pci_domain by ip\
| rex field=ip "\/(?<ips_bits>\d+)"\
| rex field=ip "(?<ips_x>\d+\.\d+\.\d+\.\d+)"\
| sort 0 -num(ips_bits), ip(ips_x)\
| rex field=cidr "(?<ip>[^\/]+)"\
| `seckit_idm_common_external_geocode`\
| eval city=coalesce(City,city)\
| eval state=coalesce(State,state)\
| eval country=coalesce(Country,country)\
| eval long=coalesce(lon,long)\
| eval lat=coalesce(lat,latx)\
| fields - City,State,Country\
| search ip="*/*" NOT ip="*/32"\
| `seckit_idm_common_output_assets("seckit_idm_common_assets_networks_lookup","ip","seckit_common_cidr")`

[seckit_idm_combined_cidr_category_by_str_lookup_ftr]
cron_schedule = */1 * * * *
dispatch.earliest_time = -2h
dispatch.latest_time = now
dispatch.ttl = 10
enableSched = true
request.ui_dispatch_app = SecKit_SA_idm_common
request.ui_dispatch_view = search
schedule_window = auto
allow_skew = 100%
realtime_schedule = 1
run_on_startup = true
run_n_times = 5
is_visible = false
search = | savedsearch seckit_idm_combined_cidr_category_by_str_lookup_gen

[seckit_idm_combined_cidr_category_by_str_lookup_gen]
action.customsearchbuilder.routine = make_lookup_generating_search:makeLookupGeneratingSearch
action.customsearchbuilder.spec = {}
cron_schedule = */30 * * * *
dispatch.earliest_time = -2h
dispatch.latest_time = now
dispatch.ttl = 10
enableSched = true
request.ui_dispatch_app = SecKit_SA_idm_common
request.ui_dispatch_view = search
schedule_window = auto
allow_skew = 100%
realtime_schedule = 1
search = | inputlookup seckit_idm_pre_cidr_category_by_str_lookup \
| inputlookup append=t seckit_idm_common_event_cidr_category \
| makemv delim="|" cidr_category \
| makemv delim="|" cidr_pci_domain \
| stats values(*) as * by cidr \
| eval cidr_category=mvjoin((mvdedup(mvsort(cidr_category))),"|") \
| eval cidr_pci_domain=mvjoin((mvdedup(mvsort(cidr_pci_domain))),"|") \
| regex cidr="^([0-9]{1,3}\.){3}[0-9]{1,3}(\/([0-9]|[1-2][0-9]|3[0-1]))?$" \
| fields + cidr,cidr_pci_domain,cidr_category,cidr_priority,cidr_bunit,cidr_owner\
| outputlookup create_empty=true createinapp=true seckit_idm_combined_cidr_category_by_str_lookup \
| stats count


#not stream bug subnetmask AS lease_scope for sourcetype=stream:dhcp
[seckit_idm_common_event_cidr_category_from_dm_network_session_dhcp]
cron_schedule = 0 */4 * * *
dispatch.earliest_time = -2h
dispatch.latest_time = now
dispatch.ttl = 10
enableSched = false
request.ui_dispatch_app = SecKit_SA_idm_common
request.ui_dispatch_view = search
schedule_window = auto
allow_skew = 100%
realtime_schedule = 1
search = | tstats allow_old_summaries=true latest(_time) as last \
  from datamodel=Network_Sessions \
  where nodename=All_Sessions.DHCP AND All_Sessions.action=added\
by All_Sessions.vendor_product,All_Sessions.src_ip,All_Sessions.DHCP.lease_scope\
| rename All_Sessions.* AS * \
| rename DHCP.* as * \
| rename lease_scope as cidr\
| eval category="net_assignment:dyndhcp"\
| eval pci_domain="TRUST"\
| eval searchname="seckit_idm_common_event_cidr_category_from_network_session_dhcp"\
| makemv delim="|" category\
| `seckit_idm_common_event_cidr_category_from_dm_network_session_dhcp_custom`\
| eval category=mvappend(category,category_custom)\
| search cidr=*\
| eval _key=md5(cidr . searchanme . category )\
| fields + cidr,last,category,priority,pci_domain,vendor_product,searchname\
| outputlookup create_empty=true createinapp=true seckit_idm_common_event_cidr_category_lookup

[seckit_idm_common_event_cidr_category_age]
cron_schedule = 0 0 * * *
dispatch.earliest_time = -2h
dispatch.latest_time = now
dispatch.ttl = 10
enableSched = true
request.ui_dispatch_app = SecKit_SA_idm_common
request.ui_dispatch_view = search
schedule_window = auto
allow_skew = 100%
search = |  inputlookup seckit_idm_common_event_cidr_category_lookup\
| eval last=if(last>1,last,0)\
| where last>now()-(86400*365) OR last=0\
| outputlookup create_empty=true createinapp=true seckit_idm_common_event_cidr_category_lookup


[seckit_idm_common_assets_expected_tracker_gen]
action.customsearchbuilder.routine = make_lookup_generating_search:makeLookupGeneratingSearch
action.customsearchbuilder.spec = {}
cron_schedule = 0 */1 * * *
dispatch.earliest_time = -15m
dispatch.latest_time = now
dispatch.ttl = 10
enableSched = true
request.ui_dispatch_app = SecKit_SA_idm_common
request.ui_dispatch_view = search
schedule_window = auto
allow_skew = 100%
realtime_schedule = 1
search = | metadata index=_internal type=hosts \
| where lastTime>=now()-60*15 \
| regex host!="\d+\.\d+\.\d+\.\d+" \
| eval host_dns=host \
| `get_asset(host)` \
| search host_asset_id=* \
| eval host=upper(host) \
| stats max(lastTime) as _time by host \
| eval reason="seckit_idm_common-UF" \
| eval _key=host \
| outputlookup create_empty=true createinapp=true seckit_idm_common_assets_host_expected_tracker_lookup\
| stats count

[seckit_idm_common_assets_expected_tracker_age]
cron_schedule = 0 0 * * *
dispatch.earliest_time = -2h
dispatch.latest_time = now
dispatch.ttl = 10
enableSched = true
request.ui_dispatch_app = SecKit_SA_idm_common
request.ui_dispatch_view = search
schedule_window = auto
allow_skew = 100%
search = |  inputlookup seckit_idm_common_assets_host_expected_tracker_tlookup\
|  where last>now()-(86400*30) \
|  outputlookup create_empty=true createinapp=true seckit_idm_common_assets_host_expected_tracker_tlookup

[seckit_idm_pre_cidr_category_by_str_lookup_ftr]
cron_schedule = */1 * * * *
dispatch.earliest_time = -2h
dispatch.latest_time = now
dispatch.ttl = 10
enableSched = true
request.ui_dispatch_app = SecKit_SA_idm_common
request.ui_dispatch_view = search
schedule_window = auto
allow_skew = 100%
realtime_schedule = 1
run_on_startup = true
run_n_times = 1
is_visible = false
search = | inputlookup seckit_idm_pre_cidr_category_by_str_lookup \
| inputlookup append=t seckit_idm_pre_cidr_category_default_lookup\
| fields + cidr,cidr_pci_domain,cidr_category,cidr_priority,cidr_bunit,cidr_owner\
| stats latest(cidr_pci_domain) as cidr_pci_domain values(cidr_category) as cidr_category, values(cidr_priority) as cidr_priority latest(cidr_bunit) as cidr_bunit latest(cidr_owner) as cidr_owner by cidr\
| eval cidr_priority=case(cidr_priority="critical","critical",cidr_priority="high","high",cidr_priority="medium","medium",0=0,"")\
| eval cidr_category=mvjoin(cidr_category,"|") \
| outputlookup create_empty=true createinapp=true seckit_idm_pre_cidr_category_by_str_lookup\
| stats count

[seckit_idm_pre_cidr_location_by_str_lookup_ftr]
cron_schedule = */1 * * * *
dispatch.earliest_time = -2h
dispatch.latest_time = now
dispatch.ttl = 10
enableSched = true
request.ui_dispatch_app = SecKit_SA_idm_common
request.ui_dispatch_view = search
schedule_window = auto
allow_skew = 100%
realtime_schedule = 1
run_on_startup = true
run_n_times = 1
is_visible = false
search = | inputlookup seckit_idm_pre_cidr_location_by_str_lookup  \
| inputlookup append=t seckit_idm_pre_cidr_location_default_lookup \
| dedup cidr\
| fields + cidr,lat,long,city,state,country\
| outputlookup create_empty=true createinapp=true seckit_idm_pre_cidr_location_by_str_lookup\
| stats count

[seckit_idm_common_assets_networks_lookup_ftr]
cron_schedule = */5 * * * *
dispatch.earliest_time = -2h
dispatch.latest_time = now
dispatch.ttl = 10
enableSched = true
request.ui_dispatch_app = SecKit_SA_idm_common
request.ui_dispatch_view = search
schedule_window = auto
allow_skew = 100%
realtime_schedule = 1
run_on_startup = true
run_n_times = 4
is_visible = false
search = | makeresults \
| inputlookup append=t seckit_idm_common_assets_networks_lookup \
| fields + ip,mac,nt_host,dns,owner,priority,lat,long,city,country,bunit,category,pci_domain,is_expected,should_timesync,should_update,requires_av \
| outputlookup create_empty=true createinapp=true seckit_idm_common_assets_networks_lookup \
| stats count

[seckit_idm_pre_host_static_lookup_ftr]
cron_schedule = 0 */1 * * *
dispatch.earliest_time = -2h
dispatch.latest_time = now
dispatch.ttl = 10
enableSched = true
request.ui_dispatch_app = SecKit_SA_idm_common
request.ui_dispatch_view = search
schedule_window = auto
allow_skew = 100%
realtime_schedule = 1
run_on_startup = true
run_n_times = 1
is_visible = false
search = | makeresults \
| eval static_name="unmatchablehost" \
| inputlookup append=t seckit_idm_pre_host_static_lookup\
| dedup static_name \
| fields + static_name,static_category,static_pci_domain,static_priority,static_expected\
| outputlookup create_empty=true createinapp=true seckit_idm_pre_host_static_lookup\
| stats count
