#
# Customizable search macros
#
# Set to -1 to disable a search result limit
# Set to a value > 0 to enforce a search result limit
[dragos_search_performance_result_limit]
definition = `dragos_search_performance_result_limit_query(-1)`


#
# Search macros
# Do not modify these values
#
[dragos_search_performance_result_limit_query(1)]
args = result_limit
definition = if (result_limit> 0, "| head $result_limit$", "")
iseval = true


#
# Web traffic
#
[dragos_events_query_web]
definition = datamodel Web search `dragos_search_performance_result_limit` | stats count

[dragos_indicator_query_web]
definition = datamodel Web search `dragos_search_performance_result_limit` |  rename Web.url as indicator | eval indicator=mvindex(split(indicator, ":"), 0), count=1 | append [| datamodel Web search `dragos_search_performance_result_limit` |  rename Web.dest as indicator | eval indicator=mvindex(split(indicator, ":"), 0), count=1 ] | where isnotnull(indicator) AND indicator != "" 

#
# DNS traffic
#
[dragos_events_query_dns]
definition = datamodel Network_Resolution DNS search `dragos_search_performance_result_limit` | stats count

[dragos_indicator_query_dns]
definition = datamodel Network_Resolution DNS search `dragos_search_performance_result_limit` | search DNS.query!=unknown | rename DNS.query as indicator | eval count=1 | append [| datamodel Network_Resolution DNS search `dragos_search_performance_result_limit` | search DNS.answer!=unknown | rename DNS.answer as indicator | eval count=1 ] | where isnotnull(indicator) AND indicator != "" 

#
# Network traffic
#
[dragos_events_query_network_traffic]
definition = datamodel Network_Traffic All_Traffic search `dragos_search_performance_result_limit` | stats count

[dragos_indicator_query_network_traffic]
definition = datamodel Network_Traffic All_Traffic search `dragos_search_performance_result_limit` | rename All_Traffic.src_ip as indicator | eval count=1 | append [| datamodel Network_Traffic All_Traffic search `dragos_search_performance_result_limit` | rename All_Traffic.dest_ip as indicator | eval count=1 ] | where isnotnull(indicator) AND indicator != "" 


#
# Utils
#
[dragos_append_zero_count]
definition =  append [| gentimes start=-1 end=0  | eval count=0 ]

[dragos_determine_ioc_dest]
definition = makeresults count=1 | eval ioc_destination_config="splunkES" |  append [ | makeresults count=2 | eval ioc_destination_config="remoteSearchHead" ] | join ioc_destination_config type=inner [ rest /services/data/inputs/all | search "eai:type"="modular_input_dragos_iocs" AND title="dragos_iocs" ]
