[bit9:carbonblack:json]
LINE_BREAKER = (?:}("\|\|")(?:{")?|([\r\n]+))
SHOULD_LINEMERGE = false
KV_MODE = JSON
TIME_PREFIX = (?:\"timestamp\"\:(?!\")|\"message\"\:)
MAX_TIMESTAMP_LOOKAHEAD = 0
pulldown_type = true
EVENT_BREAKER_ENABLE = true
REPORT-event_type = carbonblack_is_alert_transform
REPORT-event_type_edr = carbonblack_is_edr_alert_transform
REPORT-operation_type = carbonblack_is_network_transform, carbonblack_is_file_transform, carbonblack_is_registry_transform, carbonblack_is_process_transform, carbonblack_is_binary_transform, carbonblack_is_useractivity_transform, carbonblack_is_binarystore_transform, carbonblack_is_binaryinfo_transform, carbonblack_is_feed_transform
REPORT-operation_type_edr = carbonblack_is_edr_file_transform, carbonblack_is_edr_process_transform
REPORT-endpoint = carbonblack_endpoint_transform, carbonblack_endpoint_transform2, carbonblack_dest_from_link_md5_transform
REPORT-process_from_path = carbonblack_process_name_transform,carbonblack_parent_process_name_transform,carbonblack_target_process_name_transform
FIELDALIAS-vendor_type = type as vendor_type
EVAL-original_file_name = case(vendor_type=="ingress.event.moduleload",file_name)
EVAL-os = COALESCE('docs{}.os_type',if(match(path,"/"),"linux","windows"))
EVAL-dvc = COALESCE(endpoint, hostname, host_name, computer_name,cb_server)
EVAL-action = case(is_network=="netconn" OR vendor_type IN ("ingress.event.process","ingress.event.procstart","ingress.event.remotethread","ingress.event.crossprocopen","ingress.event.childproc") OR (is_alert!="" OR alert_type!="") AND (isnull(is_file) AND isnull(is_registry) AND isnull(is_binary)),"allowed", vendor_type=="binarystore.file.added" OR (vendor_type=="audit.log.useractivity" AND method=="POST"),"modified",vendor_type=="audit.log.useractivity" AND method="GET" AND path=="/api/logout","logoff",(vendor_type=="audit.log.useractivity" AND method=="GET") OR vendor_type=="ingress.event.module","read",vendor_type=="binaryinfo.host.observed","created",vendor_type=="ingress.event.moduleload","loaded",vendor_type=="ingress.event.procend","terminated")
EVAL-file_hash = case(vendor_type IN("binarystore.file.added","ingress.event.filemod","ingress.event.module","watchlist.storage.hit.binary","watchlist.hit.binary","binaryinfo.host.observed"), if(isnotnull(md5) AND md5 != "", md5, 'docs{}.md5'), true(), file_hash)
EVAL-file_access_time = case(vendor_type IN("ingress.event.filemod","ingress.event.module","binaryinfo.host.observed"),timestamp)
EVAL-file_modify_time = case(vendor_type IN("binarystore.file.added","ingress.event.filemod","ingress.event.module","binaryinfo.host.observed"),timestamp)
EVAL-file_create_time = case(vendor_type IN("binarystore.file.added","binaryinfo.host.observed") OR (vendor_type=="ingress.event.filemod" AND action=="create"),timestamp)
EVAL-vendor = "Broadcom"
EVAL-product = "Carbon Black EDR"
EVAL-vendor_product = "Carbon Black EDR"
EVAL-dest_nt_domain = if(mvcount(split(COALESCE(username,'docs{}.username'),"\\"))==2,mvindex(split(COALESCE(username,'docs{}.username'),"\\"),0),null())
EVAL-user = COALESCE(mvindex(split(COALESCE(username,'docs{}.username'),"\\"),-1), 'docs{}.username', child_username)
EVAL-user_name = COALESCE(mvindex(split(COALESCE(username,'docs{}.username'),"\\"),-1), 'docs{}.username', child_username)
EVAL-parent_process = COALESCE(parent_process,'docs{}.parent_name',case(vendor_type IN ("ingress.event.moduleload","ingress.event.remotethread","ingress.event.crossprocopen"),process_path,vendor_type="ingress.event.childproc",path,isnotnull(is_edr_process),parent_path))
EVAL-parent_process_name = COALESCE(parent_process_name,parent_process,'docs{}.parent_name',case(vendor_type IN ("ingress.event.moduleload","ingress.event.remotethread","ingress.event.crossprocopen"),process_from_path,vendor_type="ingress.event.childproc",file_name,isnotnull(is_edr_process),parent_process_from_path))
EVAL-parent_process_exec = COALESCE(parent_process_name,parent_process,'docs{}.parent_name',case(vendor_type IN ("ingress.event.moduleload","ingress.event.remotethread","ingress.event.crossprocopen"),process_from_path,vendor_type="ingress.event.childproc",file_name,isnotnull(is_edr_process),parent_process_from_path))
EVAL-parent_process_path = case(vendor_type IN ("ingress.event.procstart", "ingress.event.procend"),parent_path,vendor_type IN ("ingress.event.moduleload","ingress.event.remotethread","ingress.event.crossprocopen"),process_path,vendor_type="ingress.event.childproc",path,true(),parent_process_path)
EVAL-parent_process_id = case(vendor_type IN ("ingress.event.procstart","ingress.event.procend"),parent_pid,vendor_type IN ("ingress.event.moduleload","ingress.event.remotethread","ingress.event.crossprocopen","ingress.event.childproc"),pid,true(),COALESCE(parent_process_id,'docs{}.parent_pid'))
EVAL-parent_process_hash = if(isnotnull(is_edr_process),if(parent_md5="" OR isnull(parent_md5),'docs{}.parent_md5',parent_md5),null())
EVAL-parent_process_guid = case(event_type=="childproc",parent_guid,vendor_type IN ("ingress.event.moduleload","ingress.event.remotethread","ingress.event.crossprocopen"),process_guid,isnotnull(parent_process_guid) AND parent_process_guid != "",parent_process_guid,true(),COALESCE('docs{}.parent_guid',parent_guid))
EVAL-process = case(childproc_type="Exec",null(),vendor_type="ingress.event.procstart",command_line,vendor_type="ingress.event.moduleload" OR (file_name!="0" AND isnotnull(is_edr_process)),path,vendor_type IN ("ingress.event.remotethread","ingress.event.crossprocopen"),target_path,true(),COALESCE('docs{}.cmdline',command_line,child_command_line,process_path,process,process_path,process))
EVAL-process_id = case(vendor_type!="ingress.event.moduleload",COALESCE(target_pid,child_pid,pid,process_pid,'docs{}.process_pid',process_id))
EVAL-process_guid = case(childproc_type="Exec" OR vendor_type="ingress.event.moduleload",null(),true(),COALESCE(target_process_guid,process_guid, 'docs{}.process_guid'))
EVAL-process_path = case(childproc_type="Exec",null(),vendor_type="ingress.event.moduleload" OR event_type="childproc",path,vendor_type IN ("ingress.event.remotethread","ingress.event.crossprocopen"),target_path,isnotnull(is_edr_process),COALESCE('docs{}.path',path),true(),process_path)
EVAL-process_name = case(childproc_type="Exec",null(),vendor_type="ingress.event.moduleload",file_name,vendor_type IN ("ingress.event.remotethread","ingress.event.crossprocopen"),target_process_from_path,isnotnull(process_name),process_name,isnotnull('docs{}.process_name'),'docs{}.process_name',isnotnull(process_from_path),process_from_path,(file_name!="0" AND isnotnull(is_edr_process)),file_name,true(),process)
EVAL-process_exec = case(childproc_type="Exec",null(),vendor_type="ingress.event.moduleload",file_name,vendor_type IN ("ingress.event.remotethread","ingress.event.crossprocopen"),target_process_from_path,(file_name!="0" AND isnotnull(is_edr_process)), file_name,true(),COALESCE(process_exec,process_name,'docs{}.process_name',process_from_path, process))
EVAL-process_hash = case(childproc_type = "Exec", null(),isnotnull(target_md5) AND isnotnull(target_sha256), mvappend(target_md5, target_sha256),isnotnull(target_md5),target_md5,isnotnull(target_sha256),target_sha256,isnotnull(process_md5) AND isnotnull(process_sha256), mvappend(process_md5, process_sha256),isnotnull(process_md5),process_md5,isnotnull(process_sha256),process_sha256,isnotnull('docs{}.process_md5') AND isnotnull('docs{}.process_sha256'), mvappend('docs{}.process_md5', 'docs{}.process_sha256'),isnotnull('docs{}.process_md5'),'docs{}.process_md5',isnotnull('docs{}.process_sha256'),'docs{}.process_sha256',isnotnull('docs{}.md5') AND isnotnull('docs{}.sha256'),mvappend('docs{}.md5', 'docs{}.sha256'),isnotnull('docs{}.md5'),'docs{}.md5',isnotnull('docs{}.sha256'),'docs{}.sha256',isnotnull(md5) AND isnotnull(sha256),mvappend(md5, sha256),isnotnull(md5),md5,isnotnull(sha256),sha256)
FIELDALIAS-notification_type = type as notification_type
FIELDALIAS-signature = type as signature
FIELDALIAS-signature_id = type as signature_id
EVAL-app = case(isnotnull(app),app, direction == "outbound" AND remote_port == "443", "https", direction == "inbound" AND local_port == "130", "Multicast Listener Query", true(), "Carbon Black EDR")
EVAL-body = case(isnotnull(is_edr_alert), alert_type, true(), ioc_attr)
EVAL-severity_id = if(isnotnull(is_edr_alert),alert_severity,severity_id)
EVAL-id = COALESCE(unique_id,id,'docs{}.unique_id')
EVAL-type = case(isnotnull(is_edr_alert) OR is_alert!="" OR alert_type!="","alert",vendor_type IN ("binarystore.file.added","binaryinfo.observed","binaryinfo.group.observed","feed.synchronized"),"event",vendor_type="task.error.logged","task",true(),type)
EVAL-dest_type = case(vendor_type!="feed.synchronized" AND (isnotnull(endpoint) OR isnotnull(is_edr_alert) OR isnotnull(is_feed)),"endpoint",isnotnull(cb_server),"Carbon Black EDR server")
EVAL-src_type = case(isnotnull(endpoint) OR isnotnull(is_edr_alert) OR isnotnull(is_feed),"endpoint")
EVAL-subject = "Type:"+notification_type + ", Watchlist_name:" + watchlist_name
EVAL-severity = case(isnotnull(is_edr_alert) OR isnotnull(alert_type),case(alert_severity < 20, "informational", alert_severity >= 20 AND alert_severity < 40, "low",alert_severity >= 40 AND alert_severity < 60, "medium", alert_severity >= 60 AND alert_severity < 80,"high", alert_severity >= 80, "critical", true(),"unknown"),isnotnull(is_alert),"high",vendor_type IN ("binarystore.file.added","binaryinfo.observed","binaryinfo.group.observed","feed.synchronized","task.error.logged"),"low")
LOOKUP-bit9_cbs_description_lookup = bit9_cbs_description_lookup vendor_type OUTPUTNEW description
REPORT-object_info = carbonblack_file_and_path_transform,carbonblack_file_and_path_transform2,carbonblack_registry_transform
EVAL-size = COALESCE(size,'docs{}.orig_mod_len')
EVAL-file_size = COALESCE(size,'docs{}.orig_mod_len')/1024
EVAL-change_type = case((is_file != "" OR is_binary != ""),"filesystem",is_registry != "", "registry",is_process != "", "process", path="/api/auth" OR path="/api/logout","AAA",path="/api/v1/settings/global/advanced","EDR")
EVAL-file_name = if(is_edr_file != "" OR is_binary != "", COALESCE(file_name_transformed,file_name), null())
EVAL-file_path = if(is_edr_file != "" OR is_binary != "", COALESCE(replace(file_path_transformed,"\\\\(.)","\1"),file_path), null())
EVAL-registry_path = if(is_registry != "", path,null())
EVAL-registry_key = if(is_registry != "", registry_key,null())
EVAL-registry_key_name = if(is_registry != "", registry_key,null())
EVAL-registry_value = if(is_registry != "",COALESCE(registry_value,file_name),null())
EVAL-registry_hive = if(is_registry != "",case(match(path,"registry\\\machine\\\software\\\classes"),"HKEY_CLASSES_ROOT",match(path,"registry\\\machine\\\system"),"HKEY_LOCAL_MACHINE\\\\System",match(path,"registry\\\machine\\\sam"),"HKEY_LOCAL_MACHINE\\\\SAM",match(path,"registry\\\machine\\\software"),"HKEY_LOCAL_MACHINE\\\\Software",match(path,"registry\\\user"),"HKEY_USERS"),null())
EVAL-registry_value_name = if(is_registry != "",COALESCE(registry_value,file_name),null())
EVAL-object_path = case(is_file!="",file_path,is_registry!="",COALESCE(registry_path,file_path))
FIELDALIAS-vendor_action = action as vendor_action
LOOKUP-bit9_cbs_actions_lookup = bit9_cbs_actions_lookup vendor_action OUTPUTNEW action
EVAL-dest_ip = case(direction == "outbound",remote_ip,direction == "inbound",local_ip,true(),COALESCE(ipv4,comms_ip))
EVAL-dest_translated_ip = case(direction == "outbound",remote_ip,direction == "inbound",local_ip,true(),ipv4)
EVAL-dest = case(vendor_type IN ("binaryinfo.observed","binaryinfo.group.observed"),dest_from_link_md5,vendor_type IN ("binarystore.file.added","binaryinfo.observed","binaryinfo.group.observed","task.error.logged","feed.synchronized") OR isnotnull(is_useractivity),cb_server,direction == "outbound",remote_ip,direction == "inbound",local_ip,vendor_type IN ("feed.storage.hit.process"),computer_name,domain!="",domain,true(),COALESCE(ipv4, endpoint, host_name, server_name, computer_name))
EVAL-status = case(vendor_type=="audit.log.useractivity" AND status=="200","success",vendor_type=="audit.log.useractivity" AND status!="200" AND status!="201","failure",status=="Unresolved" OR vendor_type=="ingress.event.regmod","success",true(),status)
EVAL-src = COALESCE(hostname, computer_name,case(isnotnull(is_useractivity),ip),endpoint)
EVAL-src_ip = case(direction == "outbound",local_ip,direction == "inbound",remote_ip)
EVAL-src_translated_ip = case(direction == "outbound",local_ip,direction == "inbound",remote_ip)
EVAL-dest_port = case(direction == "outbound",COALESCE(remote_port,port),direction == "inbound",local_port)
EVAL-src_port = case(direction == "outbound",local_port,direction == "inbound",COALESCE(remote_port,port))
EVAL-dest_translated_port = case(direction == "outbound",COALESCE(remote_port,port),direction == "inbound",local_port)
EVAL-src_translated_port = case(direction == "outbound",local_port,direction == "inbound",COALESCE(remote_port,port))
EVAL-transport = case(protocol=="6" OR Protocol=="6","tcp",protocol=="17" OR Protocol=="17","udp",protocol=="1" OR Protocol=="1","icmp",true(),"unknown")
EVAL-protocol = case(is_network=="netconn" AND (protocol=="1" OR Protocol=="1"),"icmp",is_network=="netconn","ip",true(),null())
EVAL-protocol_version = case(is_network=="netconn" AND isnotnull(local_ip),if(match(local_ip,":"),"ipv6","ipv4"), is_network=="netconn" AND isnotnull(remote_ip),if(match(remote_ip,":"),"ipv6","ipv4"))
EVAL-category = if(is_alert!="" OR alert_type!="",COALESCE(watchlist_name,report_id),null())
EVAL-ids_type = if(is_alert!="" OR alert_type!="","host",null())
REPORT-message_info = carbonblack_message_transform
FIELDALIAS-command = method as command
FIELDALIAS-object_attrs = path as object_attrs
FIELDALIAS-result = status as result
FIELDALIAS-result_id = status as result_id
EVAL-object = case(vendor_type=="audit.log.useractivity" AND path=="/api/logout",username,is_file!="",file_name,is_registry!="", COALESCE(registry_key,file_name),true(),cb_server)
EVAL-object_category = case(vendor_type=="audit.log.useractivity" AND path=="/api/logout","user",true(),cb_server)
FIELDALIAS-src_user = username as src_user
FIELDALIAS-src_user_name = username as src_user_name
EVAL-object_id = case(vendor_type=="audit.log.useractivity" AND path=="/api/logout",userid)
