[netskope_connection]
definition = eventtype=netskope_connection

[netskope_web]
definition = eventtype=netskope_web

[netskope_application]
definition = eventtype=netskope_application

[netskope_network]
definition = eventtype=netskope_network

[netskope_audit]
definition = eventtype=netskope_audit

[netskope_alert]
definition = eventtype=netskope_alert

[netskope_infrastructure]
definition = eventtype=netskope_infrastructure

[netskope_api]
definition = eventtype=netskope_api

[netskope_configured_inputs]
definition = tstats count where sourcetype=netskope:* NOT sourcetype=netskope:web_transaction by host | fields host

[netskope_network_detail(11)]
args = selected_host, selected_user, selected_app, selected_dest_port, selected_os_version, selected_protocol, selected_policy, selected_ccl, selected_device, selected_os, selected_method
definition = `netskope_network` | fillnull value="" access_method ccl device host os user app dest_port | search host="$selected_host$" user="$selected_user$" app="$selected_app$" dest_port="$selected_dest_port$" os_version="$selected_os_version$" protocol="$selected_protocol$" policy="$selected_policy$" ccl="$selected_ccl$" device="$selected_device$" os="$selected_os$" access_method="$selected_method$" | rename _time as "Time", user as "User", protocol as "Protocol", userip as "User IP", dest_port as "Destination Port", app as "Host", policy as "Policy", access_method as "Access Method", os as "OS", os_version as "OS Version", device as "Device", ccl as "CCL", traffic_type as "Traffic Type", network_session_id as "Network Session ID", session_duration as "Session Duration", client_bytes as "Client Bytes", server_bytes as "Server Bytes", client_packets as "Client Packets", server_packets as "Server Packets" | table "Time", "User", "Protocol", "User IP", "Destination Port", "Host", "Policy", "Access Method", "OS", "OS Version", "Device", "CCL", "Traffic Type", "Network Session ID", "Session Duration", "Client Bytes", "Server Bytes", "Client Packets", "Server Packets"

[netskope_application_detail(9)]
args = selected_activity, selected_host, selected_user, selected_ccl, selected_device, selected_device_classification, selected_browser, selected_os, selected_method
definition = `netskope_application` | fillnull value="" access_method activity browser ccl device device_classification host os user | search activity="$selected_activity$" host="$selected_host$" user="$selected_user$" ccl="$selected_ccl$" device="$selected_device$" device_classification="$selected_device_classification$" browser="$selected_browser$" os="$selected_os$" access_method="$selected_method$" | table _time, user, userip, access_method, activity, os, browser, device, device_classification, ccl, traffic_type, app_session_id, connection_id, app_session_key

[netskope_application_detail_search_by_app_session(1)]
args = key
definition = (`netskope_application` OR `netskope_connection`) app_session_key=$key$ | table _time, app, appcategory, activity, alert, src_ip, src_location, src_region, dest_ip, dst_location, dst_region, url, client_bytes, server_bytes, app_session_id, connection_id

[netskope_connection_detail(6)]
args = selected_host, selected_user, selected_ccl, selected_device, selected_access_method, selected_browser
definition = `netskope_connection` host="$selected_host$" user="$selected_user$" ccl="$selected_ccl$" device="$selected_device$" access_method="$selected_access_method$" browser="$selected_browser$" | table _time, user, userip, src_location, app, appcategory, device, access_method, os, browser, ccl, client_bytes, server_bytes,

[netskope_alert_detail(9)]
args = selected_host, selected_user, selected_app, selected_alert_type, selected_method, selected_dlp_profile, selected_dlp_rule, selected_dlp_rule_severity, selected_policy
definition = `netskope_alert` | fillnull value="" access_method alert_type app host user dlp_profile dlp_rule dlp_rule_severity policy | search host="$selected_host$" user="$selected_user$" app="$selected_app$" alert_type="$selected_alert_type$" access_method="$selected_method$" dlp_profile="$selected_dlp_profile$" dlp_rule="$selected_dlp_rule$" dlp_rule_severity="$selected_dlp_rule_severity$" policy="$selected_policy$" | eval policy_type = policy | eval dlprule = dlp_rule | eval dlpprofile = dlp_profile | eval dlpruleseverity = dlp_rule_severity| eval dlpfile = dlp_file | eval filesize = file_size | eval filetype = file_type | rename user AS User userip AS "User IP" access_method AS "Access Method" app AS App appcategory AS "App Category" traffic_type AS "Traffic Type" activity AS Activity alert_type AS "Alert Type" alert_name AS "Alert Name" dlprule AS "DLP Rule" dlpprofile AS "DLP Profile" dlpruleseverity AS "DLP Severity" dlpfile AS "DLP File" filesize AS "File_Size" filetype AS "File Type" policy_type AS Policy | table _time, User, "User IP", "Access Method", App, "App Category", "Traffic Type", Activity, "Alert Type", "Alert Name", Policy, "DLP Rule", "DLP Profile", "DLP Severity", "DLP File", "File Size", "File Type"

[netskope_last_checkpoint]
definition = `netskope_api` action=save_checkpoint | dedup input_name, type  | convert timeformat="%m/%d/%Y %H:%M:%S" ctime(checkpoint_value) AS "Checkpoint Time" | rename type as "Event Type", input_name as "Input Name", hostname as host | table host "Input Name" "Event Type" "Checkpoint Time" | sort 0 "Input Name"

[netskope_last_5_checkpoints_by_event_type(2)]
args = selected_host, selected_event_type
definition = `netskope_api` hostname="$selected_host$" type="$selected_event_type$" | search action=collected_data | dedup input_name, type | head 5 | convert timeformat="%m/%d/%Y %H:%M:%S" ctime(checkpoint_value) AS "Checkpoint Time" | rename type as "Event Type", input_name as "Input Name", hostname as host, total_indexed as "Total Events" | table host "Input Name" "Event Type" "Checkpoint Time", "Total Events" | sort 0 "Input Name"

[netskope_infrastructure_detail(3)]
args = selected_host, selected_device, selected_severity
definition = `netskope_infrastructure` severity="$selected_severity$" device="$selected_device$" host="$selected_host$" | table _time, host, device, serial, alarm_name, severity, alarm_description

[summariesonly]
definition = summariesonly=false
iseval = 0