[SOC Prime Attack Detective Data Audit EventCodes with Indexes - Filling the Trend]
action.email.show_password = 1
action.email.useNSSubject = 1
action.keyindicator.invert = 0
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.forceCsvResults = 1
action.risk.param.verbose = 0
action.webhook.enable_allowlist = 0
alert.track = 0
dispatch.earliest_time = -15m
dispatch.latest_time = now
display.general.type = statistics
display.page.search.tab = statistics
request.ui_dispatch_view = search
search = | tstats count where index=* AND index!=socprime groupby index,_time,sourcetype span=1d\
| rename sourcetype as Sourcetype, index as Index\
| lookup field_from_sourcetype Sourcetype OUTPUT field_name\
| eval field_name = if(isnotnull(field_name), field_name,"-")\
| where field_name = "-"\
| rename Sourcetype as sourcetype, Index as index \
| fields + _time, index, sourcetype\
| tojson output_field="result"\
| rex mode=sed field=result "s/\"/'/g"\
| fields + _time, index, sourcetype, result\
| append [\
| tstats count, max(_time) as latest, min(_time) as earliest where index=* AND index!=socprime groupby index,_time,sourcetype span=1d\
| rename sourcetype as Sourcetype, index as Index\
| lookup field_from_sourcetype Sourcetype OUTPUT field_name\
| where field_name != "-"\
| eval field_name = if(isnotnull(field_name), field_name,"-")\
| eval field_name=mvindex(field_name,0)\
| table Index, Sourcetype, field_name, earliest,latest, _time\
| dynamicsearch thread_count=5\
| where results != "[]"\
| rex mode=sed field=results "s/}, {/}#{/g"\
| rex mode=sed field=results "s/^\[//g"\
| rex mode=sed field=results "s/\]$//g"\
| makemv delim="#" results\
| mvexpand results\
| rename results as result, Sourcetype as sourcetype, Index as index\
| rex mode=sed field=result "s/\"/'/g"\
| fields + _time, result \
]\
| eval type = "socprime_attack_detective_data_audit_eventcodes_and_indexes"\
| table _time, type, result\
| collect index=socprime source=tasocprimeattackdetectiveappforsplunk:log sourcetype=tasocprimeattackdetectiveappforsplunk:log addtime=true addinfo=false uselb=false

[SOC Prime Attack Detective Data Audit EventCodes with Indexes]
action.email.show_password = 1
action.keyindicator.invert = 0
action.logevent = 1
action.logevent.param.event = type = "socprime_attack_detective_data_audit_eventcodes_and_indexes" result=$result.result$
action.logevent.param.index = socprime
action.logevent.param.source = tasocprimeattackdetectiveappforsplunk:log
action.logevent.param.sourcetype = tasocprimeattackdetectiveappforsplunk:log
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.forceCsvResults = 1
action.risk.param.verbose = 0
action.webhook.enable_allowlist = 0
alert.digest_mode = 0
alert.suppress = 0
alert.track = 0
counttype = number of events
cron_schedule = 00 * * * *
dispatch.earliest_time = -60m@m
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","search"]
display.general.type = statistics
display.page.search.mode = fast
display.page.search.tab = statistics
display.visualizations.charting.chart = line
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = TA-soc-prime-attack-detective-app-for-splunk
request.ui_dispatch_view = search
search = | tstats count where index=* AND index!=socprime groupby index,sourcetype\
| rename sourcetype as Sourcetype, index as Index\
| lookup field_from_sourcetype Sourcetype OUTPUT field_name\
| eval field_name = if(isnotnull(field_name), field_name,"-")\
| where field_name = "-"\
| rename Sourcetype as sourcetype, Index as index \
| fields + index, sourcetype\
| tojson output_field="result"\
| rex mode=sed field=result "s/\"/'/g"\
| fields + index, sourcetype, result\
| append [\
| tstats count, max(_time) as latest, min(_time) as earliest where index=* AND index!=socprime groupby index, sourcetype\
     | rename sourcetype as Sourcetype, index as Index\
     | lookup field_from_sourcetype Sourcetype OUTPUT field_name\
     | eval field_name = if(isnotnull(field_name), field_name, "-")\
     | where field_name != "-" \
     | eval field_name=mvindex(field_name, 0)\
     | eval earliest = earliest - 1\
     | eval latest = latest + 1\
     | table Index, Sourcetype, field_name, earliest,latest\
     | dynamicsearch thread_count=5\
     | where results != "[]"\
     | rex mode=sed field=results "s/}, {/}#{/g"\
     | rex mode=sed field=results "s/^\[//g"\
     | rex mode=sed field=results "s/\]$//g"\
     | makemv delim="#" results\
     | mvexpand results\
     | rename results as result, Sourcetype as sourcetype, Index as index\
     | fields + index, sourcetype, result\
     ]
