[Lookup Parent Process]
display_location = event_menu
fields = parent_process_guid
label = Lookup Parent Process
search.app = AddOn-JamfProtect
search.earliest = -24h
search.preserve_timerange = 0
# Set Index when implementing in your organization
search.search_string = index="*" eventtype=jamf_protect_telemetry_exec process_guid="$parent_process_guid$"
search.target = blank
type = search

[Lookup Responsible Process]
display_location = event_menu
fields = responsible_process_guid
label = Lookup Responsible Process
search.app = AddOn-JamfProtect
search.earliest = -24h
search.preserve_timerange = 0
# Set Index when implementing in your organization
search.search_string = index="*" eventtype=jamf_protect_telemetry_exec process_guid="$responsible_process_guid$"
search.target = blank
type = search

[Lookup Child Processes]
display_location = event_menu
fields = process_guid
label = Lookup Child Processes
search.earliest = -24h
search.preserve_timerange = 0
# Set Index when implementing in your organization
search.search_string = index="*" eventtype=jamf_protect_telemetry_exec parent_process_guid="$process_guid$"
search.target = blank
type = search

[Lookup Sibling Processes]
display_location = event_menu
fields = parent_process_guid
label = Lookup Sibling Processes
search.earliest = -24h
search.preserve_timerange = 0
# Set Index when implementing in your organization
search.search_string = index="*" eventtype=jamf_protect_telemetry_exec parent_process_guid="$parent_process_guid$"
search.target = blank
type = search

# Deprecated
[Telemetry lookup]
display_location = event_menu
fields = serial
label = Telemetry Lookup
search.preserve_timerange = 1
# Set Index when implementing in your organization
search.search_string = index="*" (sourcetype=jamf:protect:alerts OR sourcetype=jamf:protect:telemetry:*) | eval serial = coalesce('input.host.serial', 'host_info.serial_number') | eval signature = coalesce('input.match.event.matchValue',mvdedup(XProtectSignatureName),'input.match.facts{}.name')| search signature=$signature$ | map search="search index=* sourcetype=jamf:protect:telemetry:* serial=$serial$" | table  _time dest header.event_name return.description subject.effective_user_name subject.audit_user_name subject.terminal_id.ip_address subject.process_name exec_chain_child.parent_path exec_args.args_compiled
search.target = blank
type = search

