##############################################################################
# THREAT DATA REPORT (TDR) PARSING
##############################################################################

[threat]
category = Custom
TRANSFORMS-devicehostname_ns = protecthostname_ns
INDEXED_EXTRACTIONS = json
KV_MODE = none
AUTO_KV_JSON = false
NO_BINARY_CHECK = 1
TIMESTAMP_FIELDS = "Last Found"
pulldown_type = 1
# CIM Tagging
LOOKUP-action = protect_cim_status_to_action_lookup "File Status" OUTPUT action
FIELDALIAS-classification = Classification AS category
FIELDALIAS-lastFound = "Last Found" AS date
FIELDALIAS-deviceName = "DeviceName" AS dest
FIELDALIAS-fileHash = "SHA256" AS file_hash
FIELDALIAS-fileName = "File Name" AS file_name
FIELDALIAS-filePath = "File Path" AS file_path
FIELDALIAS-classification2 = Classification AS signature
FIELDALIAS-detectedBy = "Detected By" AS src
FIELDALIAS-fileOwner = "File Owner" AS user
EVAL-vendor_product = "CylancePROTECT"

[device]
category = Custom
TRANSFORMS-devicehostname = protecthostname
INDEXED_EXTRACTIONS = json
KV_MODE = none
AUTO_KV_JSON = false
NO_BINARY_CHECK = 1
TIMESTAMP_FIELDS = "Last Communicated"
pulldown_type = 1
# CIM Tagging
FIELDALIAS-dest = "Device Name" AS dest
FIELDALIAS-dest_bunit = "Zones" AS dest_bunit
FIELDALIAS-dest_category = "Policy" AS dest_category
FIELDALIAS-ip = "IP Addresses" AS ip
FIELDALIAS-mac = "Mac Addresses" AS mac
FIELDALIAS-os = "OS Version" AS os
FIELDALIAS-user = "Last Reported User" AS user

[threat_indicator]
category = Custom
INDEXED_EXTRACTIONS = json
KV_MODE = none
AUTO_KV_JSON = false
NO_BINARY_CHECK = 1
TIMESTAMP_FIELDS = time
pulldown_type = 1

[event]
category = Custom
TRANSFORMS-eventhostname = protecthostname
INDEXED_EXTRACTIONS = json
KV_MODE = none
AUTO_KV_JSON = false
NO_BINARY_CHECK = 1
TIMESTAMP_FIELDS = "Date"
pulldown_type = 1


##############################################################################
# SYSLOG PARSING
##############################################################################

[syslog_protect]
TRANSFORMS-changesourcetype = set_auditlog_sourcetype
TRANSFORMS-changesourcetype2 = set_threatclassification_sourcetype
TRANSFORMS-changesourcetype3 = set_exploit_sourcetype
TRANSFORMS-changesourcetype4 = set_appcontrol_sourcetype
TRANSFORMS-changesourcetype5 = set_threat_sourcetype
TRANSFORMS-changesourcetype6 = set_device_sourcetype
TRANSFORMS-changesourcetype7 = set_devicecontrol_sourcetype
TRANSFORMS-changesourcetype8 = set_scriptcontrol_sourcetype
TRANSFORMS-changesourcetype9 = set_optics_sourcetype
TRANSFORMS-console_syslog_hostname = protecthostname_syslog
NO_BINARY_CHECK = true
category = Custom
description = CylancePROTECT Syslog Data
disabled = false
pulldown_type = true
# Common
EXTRACT-EventType = Event\sType:\s+(?P<EventType>\w+)
EXTRACT-EventName = Event\sName:\s+(?P<EventName>\w+)
EXTRACT-SHA256 = \sSHA256:\s(?<SHA256>[^,]*+)
EXTRACT-FilePath = Path:\s+(?P<FilePath>[^,]+)
FIELDALIAS-source = "source" AS Tenant


[syslog_device_control]
# Device Control
NO_BINARY_CHECK = true
category = Custom
description = CylancePROTECT Syslog Device Control
disabled = false
pulldown_type = true
TRANSFORMS-console_syslog_hostname = protecthostname_syslog
EXTRACT-EventName = Event\sName:\s(?P<EventName>.*?),
EXTRACT-DeviceName = Device\sName:\s(?P<DeviceName>.*?),
EXTRACT-ExternalDeviceType = External\sDevice\sType:\s(?P<ExternalDeviceType>.*?),
EXTRACT-ExternalDeviceVendorID = External\sDevice\sVendor\sID:\s(?P<ExternalDeviceVendorID>.*?),
EXTRACT-ExternalDeviceName = External\sDevice\sName:\s(?P<ExternalDeviceName>.*?),
EXTRACT-ExternalDeviceProductID = External\sDevice\sProduct\sID:\s(?P<ExternalDeviceProductID>.*?),
EXTRACT-ExternalDeviceSN = External\sDevice\sSerial\sNumber:\s(?P<ExternalDeviceSN>.*?),
EXTRACT-ZoneNames = \sZone\sNames:\s\((?P<ZoneNames>.*?)\)
EXTRACT-DeviceID = Device\sId:\s(?<DeviceID>(\w){8}-(\w){4}-(\w){4}-(\w){4}-(\w){12})
EXTRACT-PolicyName = Policy\sName:\s(?<PolicyName>.*)
# CIM Tagging
FIELDALIAS-category = "Action" AS category
FIELDALIAS-action = "EventName" AS action
FIELDALIAS-dest = "host" AS dest
FIELDALIAS-source = "source" AS Tenant


[syslog_app_control]
# Application Control
NO_BINARY_CHECK = true
category = Custom
description = CylancePROTECT Syslog App Control
disabled = false
pulldown_type = true
TRANSFORMS-console_syslog_hostname = protecthostname_syslog
EXTRACT-DeviceName = Device\sName:\s+(?P<DeviceName>.*?),
EXTRACT-EventType = Event\sType:\s+(?P<EventType>.*?),
EXTRACT-EventName = Event\sName:\s+(?P<EventName>.*?),
EXTRACT-SHA256 = \sSHA256:\s(?<SHA256>[^,]*+)
#EXTRACT-FilePath = (?=[^P]*(?:Path:|P.*Path:))^(?:[^,\n]*,){5}\s+\w+:\s+(?P<FilePath>[^,]+)
EXTRACT-FilePath = \sFile\sPath:\s(?<FilePath>.*?),\s
#EXTRACT-IP = (?=[^I]*(?:IP Address:|I.*IP Address:))^[^\(\n]*\((?P<IP>[^\)]+)
EXTRACT-IPv4 = \sIP\sAddress:\s\((?<ipv4>\d{1,3}\.\d{1,3}\.\d{1,3}\.\d{1,3}(,\s\d{1,3}\.\d{1,3}\.\d{1,3}\.\d{1,3})*)
EXTRACT-IPv6 = \sIP\sAddress:\s\(.*?(?<ipv6>(([0-9a-fA-F]{1,4}:){7,7}[0-9a-fA-F]{1,4}|([0-9a-fA-F]{1,4}:){1,7}:|([0-9a-fA-F]{1,4}:){1,6}:[0-9a-fA-F]{1,4}|([0-9a-fA-F]{1,4}:){1,5}(:[0-9a-fA-F]{1,4}){1,2}|([0-9a-fA-F]{1,4}:){1,4}(:[0-9a-fA-F]{1,4}){1,3}|([0-9a-fA-F]{1,4}:){1,3}(:[0-9a-fA-F]{1,4}){1,4}|([0-9a-fA-F]{1,4}:){1,2}(:[0-9a-fA-F]{1,4}){1,5}|[0-9a-fA-F]{1,4}:((:[0-9a-fA-F]{1,4}){1,6})|:((:[0-9a-fA-F]{1,4}){1,7}|:)|fe80:(:[0-9a-fA-F]{0,4}){0,4}%[0-9a-zA-Z]{1,}|::(ffff(:0{1,4}){0,1}:){0,1}((25[0-5]|(2[0-4]|1{0,1}[0-9]){0,1}[0-9])\.){3,3}(25[0-5]|(2[0-4]|1{0,1}[0-9]){0,1}[0-9])|([0-9a-fA-F]{1,4}:){1,4}:((25[0-5]|(2[0-4]|1{0,1}[0-9]){0,1}[0-9])\.){3,3}(25[0-5]|(2[0-4]|1{0,1}[0-9]){0,1}[0-9])))
EXTRACT-ZoneNames = \sZone\sNames:\s\((?P<ZoneNames>.*?)\)
EXTRACT-Action = (?=[^A]*(?:Action:|A.*Action:))^[^\)\n]*\),\s+\w+:\s+(?P<Action>\w+)
EXTRACT-ActionType = \sAction\sType:\s((?P<ActionType>[^)]+))
FIELDALIAS-source = "source" AS Tenant
EXTRACT-DeviceID = Device\sId:\s(?<DeviceID>(\w){8}-(\w){4}-(\w){4}-(\w){4}-(\w){12})
EXTRACT-PolicyName = Policy\sName:\s(?<PolicyName>.*)
# Malware CIM Tagging
LOOKUP-appcontrol_action = protect_cim_actiontype_to_action_lookup "Action Type" OUTPUT action
FIELDALIAS-category = "Action" AS category
FIELDALIAS-category_action = "Action" AS action
FIELDALIAS-dest = "host" AS dest
FIELDALIAS-file_hash = "SHA256" AS file_hash
FIELDALIAS-file_path = "FilePath" AS file_path

[syslog_audit_log]
# Audit log
NO_BINARY_CHECK = true
category = Custom
description = CylancePROTECT Syslog Audit Log
disabled = false
pulldown_type = true
EXTRACT-EventType = Event\sType:\s+(?P<EventType>\w+)
EXTRACT-EventName = Event\sName:\s+(?P<EventName>\w+)
EXTRACT-Category = Category:\s(?P<Category>.*?),
EXTRACT-Message = (?=[^M]*(?:Message:|M.*Message:))^(?:[^:\n]*:){9}\s+(?P<Message>[^,]+)
EXTRACT-Reason = \sReason:\s((?P<Reason>[^)]+))
#EXTRACT-User = (?=[^U]*(?:User:|U.*User:))^[^\(\n]*\((?P<User>\w+@\w+\.\w+)
EXTRACT-UserName = User:\s(?<UserName>.*?\))
EXTRACT-ipv4 = Source\sIP:\s(?<ipv4>.*?),
EXTRACT-DeviceName = Device:\s(?<DeviceName>.*?)(,|;)
EXTRACT-Provider = Provider:\s(?<Provider>.*?),
EXTRACT-SHA256 = SHA256:\s(?<SHA256>.*?);
EXTRACT-agent_version = Agent\sVersion:\s+(?P<agent_version>.*?),
EXTRACT-tier = Tier:\s+(?P<tier>.*?);
FIELDALIAS-source = "source" AS Tenant
# CIM Tagging
EVAL-app = "cylance"
FIELDALIAS-body = "Message" AS body
EVAL-severity = "informational"
FIELDALIAS-src = "User" AS src
FIELDALIAS-src_category  = "Reason" AS src_category
FIELDALIAS-subject = "EventName" AS subject
EVAL-type = "event"

[syslog_device]
# Devices
NO_BINARY_CHECK = true
category = Custom
description = CylancePROTECT Syslog Device
disabled = false
pulldown_type = true
# Common
EXTRACT-EventType = Event\sType:\s+(?P<EventType>\w+)
EXTRACT-EventName = Event\sName:\s+(?P<EventName>.*?),
EXTRACT-DeviceName = \sDevice\sName:\s(?<DeviceName>.*?),\s
EXTRACT-DeviceRenamed = \sRenamed:\s(?<DeviceName>\'.*?\'),\s
EXTRACT-AgentVersion = \sAgent\sVersion:\s(?<AgentVersion>.*?),\s
EXTRACT-ZoneNames = \sZone\sNames:\s\((?P<ZoneNames>.*?)\)
EXTRACT-IPv4 = \sIP\sAddress:\s\((?<ipv4>\d{1,3}\.\d{1,3}\.\d{1,3}\.\d{1,3}(,\s\d{1,3}\.\d{1,3}\.\d{1,3}\.\d{1,3})*)
EXTRACT-IPv6 = \sIP\sAddress:\s\(.*?(?<ipv6>(([0-9a-fA-F]{1,4}:){7,7}[0-9a-fA-F]{1,4}|([0-9a-fA-F]{1,4}:){1,7}:|([0-9a-fA-F]{1,4}:){1,6}:[0-9a-fA-F]{1,4}|([0-9a-fA-F]{1,4}:){1,5}(:[0-9a-fA-F]{1,4}){1,2}|([0-9a-fA-F]{1,4}:){1,4}(:[0-9a-fA-F]{1,4}){1,3}|([0-9a-fA-F]{1,4}:){1,3}(:[0-9a-fA-F]{1,4}){1,4}|([0-9a-fA-F]{1,4}:){1,2}(:[0-9a-fA-F]{1,4}){1,5}|[0-9a-fA-F]{1,4}:((:[0-9a-fA-F]{1,4}){1,6})|:((:[0-9a-fA-F]{1,4}){1,7}|:)|fe80:(:[0-9a-fA-F]{0,4}){0,4}%[0-9a-zA-Z]{1,}|::(ffff(:0{1,4}){0,1}:){0,1}((25[0-5]|(2[0-4]|1{0,1}[0-9]){0,1}[0-9])\.){3,3}(25[0-5]|(2[0-4]|1{0,1}[0-9]){0,1}[0-9])|([0-9a-fA-F]{1,4}:){1,4}:((25[0-5]|(2[0-4]|1{0,1}[0-9]){0,1}[0-9])\.){3,3}(25[0-5]|(2[0-4]|1{0,1}[0-9]){0,1}[0-9])))
EXTRACT-SHA256 = \sSHA256:\s(?<SHA256>[^,]*+)
EXTRACT-FilePath = Path:\s+(?P<FilePath>[^,]+)
FIELDALIAS-source = "source" AS Tenant
EXTRACT-MAC = (?=[^M]*(?:MAC Address:|M.*MAC Address:))^(?:[^\(\n]*\(){2}(?P<MAC>[^\)]+)
EXTRACT-LoggedOnUser = (?=[^L]*(?:Logged On Users:|L.*Logged On Users:))^(?:[^\(\n]*\(){3}(?P<LoggedOnUser>[^\)]+)
EXTRACT-User = User:\s(?P<User>.*?),
EXTRACT-OS = OS:\s(?P<OS>.*),\s
EXTRACT-DeviceNames = (?=[^D]*(?:Device Names:|D.*Device Names:))^[^\(\n]*\((?P<DeviceName>[^\)]+)
EXTRACT-Device = Device:\s(?<DeviceName>.*?)\;
EXTRACT-DeviceID = Device\sId:\s(?<DeviceID>(\w){8}-(\w){4}-(\w){4}-(\w){4}-(\w){12})
EXTRACT-PolicyName = Policy\sName:\s(?<PolicyName>.*)
# TODO: Device Updated
EXTRACT-Policy = Policy\sName:\s(?P<Policy>.*?),
EXTRACT-PolicyChange = Policy\sChanged:\s\'.*?\'\sto\s\'(?P<Policy>.*?)\'
# Inventory CIM Tagging
FIELDALIAS-mac = "MAC" AS mac
FIELDALIAS-os = "OS" AS os
FIELDALIAS-loguser = "LoggedOnUser" as user
FIELDALIAS-User = User as user
FIELDALIAS-devicename = DeviceName as dest_name
FIELDALIAS-ipv4 = ipv4 as dest_ip

[syslog_exploit]
# Memory Protection
NO_BINARY_CHECK = true
category = Custom
description = CylancePROTECT Syslog Exploit Attempt
disabled = false
pulldown_type = true
TRANSFORMS-console_syslog_hostname = protecthostname_syslog
EXTRACT-EventType = Event\sType:\s+(?P<EventType>\w+)
EXTRACT-EventName = Event\sName:\s+(?P<EventName>\w+)
#EXTRACT-IP = (?=[^I]*(?:IP Address:|I.*IP Address:))^[^jk\(\n]*\((?P<IP>[^\)]+)
EXTRACT-IPv4 = \sIP\sAddress:\s\((?<ipv4>\d{1,3}\.\d{1,3}\.\d{1,3}\.\d{1,3}(,\s\d{1,3}\.\d{1,3}\.\d{1,3}\.\d{1,3})*)
EXTRACT-IPv6 = \sIP\sAddress:\s\(.*?(?<ipv6>(([0-9a-fA-F]{1,4}:){7,7}[0-9a-fA-F]{1,4}|([0-9a-fA-F]{1,4}:){1,7}:|([0-9a-fA-F]{1,4}:){1,6}:[0-9a-fA-F]{1,4}|([0-9a-fA-F]{1,4}:){1,5}(:[0-9a-fA-F]{1,4}){1,2}|([0-9a-fA-F]{1,4}:){1,4}(:[0-9a-fA-F]{1,4}){1,3}|([0-9a-fA-F]{1,4}:){1,3}(:[0-9a-fA-F]{1,4}){1,4}|([0-9a-fA-F]{1,4}:){1,2}(:[0-9a-fA-F]{1,4}){1,5}|[0-9a-fA-F]{1,4}:((:[0-9a-fA-F]{1,4}){1,6})|:((:[0-9a-fA-F]{1,4}){1,7}|:)|fe80:(:[0-9a-fA-F]{0,4}){0,4}%[0-9a-zA-Z]{1,}|::(ffff(:0{1,4}){0,1}:){0,1}((25[0-5]|(2[0-4]|1{0,1}[0-9]){0,1}[0-9])\.){3,3}(25[0-5]|(2[0-4]|1{0,1}[0-9]){0,1}[0-9])|([0-9a-fA-F]{1,4}:){1,4}:((25[0-5]|(2[0-4]|1{0,1}[0-9]){0,1}[0-9])\.){3,3}(25[0-5]|(2[0-4]|1{0,1}[0-9]){0,1}[0-9])))
EXTRACT-Action = Action:\s(?<Action>.*?),
EXTRACT-DeviceName = Device\sName:\s(?<DeviceName>.*?),
EXTRACT-PID = Process\sID:\s(?<PID>.*?),
EXTRACT-ProcessName = Process\sName:\s(?<ProcessName>.*?),
EXTRACT-UserName = User\sName:\s(?<UserName>.*?),
#EXTRACT-UserName = (?=[^U]*(?:User Name:|U.*User Name:))^(?:[^,\n]*,){7}\s+\w+\s+\w+:\s+(?P<User>\w+)
#EXTRACT-ViolationType = (?=[^V]*(?:Violation Type:|V.*Violation Type:))^(?:[^,\n]*,){8}\s+\w+\s+\w+:\s+(?P<ViolationType>\w+\s+\w+)
EXTRACT-ViolationType = Violation\sType:\s(?<ViolationType>.*?),
EXTRACT-ZoneNames = \sZone\sNames:\s\((?P<ZoneNames>.*?)\)
FIELDALIAS-source = "source" AS Tenant
EXTRACT-DeviceID = Device\sId:\s(?<DeviceID>(\w){8}-(\w){4}-(\w){4}-(\w){4}-(\w){12})
EXTRACT-PolicyName = Policy\sName:\s(?<PolicyName>.*)
# Malware CIM Tagging
LOOKUP-exploit_action = protect_cim_action_to_action_lookup "Action" OUTPUT action
FIELDALIAS-category = "ViolationType" AS category
FIELDALIAS-dest = "host" AS dest
FIELDALIAS-dest_ip = ipv4 AS dest_ip
FIELDALIAS-file_path = "ProcessName" AS file_path
FIELDALIAS-user = "UserName" AS user
EVAL-vendor_product = "CylancePROTECT"

[syslog_script_control]
# Script Control
NO_BINARY_CHECK = true
category = Custom
description = CylancePROTECT Syslog Script Control
disabled = false
pulldown_type = true
EXTRACT-EventType = Event\sType:\s+(?P<EventType>\w+)
EXTRACT-EventName = Event\sName:\s+(?P<EventName>\w+)
EXTRACT-DeviceName = \sDevice\sName:\s(?<DeviceName>.*?),\s
EXTRACT-FilePath = ^(?:[^,\n]*,){3}\s+(?P<FilePath>[^,]+)
EXTRACT-Interpreter = \sInterpreter:\s(?<Interpreter>.*?),\s
EXTRACT-InterpreterVersion = \sInterpreter\sVersion:\s(?<InterpreterVersion>.*?),\s
EXTRACT-ZoneNames = \sZone\sNames:\s\((?P<ZoneNames>.*?)\)
EXTRACT-UserName = User\sName:\s(?<UserName>.*?),
FIELDALIAS-source = "source" AS Tenant
EXTRACT-DeviceID = Device\sId:\s(?<DeviceID>(\w){8}-(\w){4}-(\w){4}-(\w){4}-(\w){12})
EXTRACT-PolicyName = Policy\sName:\s(?<PolicyName>.*)
# Malware CIM Tagging
FIELDALIAS-user = "UserName" AS user
FIELDALIAS-devicename = DeviceName as dest_name
FIELDALIAS-ipv4 = ipv4 as dest_ip
FIELDALIAS-file_path = FilePath as file_path
FIELDALIAS-EventName = EventName as action

[syslog_threat]
# Threats
NO_BINARY_CHECK = true
category = Custom
description = CylancePROTECT Syslog Threat
disabled = false
pulldown_type = true
# Common
EXTRACT-EventType = Event\sType:\s+(?P<EventType>\w+)
EXTRACT-EventName = Event\sName:\s+(?P<EventName>\w+)
EXTRACT-DeviceName = \sDevice\sName:\s(?<DeviceName>.*?),\s
EXTRACT-IPv4 = \sIP\sAddress:\s\((?<ipv4>\d{1,3}\.\d{1,3}\.\d{1,3}\.\d{1,3}(,\s\d{1,3}\.\d{1,3}\.\d{1,3}\.\d{1,3})*)
EXTRACT-IPv6 = \sIP\sAddress:\s\(.*?(?<ipv6>(([0-9a-fA-F]{1,4}:){7,7}[0-9a-fA-F]{1,4}|([0-9a-fA-F]{1,4}:){1,7}:|([0-9a-fA-F]{1,4}:){1,6}:[0-9a-fA-F]{1,4}|([0-9a-fA-F]{1,4}:){1,5}(:[0-9a-fA-F]{1,4}){1,2}|([0-9a-fA-F]{1,4}:){1,4}(:[0-9a-fA-F]{1,4}){1,3}|([0-9a-fA-F]{1,4}:){1,3}(:[0-9a-fA-F]{1,4}){1,4}|([0-9a-fA-F]{1,4}:){1,2}(:[0-9a-fA-F]{1,4}){1,5}|[0-9a-fA-F]{1,4}:((:[0-9a-fA-F]{1,4}){1,6})|:((:[0-9a-fA-F]{1,4}){1,7}|:)|fe80:(:[0-9a-fA-F]{0,4}){0,4}%[0-9a-zA-Z]{1,}|::(ffff(:0{1,4}){0,1}:){0,1}((25[0-5]|(2[0-4]|1{0,1}[0-9]){0,1}[0-9])\.){3,3}(25[0-5]|(2[0-4]|1{0,1}[0-9]){0,1}[0-9])|([0-9a-fA-F]{1,4}:){1,4}:((25[0-5]|(2[0-4]|1{0,1}[0-9]){0,1}[0-9])\.){3,3}(25[0-5]|(2[0-4]|1{0,1}[0-9]){0,1}[0-9])))
EXTRACT-SHA256 = \sSHA256:\s(?<SHA256>[^,]*+)
EXTRACT-FilePath = Path:\s+(?P<FilePath>[^,]+)
EXTRACT-DeviceID = Device\sId:\s(?<DeviceID>(\w){8}-(\w){4}-(\w){4}-(\w){4}-(\w){12})
EXTRACT-PolicyName = Policy\sName:\s(?<PolicyName>.*)
# Malware and Inventory CIM
FIELDALIAS-source = "source" AS Tenant
FIELDALIAS-filePath = "FilePath" AS file_path
FIELDALIAS-fileHash = "SHA256" AS file_hash
FIELDALIAS-deviceName = "host" AS dest
EVAL-vendor_product = "CylancePROTECT"
# Threat
EXTRACT-FileName = File\s\Name:\s+(?P<FileName>[^,]+)
EXTRACT-Status = Status:\s+(?P<Status>\w+)
EXTRACT-Score = Score:\s+(?P<Score>\d+)
EXTRACT-Found = Found\sDate:\s+(?P<Found>[^,]+)
EXTRACT-FileType = File\sType:\s+(?P<FileType>\w+)
EXTRACT-IsRunning = \sIs\sRunning:\s(?P<IsRunning>[^,]+)
EXTRACT-IsMalware = \sIs\sMalware:\s(?P<IsMalware>[^,]+)
EXTRACT-IsUnique = \sIs\sUnique\sTo\sCylance:\s(?P<IsUnique>[^,]+)
EXTRACT-AutoRun = \sAuto\sRun:\s(?P<AutoRun>[^,]+)
EXTRACT-DetectedBy = \sDetected\sBy:\s(?P<DetectedBy>[^,]+)
EXTRACT-ZoneNames = \sZone\sNames:\s\((?P<ZoneNames>.*?)\)
EXTRACT-ThreatClassification = \sThreat\sClassification:\s(?P<ThreatClassification>[^,]+)
# Malware CIM Tagging
LOOKUP-action = protect_cim_status1_to_action_lookup "Status" OUTPUT action
FIELDALIAS-fileName = "FileName" AS file_name
FIELDALIAS-detectedBy = "DetectedBy" AS src

[syslog_threat_classification]
# Threat Classifications
NO_BINARY_CHECK = true
category = Custom
description = CylancePROTECT Syslog Threat Classification
disabled = false
pulldown_type = true
EXTRACT-EventType = Event\sType:\s+(?P<EventType>\w+)
EXTRACT-EventName = Event\sName:\s+(?P<EventName>\w+)
EXTRACT-Class = (?=[^T]*(?:Threat Class:|T.*Threat Class:))^(?:[^:\n]*:){9}\s+(?P<Class>\w+)
EXTRACT-Subclass = (?=[^T]*(?:Threat Subclass:|T.*Threat Subclass:))^(?:[^:\n]*:){10}\s+(?P<Subclass>\w+)
EXTRACT-SHA256 = \sSHA256:\s(?<SHA256>[^,]*+)
FIELDALIAS-source = "source" AS Tenant
# CIM Tagging
# FIELDALIAS-fileHash = "SHA256" AS file_hash
# FIELDALIAS-threatcat = "Class" as category
# FIELDALIAS-subclass = "Subclass" as signature

[syslog_optics]
# Script Control
NO_BINARY_CHECK = true
category = Custom
description = CylancePROTECT Syslog Optics Events
disabled = false
pulldown_type = true
EXTRACT-EventType = Event\sType:\s+(?P<EventType>\w+)
EXTRACT-EventName = Event\sName:\s+(?P<EventName>\w+)
EXTRACT-DeviceName = \sDevice\sName:\s(?<DeviceName>.*?),\s
EXTRACT-EventId = \sEvent\sId:\s(?<EventId>.*?),\s
EXTRACT-Severity = \sSeverity:\s(?<Severity>.*?),\s
EXTRACT-Description = \sDescription:\s(?<Description>.*?),\s
EXTRACT-InstigatingProcessName = \sInstigating\sProcess\sName:\s(?<InstigatingProcessName>.*?),\s
EXTRACT-InstigatingProcessOwner = \sInstigating\sProcess\sOwner:\s(?<InstigatingProcessOwner>.*?),\s
EXTRACT-InstigatingProcessHash = \sInstigating\sProcess\sImageFileSha256:\s(?<InstigatingProcessHash>.*?)(,\s|$)
EXTRACT-TargetProcessName = \sTarget\sProcess\sName:\s(?<TargetProcessName>.*?),\s
EXTRACT-TargetProcessOwner = \sTarget\sProcess\sOwner:\s(?<TargetProcessOwner>.*?),\s
EXTRACT-TargetProcessHash = \sTarget\sProcess\sImageFileSha256:\s(?<TargetProcessHash>.*?)(,\s|$)
EXTRACT-TargetRegistryKeyPath = \sTarget\sRegistry\sKeyPath:\s(?<TargetRegistryKeyPath>.*?)(,\s|$)
EXTRACT-TargetRegistryValueName = \sTarget\sRegistry\sValueName:\s(?<TargetRegistryValueName>.*?),\s
EXTRACT-TargetFilePath = \sTarget\sFile\sPath:\s(?<TargetFilePath>.*?),\s
EXTRACT-TargetFileOwner = \sTarget\sFile\sOwner:\s(?<TargetFileOwner>.*?),\s
EXTRACT-TargetFileHash = \sTarget\sFile\sSha256:\s(?<TargetFileHash>.*?),\s
EXTRACT-DestinationIP = \sDestination\sIP:\s(?<DestinationIP>.*?),\s
EXTRACT-DestinationPort = \sDestination\sPort:\s(?<DestinationPort>.*?)(,\s|$)
EXTRACT-ZoneNames = \sZone\sNames:\s\((?P<ZoneNames>.*?)\)
EXTRACT-DeviceID = Device\sId:\s(?<DeviceID>(\w){8}-(\w){4}-(\w){4}-(\w){4}-(\w){12})
EXTRACT-PolicyName = Policy\sName:\s(?<PolicyName>.*)
# OpticsCaeWmiEvent specific
EXTRACT-ConsumerText = Consumer\sText:\s(?<ConsumerText>.*?),\sConsumer\sText\sLength:
EXTRACT-ConsumerTextLength = Consumer\sText\sLength:\s(?<ConsumerTextLength>.*?),\s
EXTRACT-Operation = Operation:\s(?<Operation>.*?),\sOperation\sLength:
EXTRACT-OperationLength = Operation\sLength:\s(?<OperationLength>.*?),\s

# OpticsCaeDnsEvent specific
EXTRACT-TargetDomainName = Target\sDomain\sName:\s(?<TargetDomainName>.*?),\s
EXTRACT-ResolvedAddress = Resolved\sAddress:\s(?<ResolvedAddress>.*?),\sResolved\sAddress\sCount:
EXTRACT-ResolvedAddressCount = Resolved\sAddress\sCount:\s(?<ResolvedAddressCount>.*?),\s

# OpticsPowershellTraceEvent specific
EXTRACT-ScriptBlockText = Script\sBlock\sText:\s(?<ScriptBlockText>.*?),\sScript\sBlock\sLength:
EXTRACT-ScriptBlockLength = Script\sBlock\sLength:\s(?<ScriptBlockLength>.*?),
EXTRACT-Payload = Payload:\s(?<Payload>.*?),\s
EXTRACT-PayloadLength = Payload\sLength:\s(?<PayloadLength>.*?),\s

# OpticsCaeLogEvent specific
EXTRACT-WindowsEventId = Windows\sEvent\sId:\s(?<WindowsEventId>.*?),\s
EXTRACT-SecurityProvider = Security\sProvider:\s(?<SecurityProvider>.*?),\s


# Malware CIM Tagging
FIELDALIAS-source = "source" AS Tenant
FIELDALIAS-devicename = DeviceName as dest_name
FIELDALIAS-DestIP = DestinationIP as dest_ip
FIELDALIAS-DestPort = DestinationPort as dest_port
FIELDALIAS-file_path = FilePath as file_path


