[SSH Traffic]
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","tag","Authentication.user","action","cef_cefVersion","cef_name","cef_product","cef_severity","cef_signature","cef_vendor","cef_version","cn1","cn1Label","date_hour","date_mday","date_minute","date_month","date_second","date_wday","date_year","date_zone","dest_ip","dest_port","deviceExternalId","deviceInboundInterface","dpt","dst","dvc","eventtype","ids_type","index","linecount","product","proto","punct","rule","rule_id","severity","shost","smac","sourceTranslatedAddress","splunk_server","spt","src","src_ip","src_port","suser","tag::eventtype","timeendpos","timestartpos","transport","user","vendor","version"]
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = line
display.visualizations.show = 0
request.ui_dispatch_app = CryptoniteNXT
request.ui_dispatch_view = search
search = | datamodel Network_Traffic All_Traffic search | search eventtype="nxt" act="ACCEPT" proto=6 dpt=22 \
| eval dhost=coalesce(All_Traffic.dest,dhost,All_Traffic.dest_ip,dst)\
| table _time, suser, shost, dhost, dpt

[RDP Traffic]
dispatch.earliest_time = -7d@h
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","tag","Authentication.user","action","cef_cefVersion","cef_name","cef_product","cef_severity","cef_signature","cef_vendor","cef_version","cn1","cn1Label","date_hour","date_mday","date_minute","date_month","date_second","date_wday","date_year","date_zone","dest_ip","dest_port","deviceExternalId","deviceInboundInterface","dpt","dst","dvc","eventtype","ids_type","index","linecount","product","proto","punct","rule","rule_id","severity","shost","smac","sourceTranslatedAddress","splunk_server","spt","src","src_ip","src_port","suser","tag::eventtype","timeendpos","timestartpos","transport","user","vendor","version"]
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = line
display.visualizations.show = 0
request.ui_dispatch_app = CryptoniteNXT
request.ui_dispatch_view = search
search = | datamodel Network_Traffic All_Traffic search | search eventtype="nxt" act="ACCEPT" proto=6 dpt=3389 \
| eval dhost=coalesce(All_Traffic.dest,dhost,All_Traffic.dest_ip,dst)\
| table _time, suser, shost, dhost, dpt

[NXT Interfaces]
dispatch.earliest_time = -30d@d
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","tag","Authentication.user","action","cef_cefVersion","cef_name","cef_product","cef_severity","cef_signature","cef_vendor","cef_version","cn1","cn1Label","date_hour","date_mday","date_minute","date_month","date_second","date_wday","date_year","date_zone","dest_ip","dest_port","deviceExternalId","deviceInboundInterface","dpt","dst","dvc","eventtype","ids_type","index","linecount","product","proto","punct","rule","rule_id","severity","shost","smac","sourceTranslatedAddress","splunk_server","spt","src","src_ip","src_port","suser","tag::eventtype","timeendpos","timestartpos","transport","user","vendor","version","act","dhost","dest"]
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.charting.chart = scatter
display.visualizations.show = 0
request.ui_dispatch_app = CryptoniteNXT
request.ui_dispatch_view = search
search = | datamodel Network_Sessions Session_Start search | search eventtype="nxt_policy_accept" | dedup deviceExternalId, deviceInboundInterface \
| sort by deviceExternalId, deviceInboundInterface \
| table deviceExternalId, deviceInboundInterface, shost

[NXT Event Counts]
action.email.useNSSubject = 1
alert.track = 0
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","tag","Authentication.user","action","cef_cefVersion","cef_name","cef_product","cef_severity","cef_signature","cef_vendor","cef_version","cn1","cn1Label","date_hour","date_mday","date_minute","date_month","date_second","date_wday","date_year","date_zone","dest_ip","dest_port","deviceExternalId","deviceInboundInterface","dpt","dst","dvc","eventtype","ids_type","index","linecount","product","proto","punct","rule","rule_id","severity","shost","smac","sourceTranslatedAddress","splunk_server","spt","src","src_ip","src_port","suser","tag::eventtype","timeendpos","timestartpos","transport","user","vendor","version"]
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = line
display.visualizations.show = 0
request.ui_dispatch_app = CryptoniteNXT
request.ui_dispatch_view = search
search = eventtype="nxt" | top 25 cef_signature, cef_name

[Event Count by sourcetype]
action.email.useNSSubject = 1
alert.track = 0
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","tag","Authentication.user","action","cef_cefVersion","cef_name","cef_product","cef_severity","cef_signature","cef_vendor","cef_version","cn1","cn1Label","date_hour","date_mday","date_minute","date_month","date_second","date_wday","date_year","date_zone","dest_ip","dest_port","deviceExternalId","deviceInboundInterface","dpt","dst","dvc","eventtype","ids_type","index","linecount","product","proto","punct","rule","rule_id","severity","shost","smac","sourceTranslatedAddress","splunk_server","spt","src","src_ip","src_port","suser","tag::eventtype","timeendpos","timestartpos","transport","user","vendor","version"]
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = line
display.visualizations.show = 0
request.ui_dispatch_app = CryptoniteNXT
request.ui_dispatch_view = search
search = | tstats count groupby sourcetype

[NXT Software Version]
dispatch.earliest_time = -30d@d
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","tag","Authentication.user","action","cef_cefVersion","cef_name","cef_product","cef_severity","cef_signature","cef_vendor","cef_version","cn1","cn1Label","date_hour","date_mday","date_minute","date_month","date_second","date_wday","date_year","date_zone","dest_ip","dest_port","deviceExternalId","deviceInboundInterface","dpt","dst","dvc","eventtype","ids_type","index","linecount","product","proto","punct","rule","rule_id","severity","shost","smac","sourceTranslatedAddress","splunk_server","spt","src","src_ip","src_port","suser","tag::eventtype","timeendpos","timestartpos","transport","user","vendor","version","act","dhost","dest"]
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = scatter
display.visualizations.show = 0
request.ui_dispatch_app = CryptoniteNXT
request.ui_dispatch_view = search
search = | datamodel Compute_Inventory Network search | search eventtype="nxt_node_reg" \
| stats latest(All_Inventory.version) as version latest(_time) as latest by dvchost, deviceExternalId \
| rename dvchost as node | convert ctime(latest) timeformat="%F %T %Z"
