[apic-fault-overview]
definition = tstats latest(Fault.ack) AS "ack"  latest(Fault.nameofnode) AS "node" latest(Fault.rule) AS "rule" latest(Fault.severity) AS "severity" latest(Fault.type) AS "type" latest(Fault.cause) AS "cause" latest(Fault.domain) AS "domain" latest(Fault.Tenant) AS "tenant" latest(Fault.created) AS "creationTime" latest(Fault.lastTransition) AS "lastTransition" latest(Fault.lc) AS "lifecycle" from datamodel=Fault groupby _time,Fault.dn, Fault.apic_host | rename Fault.dn AS dn, Fault.apic_host AS apic_host | reverse

[apic-fabric-overview]
definition = tstats latest(apic.ack) AS "ack" latest(apic.cause) AS "cause" latest(apic.domain) AS "domain" latest(apic.fabric.node) AS "nodeID" latest(apic.fabric.nameofnode) AS "node" latest(apic.rule) AS "rule" latest(apic.severity) AS "severity" values(apic.twScore) AS "health" latest(apic.cur) AS "CurrentHealth" latest(apic.type) AS "type" latest(apic.role) AS "Role" latest(apic.code) AS "code" latest(apic.id) AS "id" latest(apic.name) AS "name" latest(apic.descr) AS "description" latest(apic.fabric.lcSlot) AS "lcSlot" latest(apic.operSt) AS "state" latest(apic.ser) AS "ser" latest(apic.type) AS Type latest(apic.numP) AS "numP" latest(apic.speed) AS "speed" latest(apic.adSt) AS "adSt" latest(apic.model) AS "model" latest(apic.vendor) AS "vendor" latest(apic.macB) AS "macB" latest(apic.swCId) AS "swCId" latest(apic.volt) AS "volt" latest(apic.fabric.Interface) AS "Interface" latest(apic.rev) AS "Revision" latest(apic.created) AS "Fault Creation Time" latest(apic.normalizedLast) AS "normalizedLast" from datamodel=Health WHERE (apic.component=fabricNode OR  apic.component="eqpt*" OR apic.component=ethpmPhysIf)   groupby apic.dn,_time,apic.component,apic.apic_host | rename apic.dn as dn,apic.component as component,apic.apic_host as apic_host | reverse

[authentication_details]
definition = tstats values(session.user) AS "user"  values(session.descr) AS "description" values(session.id) AS "Session-ID" values(session.trig) AS "trig" FROM datamodel=Auth groupby _time,session.dn,session.apic_host | rename session.dn AS dn, session.apic_host AS apic_host | reverse

[apic-tenant-overview]
definition = tstats latest(apic.ack) AS "ack" latest(apic.cause) AS "cause" latest(apic.domain) AS "domain" latest(apic.Tenant.EndPointGroupName) AS "EndPointGroupName" latest(apic.name) AS "name" latest(apic.rule) AS "rule" values(apic.twScore) AS "health" latest(apic.severity) AS "severity" latest(apic.Tenant.ApplicationName)  AS "ApplicationName" latest(apic.code) AS "code" latest(apic.Tenant.group_field) AS "group_field" from datamodel=Health WHERE apic.component="fv*" groupby apic.dn,apic.Tenant.TenantName,apic.component,_time,apic.apic_host | rename apic.Tenant.TenantName AS "TenantName",apic.component AS component,apic.dn AS dn, apic.apic_host AS apic_host | reverse

[home_page_details]
definition = search eventtype=cisco_apic_health ( component=fabricNode OR component=fvTenant OR component=fvAp OR component=fabrichealthTotal OR component=fvEPg OR component=fvBD OR component=vzFilter OR component=vzBrCP OR component=eqptcapacityPolEntry5min OR component=fvCtx OR component=fvAEPg OR component=l3extOut) NOT "code" | SORT _time| fields _time cur dn name role component twScore apic_host
iseval = 0

[critical-faults-count]
definition = tstats values(Fault.dn) AS "Critical-faults" from datamodel=Fault WHERE Fault.severity="critical" groupby Fault.apic_host | rename Fault.apic_host as apic_host  
iseval = 0

[vm_count]
definition = tstats prestats=true values(classInfo.VM_Relation.VirtualMachine) from datamodel=Systems WHERE classInfo.component=fvRsVm groupby classInfo.dn,classInfo.apic_host | rename classInfo.apic_host as apic_host  
iseval = 0

[end_point_detail]
definition = tstats latest(classInfo.VM_Relation.Tenant) AS Tenant latest(classInfo.VM_Relation.Application) AS Application latest(classInfo.VM_Relation.EPG) AS EPG latest(classInfo.VM_Relation.EPGHealth) AS EPG-Health values(classInfo.VM_Relation.VirtualMachine) AS VirtualMachine latest(classInfo.VM_Relation.vmState) AS state latest(classInfo.VM_Relation.ESXHost) AS ESX-Host latest(classInfo.VM_Relation.vCenter) AS vCenter latest(classInfo.VM_Relation.cep) AS cep latest(classInfo.VM_Relation.Interface) AS Interface from datamodel=Systems WHERE classInfo.component=fvRsVm groupby classInfo.VM_Relation.mac_addr, classInfo.apic_host | rename classInfo.VM_Relation.mac_addr AS Network-Adapter, classInfo.apic_host AS apic_host

[apic_details]
definition = tstats latest(classInfo.inbMgmtAddr) AS "In-band management Address" latest(classInfo.fabricMAC) AS "Fabric Mac Address" latest(classInfo.name) AS "Name" latest(classInfo.state) AS "State" latest(classInfo.systemUpTime) AS "System Up Time" latest(classInfo.role) AS "Role" latest(classInfo.mode) AS "Mode" FROM datamodel=Systems WHERE (classInfo.role=controller AND classInfo.component=topSystem) groupby classInfo.oobMgmtAddr, classInfo.apic_host | rename classInfo.oobMgmtAddr AS "Out-of-band Management Address", classInfo.apic_host AS apic_host
iseval = 0

[atomic_counter_details]
definition = tstats  values(classInfo.src) AS src values(classInfo.Atomic_Counters.srcVM) AS "Source VM" values(classInfo.dst) AS dst values(classInfo.Atomic_Counters.dstVM) AS "Destination VM" values(classInfo.totTxP) AS "Total Transmitted Packets" values(classInfo.totRxP) AS "Total Received Packets" values(classInfo.totDropP) AS "Total Dropped Packets" values(classInfo.totExssP) AS "Total Excess Packets" values(classInfo.component) AS component from datamodel=Counters where (classInfo.component="dbgEpgToEpgRslt" OR classInfo.component="dbgEpToEpRslt") groupby _time,classInfo.dn,classInfo.apic_host| rename classInfo.dn AS dn, classInfo.apic_host AS apic_host
iseval = 0

[vmware_counter_details]
definition = tstats latest(classInfo.Host_Stats.ESXHost) AS Host latest(classInfo.Host_Stats.VirtualMachine) AS "Virtual Machine"  values(classInfo.Host_Stats.vmID) AS vmID values(classInfo.cpuUsageMin) AS cpuUsageMin values(classInfo.cpuUsageMax) AS cpuUsageMax values(classInfo.cpuUsageTtl) AS cpuUsageTotal values(classInfo.cpuUsageAvg) AS cpuUsageAvg  values(classInfo.memUsageMin) AS memUsageMin values(classInfo.memUsageMax) AS memUsageMax values(classInfo.memUsageTtl) AS memUsageTotal values(classInfo.memUsageAvg) AS memUsageAvg latest(classInfo.component)  AS component from datamodel=Counters  where classInfo.component=compHostStats1h groupby _time,classInfo.apic_host | append [ | tstats values(classInfo.Trnsmtd_Error_Pkts.ESXHost) AS "Transmitting Host" values(classInfo.Trnsmtd_Error_Pkts.VirtualMachine) AS "Transmitting Virtual Machine"   values(classInfo.Rcvd_Error_Pkts.ESXHost) AS "Receiving Host"  values(classInfo.Rcvd_Error_Pkts.VirtualMachine) AS "Receiving Virtual Machine"  values(classInfo.errorAvg) AS "Errored_Packets" latest(classInfo.component) AS component from datamodel=Counters where classInfo.component=compTrnsmtdErrPkts1h OR  classInfo.component=compRcvdErrPkts1h groupby ,_time,classInfo.apic_host] | rename classInfo.apic_host AS apic_host
iseval = 0

[event-logs-overview]
definition = tstats latest(Event.cause) AS "cause" latest(Event.severity) AS "severity" latest(Event.ind) AS "ind" latest(Event.user) AS "user" from datamodel=Events groupby _time, Event.dn,Event.apic_host | rename Event.dn AS dn, Event.apic_host AS apic_host | reverse

