[Hockeymon Teams - Lookup Gen]
action.email.useNSSubject = 1
alert.track = 0
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
display.general.timeRangePicker.show = 0
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.show = 0
request.ui_dispatch_app = splunk_app_for_hockey_monitoring
request.ui_dispatch_view = splunk_app_for_hockey_monitoring
search = | hockeyteams | `hockeyteam_extract` | fields - _time event_no _raw | table * | outputlookup hockeymon_teams key_field=ID
cron_schedule = 0 0 * */4 *
enableSched = 1

[Hockeymon Players - Lookup Gen]
action.email.useNSSubject = 1
alert.track = 0
cron_schedule = 0 4 * * *
description = Generates a list of player IDs and names in hockey data over past 5 years
dispatch.earliest_time = -5y
display.general.timeRangePicker.show = 0
enableSched = 1
search = | tstats prestats=t summariesonly=f count from datamodel=Hockey_Plays where nodename=All_Plays.Shots by All_Plays.SHOOTER_ID All_Plays.SHOOTER_NAME\
| tstats prestats=t append=T summariesonly=f count from datamodel=Hockey_Plays where nodename=All_Plays.Shots.Blocked by All_Plays.BLOCKER_ID All_Plays.BLOCKER_NAME\
| tstats prestats=t append=T summariesonly=f count from datamodel=Hockey_Plays where nodename=All_Plays.Faceoffs by All_Plays.FACEOFF_WINNER_ID All_Plays.FACEOFF_WINNER_NAME\
| tstats prestats=t append=T summariesonly=f count from datamodel=Hockey_Plays where nodename=All_Plays.Faceoffs by All_Plays.FACEOFF_LOSER_ID All_Plays.FACEOFF_LOSER_NAME\
| tstats prestats=t append=T summariesonly=f count from datamodel=Hockey_Plays where nodename=All_Plays.Hit by All_Plays.HITTER_ID All_Plays.HITTER_NAME\
| tstats prestats=t append=T summariesonly=f count from datamodel=Hockey_Plays where nodename=All_Plays.Hit by All_Plays.HITTEE_ID All_Plays.HITTEE_NAME\
| tstats prestats=t append=T summariesonly=f count from datamodel=Hockey_Plays where nodename=All_Plays.Giveaways by All_Plays.GIVEAWAY_PLAYER_ID All_Plays.GIVEAWAY_PLAYER_NAME\
| tstats prestats=t append=T summariesonly=f count from datamodel=Hockey_Plays where nodename=All_Plays.Takeaways by All_Plays.TAKEAWAY_PLAYER_ID All_Plays.TAKEAWAY_PLAYER_NAME\
| tstats prestats=t append=T summariesonly=f count from datamodel=Hockey_Plays where nodename=All_Plays.Goals by All_Plays.SCORER_ID All_Plays.SCORER_NAME\
| tstats prestats=t append=T summariesonly=f count from datamodel=Hockey_Plays where nodename=All_Plays.Goals by All_Plays.ASSIST_ID_1 All_Plays.ASSIST_NAME_1\
| tstats prestats=t append=T summariesonly=f count from datamodel=Hockey_Plays where nodename=All_Plays.Goals by All_Plays.ASSIST_ID_2 All_Plays.ASSIST_NAME_2\
| tstats prestats=t append=T summariesonly=f count from datamodel=Hockey_Plays where nodename=All_Plays.Penalties by All_Plays.PENALTY_DREWBY_ID All_Plays.PENALTY_DREWBY_NAME\
| tstats prestats=t append=T summariesonly=f count from datamodel=Hockey_Plays where nodename=All_Plays.Penalties by All_Plays.PENALTY_ON_ID All_Plays.PENALTY_ON_NAME\
| tstats prestats=t append=T summariesonly=f count from datamodel=Hockey_Plays where nodename=All_Plays.Penalties by All_Plays.PENALTY_SERVEDBY_ID All_Plays.PENALTY_SERVEDBY_NAME\
| rename All_Plays.* as *\
| eval PLAYER_ID = coalesce(SHOOTER_ID,BLOCKER_ID,FACEOFF_WINNER_ID,ASSIST_ID_1,FACEOFF_LOSER_ID,HITTER_ID,HITTEE_ID,GIVEAWAY_PLAYER_ID,TAKEAWAY_PLAYER_ID,PENALTY_DREWBY_ID,PENALTY_ON_ID,PENALTY_SERVEDBY_ID)\
| eval PLAYER_NAME = coalesce(SHOOTER_NAME,BLOCKER_NAME,FACEOFF_WINNER_NAME,FACEOFF_LOSER_NAME,HITTER_NAME,HITTEE_NAME,GIVEAWAY_PLAYER_NAME,TAKEAWAY_PLAYER_NAME,PENALTY_DREWBY_NAME,PENALTY_ON_NAME,PENALTY_SERVEDBY_NAME)\
| where PLAYER_ID>1000\
| stats count by PLAYER_ID PLAYER_NAME\
| table PLAYER_ID PLAYER_NAME\
| outputlookup hockeymon_players key_field=PLAYER_ID
