#
# Copyright (C) 2012-2020 NetFlow Logic
# All rights reserved.
#
# These coded instructions and statements contain unpublished trade
# secrets and proprietary information. They are protected by federal
# copyright law and by trade secret law, and may not be disclosed to
# third parties or used, copied, reverse engineered, decompiled, or
# duplicated in any form, in whole or in part, without the prior
# written consent of NetFlow Logic.
#

[save_exporters_with_nfo]
is_visible = false
enableSched = 1
run_on_startup = true
cron_schedule = */30 * * * *
dispatch.earliest_time = -32m@m
dispatch.latest_time = -2m@m
search = `netflow_index` | inputlookup nfo_exp-group_exp_lookup append=t | dedup exp_ip nfo_hostname | sort exp_ip | lookup exporters_devices_lookup nfo_hostname exp_ip OUTPUT device_group AS exp_group | fillnull value="Unassigned" exp_group | mvexpand exp_group | table   nfo_hostname exp_group  exp_ip | outputlookup nfo_exp-group_exp_lookup

[save_snmp_devices]
is_visible = false
enableSched = 1
run_on_startup = true
cron_schedule = */30 * * * *
dispatch.earliest_time = -32m@m
dispatch.latest_time = -2m@m
search = `netflow_search_rule_20103` | inputlookup snmp-devices_lookup append=t | dedup exp_ip nfo_hostname mgmt_ip sysName device_group | sort exp_ip | fillnull value="Unassigned" device_group | table nfo_hostname exp_ip mgmt_ip device_group sysName  | outputlookup snmp-devices_lookup

[save_exporters_with_nfo_metrics]
is_visible = false
enableSched = 1
run_on_startup = true
cron_schedule = */30 * * * *
dispatch.earliest_time = -32m@m
dispatch.latest_time = -2m@m
search = | mstats sum(bytes_in) as sum_bytes_in WHERE  `netflow_metrics_index` nfc_id=20067 by exp_ip nfo_hostname | table nfo_hostname exp_ip | inputlookup nfo_exp-group_exp_lookup_metrics append=t | dedup exp_ip nfo_hostname | sort exp_ip | lookup exporters_devices_lookup nfo_hostname exp_ip OUTPUT device_group AS exp_group | fillnull value="Unassigned" exp_group | mvexpand exp_group | table   nfo_hostname exp_group  exp_ip | outputlookup nfo_exp-group_exp_lookup_metrics


[save_vpcs_with_nfo]
is_visible = false
enableSched = 1
run_on_startup = true
cron_schedule = */30 * * * *
dispatch.earliest_time = -32m@m
dispatch.latest_time = -2m@m
search = `netflow_search_rule_20267` | inputlookup nfo_vpc_name_lookup append=t | dedup exp_ip vpc_id nfo_hostname | sort vpc_name | table nfo_hostname vpc_name vpc_id exp_ip | outputlookup nfo_vpc_name_lookup

[save_nsg_vnets_with_nfo]
alert.track = 0
cron_schedule = */30 * * * *
dispatch.earliest_time = -32m@m
dispatch.latest_time = -2m@m
enableSched = 1
is_visible = 0
run_on_startup = 1
search = `netflow_search_rule_20467` \
     | eval vnet_name=case(direction == "inbound", dest_vnet_name, direction == "outbound", src_vnet_name)\
     | inputlookup nfo_nsg_vnet_name_lookup append=t \
     | dedup exp_ip vnet_name nfo_hostname \
     | sort vnet_name \
     | table nfo_hostname vnet_name exp_ip \
     | outputlookup nfo_nsg_vnet_name_lookup

[save_mgmt_ip]
is_visible = false
enableSched = 1
run_on_startup = true
cron_schedule = */30 * * * *
dispatch.earliest_time = -32m@m
dispatch.latest_time = -2m@m
search = `netflow_index` mgmt_ip=* | inputlookup mgmt_ip_lookup  append=t | dedup nfo_hostname mgmt_ip  | table nfo_hostname mgmt_ip | outputlookup mgmt_ip_lookup

[save_interfaces_20003]
is_visible = false
enableSched = 1
run_on_startup = true
cron_schedule = */30 * * * *
dispatch.earliest_time = -32m@m
dispatch.latest_time = -2m@m
search = `netflow_index` (nfc_id=20003 OR nfc_id=20067 OR nfc_id=20267 OR nfc_id=20367 OR nfc_id=20467 OR nfc_id=20062) \
         | eval SNMPDeviceName=case(nfc_id=20003,sysName,nfc_id=20062,exp_name,nfc_id=20267,vpc_name,nfc_id=20367,gcp_exp,nfc_id=20467,case(direction=="inbound", dest_vnet_name, direction=="outbound", src_vnet_name)) \
         | eval input_snmp=if(isnull(input_snmp),ifIndex,input_snmp) \
         | eval input_snmp=if(nfc_id==20267,interface_id,input_snmp) \
         | fields exp_ip nfo_hostname input_snmp output_snmp input_if_name output_if_name input_if_alias output_if_alias ifIndex SNMPDeviceName ifSpeed ifName ifAlias \
         | eval ifIndex=mvappend(input_snmp,output_snmp,ifIndex) \
         | mvexpand ifIndex \
         | fillnull value="" ifName ifAlias \
         | eval ifName=if(ifName == "",if(ifIndex==input_snmp,input_if_name,if(ifIndex==output_snmp,output_if_name,ifName)),ifName) \
         | eval ifAlias=if(ifAlias == "",if(ifIndex==input_snmp,input_if_alias,if(ifIndex==output_snmp,output_if_alias,ifAlias)),ifAlias) \
         | dedup exp_ip nfo_hostname ifIndex sortby - ifName \
         | table exp_ip nfo_hostname ifIndex SNMPDeviceName ifSpeed ifName ifAlias \
         | inputlookup interfaces_20003.csv append=t \
         | stats first(SNMPDeviceName) as SNMPDeviceName first(ifSpeed) as ifSpeed first(ifName) as ifName first(ifAlias) as ifAlias by nfo_hostname exp_ip ifIndex \
         | dedup  exp_ip nfo_hostname ifIndex sortby - ifName \
         | outputlookup interfaces_20003_lookup

[save_samplings]
is_visible = false
enableSched = 1
cron_schedule = */30 * * * *
run_on_startup = true
dispatch.earliest_time = -32m@m
dispatch.latest_time = -2m@m
search = `netflow_search_rule_20002` | inputlookup sampling_lookup append=t | stats count by _time, nfo_hostname, exp_ip, flow_smpl_id, smpl_int | dedup nfo_hostname exp_ip flow_smpl_id sortby -_time | table nfo_hostname, exp_ip, flow_smpl_id, smpl_int, _time | outputlookup sampling_lookup

[save_gcp_project_vpc_subnets_with_nfo]
alert.track = 0
cron_schedule = */30 * * * *
dispatch.earliest_time = -32m@m
dispatch.latest_time = -2m@m
enableSched = 1
is_visible = 0
run_on_startup = 1
search = `netflow_search_rule_20367` | inputlookup nfo_gcp_project_vpc_subnet_name_lookup append=t | eval gcp_exp_fields=split(gcp_exp,"/") | eval gcp_project_id=mvindex(gcp_exp_fields,0) | dedup nfo_hostname gcp_project_id gcp_exp | sort gcp_project_id gcp_exp | table nfo_hostname gcp_project_id gcp_exp | outputlookup nfo_gcp_project_vpc_subnet_name_lookup

[Security - Botnet Command & Control ( emergingthreats.net )]
action.email.inline = 1
action.email.message.alert = The alert condition for '$name$' was triggered. See details : $action.email.hostname$/en-US/app/netflow/cyber_threat
action.email.sendresults = 1
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = */5 * * * *
disabled = 1
dispatch.earliest_time = -5m@m
dispatch.latest_time = now
enableSched = 1
quantity = 0
relation = greater than
search = `netflow_index` nfc_id="20050" | stats count

[Security - Custom Threat Feeds]
action.email.inline = 1
action.email.message.alert = The alert condition for '$name$' was triggered. See details : $action.email.hostname$/en-US/app/netflow/cyber_threat
action.email.sendresults = 1
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = */5 * * * *
disabled = 1
dispatch.earliest_time = -5m@m
dispatch.latest_time = now
enableSched = 1
quantity = 0
relation = greater than
search = `netflow_index` nfc_id="20051" | stats count


[Security - Malicious Hosts (Alienvault Reputation)]
action.email.inline = 1
action.email.message.alert = The alert condition for '$name$' was triggered. See details : $action.email.hostname$/en-US/app/netflow/cyber_threat
action.email.sendresults = 1
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = */5 * * * *
disabled = 1
dispatch.earliest_time = -5m@m
dispatch.latest_time = now
enableSched = 1
quantity = 0
relation = greater than
search = `netflow_index` nfc_id="20052" | stats count

[Security - Threat Feeds (www.dshield.org)]
action.email.inline = 1
action.email.message.alert = The alert condition for '$name$' was triggered. See details : $action.email.hostname$/en-US/app/netflow/cyber_threat
action.email.sendresults = 1
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = */5 * * * *
disabled = 1
dispatch.earliest_time = -5m@m
dispatch.latest_time = now
enableSched = 1
quantity = 0
relation = greater than
search = `netflow_index` nfc_id="20053" | stats count

[ITOps - Hosts with most count of failed TCP connections]
action.email.inline = 1
action.email.message.alert = The alert condition for '$name$' was triggered. See details : $action.email.hostname$/en-US/app/netflow/tcp_health
action.email.sendresults = 1
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = */5 * * * *
disabled = 1
dispatch.earliest_time = -5m@m
dispatch.latest_time = now
enableSched = 1
quantity = 0
relation = greater than
search = `netflow_search_rule_20060` nfo_hostname="*"                          \
            | eventstats latest(src_host) as l_src_host by src_ip nfo_hostname \
            | stats sum(reset_count) as sumResetCount                          \
                    by  nfo_hostname src_ip l_src_host sum_total_by_nfo        \
            | search  sumResetCount > 100                                      \
            | sort - sumResetCount                                             \
            | `commas_formatting(Reset Count, sumResetCount)`                  \
            | table nfo_hostname src_ip l_src_host "Reset Count"               \
            | rename src_ip as "Source IP"                                     \
            | rename l_src_host as "Source Host"                               \
            | rename nfo_hostname as NFO


[ITOps - Hosts with largest share of failed TCP connections]
action.email.inline = 1
action.email.message.alert = The alert condition for '$name$' was triggered. See details : $action.email.hostname$/en-US/app/netflow/tcp_health
action.email.sendresults = 1
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = */5 * * * *
disabled = 1
dispatch.earliest_time = -5m@m
dispatch.latest_time = now
enableSched = 1
quantity = 0
relation = greater than
search = `netflow_search_rule_20060` nfo_hostname="*" \
            | eventstats latest(src_host) as l_src_host by src_ip nfo_hostname \
            | eval slice_total=ceil(100*reset_count/total_share) \
            | eval slice_local=ceil(100*reset_count/local_share) \
            | eventstats mode(slice_total) as total_by_nfo  by nfo_hostname _time \
            | eventstats mode(slice_local) as local_by_nfo  by nfo_hostname src_ip l_src_host _time \
            | eventstats sum(total_by_nfo) as sum_total_by_nfo  by nfo_hostname \
            | eventstats sum(local_by_nfo) as sum_local by src_ip l_src_host nfo_hostname \
            | stats sum(reset_count) as sumResetCount \
                  mode(sum_local) as sumLocalCount \
                    by  nfo_hostname src_ip l_src_host sum_total_by_nfo \
            | eval percTotal = sumResetCount/sum_total_by_nfo*100 \
            | eval percLocal = sumResetCount/sumLocalCount*100 \
            | search sumResetCount > 10 \
            | sort - percLocal sumResetCount \
            | `commas_formatting(Reset Count, sumResetCount)` \
            | table nfo_hostname src_ip l_src_host "Reset Count" \
            | rename src_ip as "Source IP" \
            | rename l_src_host as "Source Host" \
            | rename nfo_hostname as NFO


[ITOps - Interface Utilisation > 85%]
action.email.inline = 1
action.email.message.alert = The alert condition for '$name$' was triggered. See details : $action.email.hostname$/en-US/app/netflow/interfaces_traffic
action.email.sendresults = 1
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = */5 * * * *
disabled = 1
dispatch.earliest_time = -5m@m
dispatch.latest_time = now
enableSched = 1
quantity = 0
relation = greater than
search = `netflow_search_rule_20067` exp_ip="*" nfo_hostname="*" \
      | `sampling(bytes_in)` \
      | eventstats sum(bytes_in) as sum_by_exp by exp_ip nfo_hostname \
      | lookup exporters_devices_lookup nfo_hostname exp_ip OUTPUT device_group AS exp_group \
      | search exp_group="*" * (input_snmp="*" OR output_snmp="*") \
      | bin _time span=3s \
      | stats sum(bytes_in) as sum_bytes_in sum(packets_in) as sum_packets_in sum(flow_count) as sum_flow_count by nfo_hostname exp_ip src_ip src_port src_host dest_ip dest_port dest_host transport input_snmp output_snmp flow_smpl_id sum_by_exp _time \
      | eval snmps=input_snmp+","+output_snmp  \
      | eval snmps=split(snmps,",") \
      | `sampling(sum_packets_in)` \
      | `sampling(sum_flow_count)` \
      |  stats  sum(sum_bytes_in) as sumbytes \
                sum(sum_packets_in) as sumpacketsin \
                    by  exp_ip sum_by_exp snmps _time nfo_hostname \
      | eval avgbits= sumbytes*8/(3) \
      | stats sum(sumbytes) as TrafficAmount \
          sum(sumpacketsin) as PacketsAmount \
            by exp_ip sum_by_exp snmps nfo_hostname \
      | eval AverageSpeed=(TrafficAmount)*8/300.000 \
      | eval PacketsSpeed=(PacketsAmount)/300.000 \
      | `get_iface_name(snmp_name, snmps)` \
      | search snmp_name = "*" snmps = "*" \
      | `get_iface_speed(snmp_speed, snmps)` \
      | `get_exporter_name(exp_ip_name)` \
      | strcat exp_ip_name "/" snmp_name exp_snmp \
      | eval TrafficSpeedBoth=AverageSpeed/1000000 \
      | eval percOfUsageBoth = round(TrafficSpeedBoth/(snmp_speed)*100, 2) \
      | table nfo_hostname exp_snmp percOfUsageBoth \
      | search percOfUsageBoth>85 \
      | sort - percOfUsageBoth \
      | rename exp_snmp as "Device/Interface" \
      | rename percOfUsageBoth as "% of Usage Both" \
      | rename nfo_hostname as "NFO"

[SNMP - CPU Utilisation > 80%]
action.email.inline = 1
action.email.message.alert = The alert condition for '$name$' was triggered. See details : $action.email.hostname$/en-US/app/snmp_devices_cpu_and_mem
action.email.sendresults = 1
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = */5 * * * *
disabled = 1
dispatch.earliest_time = -5m@m
dispatch.latest_time = now
enableSched = 1
quantity = 0
relation = greater than
search = `netflow_search_rule_20103` oid_set=*cpu cpu_load_percent=* exp_ip=* \
           | fillnull value="" mgmt_ip sysName \
           | eval device_sysname = (((mgmt_ip . " (") . sysName) . ")") \
           | where cpu_load_percent>80 \
           | table nfo_hostname device_sysname cpu_load_percent \
           | rename nfo_hostname as "NFO" \
           | rename device_sysname as "Device (sysName)" \
           | rename cpu_load_percent as "CPU utilization %"

[SNMP - Memory Utilisation > 80%]
action.email.inline = 1
action.email.message.alert = The alert condition for '$name$' was triggered. See details : $action.email.hostname$/en-US/app/netflow/snmp_devices_cpu_and_mem
action.email.sendresults = 1
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = */5 * * * *
disabled = 1
dispatch.earliest_time = -5m@m
dispatch.latest_time = now
enableSched = 1
quantity = 0
relation = greater than
search = `netflow_search_rule_20103` oid_set=*mem mem_* exp_ip=* \
           | fillnull value="" mgmt_ip sysName \
           | eval device_sysname = (((mgmt_ip . " (") . sysName) . ")") \
           | fillnull value=NULL mem_free mem_used mem_total mem_used_percent \
           | eval mem_free=if(mem_free=="NULL",mem_total-mem_used,mem_free) \
           | eval mem_used=if(mem_used=="NULL",mem_total-mem_free,mem_used) \
           | eval mem_total=if(mem_total=="NULL",mem_used+mem_free,mem_total) \
           | eval mem_used_percent=if(mem_used_percent=="NULL",100*mem_used/mem_total,mem_used_percent) \
           | where mem_used_percent>80 \
           | table nfo_hostname device_sysname mem_used_percent \
           | rename nfo_hostname as "NFO" \
           | rename device_sysname as "Device (sysName)" \
           | rename mem_used_percent as "Memory utilization %"

[SNMP - Interface Relative Load > 85%]
action.email.inline = 1
action.email.message.alert = The alert condition for '$name$' was triggered.
action.email.sendresults = 1
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = */5 * * * *
disabled = 1
dispatch.earliest_time = -5m@m
dispatch.latest_time = now
enableSched = 1
quantity = 0
relation = greater than
search = `netflow_search_rule_20103` ifHCInOctets \
           | stats  max(ifHCInOctets) as maxinoctets min(ifHCInOctets) as mininoctets \
               max(ifHCOutOctets) as maxoutoctets min(ifHCOutOctets) as minoutoctets \
               avg(ifHighSpeed) as ifHighSpeed avg(ifSpeed) as ifSpeed \
             by interface_name  exp_ip ifIndex  sysName ifDescr nfo_hostname \
           | eval TotalTraffic = (maxinoctets-mininoctets)+(maxoutoctets-minoutoctets) \
           | fillnull value=NULL ifSpeed ifHighSpeed \
           | eval ifSpeed=if(ifHighSpeed==NULL,ifSpeed/1000000,ifHighSpeed) \
           | eval AverageSpeed=TotalTraffic*8/(300*1000000) \
           | eval percOfUsageBoth = round(AverageSpeed/(ifSpeed)*100, 2) \
           | where percOfUsageBoth>85 \
           | table interface_name percOfUsageBoth \
           | rename interface_name as "Interface Name" \
           | rename percOfUsageBoth as "Interface Usage"

[Internal NFO logs - Unresponsive SNMP Devices]
action.email.inline = 1
action.email.message.alert = The alert condition for '$name$' was triggered.
action.email.sendresults = 1
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = */5 * * * *
disabled = 1
dispatch.earliest_time = -5m@m
dispatch.latest_time = now
enableSched = 1
quantity = 0
relation = greater than
search = `netflow_index` service=SNMP  description="Unresponsive device" \
           | table node

[set_default_interfaces_lookup]
is_visible = false
enableSched = 1
cron_schedule = 1 1 1 1 1
run_on_startup = true
search = | makeresults \
         | eval nfo_hostname="*" \
         | eval management_ip="*" \
         | eval snmp_index="*" \
         | eval if_name="*" \
         | eval if_speed="*" \
         | inputlookup interfaces_lookup  append=t \
         | dedup nfo_hostname,management_ip,snmp_index,if_name,if_speed  \
         | table nfo_hostname,management_ip,snmp_index,if_name,if_speed  \
         | outputlookup interfaces_lookup

[set_default_exporters_devices_lookup]
is_visible = false
enableSched = 1
cron_schedule = 1 1 1 1 1
run_on_startup = true
search = | makeresults \
         | eval nfo_hostname="*" \
         | eval exp_ip="*" \
         | eval management_ip="*" \
         | eval device_group="*" \
         | eval caption="*" \
         | inputlookup exporters_devices_lookup  append=t \
         | dedup nfo_hostname,exp_ip,management_ip,device_group  \
         | table nfo_hostname,exp_ip,management_ip,device_group,caption  \
         | outputlookup exporters_devices_lookup

[set_default_sampling_lookup]
is_visible = false
enableSched = 1
cron_schedule = 1 1 1 1 1
run_on_startup = true
search = | makeresults \
         | eval nfo_hostname="*" \
         | eval exp_ip="*" \
         | eval flow_smpl_id="*" \
         | eval smpl_int="*" \
         | eval _time="*" \
         | inputlookup sampling_lookup  append=t \
         | dedup nfo_hostname,exp_ip,flow_smpl_id,smpl_int,_time \
         | table nfo_hostname,exp_ip,flow_smpl_id,smpl_int,_time \
         | outputlookup sampling_lookup

[20067_summary_5min]
action.summary_index = 1
action.summary_index._metric_dims = src_port,dest_port,protocol_id,transport,input_snmp,output_snmp
action.summary_index._name = summary_metrics
action.summary_index._type = metric
alert.track = 0
cron_schedule = */5 * * * *
dispatch.earliest_time = -5min@min
dispatch.latest_time = now
display.general.timeRangePicker.show = 0
enableSched = 1
realtime_schedule = 0
schedule_priority = highest
schedule_window = auto
search = `netflow_search_rule_20067`   \
  | lookup sampling_lookup nfo_hostname exp_ip flow_smpl_id OUTPUT smpl_int \
  | eval bytes_in=if(isnull(smpl_int),bytes_in,(bytes_in * smpl_int)) \
  | eval packets_in=if(isnull(smpl_int),packets_in,(packets_in * smpl_int)) \
  | eval flow_count=if(isnull(smpl_int),flow_count,(flow_count * smpl_int)) \
  | fillnull value="" transport  \
  | lookup port_lookup port as dest_port OUTPUT service as dest_service | lookup port_lookup port as src_port OUTPUT service as src_service\
  | eval src_port=if(src_service!="unknown",src_port,if((src_service=="unknown" AND dest_service=="unknown") AND src_port<dest_port,src_port,0)) \
  | eval dest_port=if(dest_service!="unknown",dest_port,if((src_service=="unknown" AND dest_service=="unknown") AND dest_port<src_port,dest_port,0)) \
  | stats sum(bytes_in) as sum_bytes_in \
    sum(packets_in) as sum_packets_in \
    sum(flow_count) as sum_flow_count \
      by nfo_hostname exp_ip  src_ip src_port src_host dest_ip dest_port dest_host  transport protocol_id input_snmp output_snmp  \
  | table sum_bytes_in sum_packets_in sum_flow_count nfo_hostname exp_ip  src_ip src_port src_host  dest_ip dest_port dest_host \
        transport protocol_id input_snmp output_snmp
disabled = 1

[20067_summary_1h]
action.summary_index = 1
action.summary_index._metric_dims = src_port,dest_port,protocol_id,transport,input_snmp,output_snmp
action.summary_index._name = summary_metrics
action.summary_index._type = metric
alert.track = 0
cron_schedule = 5 * * * *
dispatch.earliest_time = -65min@min
dispatch.latest_time = -5min@min
display.general.timeRangePicker.show = 0
enableSched = 1
realtime_schedule = 0
schedule_priority = highest
schedule_window = auto
search = | mstats sum(sum_bytes_in) as sum_bytes_in sum(sum_packets_in) as sum_packets_in sum(sum_flow_count) as sum_flow_count             \
                 WHERE index=summary_metrics source=20067_summary_5min                                                                      \
                 BY nfo_hostname exp_ip  src_ip src_port src_host dest_ip dest_port dest_host transport protocol_id input_snmp output_snmp  \
         | table sum_bytes_in sum_packets_in sum_flow_count nfo_hostname exp_ip  src_ip src_port src_host dest_ip dest_port dest_host       \
                 transport protocol_id input_snmp output_snmp
disabled = 1

[20067_summary_5min_subnet_groups]
action.summary_index = 1
action.summary_index._metric_dims = protocol_id
action.summary_index._name = summary_metrics
action.summary_index._type = metric
alert.track = 0
cron_schedule = */5 * * * *
dispatch.earliest_time = -5min@min
dispatch.latest_time = now
display.general.timeRangePicker.show = 0
enableSched = 1
realtime_schedule = 0
schedule_priority = highest
schedule_window = auto
search = `netflow_search_rule_20067` \
    | lookup my_subnets_lookup subnet AS src_ip OUTPUT level_2 AS src_group level_1 as src_datacenter \
    | lookup my_subnets_lookup subnet AS dest_ip OUTPUT level_2 AS dest_group level_1 as dest_datacenter \
    | where src_group != dest_group  \
    | eval subnet_group_pair=src_group+" to "+dest_group    \
    | lookup sampling_lookup nfo_hostname exp_ip flow_smpl_id OUTPUT smpl_int \
    | eval bytes_in=if(isnull(smpl_int),bytes_in,(bytes_in * smpl_int)) \
    | eval packets_in=if(isnull(smpl_int),packets_in,(packets_in * smpl_int)) \
    | eval flow_count=if(isnull(smpl_int),flow_count,(flow_count * smpl_int)) \
    | fillnull value="" transport  \
    | stats sum(bytes_in) as sum_bytes_in \
      sum(packets_in) as sum_packets_in \
      sum(flow_count) as sum_flow_count \
        by nfo_hostname exp_ip  transport protocol_id dest_group dest_datacenter src_group src_datacenter\
    | table sum_bytes_in sum_packets_in sum_flow_count  nfo_hostname exp_ip  dest_group dest_datacenter src_group src_datacenter transport protocol_id
disabled = 1

[20067_summary_1h_subnet_groups]
action.summary_index = 1
action.summary_index._metric_dims = protocol_id
action.summary_index._name = summary_metrics
action.summary_index._type = metric
alert.track = 0
cron_schedule = 5 * * * *
dispatch.earliest_time = -65m@m
dispatch.latest_time = -5m@m
display.general.timeRangePicker.show = 0
enableSched = 1
realtime_schedule = 0
schedule_priority = highest
schedule_window = auto
search = | mstats sum(sum_bytes_in) as sum_bytes_in sum(sum_packets_in) as sum_packets_in sum(sum_flow_count) as sum_flow_count\
             WHERE index=summary_metrics source=20067_summary_5min_subnet_groups \
             BY nfo_hostname exp_ip  dest_group dest_datacenter src_group src_datacenter transport protocol_id  \
         | table sum_bytes_in sum_packets_in sum_flow_count  nfo_hostname exp_ip  dest_group dest_datacenter src_group src_datacenter transport protocol_id
disabled = 1
