[PAM(3)]
args = PAM_earliest,PAM_latest,IsNotInteractive
definition = `CA_PAM($PAM_earliest$,$PAM_latest$,$IsNotInteractive$)`
iseval = 0

[CA_PAM-index]
definition = index=*
# definition = index=pam (host=PAM-101 OR host=PAM-002)
iseval = 0

[CA_PAM-lookup_dest]
definition = lookup simple_asset_lookup ip AS PAM_dest_ip OUTPUTNEW nt_host AS PAM_dest
#definition = lookup simple_asset_lookup ip AS PAM_dest_ip OUTPUTNEW nt_host AS PAM_dest | lookup Privilege_Accounts_PAM ip AS PAM_dest_ip OUTPUTNEW host AS PAM_dest
iseval = 0

[CA_PAM-eval_output_dest_nt_domain]
definition = eval dest_nt_domain=dest
# definition = eval dest_nt_domain=case(UPPER(user_nt_domain)=="EXAMPLEDOMAIN1.LOCAL", "EXAMPLEDOMAIN1", UPPER(user_nt_domain)=="EXAMPLEDOMAIN2.LOCAL", "EXAMPLEDOMAIN2", UPPER(user_nt_domain)=="EXAMPLEDOMAIN3.LOCAL", "EXAMPLEDOMAIN3", UPPER(user_nt_domain)=="EXAMPLEDOMAIN4.LOCAL", "EXAMPLEDOMAIN4", true(),UPPER(dest_nt_domain))
iseval = 0

[CA_PAM-UsePassword(3)]
args = PAM_earliest,PAM_latest,IsNotInteractive
definition = `CA_PAM-index` sourcetype="ca:pam:syslog*" earliest=$PAM_earliest$ latest=$PAM_latest$ gkpsyslog OR viewAccountPassword OR "<bm.id>" NOT "logwatch[" NOT "log-watch[" NOT PAM-CMN-1482 NOT PAM-CMN-1701 NOT PAM-SPFD-0028 NOT PAM-SRM-0010 NOT PAM-SRM-0051 NOT PAM-CMN-1989 NOT PAM-SPFD-0027 NOT PAM-CMN-0917 NOT PAM-CMN-1985 NOT PAM-CMN-0627 NOT PAM-CMN-1982 NOT PAM-CMN-1984 NOT PAM-CMN-1988 | transaction maxspan=60s DeviceName, src_user_identity, dest_user, TargetAccount_ID keeporphans=true keepevicted=true | eval _txn_orphan=NULL | transaction maxspan=14h ca_pam_autologin_session_id keeporphans=true keepevicted=true | search eventtype=ca_pam_network_sessions_start | eval logdest=dest | eval src_mvcount=mvcount(src) | mvexpand src | where NOT (src_mvcount>1 AND src="127.0.0.1") | fields - src_mvcount | eval dest_mvcount=mvcount(dest) | mvexpand dest | where NOT (dest_mvcount>1 AND dest=Actual_Authenticaion_Server) | eval AutoLogin_StartTS=min(AutoLogin_StartTS) | eval AutoLogin_EndTS=max(AutoLogin_EndTS) | eval Valid_StartTS=AutoLogin_StartTS | eval Valid_EndTS=case(($IsNotInteractive$==1 AND isnotnull(Actual_Approved_EndTS)), Actual_Approved_EndTS, ($IsNotInteractive$==1 AND isnull(Actual_Approved_EndTS) AND isnotnull(AutoLogin_StartTS)), relative_time(AutoLogin_StartTS,"+3h@m"),($IsNotInteractive$==1 AND isnull(Actual_Approved_EndTS) AND isnull(AutoLogin_StartTS)), relative_time(_time,"+3h@m"),($IsNotInteractive$==0 AND isnotnull(AutoLogin_StartTS)), relative_time(AutoLogin_StartTS,"+5m@m"),true(), relative_time(_time,"+5m@m")) | eval PAM_dest=if(isnull(PAM_dest_ip), dest, null()) | fields - dest | `CA_PAM-lookup_dest` | eval PAM_dest=mvdedup(PAM_dest) | fields _time, src, src_user, dest_user, user, Actual_Authenticaion_Server, dest_nt_domain, PAM_dest_ip, PAM_dest, PAM_dest_dns, logdest, TargetApplication_name, Valid_StartTS, Valid_EndTS, Actual_Approved_StartTime, Actual_Approved_EndTime,Actual_Approved_StartTS, Actual_Approved_EndTS, PAM_Action, Access_Protocol, Service_App, referenceCode, Attribute_descriptor1, Attribute_descriptor2, PasswordViewRequest_ssoType, authentication, cmdName, selectedComponent, TargetApplication_name, reason, reasonDetails, AutoLogin_StartTS, AutoLogin_EndTS, PAM_error_message | eval PAM_Action=if($IsNotInteractive$==1, "Retrieve password", PAM_Action)
iseval = 0

[CA_PAM-UsePassword]
definition = `CA_PAM-index` sourcetype="ca:pam:syslog*" gkpsyslog OR viewAccountPassword OR "<bm.id>" NOT "logwatch[" NOT "log-watch[" NOT PAM-CMN-1482 NOT PAM-CMN-1701 NOT PAM-SPFD-0028 NOT PAM-SRM-0010 NOT PAM-SRM-0051 NOT PAM-CMN-1989 NOT PAM-SPFD-0027 NOT PAM-CMN-0917 NOT PAM-CMN-1985 NOT PAM-CMN-0627 NOT PAM-CMN-1982 NOT PAM-CMN-1984 NOT PAM-CMN-1988 | transaction maxspan=60s DeviceName, src_user_identity, dest_user, TargetAccount_ID keeporphans=true keepevicted=true | eval _txn_orphan=NULL | transaction maxspan=14h ca_pam_autologin_session_id keeporphans=true keepevicted=true | search eventtype=ca_pam_network_sessions_start | eval logdest=dest | eval src_mvcount=mvcount(src) | mvexpand src | where NOT (src_mvcount>1 AND src="127.0.0.1") | fields - src_mvcount | eval dest_mvcount=mvcount(dest) | mvexpand dest | where NOT (dest_mvcount>1 AND dest=Actual_Authenticaion_Server) | eval AutoLogin_StartTS=min(AutoLogin_StartTS) | eval AutoLogin_EndTS=max(AutoLogin_EndTS) | eval Valid_StartTS=AutoLogin_StartTS | eval Valid_EndTS=case(isnotnull(AutoLogin_EndTS) AND (AutoLogin_EndTS>AutoLogin_StartTS),\
AutoLogin_EndTS, isnotnull(Actual_Approved_EndTS), Actual_Approved_EndTS, true(), relative_time(AutoLogin_StartTS,"+5m@m")) | eval PAM_dest=if(isnull(PAM_dest_ip), dest, null()) | fields - dest | `CA_PAM-lookup_dest` | eval PAM_dest=mvdedup(PAM_dest) | table _time, src, src_user, dest_user, user, Actual_Authenticaion_Server, dest_nt_domain, PAM_dest_ip, PAM_dest, PAM_dest_dns, logdest, TargetApplication_name, Valid_StartTS, Valid_EndTS, Actual_Approved_StartTime, Actual_Approved_EndTime,Actual_Approved_StartTS, Actual_Approved_EndTS, PAM_Action, Access_Protocol, Service_App, referenceCode, Attribute_descriptor1, Attribute_descriptor2, PasswordViewRequest_ssoType, authentication, cmdName, selectedComponent, TargetApplication_name, reason, reasonDetails, AutoLogin_StartTS, AutoLogin_EndTS, PAM_error_message | convert ctime(AutoLogin_StartTS) | convert ctime(AutoLogin_EndTS)
iseval = 0

[CA_PAM-Retrievepassword(3)]
args = PAM_earliest,PAM_latest,IsNotInteractive
definition = `CA_PAM-index` sourcetype="ca:pam:syslog*" earliest=$PAM_earliest$ latest=$PAM_latest$ ("<bm.id>" AND bm_id="*") OR (selectedComponent AND viewAccountPassword AND (PAM_Action="Retrieve password")) | transaction maxpause=2s TargetAccount_ID | search dest_user="*" | eval Valid_StartTS=Actual_Approved_StartTS | eval Valid_EndTS=Actual_Approved_EndTS | eval PAM_dest=if(isnull(PAM_dest_ip), dest, null()) | eval logdest=dest | eval src_mvcount=mvcount(src) | fillnull value=NULL src | mvexpand src | where NOT (src_mvcount>1 AND src="127.0.0.1") | fields - src_mvcount | eval dest_mvcount=mvcount(dest) | fillnull value=NULL dest | mvexpand dest | where NOT (dest_mvcount>1 AND dest=Actual_Authenticaion_Server) | fields - dest | `CA_PAM-lookup_dest` | eval PAM_dest=mvdedup(PAM_dest) | fields _time, src, src_user, dest_user, user, Actual_Authenticaion_Server, dest_nt_domain, PAM_dest_ip, PAM_dest, PAM_dest_dns, logdest, TargetApplication_name, Valid_StartTS, Valid_EndTS, Actual_Approved_StartTime, Actual_Approved_EndTime,Actual_Approved_StartTS, Actual_Approved_EndTS, PAM_Action, Access_Protocol, Service_App, referenceCode, Attribute_descriptor1, Attribute_descriptor2, PasswordViewRequest_ssoType, authentication, cmdName,  selectedComponent, TargetApplication_name, reason, reasonDetails,  AutoLogin_StartTS, AutoLogin_EndTS, PAM_error_message
iseval = 0

[CA_PAM-Retrievepassword]
definition = `CA_PAM-index` sourcetype="ca:pam:syslog*" ("<bm.id>" AND bm_id="*") OR (selectedComponent AND viewAccountPassword AND (PAM_Action="Retrieve password")) | transaction maxpause=2s TargetAccount_ID | search dest_user="*" | eval Valid_StartTS=Actual_Approved_StartTS | eval Valid_EndTS=Actual_Approved_EndTS | eval PAM_dest=if(isnull(PAM_dest_ip), dest, null()) | eval logdest=dest | eval src_mvcount=mvcount(src) | fillnull value=NULL src | mvexpand src | where NOT (src_mvcount>1 AND src="127.0.0.1") | fields - src_mvcount | eval dest_mvcount=mvcount(dest) | fillnull value=NULL dest | mvexpand dest | where NOT (dest_mvcount>1 AND dest=Actual_Authenticaion_Server) | fields - dest | `CA_PAM-lookup_dest` | eval PAM_dest=mvdedup(PAM_dest) | table _time, src, src_user, dest_user, user, Actual_Authenticaion_Server, dest_nt_domain, PAM_dest_ip, PAM_dest, PAM_dest_dns, logdest, TargetApplication_name, Valid_StartTS, Valid_EndTS, Actual_Approved_StartTime, Actual_Approved_EndTime,Actual_Approved_StartTS, Actual_Approved_EndTS, PAM_Action, Access_Protocol, Service_App, referenceCode, Attribute_descriptor1, Attribute_descriptor2, PasswordViewRequest_ssoType, authentication, cmdName,  selectedComponent, TargetApplication_name, reason, reasonDetails,  AutoLogin_StartTS, AutoLogin_EndTS, PAM_error_message
iseval = 0

[CA_PAM(3)]
args = PAM_earliest,PAM_latest,IsNotInteractive
definition = `CA_PAM-Retrievepassword($PAM_earliest$,$PAM_latest$,$IsNotInteractive$)` | append [ search `CA_PAM-UsePassword($PAM_earliest$,$PAM_latest$,$IsNotInteractive$)`] | `CA_PAM-eval_output_dest_nt_domain` | rename src AS PAM_src | rename dest_nt_domain AS PAM_dest_nt_domain | lookup dnslookup clientip as PAM_dest_ip outputnew clienthost AS PAM_dest_dns | rex field=PAM_dest_dns "(?<PAM_dest>[^.]+)" | eval Actual_Authenticaion_Server=if(isnull(Actual_Authenticaion_Server), PAM_dest_ip, Actual_Authenticaion_Server) | eval PAM_dest_nt_domain=if(isnull(PAM_dest_nt_domain), PAM_dest, PAM_dest_nt_domain) | eval PAM_Action=if(Service_App=="Exchange Server Web Access", "Use Web Password", PAM_Action)
iseval = 0

[CA_PAM]
definition = `CA_PAM-Retrievepassword` | append [ search `CA_PAM-UsePassword`] | `CA_PAM-eval_output_dest_nt_domain` | rename src AS PAM_src | rename dest_nt_domain AS PAM_dest_nt_domain | lookup dnslookup clientip as PAM_dest_ip OUTPUTNEW clienthost AS PAM_dest_dns | rex field=PAM_dest_dns "(?<PAM_dest>[^.]+)" | eval Actual_Authenticaion_Server=if(isnull(Actual_Authenticaion_Server), PAM_dest_ip, Actual_Authenticaion_Server) | eval PAM_dest_nt_domain=if(isnull(PAM_dest_nt_domain), PAM_dest, PAM_dest_nt_domain) | eval PAM_Action=if(Service_App=="Exchange Server Web Access", "Use Web Password", PAM_Action)
iseval = 0

[Dummy_Record]
definition = index="_*" NOT sourcetype="kvstore" | head 1 | addinfo | fields _time, "info_max_time","info_min_time","info_search_time","info_sid"
iseval = 0