### PSM Summaries and Reports ###

[F5 - PSM - Request Status Over Time - Summary]
action.email.sendresults = 0
action.summary_index = 1
cron_schedule = */59 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = +0s
displayview = flashtimeline
enableSched = 0
request.ui_dispatch_view = flashtimeline
search = sourcetype=psm_log | sitimechart count by request_status
vsid = fx3mgenj

[F5 - PSM - Top Virtuals by Violations - Summary]
action.email.sendresults = 0
action.summary_index = 1
cron_schedule = */59 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = +0s
displayview = flashtimeline
enableSched = 0
request.ui_dispatch_view = flashtimeline
search = sourcetype=psm_log | sitop ip_client violations vs_name
vsid = fx3mgenj


### PSM Reports ###
[F5 - PSM HTTP Report - Request Status Over Time]
displayview = flashtimeline
enableSched = 0
request.ui_dispatch_view = flashtimeline
search = sourcetype=psm_log protocol=HTTP | timechart count by request_status

[F5 - PSM HTTP Report - Top Violations]
displayview = flashtimeline
enableSched = 0
request.ui_dispatch_view = flashtimeline
search = sourcetype=psm_log  protocol=HTTP | top violations

[F5 - PSM HTTP Report - Top Accessed Virtual Severs]
displayview = flashtimeline
enableSched = 0
request.ui_dispatch_view = flashtimeline
search = sourcetype=psm_log protocol=HTTP | top vs_name

[F5 - PSM HTTP Report - Top Attacking IPs]
displayview = flashtimeline
enableSched = 0
request.ui_dispatch_view = flashtimeline
search = sourcetype=psm_log protocol=HTTP | top ip_client

### PSM Reports on summaries ###
[F5 - PSM - Request Status Over Time - Report]
action.email.sendresults = 0
cron_schedule = */10 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = +0s
displayview = flashtimeline
enableSched = 0
request.ui_dispatch_view = flashtimeline
search = index="summary" F5  PSM Request Status Over Time  Summary  | timechart count by request_status
vsid = fx3rsu63

[F5 - PSM - Top Violations - Report]
action.email.sendresults = 0
cron_schedule = */59 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = +0s
displayview = flashtimeline
enableSched = 0
request.ui_dispatch_view = flashtimeline
search = index=summary F5 PSM Top Virtuals by Violations Summary | top violations | head 20 | fields - percent
vsid = fx3rsu63

[F5 - PSM - Top Accessed Virtual Servers - Report]
action.email.sendresults = 0
cron_schedule = */59 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = +0s
displayview = flashtimeline
enableSched = 0
request.ui_dispatch_view = flashtimeline
search = index=summary F5 PSM Top Virtuals by Violations Summary | top vs_name | head 20 | fields - percent
vsid = fx3rsu63

[F5 - PSM - Top Attacking IPs - Report]
action.email.sendresults = 0
cron_schedule = */59 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = +0s
displayview = flashtimeline
enableSched = 0
request.ui_dispatch_view = flashtimeline
search = index=summary F5 PSM Top Virtuals by Violations Summary | top ip_client | head 20 | fields - percent
vsid = fx3rsu63


### ASM Summaries and Reports ###

[F5 - ASM - Request Status Over Time - Summary]
action.email.sendresults = 0
action.summary_index = 1
cron_schedule = */59 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = +0s
displayview = flashtimeline
enableSched = 1
request.ui_dispatch_view = flashtimeline
search = sourcetype=asm_log | sitimechart count by request_status
vsid = fx3mgenj

[F5 - ASM - Web Applications by Attack and Method - Summary]
action.email.sendresults = 0
action.summary_index = 1
cron_schedule = */59 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = +0s
displayview = flashtimeline
enableSched = 1
request.ui_dispatch_view = flashtimeline
search = sourcetype=asm_log | sitop ip_client violations attack_type web_application_name method
vsid = fx3mgenj

[F5 - ASM Report - Request Status Over Time]
displayview = flashtimeline
enableSched = 0 
request.ui_dispatch_view = flashtimeline
search = `Request_Status_over_time_by_webapp(*,*)`

[F5 - ASM Report - Top Violations]
displayview = flashtimeline
enableSched = 0 
request.ui_dispatch_view = flashtimeline
search = `Top_violations_by_webapp_and_device(*,*)`

[F5 - ASM Report - Top Web Applications]
displayview = flashtimeline
enableSched = 0 
request.ui_dispatch_view = flashtimeline
search = sourcetype=asm_log  | top web_application_name

[F5 - ASM Report - Top Attacking IPs]
displayview = flashtimeline
enableSched = 0 
request.ui_dispatch_view = flashtimeline
search = `Top_attacking_IPs(*,*)`

[F5 - ASM Report - Top Attack Types]
displayview = flashtimeline
enableSched = 0 
request.ui_dispatch_view = flashtimeline
search = `Top_attack_types(*,*)`

#### Summmary based searches ####

[F5 - ASM  - Top Violations - Report]
action.email.sendresults = 0
cron_schedule = */59 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = +0s
displayview = flashtimeline
enableSched = 0
request.ui_dispatch_view = flashtimeline
search = index=summary F5 ASM Web Applications by Attack and Method Summary | top violations | head 20 | fields - percent
vsid = fx3rsu63

[F5 - ASM  - Top Sites - Report]
action.email.sendresults = 0
cron_schedule = */59 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = +0s
displayview = flashtimeline
enableSched = 0
request.ui_dispatch_view = flashtimeline
search = index=summary F5 ASM Web Applications by Attack and Method Summary | top web_application_name | head 20 | fields - percent
vsid = fx3rsu63

[F5 - ASM  - Top Attacker - Report]
action.email.sendresults = 0
cron_schedule = */59 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = +0s
displayview = flashtimeline
enableSched = 0
request.ui_dispatch_view = flashtimeline
search = index=summary F5 ASM Web Applications by Attack and Method Summary | top ip_client | head 20 | fields - percent
vsid = fx3rsu63

[F5 - ASM  - Request Status Over Time - Report]
action.email.sendresults = 0
cron_schedule = */10 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = +0s
displayview = flashtimeline
enableSched = 0 
request.ui_dispatch_view = flashtimeline
search = index="summary" F5  ASM  Request Status Over Time  Summary  | timechart count by request_status
vsid = fx3rsu63


[F5 - ASM  - Top Violations - Report]
action.email.sendresults = 0
cron_schedule = */59 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = +0s
displayview = flashtimeline
enableSched = 0 
request.ui_dispatch_view = flashtimeline
search = index=summary F5 ASM Web Applications by Attack and Method Summary | top violations | head 20 | fields - percent
vsid = fx3rsu63

[F5 - ASM  - Top Sites - Report]
action.email.sendresults = 0
cron_schedule = */59 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = +0s
displayview = flashtimeline
enableSched = 0 
request.ui_dispatch_view = flashtimeline
search = index=summary F5 ASM Web Applications by Attack and Method Summary | top web_application_name | head 20 | fields - percent
vsid = fx3rsu63

[F5 - ASM  - Top Attacker - Report]
action.email.sendresults = 0
cron_schedule = */59 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = +0s
displayview = flashtimeline
enableSched = 0 
request.ui_dispatch_view = flashtimeline
search = index=summary F5 ASM Web Applications by Attack and Method Summary | top ip_client | head 20 | fields - percent
vsid = fx3rsu63

[F5 - ASM  - Top Attack Type - Report]
action.email.sendresults = 0
cron_schedule = */59 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = +0s
displayview = flashtimeline
enableSched = 0 
request.ui_dispatch_view = flashtimeline
search = index=summary F5 ASM Web Applications by Attack and Method Summary | top attack_type | head 20 | fields - percent
vsid = fx3rsu63

## DoS Reports ##

[F5 - ASM DoS Report - Dropped requests by URL per attack]
displayview = flashtimeline
enableSched = 0
request.ui_dispatch_view = flashtimeline
search = sourcetype="asm_log" | chart max(dos_dropped_request_count) over attack_id by client_request_uri
vsid = g0ttkqh4

[F5 - ASM DoS Report - Dropped requests by URL total]
displayview = flashtimeline
enableSched = 0
request.ui_dispatch_view = flashtimeline
search =  sourcetype="asm_log" |stats max(dos_dropped_request_count) as max_drop by client_request_uri attack_id |stats sum(max_drop) by client_request_uri


[F5 - ASM DoS Report - Dropped requests by IP per attack]
displayview = flashtimeline
enableSched = 0
request.ui_dispatch_view = flashtimeline
search =  sourcetype="asm_log" | chart max(dos_dropped_request_count) over attack_id by attacker_ip

[F5 - ASM DoS Report - Dropped requests by IP total]
displayview = flashtimeline
enableSched = 0
request.ui_dispatch_view = flashtimeline
search =  sourcetype="asm_log" | stats max(dos_dropped_request_count) as max_drop by attack_id attacker_ip | stats sum(max_drop) by attacker_ip

[F5 - ASM DoS Report - Dropped requests by Country total]
displayview = flashtimeline
enableSched = 0
request.ui_dispatch_view = flashtimeline
search = sourcetype="asm_log" | stats max(dos_dropped_request_count) as max_drop by attacker_ip country | stats sum(max_drop) by country
	
### Firepass Summaries and Reports ###

[F5 - FirePass - Connections Over Time]
action.email.sendresults = 0
action.summary_index = 1
cron_schedule = */59 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = +0s
displayview = flashtimeline
enableSched = 0
request.ui_dispatch_view = flashtimeline
search = sourcetype=firepass_log eventtype="*" | timechart count by eventtype
vsid = fx3mgenj

[F5 - FirePass - Connections by User]
action.summary_index = 1
cron_schedule = */59 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = +0s
displayview = flashtimeline
enableSched = 0
request.ui_dispatch_view = flashtimeline
search = sourcetype="firepass_log" user logged on | top user src_ip
vsid = fx3mgenj


[F5 - FirePass - Failed Connections by User]
action.summary_index = 1
cron_schedule = */59 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = +0s
displayview = flashtimeline
enableSched = 0
request.ui_dispatch_view = flashtimeline
search = sourcetype="firepass_log" failed to log on | top user src_ip
vsid = fx3mgenj


[F5 - FirePass - Connections Over Time]
action.email.sendresults = 0
cron_schedule = */10 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = +0s
displayview = flashtimeline
enableSched = 0 
request.ui_dispatch_view = flashtimeline
search = index="summary" F5 firepass connections over time summary | timechart count by eventtype
vsid = fx3rsu63


[F5 - Firepass  -  Connections by User]
action.email.sendresults = 0
cron_schedule = */59 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = +0s
displayview = flashtimeline
enableSched = 0 
request.ui_dispatch_view = flashtimeline
search = index="summary" F5 FirePass Connections by User Summary | top user | head 20	
vsid = fx3rsu63

[F5 - Firepass  - Failed Connections by User]
action.email.sendresults = 0
cron_schedule = */59 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = +0s
displayview = flashtimeline
enableSched = 0 
request.ui_dispatch_view = flashtimeline
search = index="summary" F5 FirePass failed Connections by User Summary | top user | head 20
vsid = fx3rsu63






#######################################################################
#################### INPUTS DASHBOARD SAVED SEACHES ###################
#######################################################################


[Inputs - Recent Changed Files]
search = index=_internal group=per_source_thruput earliest=-24h source=*metrics.log NOT splunk | dedup series | fields series | rename series as Filename  
dispatch.earliest_time = -24h

[Inputs - Recent Ignored Files]
search = index=_internal source=*splunkd.log earliest=-24h component="fileclassifiermanager" message="invalid file*" | fields message 
dispatch.earliest_time = -24h

[Inputs - Crawl]
search = | crawl | fields source, sourcetype, size


#######################################################################
#################### ADMIN DASHBOARD SAVED SEACHES ####################
#######################################################################

[Admin - System Info]
search = index=_internal source=*splunkd.log component="loader" message="system info*"| head 1 | fields message | fields - _*

[Admin - Splunkd Errors This Hour]
search = index=_internal source="*splunkd.log" earliest=-1h log_level="error" | stats count | rangemap field=count low=0-0 elevated=1-9 default=severe
dispatch.earliest_time = -1h

[Admin - Splunkd Avg Access Delay This Hour]
search = index=_internal source="*splunkd_access.log" earliest=-1h | rex "(?<delay>\d+)ms$" | stats avg(delay) as d | eval d = round(d, 3) | rangemap field=d low=0-250 elevated=250-499 default=severe
dispatch.earliest_time = -1h

[Admin - Splunkd Avg Uptime]
search = source="*splunkd.log" index=_internal "splunkd starting" OR "shutting down splunkd" | transaction startswith="splunkd starting" endswith="shutting down splunkd" | stats avg(duration) as avgdur | eval avgdur = round(avgdur/3600,3) | rangemap field=avgdur low=24-99999999 elevated=1-23.999 default=severe 

[Admin - Splunkd Recent Errors]
search = index=_internal source=*splunkd.log (log_level="fatal" OR log_level="error")| dedup punct| head 100 | fields Message
dispatch.earliest_time = -24h

[Admin - Recent Timestamping Issues]
search = index=_internal source=*splunkd.log component="dateparserverbose" | dedup message | fields message 
dispatch.earliest_time = -24h

[Admin - Splunkweb 404s This Hour]
search = index=_internal 404 source="*web_access.log" earliest=-1h | stats count | rangemap field=count low=0-0 elevated=1-100 default=severe
dispatch.earliest_time = -1h

[Admin - Splunkweb Recent Unhandled Exceptions]
search = index=_internal source=*web_service.log message="*Traceback*" | dedup component,line|rename message as _raw
dispatch.earliest_time = -24h

[Admin - Splunkweb Recent Errors]
search = index=_internal source=*web_service.log log_level=error NOT traceback NOT "request headers"| dedup message | fields Message
dispatch.earliest_time = -24h

[Admin - Splunkweb Browser Usage]
search = index=_internal source=*web_service.log  useragent=* | timechart count(useragent) by useragent
dispatch.earliest_time = -24h
dispatch.latest_time = now


