[User list - Successful login past 30d]
action.email.useNSSubject = 1
action.sendmn = 1
alert.severity = 1
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = 0 * * * *
dispatch.earliest_time = -30d
dispatch.latest_time = now
display.general.type = statistics
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = SOCPrimePasswordSecurityBasic
request.ui_dispatch_view = search
search = index=* source="WinEventLog:security" (EventCode=528 OR EventCode=540 OR EventCode=4624) (Logon_Type=2 OR Logon_Type=3 OR Logon_Type=7 OR Logon_Type=10) | eval User=if(mvcount(Account_Name)>1, mvindex(Account_Name,1), mvindex(Account_Name, 0)) |search NOT  (User=*$ OR User="ANONYMOUS LOGON" OR User="LOCAL SERVICE" OR User=SYSTEM) | stats count by User | fields User| outputlookup users.csv

[Successful login IP-User list past 30d]
action.email.useNSSubject = 1
action.sendmn = 1
alert.severity = 1
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = 0 * * * *
dispatch.earliest_time = -30d
dispatch.latest_time = now
display.general.type = statistics
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = SOCPrimePasswordSecurityBasic
request.ui_dispatch_view = search
search = index=* source="WinEventLog:security" (EventCode=528 OR EventCode=540 OR EventCode=4624) (Logon_Type=2 OR Logon_Type=3 OR Logon_Type=7 OR Logon_Type=10) | eval User=if(mvcount(Account_Name)>1, mvindex(Account_Name,1), mvindex(Account_Name, 0)) | search NOT(User=*$ OR User="ANONYMOUS LOGON" OR User="LOCAL SERVICE" OR User=SYSTEM)  (Source_Network_Address=*  AND Source_Network_Address!="-")| lookup dnsLookup ip as Source_Network_Address OUTPUT host as Source_Host | dedup Source_Network_Address User|rename _time as Time |table Time Source_Host Source_Network_Address User | outputlookup successful_logins.csv
