[Models 1h summary]
action.email.show_password = 1
action.email.useNSSubject = 1
action.keyindicator.invert = 0
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.forceCsvResults = 1
action.risk.param.verbose = 0
action.send2uba.param.verbose = 0
action.threat_add.param.verbose = 0
action.webhook.enable_allowlist = 0
alert.track = 0
cron_schedule = 30 * * * *
description = Outputs in lookup all searches and their relations along with attributes.
dispatch.earliest_time = -60m@m
dispatch.latest_time = now
display.general.type = statistics
display.page.search.mode = fast
display.page.search.tab = statistics
display.visualizations.show = 0
enableSched = 1
request.ui_dispatch_app = mlops_4_splunk
request.ui_dispatch_view = search
schedule_window = auto
search = | listmodels\
|eval _time=now()\
|table _time name type options owner app sharing\
| outputlookup append=true ml_models_1h.csv

[MLOPS Events By Sourcetype Per Hour - Model Gen]
action.email.show_password = 1
action.email.useNSSubject = 1
action.keyindicator.invert = 0
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.forceCsvResults = 1
action.risk.param.verbose = 0
action.send2uba.param.verbose = 0
action.threat_add.param.verbose = 0
action.webhook.enable_allowlist = 0
alert.track = 0
cron_schedule = 0 * * * *
dispatch.earliest_time = -7d@d
dispatch.latest_time = -1d@d
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.custom.type = parallel_coordinates_app.parallel_coordinates
display.visualizations.show = 0
enableSched = 0
request.ui_dispatch_app = mlops_4_splunk
request.ui_dispatch_view = search
search = | tstats summariesonly=t count where index=* [ | inputlookup ml_events_by_sourcetype_1h|table sourcetype ] by _time sourcetype span=1h\
|stats avg(count) as avg_evt_count by _time sourcetype\
| eval HourOfDay=strftime(_time, "%H")\
| eval DayOfWeek=strftime(_time, "%A")\
| eval workday=if(DayOfWeek="Saturday" OR DayOfWeek="Sunday", 0,1)\
| fit DensityFunction avg_evt_count by "sourcetype,DayOfWeek,HourOfDay"  partial_fit=true dist=norm into app:mlops_events_by_sourcetype_1h

[MLOPS Events By Sourcetype Per Hour - Baseline Model Gen]
action.email.show_password = 1
action.email.useNSSubject = 1
action.keyindicator.invert = 0
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.forceCsvResults = 1
action.risk.param.verbose = 0
action.send2uba.param.verbose = 0
action.threat_add.param.verbose = 0
action.webhook.enable_allowlist = 0
alert.track = 0
cron_schedule = 15 * * * *
dispatch.earliest_time = -7d@d
dispatch.latest_time = -1d@d
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.custom.type = parallel_coordinates_app.parallel_coordinates
display.visualizations.show = 0
request.ui_dispatch_app = mlops_4_splunk
request.ui_dispatch_view = search
search = | tstats summariesonly=t count where index=* \
    [| inputlookup ml_events_by_sourcetype_1h \
    | fields sourcetype] by _time sourcetype span=1h \
| stats avg(count) as avg_evt_count by _time sourcetype     \
| eval HourOfDay=strftime(_time, "%H")\
| eval DayOfWeek=strftime(_time, "%A")\
| eval workday=if(DayOfWeek="Saturday" OR DayOfWeek="Sunday", 0,1)    \
| fit DensityFunction avg_evt_count by sourcetype dist=norm into app:mlops_events_by_sourcetype_1h

[MLOPS Results By Search Per Hour - Baseline Model Gen]
action.email.show_password = 1
action.email.useNSSubject = 1
action.keyindicator.invert = 0
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.forceCsvResults = 1
action.risk.param.verbose = 0
action.send2uba.param.verbose = 0
action.threat_add.param.verbose = 0
action.webhook.enable_allowlist = 0
alert.track = 0
cron_schedule = 0 16 * * *
description = Model generation for monitoring ML search results
dispatch.earliest_time = -30d@d
dispatch.latest_time = -1d@d
display.general.type = statistics
display.page.search.tab = statistics
enableSched = 1
request.ui_dispatch_view = search
schedule_window = auto
search = index=_audit sourcetype=audittrail fully_completed_search=true search_type=scheduled savedsearch_name!="" savedsearch_name!="search*"\
|rename savedsearch_name as search\
|search [ | inputlookup ml_results_by_search_1h.csv|table search | format "(" "(" "AND" ")" "OR" ")" ]\
|search search!="Audit - Notable Default Modify for Correlation Searches"\
|stats avg(result_count) as avg_result_count by _time search\
| fit DensityFunction avg_result_count by search dist=norm into app:ml_results_by_search_1h as IsOutlier

[MLOPS Results By Search Per 24h - Baseline Model Gen]
action.email.show_password = 1
action.email.useNSSubject = 1
action.keyindicator.invert = 0
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.forceCsvResults = 1
action.risk.param.verbose = 0
action.send2uba.param.verbose = 0
action.threat_add.param.verbose = 0
action.webhook.enable_allowlist = 0
alert.track = 0
cron_schedule = 0 23 * * *
description = Model generation for monitoring ML search results on 24h
dispatch.earliest_time = -7d@h
dispatch.latest_time = now
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.show = 0
request.ui_dispatch_app = mlops_4_splunk
request.ui_dispatch_view = search
schedule_window = auto
search = index=_audit sourcetype=audittrail fully_completed_search=true search_type=scheduled savedsearch_name!="" savedsearch_name!="search*"\
|rename savedsearch_name as search\
|search [ | inputlookup ml_results_by_search_24h.csv | format "(" "(" "AND" ")" "OR" ")" ]\
|search search!="Audit - Notable Default Modify for Correlation Searches"\
|stats avg(result_count) as avg_result_count by _time search\
| fit DensityFunction avg_result_count by search dist=norm into app:ml_results_by_search_24h as IsOutlier


[MLOPS Events By Search Per 24h - Baseline Model Gen]
action.email.show_password = 1
action.email.useNSSubject = 1
action.keyindicator.invert = 0
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.forceCsvResults = 1
action.risk.param.verbose = 0
action.send2uba.param.verbose = 0
action.threat_add.param.verbose = 0
action.webhook.enable_allowlist = 0
alert.track = 0
cron_schedule = 0 23 * * *
description = Model generation for monitoring ML search events on 24h
dispatch.earliest_time = -7d@h
dispatch.latest_time = now
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.show = 0
enableSched = 0
request.ui_dispatch_app = mlops_4_splunk
request.ui_dispatch_view = search
schedule_window = auto
search = index=_audit sourcetype=audittrail fully_completed_search=true search_type=scheduled savedsearch_name!="" savedsearch_name!="search*"\
|rename savedsearch_name as search\
|search [ | inputlookup ml_events_by_search_24h.csv |table search| format "(" "(" "AND" ")" "OR" ")" ]\
|search search!="Audit - Notable Default Modify for Correlation Searches"\
|stats avg(event_count) as avg_evt_count by _time search\
\
| eval HourOfDay=strftime(_time, "%H")\
| eval DayOfWeek=strftime(_time, "%A")\
| eval workday=if(DayOfWeek="Saturday" OR DayOfWeek="Sunday", 0,1) \
| fit DensityFunction "avg_evt_count" by "DayOfWeek,search" dist=auto show_density=true show_options="feature_variables,split_by,params" into app:ml_events_by_search_24h


[MLOPS Anomaly in Results By Search Per Hour]
action.email.show_password = 1
action.keyindicator.invert = 0
action.lookup = 1
action.lookup.append = 1
action.lookup.filename = ml_alerts.csv
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.forceCsvResults = 1
action.risk.param.verbose = 0
action.send2uba.param.verbose = 0
action.threat_add.param.verbose = 0
action.webhook.enable_allowlist = 0
alert.expires = 24d
alert.severity = 1
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = 15 * * * *
description = Detects anomalies in the events count for the monitored ML search
dispatch.earliest_time = -1h
dispatch.latest_time = now
display.general.type = statistics
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = mlops_4_splunk
request.ui_dispatch_view = search
search = index=_audit sourcetype=audittrail fully_completed_search=true search_type=scheduled savedsearch_name!="" savedsearch_name!="search*"\
|rename savedsearch_name as search\
|search [ | inputlookup ml_results_by_search_1h.csv|table search | format "(" "(" "AND" ")" "OR" ")" ]\
|search search!="Audit - Notable Default Modify for Correlation Searches"\
|stats avg(result_count) as avg_result_count by _time search\
| apply app:ml_results_by_search_1h  show_density=true as IsOutlier\
|search IsOutlier=1\
| eval  span="24h" ,alert_name="MLOPS Anomaly in Results By Search Per Hour"\
|table _time alert_name span search avg_result_count IsOutlier BoundaryRanges "ProbabilityDensity(avg_result_count)"

[MLOPS Anomaly in Events By Sourcetype Per Hour]
action.email.show_password = 1
action.keyindicator.invert = 0
action.lookup = 1
action.lookup.append = 1
action.lookup.filename = ml_sourcetype_alerts.csv
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.forceCsvResults = 1
action.risk.param.verbose = 0
action.send2uba.param.verbose = 0
action.threat_add.param.verbose = 0
action.webhook.enable_allowlist = 0
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = 0 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = now
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.custom.type = parallel_coordinates_app.parallel_coordinates
enableSched = 0
quantity = 0
relation = greater than
request.ui_dispatch_app = mlops_4_splunk
request.ui_dispatch_view = search
search = | tstats summariesonly=t count where index=* \
    [| inputlookup ml_events_by_sourcetype_1h \
    | table sourcetype] by _time sourcetype \
| stats avg(count) as avg_evt_count by _time sourcetype \
| eval HourOfDay=strftime(_time, "%H") \
| eval DayOfWeek=strftime(_time, "%A") \
| eval workday=if(DayOfWeek="Saturday" OR DayOfWeek="Sunday", 0,1) \
| apply app:mlops_events_by_sourcetype_1h show_density=true \
| rename "IsOutlier(avg_evt_count)" as outlier \
| rename "ProbabilityDensity(avg_evt_count)" as probability \
| where outlier=1\
		|outputlookup ml_sourcetype_alerts.csv append=true

[MLOPS Clear ML alerts]
action.email.show_password = 1
action.email.useNSSubject = 1
action.keyindicator.invert = 0
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.forceCsvResults = 1
action.risk.param.verbose = 0
action.send2uba.param.verbose = 0
action.threat_add.param.verbose = 0
action.webhook.enable_allowlist = 0
alert.track = 0
cron_schedule = 0 0 * * 1
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
display.general.type = statistics
display.page.search.mode = fast
display.page.search.tab = statistics
display.visualizations.charting.chart = area
display.visualizations.custom.type = heat-map-viz.heat-map-viz
display.visualizations.show = 0
enableSched = 1
request.ui_dispatch_app = mlops_4_splunk
request.ui_dispatch_view = search
search = |outputlookup ml_alerts.csv

[MLOPS Events By Search Per Hour - Baseline Model Gen]
action.email.show_password = 1
action.email.useNSSubject = 1
action.keyindicator.invert = 0
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.forceCsvResults = 1
action.risk.param.verbose = 0
action.send2uba.param.verbose = 0
action.threat_add.param.verbose = 0
action.webhook.enable_allowlist = 0
alert.track = 0
cron_schedule = 0 16 * * *
description = Model generation for monitoring ML search events
dispatch.earliest_time = -30d@d
dispatch.latest_time = -1d@d
display.general.type = statistics
display.page.search.tab = statistics
enableSched = 0
request.ui_dispatch_view = search
schedule_window = auto
search = index=_audit sourcetype=audittrail fully_completed_search=true search_type=scheduled savedsearch_name!="" savedsearch_name!="search*"\
|rename savedsearch_name as search\
|search [ | inputlookup ml_events_by_search_1h.csv |table search| format "(" "(" "AND" ")" "OR" ")" ]\
|search search!="Audit - Notable Default Modify for Correlation Searches"\
|stats avg(event_count) as avg_evt_count by _time search\
| eval HourOfDay=strftime(_time, "%H")\
| eval DayOfWeek=strftime(_time, "%A")\
| eval workday=if(DayOfWeek="Saturday" OR DayOfWeek="Sunday", 0,1) \
| fit DensityFunction "avg_evt_count" by "DayOfWeek,search" dist=auto show_density=true show_options="feature_variables,split_by,params" into app:ml_events_by_search_1h

[MLOPS Anomaly in Events By Search Per Hour]
action.email.show_password = 1
action.keyindicator.invert = 0
action.lookup = 1
action.lookup.append = 1
action.lookup.filename = ml_alerts.csv
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.forceCsvResults = 1
action.risk.param.verbose = 0
action.send2uba.param.verbose = 0
action.threat_add.param.verbose = 0
action.webhook.enable_allowlist = 0
alert.expires = 24d
alert.severity = 1
alert.suppress = 1
alert.suppress.period = 180m
alert.track = 1
counttype = number of events
cron_schedule = 0 * * * *
description = Detects anomalies in the events count for the monitored ML search
dispatch.earliest_time = -1h
dispatch.latest_time = now
display.general.type = statistics
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = mlops_4_splunk
request.ui_dispatch_view = search
search = index=_audit sourcetype=audittrail fully_completed_search=true search_type=scheduled savedsearch_name!="" savedsearch_name!="search*"\
|rename savedsearch_name as search\
|search [ | inputlookup ml_events_by_search_1h.csv |table search| format "(" "(" "AND" ")" "OR" ")" ]\
|search search!="Audit - Notable Default Modify for Correlation Searches"\
|bin span=1h _time\
| eval HourOfDay=strftime(_time, "%H")\
| eval DayOfWeek=strftime(_time, "%A")\
| eval workday=if(DayOfWeek="Saturday" OR DayOfWeek="Sunday", 0,1) \
|stats avg(event_count) as avg_evt_count by _time HourOfDay DayOfWeek search \
| apply app:ml_events_by_search_1h show_density=true as IsOutlier\
	| search IsOutlier=1\
	| eval  span="1h" ,alert_name="MLOPS Anomaly in Events By Search Per Hour"\
	| fields _time alert_name search avg_evt_count span outlier probability\
	|table _time alert_name search avg_evt_count IsOutlier BoundaryRanges "ProbabilityDensity(avg_evt_count)"


[MLOPS Clear ML models]
action.email.show_password = 1
action.email.useNSSubject = 1
action.keyindicator.invert = 0
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.forceCsvResults = 1
action.risk.param.verbose = 0
action.send2uba.param.verbose = 0
action.threat_add.param.verbose = 0
action.webhook.enable_allowlist = 0
alert.track = 0
cron_schedule = 0 0 * * 1
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
display.general.type = statistics
display.page.search.mode = fast
display.page.search.tab = statistics
display.visualizations.charting.chart = area
display.visualizations.custom.type = heat-map-viz.heat-map-viz
display.visualizations.show = 0
enableSched = 1
request.ui_dispatch_app = mlops_4_splunk
request.ui_dispatch_view = search
search = |outputlookup ml_models_1h.csv


[MLOPS Clear ML alerts sourcetypes]
action.email.show_password = 1
action.email.useNSSubject = 1
action.keyindicator.invert = 0
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.forceCsvResults = 1
action.risk.param.verbose = 0
action.send2uba.param.verbose = 0
action.threat_add.param.verbose = 0
action.webhook.enable_allowlist = 0
alert.track = 0
cron_schedule = 0 0 * * 1
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
display.general.type = statistics
display.page.search.mode = fast
display.page.search.tab = statistics
display.visualizations.charting.chart = area
display.visualizations.custom.type = heat-map-viz.heat-map-viz
display.visualizations.show = 0
enableSched = 1
request.ui_dispatch_app = mlops_4_splunk
request.ui_dispatch_view = search
search = |outputlookup ml_sourcetype_alerts.csv

[ML Searches 1h]
search = | rest /servicesNS/-/-/saved/searches \
| eval is_enabled = if(disabled=0,"Yes","No") \
| eval is_scheduled_cu = if(is_scheduled=1,"Yes","No") \
\
| eval ml_search_type=case(search LIKE "%| apply %" OR search LIKE "%|apply %" OR search LIKE "%mltk_findbest%" OR search LIKE "%mltk_apply_upper%" OR search LIKE "%mltk_apply_lower%" OR search LIKE "%mltk_apply%", "ml_search_model_apply", search LIKE "% into %" AND search LIKE "%fit %","ml_search_model_gen",search LIKE "%fit %" AND search !="*apply*","ml_search_direct" , search!="*fit*" AND search !="*apply*","normal_search") \
\
| rex field=search "into (?<ml_model_name>\w+)" \
| rex field=search "into [\"](?<ml_model_name>\w+)" \
| rex field=search "into app:(?<ml_model_name>\w+)" \
| rex field=search "apply [\"](?<ml_model_name>\w+)"\
| rex field=search "apply (?<ml_model_name>\w+)"\
| rex field=search "apply app:(?<ml_model_name>\w+)"\
| rex field=search "mltk_findbest\(\"app:(?<ml_model_name>\w+)"\
| rex field=search "mltk_apply\(\"app:(?<ml_model_name>\w+)"\
| rex field=search "mltk_apply_upper\(\"app:(?<ml_model_name>\w+)"\
| rex field=search "mltk_apply_lower\(\"app:(?<ml_model_name>\w+)"\
\
| rex field=search "datamodel\W{1,2}(?<datamodel>\w+)"\
| rex field=search "tstats.*?from datamodel=(?<datamodel>\w+)"\
| eval datamodel2=case(match(search, "src_dest_tstats"), mvappend("Network_Traffic", "Intrusion_Detection", "Web"), match(search, "(access_tracker|inactive_account_usage)"), "Authentication", match(search, "malware_operations_tracker"), "Malware", match(search, "(primary_functions|listeningports|localprocesses|services)_tracker"), "Application_State", match(search, "useraccounts_tracker"), "Compute_Inventory")\
| eval datamodel=mvappend(datamodel, datamodel2)\
| eval datamodel=if(datamodel!="",datamodel,"NoDataModelFound")\
\
| table actions ml_search_type ml_model_name datamodel datamodel2 search eai:acl.app eai:acl.owner id is_enabled is_scheduled is_scheduled_cu is_visible next_scheduled_time qualifiedSearch realtime_schedule request.ui_dispatch_app schedule_priority schedule_window splunk_server title description triggered_alert_count updated cron_schedule is_scheduled is_scheduled_cu disabled is_enabled dispatch.earliest_time dispatch.latest_time alert.digest_mode id\
| search ml_search_type="ml_*" \
\
| join type=outer ml_model_name [| rest /servicesNS/-/-/saved/searches \
| eval is_enabled_model_gen = if(disabled=0,"Yes","No") \
| eval is_scheduled_model_gen = if(is_scheduled=1,"Yes","No") \
\
| eval ml_search_type=case(search LIKE "%| apply %" OR search LIKE "%|apply %" OR search LIKE "%mltk_findbest%" OR search LIKE "%mltk_apply_upper%" OR search LIKE "%mltk_apply_lower%" OR search LIKE "%mltk_apply%", "ml_search_model_apply", search LIKE "% into %" AND search LIKE "%fit %","ml_search_model_gen",search LIKE "%fit %" AND search !="*apply*","ml_search_direct" , search!="*fit*" AND search !="*apply*","normal_search") \
\
| rex field=search "into (?<ml_model_name>\w+)" \
| rex field=search "into [\"](?<ml_model_name>\w+)" \
| rex field=search "into app:(?<ml_model_name>\w+)" \
| rex field=search "apply [\"](?<ml_model_name>\w+)"\
| rex field=search "apply (?<ml_model_name>\w+)"\
| rex field=search "apply app:(?<ml_model_name>\w+)"\
|rename title as model_gen_title\
|rename ml_search_type AS type\
| table type is_enabled_model_gen is_scheduled_model_gen ml_model_name model_gen_title\
| search type="ml_search_model_gen" ]\
\
| join type=outer ml_model_name [| listmodels|rename name AS ml_model_name|rename type AS ml_model_type| table ml_model_name , ml_model_type , app]\
\
\
| table actions ml_search_type ml_model_name ml_model_type datamodel title model_gen_title is_enabled_model_gen is_scheduled_model_gen search eai:acl.app eai:acl.owner id is_enabled is_scheduled is_scheduled_cu is_visible next_scheduled_time qualifiedSearch realtime_schedule request.ui_dispatch_app schedule_priority schedule_window splunk_server title description triggered_alert_count updated cron_schedule is_scheduled is_scheduled_cu disabled is_enabled dispatch.earliest_time dispatch.latest_time alert.digest_mode id\
|rename title as ML_Search_Name\
|outputlookup ml_searches_1h.csv





