[Bastille Tag Alert]
action.lookup = 1
action.lookup.append = 1
action.lookup.filename = bastille_tag_alert.csv
action.webhook.enable_allowlist = 0
alert.digest_mode = 0
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = */5 * * * *
dispatch.earliest_time = -5m@m
dispatch.latest_time = @m
enableSched = 1
quantity = 0
relation = greater than
search = | tstats summariesonly=false count from datamodel=Bastille where `bastille_restricted_tags` by _time, Bastille.tags, Bastille.emitter.transmitter_id, Bastille.area.site_id, Bastille.area.map_id, Bastille.area.concentrator_id span=1s \
| stats values(Bastille.tags) as Tags latest(_time) as _time by Bastille.emitter.transmitter_id, Bastille.area.concentrator_id, Bastille.area.site_id, Bastille.area.map_id
disabled = 0

[Bastille Delete Old Alerts]
action.email.useNSSubject = 1
action.webhook.enable_allowlist = 0
alert.track = 0
cron_schedule = 8 4 * * *
display.general.timeRangePicker.show = 0
enableSched = 1
search = | inputlookup bastille_tag_alert.csv \
| where _time > now() - 15*86400\
| outputlookup bastille_tag_alert.csv