[Update openldap_user_lookup KV Store collection]
request.ui_dispatch_app = search
disabled = 0
alert.track = 0
cron_schedule = */2 * * * *
dispatch.earliest_time = -4m
dispatch.latest_time = -2m
enableSched = 1
search = sourcetype="openldap:access" operation="BIND" | dedup conn cn | table conn op cn | rename cn as user | lookup openldap_user_lookup conn, op OUTPUTNEW _key AS _key | outputlookup append=t openldap_user_lookup

[Update openldap_src_lookup KV Store collection]
request.ui_dispatch_app = search
disabled = 0
alert.track = 0
cron_schedule = */2 * * * *
dispatch.earliest_time = -4m
dispatch.latest_time = -2m
enableSched = 1
search = sourcetype="openldap:access" src_ip="*" | dedup conn src_ip | table conn src_ip | rename src_ip as src | lookup openldap_src_lookup conn OUTPUTNEW _key AS _key | outputlookup append=t openldap_src_lookup