[mac_check_augur_prediction_transaction]
definition = lookup augurPredictionLookup predicted_netblock as src_ip OUTPUT predicted_netblock as src_predicted_netblock  | lookup augurPredictionLookup predicted_netblock as dest_ip OUTPUT predicted_netblock as dest_predicted_netblock | eval dest_predicted_netblock=if(dest_predicted_netblock == "NONE", null, dest_predicted_netblock) | eval src_predicted_netblock=if(src_predicted_netblock == "NONE", null, src_predicted_netblock) | eval predicted_netblock=if(isnull(src_predicted_netblock), dest_predicted_netblock, src_predicted_netblock) | eval predicted_ip=if(!isnull(src_predicted_netblock), src_ip, if(!isnull(dest_predicted_netblock), dest_ip, null)) | eval prediction_direction=if(isnull(predicted_netblock), null, if(src_predicted_netblock != "NONE", "incoming", "outgoing"))

[mac_check_augur_watchlist_transaction]
definition = lookup augurIpWatchlist ip as src_ip OUTPUT ip as src_watchlist_ip | lookup augurIpWatchlist ip as dest_ip OUTPUT ip as dest_watchlist_ip | eval watchlist_ip=if(isnull(dest_watchlist_ip), src_watchlist_ip, dest_watchlist_ip)

[mac_check_augur_file_watchlist_transaction]
definition = lookup augurHashWatchlist hash as file_hash OUTPUT hash as file_hash | eval watchlist_file_hash=if(!isnull(file_hash), file_hash, null)

[mac_check_augur_url_watchlist_transaction]
definition = lookup augurUrlWatchlist url as url OUTPUT url as url | eval watchlist_url=if(!isnull(url), url, null)

[mac_check_augur_host_watchlist_transaction]
definition = lookup augurHostWatchlist host as host OUTPUT host as host | eval watchlist_host=if(!isnull(host), host, null)

[mac_check_augur_prediction_transaction_with_feedback]
definition = `mac_check_augur_prediction_transaction` | `mac_check_augur_watchlist_transaction` | where(!isnull(predicted_ip) or !isnull(watchlist_ip)) | augurpredictionfeedback

[mac_check_augur_watchlist_transaction_with_feedback]
definition = `mac_check_augur_file_watchlist_transaction` | `mac_check_augur_url_watchlist_transaction` | `mac_check_augur_host_watchlist_transaction` | where(!isnull(watchlist_file_hash) or !isnull(watchlist_url) or !null(watchlist_host)) | augurpredictionfeedback

[mac_cim_network_traffic_predictions_keep]
definition = index=* sourcetype=* | eval  dest_ip=dst_ip | eval src_ip=src_ip | `mac_check_augur_prediction_transaction_with_feedback` 

[mac_cim_network_traffic_predictions]
definition = `cim_Network_Traffic_indexes` | `mac_check_augur_prediction_transaction_with_feedback`

[mac_cim_endpoint]
definition = `cim_Endpoint_indexes` | `mac_check_augur_watchlist_transaction_with_feedback`

[mac_check_augur_prediction(1)]
args = field
definition = lookup augurPredictionLookup predicted_netblock as $field$ OUTPUT predicted_netblock  | where predicted_netblock != "NONE"

[mac_check_augur_prediction_with_feedback(1)]
args = field 
definition = `mac_check_augur_prediction($fields$)`  
