[Industrial Defender OT Asset List]
action.email.useNSSubject = 1
alert.track = 0
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.charting.chart = bar
display.visualizations.show = 0
request.ui_dispatch_app = splunk-app-asm
request.ui_dispatch_view = search
search = tag=ot_asset\
| table asset_id,asset_model,asset_status,asset_system,asset_type,asset_vendor,asset_version,asset_criticality,bunit,category,city,classification,country,dns,end_of_support,exposure,ip,is_expected,lat,lon,location,mac,nt_host,owner,parent_asset_id,pci_domain,priority,product_details,requires_av,serial,should_timesync,should_update,site_id,vlan,zone

[Industrial Defender OT Software Asset List]
action.email.useNSSubject = 1
alert.track = 0
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.charting.chart = bar
display.visualizations.show = 0
request.ui_dispatch_app = splunk-app-asm
request.ui_dispatch_view = search
search = tag=ot_asset_sw\
| table asset_id, asset_name, install_date, vendor, version

[Industrial Defender OTML Training Density Dest Bytes By Period Protocol]
action.email.useNSSubject = 1
alert.track = 0
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","app","description","dest","id","severity_id","severity","signature","src"]
display.general.timeRangePicker.show = 0
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.charting.chart = bar
display.visualizations.custom.type = Splunk_ML_Toolkit.OutliersViz
display.visualizations.show = 0
display.visualizations.type = custom
request.ui_dispatch_app = splunk-app-asm
request.ui_dispatch_view = search
search = index=* sourcetype="asm:netflow:json" earliest=-31d@h latest=-24h@h\
| bin _time span=15m \
| eval HourOfDay=strftime(_time, "%H")\
| eval DayOfWeek=strftime(_time, "%a")\
| eval Period=case(DayOfWeek="Sat" OR DayOfWeek="Sun", "Weekend", DayOfWeek!="Sat" AND DayOfWeek!="Sun" AND in(HourOfDay, 20,21,22,23,00,01,02,03,04,05,06), "WeekDayNight", DayOfWeek!="Sat" AND DayOfWeek!="Sun" AND in(HourOfDay, 07,08,09,10,11,12,13,14,15,16,17,18,19), "WeekDayDay")\
| stats avg(dest_bytes) as bytes by _time Period protocol  \
| fit DensityFunction bytes by "Period,protocol" dist=auto threshold=0.001 show_density=true show_options="feature_variables,split_by,params" into "asm_otml_density_dest_bytes_by_period_protocol"
cron_schedule = 0 4 1 * *
enableSched = 1

[Industrial Defender OTML Training Density Src Bytes By Period Protocol]
action.email.useNSSubject = 1
alert.track = 0
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","app","description","dest","id","severity_id","severity","signature","src"]
display.general.timeRangePicker.show = 0
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.charting.chart = bar
display.visualizations.custom.type = Splunk_ML_Toolkit.OutliersViz
display.visualizations.show = 0
display.visualizations.type = custom
request.ui_dispatch_app = splunk-app-asm
request.ui_dispatch_view = search
search = index=* sourcetype="asm:netflow:json" earliest=-31d@h latest=-24h@h\
| bin _time span=15m \
| eval HourOfDay=strftime(_time, "%H")\
| eval DayOfWeek=strftime(_time, "%a")\
| eval Period=case(DayOfWeek="Sat" OR DayOfWeek="Sun", "Weekend", DayOfWeek!="Sat" AND DayOfWeek!="Sun" AND in(HourOfDay, 20,21,22,23,00,01,02,03,04,05,06), "WeekDayNight", DayOfWeek!="Sat" AND DayOfWeek!="Sun" AND in(HourOfDay, 07,08,09,10,11,12,13,14,15,16,17,18,19), "WeekDayDay")\
| stats avg(src_bytes) as bytes by _time Period protocol  \
| fit DensityFunction bytes by "Period,protocol" dist=auto threshold=0.001 show_density=true show_options="feature_variables,split_by,params" into "asm_otml_density_src_bytes_by_period_protocol"
cron_schedule = 0 4 1 * *
enableSched = 1

[Industrial Defender OTML Training Density Dest Bytes By Conversation]
action.email.useNSSubject = 1
alert.track = 0
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","app","description","dest","id","severity_id","severity","signature","src"]
display.general.timeRangePicker.show = 0
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.charting.chart = bar
display.visualizations.custom.type = Splunk_ML_Toolkit.OutliersViz
display.visualizations.show = 0
display.visualizations.type = custom
request.ui_dispatch_app = splunk-app-asm
request.ui_dispatch_view = search
search = index=* sourcetype="asm:netflow:json" earliest=-31d@h latest=-24h@h \
| join type=inner src_ip [search index=* sourcetype="asm:adminprop:json" | rename ip as src_ip] \
| search dest_port != 0 | search dest_bytes > 0 \
| bin _time span=60m \
| stats count as connections avg(dest_bytes) as bytes by _time src_ip dest_ip dest_port\
| fit DensityFunction "bytes" by "src_ip,dest_ip,dest_port" dist=auto threshold=0.0001 show_density=true show_options="feature_variables,split_by,params" into asm_otml_density_dest_bytes_by_conversation
cron_schedule = 0 4 1 * *
enableSched = 1

[Industrial Defender OTML Training Density Src Bytes By Conversation]
action.email.useNSSubject = 1
alert.track = 0
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","app","description","dest","id","severity_id","severity","signature","src"]
display.general.timeRangePicker.show = 0
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.charting.chart = bar
display.visualizations.custom.type = Splunk_ML_Toolkit.OutliersViz
display.visualizations.show = 0
display.visualizations.type = custom
request.ui_dispatch_app = splunk-app-asm
request.ui_dispatch_view = search
search = index=* sourcetype="asm:netflow:json" earliest=-31d@h latest=-24h@h \
| join type=inner src_ip [search index=* sourcetype="asm:adminprop:json" | rename ip as src_ip] \
| search dest_port != 0 | search src_bytes > 0 \
| bin _time span=60m \
| stats count as connections avg(src_bytes) as bytes by _time src_ip dest_ip dest_port\
| fit DensityFunction "bytes" by "src_ip,dest_ip,dest_port" dist=auto threshold=0.0001 show_density=true show_options="feature_variables,split_by,params" into asm_otml_density_src_bytes_by_conversation
cron_schedule = 0 4 1 * *
enableSched = 1

