[source::...ta-crowdstrike-falcon-detections-data*.log*]
sourcetype = tacrowdstrikefalcondetections:log
TRUNCATE = 0

[source::...ta_crowdstrike_falcon_detections*.log*]
sourcetype = tacrowdstrikefalcondetections:log
TRUNCATE = 0

[crowdstrike:falcon:detections:json]
ANNOTATE_PUNCT = false
KV_MODE = json
LINE_BREAKER = ([\r\n]+)
MAX_TIMESTAMP_LOOKAHEAD = 35
NO_BINARY_CHECK = true
SHOULD_LINEMERGE = false
TIME_FORMAT = %Y-%m-%dT%H:%M:%S.%6N%Z
TIME_PREFIX = "updated_timestamp"\s*:\s*"
TZ = UTC
category = Network & Security
pulldown_type = 1
TRUNCATE = 0

EVAL-action = case('pattern_disposition' IN (16,26,128,144,512,522,538,1024,1152,2048,2176,4112,5120), "blocked", 'pattern_disposition' IN (0,272,282,768,778,794,1280,2304,2432,4368), "allowed", 'Success'=="false", "failure", 'Success'=="true", "success", 'pattern_disposition_details.blocking_unsupported_or_disabled'=true, "allowed", 'pattern_disposition_description' LIKE "%would have been%", "allowed", 'pattern_disposition_description' LIKE "%blocked%", "blocked", 'pattern_disposition_description' LIKE "%Blocked%", "blocked")
EVAL-description = coalesce('pattern_disposition_description', 'description', 'RuleDescription')
EVAL-ip = coalesce('local_address_ip4', 'local_address_ip6', 'EndpointIp', 'device.local_ip', 'device.external_ip')
EVAL-user = coalesce('user_id', 'user_principal', 'user_name')
FIELDALIAS-id = composite_id ASNEW id
EVAL-vendor_product = "CrowdStrike Falcon"
FIELDALIAS-dest = device.hostname ASNEW dest
FIELDALIAS-dest_nt_domain = device.machine_domain ASNEW dest_nt_domain
FIELDALIAS-dvc = device.hostname ASNEW dvc
FIELDALIAS-file_hash = sha256 ASNEW file_hash
FIELDALIAS-file_name = filename ASNEW file_name
FIELDALIAS-file_path = filepath ASNEW file_path
FIELDALIAS-parent_process = parent_details.cmdline ASNEW parent_process
FIELDALIAS-severity_id = severity ASNEW severity_id
EVAL-severity = lower(severity_name)
FIELDALIAS-signature = display_name ASNEW signature
FIELDALIAS-signature_id = pattern_id ASNEW signature_id
EVAL-src = coalesce('source_endpoint_address_ip4', 'local_address_ip4', 'device.local_ip')
FIELDALIAS-subject = description ASNEW subject
FIELDALIAS-url = falcon_host_link ASNEW url