[symantec:ep:syslog]
TRANSFORMS-sub_sourcetype_sep12 =  force_sourcetype_sep12_agent,force_sourcetype_sep12_traffic,force_sourcetype_sep12_proactive,force_sourcetype_sep12_behavior,force_sourcetype_sep12_risk,force_sourcetype_sep12_admin,force_sourcetype_sep12_policy,force_sourcetype_sep12_agt_system,force_sourcetype_sep12_scan,force_sourcetype_sep12_security,force_sourcetype_sep12_scm_agent_action
pulldown_type = true
SHOULD_LINEMERGE = false
category = Network & Security
description = Symantec Endpoint Protection via syslog

## sep transform is for syslog
[sep12]
TRANSFORMS-sub_sourcetype_sep =  force_sourcetype_sep12_traffic, force_sourcetype_sep12_proactive, force_sourcetype_sep12_behavior,force_sourcetype_sep12_risk,force_sourcetype_sep12_admin,force_sourcetype_sep12_agent,force_sourcetype_sep12_policy,force_sourcetype_sep12_agt_system, force_sourcetype_sep12_scan,force_sourcetype_sep12_security, force_sourcetype_sep12_scm_system

[symantec:ep:agt:system:syslog]
KV_MODE = none
MAX_TIMESTAMP_LOOKAHEAD = 32
SHOULD_LINEMERGE = false
REPORT-field_extraction_for_agt_system = field_extraction_for_agt_system

# Purpose for below "EVAL": remove prefix for specific field.
EVAL-Category = nullif(replace(Category, "[^:]+:\s*(.*)", "\1"),"")

LOOKUP-vendor_severity_to_severity = symantec_ep_severity_lookup vendor_severity OUTPUT severity
EVAL-vendor_product = "Symantec Endpoint Protection"



[symantec:ep:scm_system:syslog]
KV_MODE = none
MAX_TIMESTAMP_LOOKAHEAD = 32
SHOULD_LINEMERGE = false
REPORT-field_extraction_for_scm_system = field_extraction_for_scm_system

# Purpose for below "EVAL"s: remove prefix for specific field.
# Note: (1) the value of the field may contain more than one colons.
#           e.g. "Beging Time: 2011-11-11 11:11:11"
#       (2) the value of field may be empty string, which should be set to be null.
#           e.g. "Domain: "
EVAL-Server_Name = nullif(replace(Server_Name, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Site_Name = nullif(replace(Site_Name, "[^:]+:\s*(.*)", "\1"),"")

EVAL-vendor_product = "Symantec Endpoint Protection"



[symantec:ep:agent:syslog]
KV_MODE = none
MAX_TIMESTAMP_LOOKAHEAD = 32
SHOULD_LINEMERGE = false
REPORT-field_extraction_for_agent_act = field_extraction_for_agent_act

# Purpose for below "EVAL"s: remove prefix for specific field.
# Note: (1) the value of the field may contain more than one colons.
#           e.g. "Beging Time: 2011-11-11 11:11:11"
#       (2) the value of field may be empty string, which should be set to be null.
#           e.g. "Domain: "
EVAL-Domain = nullif(replace(Domain, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Server_Name = nullif(replace(Server_Name, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Site_Name = nullif(replace(Site_Name, "[^:]+:\s*(.*)", "\1"),"")

######## For CIM Mapping ##########
FIELDALIAS-src = Host_Name as src
EVAL-dest = nullif(replace(Server_Name, "[^:]+:\s*(.*)", "\1"),"")
EVAL-dvc = nullif(replace(Server_Name,"[^:]+:\s*(.*)", "\1"),"")
LOOKUP-vendor_action_for_agent_act = symantec_ep_admin_action_lookup vendor_action as Event_Description OUTPUT action, change_type
EVAL-vendor_product = "Symantec Endpoint Protection"



[symantec:ep:behavior:syslog]
KV_MODE = none
MAX_TIMESTAMP_LOOKAHEAD = 32
SHOULD_LINEMERGE = false
REPORT-field_extraction_for_agt_behavior = field_extraction_for_agt_behavior,process_from_caller_process_name, caller_md5_from_description

# Purpose for below "EVAL"s: remove prefix for specific field.
# Note: (1) the value of the field may contain more than one colons.
#           e.g. "Beging Time: 2011-11-11 11:11:11"
#       (2) the value of field may be empty string, which should be set to be null.
#           e.g. "Domain: "
EVAL-Begin_Time = nullif(replace(Begin_Time, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Action_Type = nullif(replace(Action_Type, "[^:]+:\s*(.*)", "\1"),"")
EVAL-End_Time = nullif(replace(End_Time, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Device_ID = nullif(replace(Device_ID, "[^:]+:\s*(.*)", "\1"),"")
EVAL-File_Size = nullif(replace(File_Size, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Domain_Name = nullif(replace(Domain_Name, "[^:]+:\s*(.*)", "\1"),"")
# For the case: "User Name: user1,user2"
EVAL-user = nullif(split(trim(replace(user, "[^:]+:\s*(.*)", "\1"),"\"'"),","),"")
# For the case: "Rule: Allow ping, pong and tracert"
EVAL-rule = nullif(trim(replace(rule, "[^:]+:\s*(.*)", "\1"),"\"'"),"")
EVAL-Description = nullif(trim(Description,"\"'"),"")

###### For CIM mapping #########
EVAL-vendor_product = "Symantec Endpoint Protection"
FIELDALIAS-Host_Name_dest = Host_Name as dest
EVAL-signature = if(vendor_action =="Blocked",if(match(Description,"Block\saccess\sto\sautorun\.inf"),if(isnotnull(Caller_MD5),"Drive Autorun (Caller MD5=" + Caller_MD5+")","Drive Autorun"),nullif(trim(Description,"\"'"),"")),null)
LOOKUP-vendor_action_to_action = symantec_ep_action_lookup vendor_action OUTPUT action
LOOKUP-vendor_severity_to_severity = symantec_ep_severity_lookup vendor_severity OUTPUT severity
EVAL-dvc = nullif(replace(Device_ID, "[^:]+:\s*(.*)", "\1"),"")
EVAL-dest_nt_domain = nullif(replace(Domain_Name, "[^:]+:\s*(.*)", "\1"),"")



[symantec:ep:risk:syslog]
KV_MODE = none
MAX_TIMESTAMP_LOOKAHEAD = 32
SHOULD_LINEMERGE = false
REPORT-field_extraction_for_agt_risk = field_extraction_for_agt_risk, filename_from_filepath

# Purpose for below "EVAL"s: remove prefix for specific field.
# Note: (1) the value of the field may contain more than one colons.
#           e.g. "Beging Time: 2011-11-11 11:11:11"
#       (2) the value of field may be empty string, which should be set to be null.
#           e.g. "Domain: "
EVAL-URL_Tracking_Status = nullif(replace(URL_Tracking_Status, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Event_Insert_Time = nullif(replace(Event_Insert_Time, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Server_Name = nullif(replace(Server_Name, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Prevalence = nullif(replace(Prevalence, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Application_Hash = nullif(replace(Application_Hash, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Category_Type = nullif(replace(Category_Type, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Last_Update_Time = nullif(replace(Last_Update_Time, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Disposition = nullif(replace(Disposition, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Source = nullif(replace(Source, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Application_Name = nullif(replace(Application_Name, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Group_Name = nullif(replace(Group_Name, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Application_Type = nullif(replace(Application_Type, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Source_Computer_Name = nullif(replace(Source_Computer_Name, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Confidence = nullif(replace(Confidence, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Company_Name = nullif(replace(Company_Name, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Category_Set = nullif(replace(Category_Set, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Computer_Name = nullif(replace(Computer_Name, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Event_Time = nullif(replace(Event_Time, "[^:]+:\s*(.*)", "\1"),"")
EVAL-First_Seen = nullif(replace(First_Seen, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Sensitivity = nullif(replace(Sensitivity, "[^:]+:\s*(.*)", "\1"),"")
EVAL-File_Size = nullif(replace(File_Size, "[^:]+:\s*(.*)", "\1"),"")
EVAL-IP_Address = nullif(replace(IP_Address, "[^:]+:\s*(.*)", "\1"),"")
EVAL-End_Time = nullif(replace(End_Time, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Secondary_Action = nullif(replace(Secondary_Action, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Occurrences = nullif(replace(Occurrences, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Requested_Action = nullif(replace(Requested_Action, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Hash_Type = nullif(replace(Hash_Type, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Source_Computer_IP = nullif(replace(Source_Computer_IP, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Domain_Name = nullif(replace(Domain_Name, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Risk_Name = nullif(replace(Risk_Name, "[^:]+:\s*(.*)", "\1"),"")
EVAL-vendor_action = nullif(replace(vendor_action, "[^:]+:\s*(.*)", "\1"),"")
# For the case: "User Name: user1,user2"
EVAL-user = nullif(split(trim(replace(user, "[^:]+:\s*(.*)", "\1"),"\"'"),","),"")
# trim the quotation marks
EVAL-Description = nullif(trim(Description,"\"'"),"")
# For the case "Field: null" set the field to be null.
EVAL-Web_Domain = if(replace(Web_Domain, "[^:]+:\s*(.*)", "\1")=="" OR replace(Web_Domain, "[^:]+:\s*(.*)", "\1")=="null", null, replace(Web_Domain, "[^:]+:\s*(.*)", "\1"))
EVAL-Downloaded_By = if(replace(Downloaded_By, "[^:]+:\s*(.*)", "\1")=="null" OR replace(Downloaded_By, "[^:]+:\s*(.*)", "\1")=="",null,replace(Downloaded_By, "[^:]+:\s*(.*)", "\1"))
EVAL-Download_Site = if(replace(Download_Site, "[^:]+:\s*(.*)", "\1")=="null" OR replace(Download_Site, "[^:]+:\s*(.*)", "\1")=="", null, replace(Download_Site, "[^:]+:\s*(.*)", "\1"))

###### For CIM mapping #######
EVAL-date = nullif(replace(Event_Time, "[^:]+:\s*(.*)", "\1"),"")
EVAL-signature = nullif(replace(Risk_Name, "[^:]+:\s*(.*)", "\1"),"")
EVAL-file_hash = nullif(replace(Application_Hash,"[^:]+:\s*(.*)", "\1"),"")
EVAL-file_hash_type = nullif(replace(Hash_Type,"[^:]+:\s*(.*)", "\1"),"")
EVAL-vendor_product = "Symantec Endpoint Protection"
EVAL-src = nullif(replace(Source_Computer_Name, "[^:]+:\s*(.*)", "\1"),"")
EVAL-src_ip = nullif(replace(Source_Computer_IP, "[^:]+:\s*(.*)", "\1"),"")
EVAL-dest = nullif(replace(Computer_Name, "[^:]+:\s*(.*)", "\1"),"")
EVAL-dest_nt_domain = nullif(replace(Domain_Name, "[^:]+:\s*(.*)", "\1"),"")
EVAL-dest_ip = nullif(replace(IP_Address, "[^:]+:\s*(.*)", "\1"),"")
LOOKUP-risk_vendor_action_to_action = symantec_ep_action_lookup vendor_action OUTPUT action
LOOKUP-risk_category_lookup = symantec_ep_malware_category_lookup title as signature OUTPUT type as category  riskLevel as Risk_Level



[symantec:ep:security:syslog]
KV_MODE = none
MAX_TIMESTAMP_LOOKAHEAD = 32
SHOULD_LINEMERGE = false
REPORT-field_extraction_for_agt_security = field_extraction_for_agt_security,category_from_description

# Purpose for below "EVAL"s: remove prefix for specific field.
# Note: (1) the value of the field may contain more than one colons.
#           e.g. "Beging Time: 2011-11-11 11:11:11"
#       (2) the value of field may be empty string, which should be set to be null.
#           e.g. "Domain: "
EVAL-Location = nullif(replace(Location, "[^:]+:\s*(.*)", "\1"),"")
EVAL-CIDS_Signature_String = nullif(replace(CIDS_Signature_String, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Local_Host_MAC = nullif(replace(Local_Host_MAC, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Remote_Port = nullif(replace(Remote_Port, "[^\d]+(\d*)", "\1"),"")
EVAL-Local_Host_IP = nullif(replace(Local_Host_IP, "[^:]+:\s*(.*)", "\1"),"")
EVAL-CIDS_Signature_SubID = nullif(replace(CIDS_Signature_SubID, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Application_Name = nullif(replace(Application_Name, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Local_Port = nullif(replace(Local_Port, "[^\d]+(\d*)", "\1"),"")
EVAL-Remote_Host_MAC = nullif(replace(Remote_Host_MAC, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Begin_Time = nullif(replace(Begin_Time, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Intrusion_URL = nullif(replace(Intrusion_URL, "[^:]+:\s*(.*)", "\1"),"")
EVAL-End_Time = nullif(replace(End_Time, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Occurrences = nullif(replace(Occurrences, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Remote_Host_IP = nullif(replace(Remote_Host_IP, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Intrusion_Payload_URL = nullif(replace(Intrusion_Payload_URL, "[^:]+:\s*(.*)", "\1"),"")
EVAL-CIDS_Signature_ID = nullif(replace(CIDS_Signature_ID, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Domain_Name = nullif(replace(Domain_Name, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Remote_Host_Name = nullif(replace(Remote_Host_Name, "[^:]+:\s*(.*)", "\1"),"")
# For the case: "User Name: user1,user2"
EVAL-user = nullif(split(trim(replace(user, "[^:]+:\s*(.*)", "\1"),"\"'"),","),"")

##### For CIM mappimng ########
FIELDALIAS-dvc = host AS dvc
EVAL-direction = lower(Traffic_Direction)
EVAL-dest = if(Traffic_Direction=="Inbound",nullif(replace(Local_Host_IP, "[^:]+:\s*(.*)", "\1"),""),nullif(replace(Remote_Host_IP, "[^:]+:\s*(.*)", "\1"),""))
EVAL-src = if(Traffic_Direction=="Outbound",nullif(replace(Local_Host_IP, "[^:]+:\s*(.*)", "\1"),""),nullif(replace(Remote_Host_IP, "[^:]+:\s*(.*)", "\1"),""))
EVAL-vendor_product = "Symantec Endpoint Protection"
EVAL-signature = nullif(replace(CIDS_Signature_String, "[^:]+:\s*(.*)", "\1"),"")
EVAL-ids_type = "host"
EVAL-action = case(match(Event_Description, "block"), "blocked", 1==1, "allowed")
LOOKUP-vendor_severity_to_severity = symantec_ep_severity_lookup vendor_severity OUTPUT severity



[symantec:ep:scan:syslog]
KV_MODE = none
MAX_TIMESTAMP_LOOKAHEAD = 32
SHOULD_LINEMERGE = false
REPORT-field_extraction_for_agt_scan = field_extraction_for_agt_scan

# Purpose for below "EVAL"s: remove prefix for specific field.
# Note: (1) the value of the field may contain more than one colons.
#           e.g. "Beging Time: 2011-11-11 11:11:11"
#       (2) the value of field may be empty string, which should be set to be null.
#           e.g. "Domain: "
EVAL-Total_Files = nullif(replace(Total_Files, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Threats = nullif(replace(Threats, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Computer_Name = nullif(replace(Computer_Name, "[^:]+:\s*(.*)", "\1"),"")
EVAL-IP_Address = nullif(replace(IP_Address, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Omitted_Files = nullif(replace(Omitted_Files, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Client_User_1 = nullif(replace(Client_User_1, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Begin_Time = nullif(replace(Begin_Time, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Client_User_2 = nullif(replace(Client_User_2, "[^:]+:\s*(.*)", "\1"),"")
EVAL-End_Time = nullif(replace(End_Time, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Command = nullif(replace(Command, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Scan_ID = nullif(replace(Scan_ID, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Duration = nullif(replace(Duration, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Infected_Files = nullif(replace(Infected_Files, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Group_Name = nullif(replace(Group_Name, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Domain_Name = nullif(replace(Domain_Name, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Server_Name = nullif(replace(Server_Name, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Start_Message = nullif(trim(Start_Message,"\"'"),"")
EVAL-Stop_Message = nullif(trim(Stop_Message,"\"'"),"")

##### For CIM mapping ######
EVAL-vendor_product = "Symantec Endpoint Protection"
EVAL-dest = nullif(replace(Computer_Name, "[^:]+:\s*(.*)", "\1"),"")
EVAL-dest_ip = nullif(replace(IP_Address, "[^:]+:\s*(.*)", "\1"),"")
EVAL-dest_nt_domain = nullif(replace(Domain_Name, "[^:]+:\s*(.*)", "\1"),"")

[symantec:ep:proactive:syslog]
KV_MODE = none
MAX_TIMESTAMP_LOOKAHEAD = 32
SHOULD_LINEMERGE = false
REPORT-field_extraction_for_agt_proactive = field_extraction_for_agt_proactive, filename_from_filepath

# Purpose for below "EVAL"s: remove prefix for specific field.
# Note: (1) the value of the field may contain more than one colons.
#           e.g. "Beging Time: 2011-11-11 11:11:11"
#       (2) the value of field may be empty string, which should be set to be null.
#           e.g. "Domain: "
EVAL-Confidence = nullif(replace(Confidence, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Event_Insert_Time = nullif(replace(Event_Insert_Time, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Server_Name = nullif(replace(Server_Name, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Requested_Action = nullif(replace(Requested_Action, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Downloaded_By = nullif(replace(Downloaded_By, "[^:]+:\s*(.*)", "\1"),"")
EVAL-First_Seen = nullif(replace(First_Seen, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Application_Name = nullif(replace(Application_Name, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Detection_Score = nullif(replace(Detection_Score, "[^:]+:\s*(.*)", "\1"),"")
EVAL-File_Size = nullif(replace(File_Size, "[^:]+:\s*(.*)", "\1"),"")
EVAL-COH_Engine_Version = nullif(replace(COH_Engine_Version, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Risk_Level = nullif(replace(Risk_Level, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Group_Name = nullif(replace(Group_Name, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Domain_Name = nullif(replace(Domain_Name, "[^:]+:\s*(.*)", "\1"),"")
EVAL-URL_Tracking_Status = nullif(replace(URL_Tracking_Status, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Source_Computer_IP = nullif(replace(Source_Computer_IP, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Computer_Name = nullif(replace(Computer_Name, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Hash_Type = nullif(replace(Hash_Type, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Source = nullif(replace(Source, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Application_Hash = nullif(replace(Application_Hash, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Prevalence = nullif(replace(Prevalence, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Occurrences = nullif(replace(Occurrences, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Detection_Type = nullif(replace(Detection_Type, "[^:]+:\s*(.*)", "\1"),"")
EVAL-End_Time = nullif(replace(End_Time, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Event_Time = nullif(replace(Event_Time, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Permitted_Application_Reason = nullif(replace(Permitted_Application_Reason, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Download_Site = nullif(replace(Download_Site, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Company_Name = nullif(replace(Company_Name, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Disposition = nullif(replace(Disposition, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Web_Domain = nullif(replace(Web_Domain, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Secondary_Action = nullif(replace(Secondary_Action, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Source_Computer_Name = nullif(replace(Source_Computer_Name, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Sensitivity = nullif(replace(Sensitivity, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Application_Type = nullif(replace(Application_Type, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Risk_Name = nullif(replace(Risk_Name, "[^:]+:\s*(.*)", "\1"),"")
EVAL-vendor_action = nullif(replace(vendor_action, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Detection_Source = if(replace(Detection_Source, "[^:]+:\s*(.*)", "\1")=="" OR replace(Detection_Source, "[^:]+:\s*(.*)", "\1")=="N/A", null, replace(Detection_Source, "[^:]+:\s*(.*)", "\1"))
# trim the quotation marks
EVAL-Description = nullif(trim(Description,"\"'"),"")
EVAL-Application_Version = nullif(trim(replace(Application_Version, "[^:]+:\s*(.*)", "\1"),"\"'"),"")
# For the case: "User Name: user1,user2"
EVAL-user = nullif(split(trim(replace(user, "[^:]+:\s*(.*)", "\1"),"\"'"),","),"")
##### For CIM mapping #######
EVAL-date = nullif(replace(Event_Time, "[^:]+:\s*(.*)", "\1"),"")
EVAL-signature = nullif(replace(Application_Type, "[^:]+:\s*(.*)", "\1"),"")
EVAL-vendor_product = "Symantec Endpoint Protection"
EVAL-src = nullif(replace(Source_Computer_Name, "[^:]+:\s*(.*)", "\1"),"")
EVAL-src_ip = nullif(replace(Source_Computer_IP, "[^:]+:\s*(.*)", "\1"),"")
EVAL-dest = nullif(replace(Computer_Name, "[^:]+:\s*(.*)", "\1"),"")
EVAL-dest_nt_domain = nullif(replace(Domain_Name, "[^:]+:\s*(.*)", "\1"),"")
LOOKUP-proactive_vendor_action_to_action = symantec_ep_action_lookup vendor_action OUTPUT action



[symantec:ep:admin:syslog]
KV_MODE = none
MAX_TIMESTAMP_LOOKAHEAD = 32
SHOULD_LINEMERGE = false
REPORT-field_extraction_for_admin = field_extraction_for_admin
EVAL-vendor_product = "Symantec Endpoint Protection"



[symantec:ep:policy:syslog]
KV_MODE = none
MAX_TIMESTAMP_LOOKAHEAD = 32
SHOULD_LINEMERGE = false
REPORT-field_extraction_for_policy = field_extraction_for_policy
EVAL-vendor_product = "Symantec Endpoint Protection"



[symantec:ep:packet:syslog]
KV_MODE = none
MAX_TIMESTAMP_LOOKAHEAD = 32
SHOULD_LINEMERGE = false
REPORT-field_extraction_for_packet = field_extraction_for_packet
EVAL-vendor_product = "Symantec Endpoint Protection"



[symantec:ep:traffic:syslog]
KV_MODE = none
MAX_TIMESTAMP_LOOKAHEAD = 32
SHOULD_LINEMERGE = false
REPORT-field_extraction_for_traffic = field_extraction_for_traffic

# Purpose for below "EVAL"s: remove prefix for specific field.
# Note: (1) the value of the field may contain more than one colons.
#           e.g. "Beging Time: 2011-11-11 11:11:11"
#       (2) the value of field may be empty string, which should be set to be null.
#           e.g. "Domain: "
EVAL-Location = nullif(replace(Location, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Local_Host_MAC = nullif(replace(Local_Host_MAC, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Remote_Port = nullif(replace(Remote_Port, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Local_Host_IP = nullif(replace(Local_Host_IP, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Application_Name = nullif(replace(Application_Name, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Local_Port = nullif(replace(Local_Port, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Remote_Host_MAC = nullif(replace(Remote_Host_MAC, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Begin_Time = nullif(replace(Begin_Time, "[^:]+:\s*(.*)", "\1"),"")
EVAL-End_Time = nullif(replace(End_Time, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Occurrences = nullif(replace(Occurrences, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Remote_Host_IP = nullif(replace(Remote_Host_IP, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Domain_Name = nullif(replace(Domain_Name, "[^:]+:\s*(.*)", "\1"),"")
EVAL-Remote_Host_Name = nullif(replace(Remote_Host_Name, "[^:]+:\s*(.*)", "\1"),"")
EVAL-vendor_action = nullif(replace(vendor_action, "[^:]+:\s*(.*)", "\1"),"")
# For the case: "User Name: user1,user2"
EVAL-user = nullif(split(trim(replace(user, "[^:]+:\s*(.*)", "\1"),"\"'"),","),"")
# For the case: "Rule: Allow ping, pong and tracert"
EVAL-rule = nullif(trim(replace(rule, "[^:]+:\s*(.*)", "\1"),"\"'"),"")

##### For CIM mapping #######
####### fields for both 'Network Traffic' and IDS model #####
FIELDALIAS-dvc_from_host_for_sep = host AS dvc
LOOKUP-symantec_ep_vendor_action_lookup_for_traffic_file = symantec_ep_action_lookup vendor_action OUTPUT action

######## fields for 'Network Traffic' model ##########
EVAL-direction = lower(Traffic_Direction)
EVAL-dest_ip = if(Traffic_Direction=="Inbound",nullif(replace(Local_Host_IP, "[^:]+:\s*(.*)", "\1"),""),nullif(replace(Remote_Host_IP, "[^:]+:\s*(.*)", "\1"),""))
EVAL-src_ip = if(Traffic_Direction=="Outbound",nullif(replace(Local_Host_IP, "[^:]+:\s*(.*)", "\1"),""),nullif(replace(Remote_Host_IP, "[^:]+:\s*(.*)", "\1"),""))

EVAL-dest = if(Traffic_Direction=="Inbound",if(Host_Name=="",nullif(replace(Local_Host_IP, "[^:]+:\s*(.*)", "\1"),""),Host_Name),if(replace(Remote_Host_Name, "[^:]+:\s*(.*)", "\1")=="",nullif(replace(Remote_Host_IP, "[^:]+:\s*(.*)", "\1"),""),replace(Remote_Host_Name, "[^:]+:\s*(.*)", "\1")))
EVAL-src = if(Traffic_Direction=="Outbound",if(Host_Name=="",nullif(replace(Local_Host_IP, "[^:]+:\s*(.*)", "\1"),""),Host_Name),if(replace(Remote_Host_Name, "[^:]+:\s*(.*)", "\1")=="",nullif(replace(Remote_Host_IP, "[^:]+:\s*(.*)", "\1"),""),replace(Remote_Host_Name, "[^:]+:\s*(.*)", "\1")))

EVAL-dest_port = if(Traffic_Direction=="Inbound",nullif(replace(Local_Port, "[^:]+:\s*(.*)", "\1"),""),nullif(replace(Remote_Port, "[^:]+:\s*(.*)", "\1"),""))
EVAL-src_port = if(Traffic_Direction=="Outbound",nullif(replace(Local_Port, "[^:]+:\s*(.*)", "\1"),""),nullif(replace(Remote_Port, "[^:]+:\s*(.*)", "\1"),""))

EVAL-dest_mac = if(Traffic_Direction=="Outbound", lower(replace(Remote_Host_MAC,"[^:]+:\s*(\w{2})(\w{2})(\w{2})(\w{2})(\w{2})(\w{2})", "\1:\2:\3:\4:\5:\6")),lower(replace(Local_Host_MAC,"[^:]+:\s*(\w{2})(\w{2})(\w{2})(\w{2})(\w{2})(\w{2})", "\1:\2:\3:\4:\5:\6")))
EVAL-src_mac = if(Traffic_Direction=="Inbound",lower(replace(Remote_Host_MAC,"[^:]+:\s*(\w{2})(\w{2})(\w{2})(\w{2})(\w{2})(\w{2})", "\1:\2:\3:\4:\5:\6")),lower(replace(Local_Host_MAC,"[^:]+:\s*(\w{2})(\w{2})(\w{2})(\w{2})(\w{2})(\w{2})", "\1:\2:\3:\4:\5:\6")))

EVAL-vendor_product = "Symantec Endpoint Protection"
EVAL-protocol = if(Network_Protocol=="ICMP" OR isint(Network_Protocol),"icmp","ip")
EVAL-icmp_type_code = if(isint(Network_Protocol),Network_Protocol,null)
LOOKUP-symantec_ep_icmp_type = symantec_ep_icmp_type_lookup icmp_type_code OUTPUT icmp_type_name
EVAL-transport = if(Network_Protocol=="TCP","tcp", if(Network_Protocol=="UDP","udp","unknown"))
EVAL-duration = strptime(replace(End_Time, "[^:]+:\s*(.*)", "\1"),"%Y-%m-%d %H:%M:%S")-strptime(replace(Begin_Time, "[^:]+:\s*(.*)", "\1"),"%Y-%m-%d %H:%M:%S")
EVAL-app = nullif(replace(Application_Name, "[^:]+:\s*(.*)", "\1"),"")

##### fields for IDS model (The inbound blocked events is mapped to IDS) #####
EVAL-category =  if(Traffic_Direction=="Inbound" AND match(vendor_action,"[Bb]lock"),"traffic", null)
EVAL-ids_type = if(Traffic_Direction=="Inbound" AND match(vendor_action,"[Bb]lock"),"host", null)
LOOKUP-symantec_ep_severity_lookup_for_traffic_file = symantec_ep_severity_lookup vendor_severity OUTPUT severity
EVAL-signature = if(Traffic_Direction=="Inbound" AND match(vendor_action,"[Bb]lock"),nullif(replace(rule, "[^:]+:\s*(.*)", "\1"),""), null)

