[Threat Activity By IP - Summary]

disabled = 0
action.email.useNSSubject = 1
action.summary_index = 1
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
cron_schedule = 0 * * * *
dispatch.earliest_time = -65m@m
dispatch.latest_time = -5m@m
enableSched = 1
realtime_schedule = 0
schedule_window = 10
search = tag=network tag=communicate | rename dest_ip as ip | stats count by ip | join ip [|inputlookup themediatrust_ip_intel | search threat_key="themediatrust_ip"  | where isnotnull(ip) ] | where isnotnull(threat_key)  | stats sum(count) as count
[Threat Activity By Domain - Summary]

disabled = 0
action.email.useNSSubject = 1
action.summary_index = 1
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
cron_schedule = 5 * * * *
dispatch.earliest_time = -65m@m
dispatch.latest_time = -5m@m
enableSched = 1
realtime_schedule = 0
schedule_window = 10
search = tag=network tag=communicate | rename dest_zone as domain | stats count by domain | join domain [|inputlookup themediatrust_ip_intel | search threat_key="themediatrust_domain"  | where isnotnull(domain) ] | where isnotnull(threat_key) | stats sum(count) as count
[Threat Activity Actions By IP - Summary]

disabled = 0
action.email.useNSSubject = 1
action.summary_index = 1
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
cron_schedule = 10 * * * *
dispatch.earliest_time = -65m@m
dispatch.latest_time = -5m@m
enableSched = 1
realtime_schedule = 0
schedule_window = 10
search = |inputlookup themediatrust_ip_intel | search threat_key="themediatrust_ip" | where isnotnull(ip) | fields ip | eval ip="*"+ip+"*" | map maxsearches=20000  search="tag=change tag=endpoint command=$ip$" | stats count
[Threat Activity Actions By Domain - Summary]
disabled = 0
action.email.useNSSubject = 1
action.summary_index = 1
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
cron_schedule = 15 * * * *
dispatch.earliest_time = -65m@m
dispatch.latest_time = -5m@m
enableSched = 1
realtime_schedule = 0
schedule_window = 10
search = |inputlookup themediatrust_ip_intel | search threat_key="themediatrust_domain" | where isnotnull(domain) | fields domain | eval domain="*"+domain+"*" | map maxsearches=20000  search="tag=change tag=endpoint command=$domain$" | stats count

