[map_24h]
action.email.inline = 1
action.email.reportServerEnabled = 0
alert.suppress = 0
alert.track = 1
auto_summarize.dispatch.earliest_time = -1d@h
cron_schedule = 0 0 * * *
dispatch.earliest_time = -24h
dispatch.latest_time = +0s
enableSched = 1
search = `default_index` sourcetype=rswaf AND bw_log_source != "Event Logs" bw_log_class=BLOCKED OR bw_log_class=ALERT | search icx_src_ip!=192.168.0.0/16 icx_src_ip!=10.0.0.0/8 icx_src_ip!=172.16.0.0/20 |  stats count by icx_src_ip | eval count_label="Attack" | eval iterator="icx_src_ip" | eval iterator_label="Source IP" |  eval zoom = "zoom=\"250%\" zoom_x=\"0%\" zoom_y=\"-75%\""| eval movie_color="#FF0000" | eval output_file="24h_threat_data.xml" | eval app="rswaf" | lookup geoip clientip as icx_src_ip | mapit

[map_24h_wam]
action.email.inline = 1
action.email.reportServerEnabled = 0
alert.suppress = 0
alert.track = 1
auto_summarize.dispatch.earliest_time = -1d@h
cron_schedule = 0 0 * * *
dispatch.earliest_time = -24h
dispatch.latest_time = +0s
enableSched = 1
search = `default_index` sourcetype=rswaf AND bw_log_source != "Event Logs" bw_log_class = IAM | search icx_src_ip!=192.168.0.0/16 icx_src_ip!=10.0.0.0/8 icx_src_ip!=172.16.0.0/20 |  stats count by icx_src_ip | eval count_label="WAM Event" | eval iterator="icx_src_ip" | eval iterator_label="Source IP" |  eval zoom = "zoom=\"250%\" zoom_x=\"0%\" zoom_y=\"-75%\""| eval movie_color="#FF0000" | eval output_file="24h_wam_data.xml" | eval app="rswaf" | lookup geoip clientip as icx_src_ip | mapit

[map_24h_access]
action.email.inline = 1
action.email.reportServerEnabled = 0
alert.suppress = 0
alert.track = 1
auto_summarize.dispatch.earliest_time = -1d@h
cron_schedule = 0 0 * * *
dispatch.earliest_time = -24h
dispatch.latest_time = +0s
enableSched = 1
search = `default_index` sourcetype = rswaf AND bw_alog_target = "*" | search bw_alog_ipsrc!=192.168.0.0/16 bw_alog_ipsrc!=10.0.0.0/8 bw_alog_ipsrc!=172.16.0.0/20 |  stats count by bw_alog_ipsrc | eval count_label="Access" | eval iterator="bw_alog_ipsrc" | eval iterator_label="Source IP" |  eval zoom = "zoom=\"250%\" zoom_x=\"0%\" zoom_y=\"-75%\""| eval movie_color="#FF0000" | eval output_file="24h_access_data.xml" | eval app="rswaf" | lookup geoip clientip as bw_alog_ipsrc | mapit

[map_7d]
action.email.inline = 1
action.email.reportServerEnabled = 0
alert.suppress = 0
alert.track = 1
auto_summarize.dispatch.earliest_time = -1d@h
cron_schedule = 0 0 * * *
dispatch.earliest_time = -7d
dispatch.latest_time = +0s
enableSched = 1
search = `default_index` sourcetype=rswaf AND bw_log_source != "Event Logs" bw_log_class=BLOCKED OR bw_log_class=ALERT | search icx_src_ip!=192.168.0.0/16 icx_src_ip!=10.0.0.0/8 icx_src_ip!=172.16.0.0/20 |  stats count by icx_src_ip | eval count_label="Attack" | eval iterator="icx_src_ip" | eval iterator_label="Source IP" |  eval zoom = "zoom=\"250%\" zoom_x=\"0%\" zoom_y=\"-75%\""| eval movie_color="#FF0000" | eval output_file="7d_threat_data.xml" | eval app="rswaf" | lookup geoip clientip as icx_src_ip | mapit

[map_7d_wam]
action.email.inline = 1
action.email.reportServerEnabled = 0
alert.suppress = 0
alert.track = 1
auto_summarize.dispatch.earliest_time = -1d@h
cron_schedule = 0 0 * * *
dispatch.earliest_time = -7d
dispatch.latest_time = +0s
enableSched = 1
search = `default_index` sourcetype=rswaf AND bw_log_source != "Event Logs" bw_log_class = IAM | search icx_src_ip!=192.168.0.0/16 icx_src_ip!=10.0.0.0/8 icx_src_ip!=172.16.0.0/20 |  stats count by icx_src_ip | eval count_label="WAM Event" | eval iterator="icx_src_ip" | eval iterator_label="Source IP" |  eval zoom = "zoom=\"250%\" zoom_x=\"0%\" zoom_y=\"-75%\""| eval movie_color="#FF0000" | eval output_file="7d_wam_data.xml" | eval app="rswaf" | lookup geoip clientip as icx_src_ip | mapit

[map_7d_access]
action.email.inline = 1
action.email.reportServerEnabled = 0
alert.suppress = 0
alert.track = 1
auto_summarize.dispatch.earliest_time = -1d@h
cron_schedule = 0 0 * * *
dispatch.earliest_time = -7d
dispatch.latest_time = +0s
enableSched = 1
search = `default_index` sourcetype = rswaf AND bw_alog_target = "*" | search bw_alog_ipsrc!=192.168.0.0/16 bw_alog_ipsrc!=10.0.0.0/8 bw_alog_ipsrc!=172.16.0.0/20 |  stats count by bw_alog_ipsrc | eval count_label="Access" | eval iterator="bw_alog_ipsrc" | eval iterator_label="Source IP" |  eval zoom = "zoom=\"250%\" zoom_x=\"0%\" zoom_y=\"-75%\""| eval movie_color="#FF0000" | eval output_file="7d_access_data.xml" | eval app="rswaf" | lookup geoip clientip as bw_alog_ipsrc | mapit

