[aws_cloudtrail_rename_fields]
definition = | rename resources{}.ARN as arn, resources{}.accountId as accountId,\
    resources{}.type as type, \
    requestParameters.detectorId as requestDetectorId,\
    requestParameters.code.s3Bucket as requestParametersCodes3Bucket,\
    requestParameters.bucketName as requestParametersBucketName,\
    requestParameters.code.s3Key as requestParametersCodes3Key, \
    requestParameters.functionName as requestParametersFunctionName, \
    requestParameters.handler as requestParametersHandler, \
    requestParameters.role as requestParametersRole, \
    requestParameters.runtime as requestParametersRuntime, \
    requestParameters.enable as requestEnable, \
    requestParameters.clientToken as clientToken,\
    requestParameters.name as requestParametersName,\
    requestParameters.accessKeyId as requestParametersAccessKeyId,\
    requestParameters.userName as requestParametersUserName,\
    requestParameters.action as requestParametersAction,\
    requestParameters.DeleteFlowLogsRequest.FlowLogId.content as requestParametersDeleteFlowLogsRequestFlowLogId,\
    requestParameters.logGroupName as requestParametersLogGroupName,\
    requestParameters.logStreamName as requestParametersLogStreamName,\
    responseElements.detectorId as responseDetectorId,\
    responseElements.state as responseElementsState,\
    responseElements.stateReason as responseElementsStateReason,\
    responseElements.accessKey.accessKeyId as responseElementsAccessKeyId, \
    responseElements.accessKey.status as responseElementsAccessKeyStatus, \
    userIdentity.accessKeyId as userIdentityAccessKeyId, \
    userIdentity.accountId as userIdentityAccountId, \
    userIdentity.arn as userIdentityArn, \
    userIdentity.principalId as userIdentityPrincipalId, \
    userIdentity.type as userIdentityType\
| spath output=userIdentityUserName path=userIdentity.userName\
| spath output=requestFindingIds path=requestParameters.findingIds{}\
| spath output=requestParametersRaw path=requestParameters\
| spath output=requestParametersGroupName path=requestParameters.groupName\
| spath output=requestParametersPolicyArn path=requestParameters.policyArn\
| spath output=requestParametersPolicyDocument path=requestParameters.policyDocument\
| spath output=requestParametersSetAsDefault path=requestParameters.setAsDefault\
| spath output=requestParametersIamInstanceProfile path=requestParameters.iamInstanceProfile\
| spath output=instancesSet path=requestParameters.instancesSet.items{}\
| spath output=sessionContextEc2RoleDelivery path=userIdentity.sessionContext.ec2RoleDelivery\
| spath output=sessionIssuerType path=userIdentity.sessionContext.sessionIssuer.type\
| spath output=sessionIssuerArn path=userIdentity.sessionContext.sessionIssuer.arn\
| spath output=requestParametersInstanceId path=requestParameters.instanceId\
| spath output=requestParametersInstanceOSUser path=requestParameters.instanceOSUser\
| spath output=requestParametersSSHPublicKey path=requestParameters.sSHPublicKey\
| spath output=requestParametersRepositoryName path=requestParameters.repositoryName\
| nomv arn \
| nomv accountId \
| nomv type \
| nomv requestFindingIds\
| fillnull value=NULL eventTime, eventID, eventSource, eventName, eventCategory, awsRegion, sourceIPAddress, userAgent, clientToken, requestDetectorId, requestFindingIds, request_enable, requestParametersBucketName, requestParametersCodes3Bucket, requestParametersCodes3Key, requestParametersFunctionName, requestParametersHandler, requestParametersRole, requestParametersRuntime, requestParametersName, requestParametersAccessKeyId, requestParametersUserName, requestParametersAction, requestParametersDeleteFlowLogsRequestFlowLogId, requestParametersLogGroupName, requestParametersLogStreamName, responseElementsState, responseElementsAccessKeyId, responseElementsAccessKeyStatus, responseDetectorId, responseElementsStateReason, errorCode, errorMessage, arn, accountId, type, userIdentityAccessKeyId, userIdentityAccountId, userIdentityArn, userIdentityPrincipalId, userIdentityType, userIdentityUserName, requestParametersRaw, requestParametersGroupName, requestParametersPolicyArn, requestParametersPolicyDocument, requestParametersSetAsDefault, iamInstanceProfile, instancesSet, sessionContextEc2RoleDelivery, sessionIssuerType, sessionIssuerArn, requestParametersInstanceId, requestParametersInstanceOSUser, requestParametersSSHPublicKey,requestParametersRepositoryName\
| table eventTime, eventID, eventSource, eventName, eventCategory, awsRegion, sourceIPAddress, userAgent, clientToken, requestDetectorId, requestFindingIds, request_enable, responseDetectorId, requestParametersBucketName, requestParametersCodes3Bucket, requestParametersCodes3Key,\
requestParametersFunctionName, requestParametersHandler, requestParametersRole, requestParametersRuntime, requestParametersName, requestParametersAccessKeyId, requestParametersUserName, requestParametersAction, requestParametersDeleteFlowLogsRequestFlowLogId, requestParametersLogGroupName, requestParametersLogStreamName, responseElementsState, responseElementsAccessKeyId, responseElementsAccessKeyStatus, responseElementsStateReason, errorCode, errorMessage, arn, accountId, type, userIdentityAccessKeyId, userIdentityAccountId, userIdentityArn, userIdentityPrincipalId, userIdentityType, userIdentityUserName, requestParametersRaw, requestParametersGroupName, requestParametersPolicyArn, requestParametersPolicyDocument, requestParametersSetAsDefault, iamInstanceProfile, instancesSet, sessionContextEc2RoleDelivery, sessionIssuerType, sessionIssuerArn, requestParametersInstanceId, requestParametersInstanceOSUser, requestParametersSSHPublicKey, requestParametersRepositoryName,_raw\
| eval timestamp = eventTime \
| dedup eventID \
| sort -eventTime
iseval = 0

[aws_cloudtrail_search]
definition = index=main sourcetype="aws:cloudtrail"
iseval = 0

[aws_exclude_trivial_events]
definition = | where !(like(userAgent, "cloudtrail.amazonaws.com") or like(userAgent, "%command/cloudtrail.lookup-events%") or like(userAgent, "AWS Internal"))
iseval = 0

[aws_output_alert]
definition = | table timestamp, severity, summary, body, mitre_tactic, mitre_technique, mitre_subtechnique\
| outputlookup append=t alerts.csv
iseval = 0
