[line_break_sanity_check_blacklist]
definition = sourcetype!=windows:process
iseval = 0

[summary_data_index]
definition = index=summary
iseval = 0

[metadata_time_limiter-AtAGlance]
definition = 86400
iseval = 0

[metadata_time_limiter-SourcetypeOverview]
definition = 604800
iseval = 0

[field_extraction_percentage]
definition = fields - date_* linecount eventtype source host splunk_server timestartpos timeendpos tag* index | rex max_match=100 "(?:\n|\s)?(?<key_value_fields>\S+)=\s?" | nomv key_value_fields | rex mode=sed field=key_value_fields "s/ //g" | rex mode=sed field=key_value_fields "s/\n//g" | eval kv_field_len = len(key_value_fields) | eval kv_field_len = if(isnotnull(kv_field_len), kv_field_len, 0)| rex mode=sed field=_raw "s/ //g" | rex mode=sed field=_raw "s/\n//g" | eval raw_len=len(_raw)  | eval time_len = if(isnull(timestamp), 19, 0) | fields - timestamp _time key_value_fields | stats count first(*) as * by sourcetype punct | eval total_field_len = 0 | foreach * [eval total_field_len = if(isnotnull('<<FIELD>>'), len('<<FIELD>>') + total_field_len, 0 + total_field_len)] | eval raw_len_len = len(raw_len) | eval st_len=len(sourcetype) | eval t_len = len(time_len) | eval punct_len = len(punct) | eval count_len = len(count)  | eval total_field_len = total_field_len - st_len - raw_len_len - punct_len - count_len - t_len + kv_field_len | table sourcetype punct count raw_len total_field_len | eval perc_fields = round((total_field_len/raw_len)*100) | eval perc_fields = case(perc_fields>100,"100", perc_fields<0, "0", 1=1, perc_fields) | eventstats sum(count) as total by sourcetype | eval loaded_perc_fields = count*perc_fields | stats sum(loaded_perc_fields) as loaded_perc_fields by sourcetype total | eval loaded_perc_fields = round(loaded_perc_fields/total,`field_extraction_percentage_round_int`) | table sourcetype loaded_perc_fields
iseval = 0

[field_extraction_score_scale]
definition = 10
iseval = 0

[field_extraction_percentage_round_int]
definition = 1
iseval = 0

[field_extraction_score_upper_bounds]
definition = 100
iseval = 0

[field_extraction_score(1)]
args = field
definition = eval fields_score =  round((($field$ * `field_extraction_score_scale`)/`field_extraction_score_upper_bounds`),1)
iseval = 0

[props_score_scale]
definition = 10
iseval = 0

[props_score_upper_bounds]
definition = 7
iseval = 0

[props_score_raw]
definition = rest splunk_server=local /servicesNS/-/-/configs/conf-props | eval sourcetype = if(isnull(sourcetype) OR len(sourcetype)<1, title, sourcetype) | rename eai:appName as App | search App!=system App!=learned TIME_FORMAT=* OR TIME_PREFIX=* OR MAX_TIMESTAMP_LOOKAHEAD=* OR LINE_BREAKER=* OR TZ=* OR TRUNCATE=* OR DATETIME_CONFIG=*  | eval datetime_set = if(DATETIME_CONFIG!="/etc/datetime.xml", "yes", "no") | foreach TIME_FORMAT TIME_PREFIX LINE_BREAKER TZ BREAK_ONLY_BEFORE MUST_BREAK_AFTER MUST_NOT_BREAK_AFTER MUST_NOT_BREAK_BEFORE [eval <<FIELD>> = if(isnull(<<FIELD>>) OR <<FIELD>>="","0","1")] | eval multiline_settings = BREAK_ONLY_BEFORE +MUST_BREAK_AFTER +MUST_NOT_BREAK_AFTER +MUST_NOT_BREAK_BEFORE | eval line_merge = case(SHOULD_LINEMERGE=0, 1, SHOULD_LINEMERGE=1 AND multiline_settings=0, 0, SHOULD_LINEMERGE="1" AND multiline_settings>0, 1) | eval max_timestamp_lookahead = if(MAX_TIMESTAMP_LOOKAHEAD=150, 0, 1) | eval truncate = if(TRUNCATE=10000, 0, 1) | eval time_score = if(datetime_set ="no", max_timestamp_lookahead + TIME_FORMAT+ TIME_PREFIX, 3) | eval props_score_raw = time_score + LINE_BREAKER + TZ + truncate + line_merge | table sourcetype props_score_raw
iseval = 0

[props_score_generator(1)]
args = field
definition = eval props_score = round(($field$ * `props_score_scale`)/`props_score_upper_bounds`,1)
iseval = 0

[props_config_lookup(1)]
args = sourcetype
definition = rest splunk_server=local /servicesNS/-/-/configs/conf-props | eval sourcetype = if(isnull(sourcetype) OR len(sourcetype)<1, title, sourcetype) | rename eai:appName as App | search App!=system App!=learned sourcetype=$sourcetype$ TIME_FORMAT=* OR TIME_PREFIX=* OR MAX_TIMESTAMP_LOOKAHEAD=* OR LINE_BREAKER=* OR TZ=* OR SHOULD_LINEMERGE=* OR TRUNCATE=* OR MAX_DAYS_AGO=* OR DATETIME_CONFIG=* | eval DATETIME_CONFIG = if(DATETIME_CONFIG="/etc/datetime.xml", "-", DATETIME_CONFIG) | eval SHOULD_LINEMERGE = if(SHOULD_LINEMERGE=0, "False", "True / Default") | table sourcetype App DATETIME_CONFIG TIME_FORMAT TIME_PREFIX MAX_TIMESTAMP_LOOKAHEAD LINE_BREAKER TZ SHOULD_LINEMERGE MAX_DAYS_AGO TRUNCATE | foreach DATETIME_CONFIG TIME_FORMAT TIME_PREFIX MAX_TIMESTAMP_LOOKAHEAD LINE_BREAKER TZ SHOULD_LINEMERGE MAX_DAYS_AGO TRUNCATE [eval <<FIELD>> = if(isnull(<<FIELD>>),"Null",<<FIELD>>)] | foreach * [eval <<FIELD>> = '<<FIELD>>'."##".sourcetype."##".App."||"] | stats values(*) as *| transpose | makemv delim="|| " "row 1" | mvexpand "row 1" | search column!=App column!=sourcetype | rex field="row 1" "^(?<value>[^\#]+)##(?<sourcetype>[^\#]+)##(?<app>[^\#]+)" | eval value = if(value="Null","-",value) | table app sourcetype column value | sort app sourcetype column | stats list(column) as setting list(value) as value by app
iseval = 0

[index_servers]
definition = host=index*
iseval = 0

[advanced_learned_sourcetypes_whitelist]
definition = search sourcetype!=dhcpd sourcetype!=ezproxy
iseval = 0

[stitch_props_trans]
definition = rest /servicesNS/-/-/configs/conf-props | eval props_stanza = if(isnull(sourcetype) OR len(sourcetype)<1, title, sourcetype) | rename eai:appName as app | stats values(*) as * by app props_stanza | table app props_stanza EXTRACT* REPORT* TRANSFORMS*| foreach EXTRACT* REPORT* TRANSFORM* [eval <<FIELD>> = '<<FIELD>>'."##".props_stanza."##".app."||"] | stats values(*) as * | transpose | where  column!="REPORT-zzzzzz-cim-ip" AND like(column,"REPORT%") OR like(column,"TRANS%") OR like(column,"EXTRACT%") | where column!="TRANSFORMS" | makemv delim="|| " "row 1" | mvexpand "row 1" | rex field="row 1" "^(?<value>[^\#]+)##(?<props_stanza>[^\#]+)##(?<app>[^\|]+)" | eval foo = value | makemv value delim="," | mvexpand value | eval value = if(like(column,"EXTRACT%"), foo, value)| rename column as props_attribute value as props_attribute_value app as props_app | dedup props_stanza props_app props_attribute props_attribute_value | table props_stanza props_app props_attribute props_attribute_value | join type=left max=0 props_attribute_value [| rest splunk_server=local /servicesNS/-/-/configs/conf-transforms | eval transforms_stanza = if(isnull(sourcetype) OR len(sourcetype)<1, title, sourcetype) | rename eai:appName as transforms_app | stats values(*) as * by transforms_app transforms_stanza | eval props_attribute_value = transforms_stanza | eval SOURCE_KEY = if(SOURCE_KEY="_raw", null(), SOURCE_KEY) | table transforms_app props_attribute_value transforms_stanza SOURCE_KEY DEST_KEY REGEX FORMAT DELIMS FIELDS] | table props_app props_stanza props_attribute props_attribute_value transforms_stanza transforms_app SOURCE_KEY DEST_KEY REGEX FORMAT DELIMS FIELDS | sort props_app props_stanza props_attribute
iseval = 0

[props_trans_stanza_format]
definition = fieldformat props_stanza = "[".props_stanza."]" | fieldformat transforms_stanza = "[".transforms_stanza."]"
iseval = 0

[sourcetype_punct_whitelist]
definition = sourcetype!=WinEventLog:Security sourcetype!=WinEventLog:System sourcetype!=WinEventLog:Application punct!="__________________________________________________" sourcetype!=perfmon:*
iseval = 0
