[Windows - AD (Kerberos) successful logins]
search = `windowsindex` `windowssourcetype` (EventCode=4768 AND "Audit Success") OR ("EventCode=672" "Success Audit") NOT (Account_Name="*$" OR User_Name="*$") | eval "User_Account"=coalesce(User_Name,Account_Name) | transaction "User_Account",Client_Address maxpause=5s
dispatch.earliest_time = -24h

[Windows - Server with missing patches]
search = `windowsindex` "Windows Update Client successfully"  | rex field=_raw "(?<numpatch>\\d+)\\supdates"  | stats first(numpatch) AS nm,max(_time) AS Time by host
dispatch.earliest_time= -24h

[Windows - Process Activity]
search = `windowsindex` `windowssourcetype` EventCode="592" OR EventCode=4688 NOT User="SYSTEM" NOT User="NETWORK SERVICE" | eval FileName=if(isnotnull(Image_File_Name),Image_File_Name,New_Process_Name) | eval finaluser=if(isnotnull(User_Name),User_Name,Account_Name)
dispatch.earliest_time= -24h

[Windows - Time Synchronization]
search = `windowsindex` `windowssourcetype` EventCode="4616"
dispatch.earliest_time= -24h

[Windows - NTLM successful logins]
search = `windowsindex` `windowssourcetype` ("EventCode=4776" AND Keywords="Audit Success") OR ("EventCode=680" AND "Success Audit") NOT (Logon_Account="*$" OR Logon_account="*$") | eval "User_Account" = coalesce(Logon_Account,Logon_account) | transaction "User_Account",Source_Workstation maxpause=5s
dispatch.earliest_time = -24h

[Windows - AD (Kerberos) unsuccessful logins]
search = `windowsindex` `windowssourcetype` ("EventCode=675" OR ("EventCode=672" AND Type="Failure Audit")) OR (EventCode=4771 AND "Audit Failure") NOT (User_Name="*$" OR Account_Name="*$") NOT Failure_Code=0x19 | eval "User Account"=coalesce(User_Name,Account_Name)
dispatch.earliest_time = -24h

[Windows - AD (Kerberos) unsuccessful distinct count of hosts by users]
search = `windowsindex` `windowssourcetype` ("EventCode=675" OR ("EventCode=672" AND Type="Failure Audit")) OR (EventCode=4771 AND "Audit Failure") NOT (User_Name="*$" OR Account_Name="*$") NOT Failure_Code=0x19  | eval Username=coalesce(User_Name,Account_Name) | stats dc(host) AS "Number of hosts" by Username | sort - "Number of hosts" | table Username "Number of hosts"
dispatch.earliest_time = -24h

[Windows - NTLM unsuccessful logins]
search = `windowsindex` `windowssourcetype` ("EventCode=4776" AND Keywords="Audit Failure") OR ("EventCode=680" AND "Failure Audit") NOT (Logon_Account="*$" OR Logon_account="*$") | eval "User Account" = coalesce(Logon_Account,Logon_account)
dispatch.earliest_time = -24h

[Windows - RDP successful logins]
search = `windowsindex` `windowssourcetype` ( EventCode=528 Logon_Type=10 ) OR EventCode=4624 | eval User = if(isnull(Account_Name), User_Name, mvindex(Account_Name,1))
dispatch.earliest_time = -24h

[Windows - RDP unsuccessful logins]
search = `windowsindex` `windowssourcetype` ( EventCode=529 Logon_Type=10 ) OR EventCode=4625 Failure | eval User = if(isnull(Account_Name), User_Name, mvindex(Account_Name,1))
dispatch.earliest_time = -24h

[Windows - AD (Kerberos) unsuccessful logins (not preauth)]
search = `windowsindex` `windowssourcetype` NOT "Message=Pre-authentication failed:" ("EventCode=675" OR ("EventCode=672" AND Type="Failure Audit")) OR (EventCode=4771 AND "Audit Failure") NOT (User_Name="*$" OR Account_Name="*$") NOT Failure_Code=0x19 | eval "User Account"=coalesce(User_Name,Account_Name)
dispatch.earliest_time = -24h

[Windows - Added Domain Accounts]
search = `windowsindex` `windowssourcetype` "EventCode=624" OR "EventCode=4720" | eval Win2K8_acc = mvindex(Account_Name,1) | eval "Created_Account"=coalesce(Win2K8_acc,New_Account_Name)
dispatch.earliest_time = -24h

[Windows - Deleted Domain Accounts]
search = `windowsindex` `windowssourcetype` "EventCode=67" OR "EventCode=4726" | eval Win2K8_acc = mvindex(Account_Name,1) | eval "Deleted_Account"=coalesce(Win2K8_acc,Target_Account_Name)
dispatch.earliest_time = -24h

[Windows - Locked Domain Accounts]
search = `windowsindex` `windowssourcetype` "EventCode=644" OR "EventCode=4740" | eval Win2K8_acc = mvindex(Account_Name,1) | eval "Locked_Account"=coalesce(Win2K8_acc,Target_Account_Name)
dispatch.earliest_time = -24h

[Windows - Unlocked Domain Accounts]
search = `windowsindex` `windowssourcetype` "EventCode=671" OR "EventCode=4767" | eval Win2K8_acc = mvindex(Account_Name,1) | eval "Unlocked_Account"=coalesce(Win2K8_acc,Target_Account_Name)
dispatch.earliest_time = -24h

[Windows - Disabled User Accounts]
search = `windowsindex` `windowssourcetype` ( CategoryString="Account Management" OR TaskCategory="User Account Management" ) ( "EventCode=629" OR "EventCode=4725" ) | eval caller = if(isnull(Account_Name), Caller_User_Name, mvindex(Account_Name,0)) | eval member = if(isnull(Account_Name), Target_Account_Name, mvindex(Account_Name,1)) | table _time caller member | rename _time AS Time caller AS "Account disabled by" member AS "Disabled Account" | convert timeformat="%H:%M:%S %d.%m.%Y." ctime(Time)
dispatch.earliest_time = -24h

[Windows - Security Enabled Global Group Members Added]
search = `windowsindex` ( CategoryString="Account Management" OR TaskCategory="Security Group Management" ) (Message="Security Enabled*" OR Message="A member was added to a*") ( EventCode=632 OR EventCode=4728)  | eval caller = if(isnull(Account_Name), Caller_User_Name, mvindex(Account_Name,0)) | eval member = if(isnull(Account_Name), Member_Name, mvindex(Account_Name,1)) | eval group = if(isnull(Target_Account_Name), Group_Name, Target_Account_Name) | table _time caller member group | rename _time AS Time member AS Username group AS Group caller AS "Action by" | convert timeformat="%H:%M:%S %d.%m.%Y." ctime(Time)
dispatch.earliest_time = -24h

[Windows - Security Enabled Universal Group Members Added]
search = `windowsindex` ( CategoryString="Account Management" OR TaskCategory="Security Group Management" ) (Message="Security Enabled*" OR Message="A member was added to a*") ( EventCode=660 OR EventCode=4756 ) | eval caller = if(isnull(Account_Name), Caller_User_Name, mvindex(Account_Name,0)) | eval member = if(isnull(Account_Name), Member_Name, mvindex(Account_Name,1)) | eval group = if(isnull(Target_Account_ID), mvindex(Account_Name,2), Target_Account_Name) | table _time caller member group | rename _time AS Time member AS Username group AS Group caller AS "Action by" | convert timeformat="%H:%M:%S %d.%m.%Y." ctime(Time)
dispatch.earliest_time = -24h

[Windows - Security Enabled Local Group Members Added]
search = `windowsindex` ( CategoryString="Account Management" OR TaskCategory="Security Group Management" ) (Message="Security Enabled*" OR Message="A member was added to a*") ( EventCode=636 OR EventCode=4732 ) | eval Member_Name = if(Member_Name == "-", Member_ID, Member_Name) | eval caller = if(isnull(Account_Name), Caller_User_Name, mvindex(Account_Name,0)) | eval member = if(isnull(Account_Name), Member_Name, mvindex(Account_Name,1)) | eval group = if(isnull(Group_Name),Target_Account_Name,Group_Name) | eval domain = if(Target_Domain == "Builtin", ComputerName, Target_Domain) | table _time caller member group domain | rename _time AS Time member AS Username group AS Group caller AS "Action by" domain AS "Destination domain/server" | convert timeformat="%H:%M:%S %d.%m.%Y." ctime(Time)
dispatch.earliest_time = -24h

[Windows - New Created Groups]
search = `windowsindex` `windowssourcetype` EventCode=631 OR EventCode=4727 OR EventCode=635 OR EventCode=4731 OR EventCode=658 OR EventCode=4754 | rex field=Message "(?<msg>[^\.:]+)" | eval new_grp = if(isnotnull(Account_Name), Group_Name, New_Account_Name) | eval creator = if(isnotnull(Account_Name), Account_Name, Caller_User_Name) | table _time creator new_grp msg | rename _time AS Time creator AS "Group created by" new_grp AS "Created group" msg AS "Reason/Type" | convert timeformat="%H:%M:%S %d.%m.%Y." ctime(Time)
dispatch.earliest_time = -24h

[Windows - Deleted Groups]
search = `windowsindex` `windowssourcetype` EventCode=662 OR EventCode=4758 OR EventCode=638 OR EventCode=4734 OR EventCode=634 OR EventCode=477 | rex field=Message "(?<msg>[^\.:]+)" | eval del_grp = if(isnotnull(Account_Name), Group_Name, Target_Account_Name) | eval deletedby = if(isnotnull(Account_Name), Account_Name, Caller_User_Name) | table _time deletedby del_grp msg | rename _time AS Time deletedby AS "Group deleted by" del_grp AS "Deleted group" msg AS "Reason/Type" | convert timeformat="%H:%M:%S %d.%m.%Y." ctime(Time)
dispatch.earliest_time = -24h

[Windows - Domain Policy Changes]
search = `windowsindex` EventCode=643 | rex field=Message "Domain Policy Changed:\s(?<msg>.*)" | table _time host msg Caller_Domain | rename _time AS Time host AS Server msg AS "Policy change" Caller_Domain AS "Windows Domain" | convert timeformat="%H:%M:%S %d.%m.%Y." ctime(Time)
dispatch.earliest_time = -24h

[Windows - Log Entry Deleted]
search = `windowsindex` `windowssourcetype` ("EventCode=517" OR "EventCode=1102") | eval msg="The audit log was cleared." | convert timeformat=" %H:%M:%S %d.%m.%Y." ctime(_time) | table _time host msg | rename _time as Time host as Hostname msg as Message
dispatch.earliest_time = -24h

[Windows - Server Restarts]
search = `windowsindex` EventCode=1074 SourceName="USER32" | rex field=_raw "Comment:\s(?<comment>.*)" | rex field=Message "The process\s(?<process>[^\s]+)" | transaction host maxspan=5m | eval user_count=mvcount(User) | eval final_user=case(user_count == 1, User, user_count > 1, mvindex(User, user_count-1)) | eval process_count=mvcount(process) | eval final_process=case(process_count == 1, process, process_count > 1, mvindex(process, process_count-1)) | table _time host final_user final_process comment | rename _time AS Time | convert timeformat="%H:%M:%S %d.%m.%Y." ctime(Time) | rename final_user AS Username | rename final_process AS "Process name" | rename comment AS "Comment"
dispatch.earliest_time = -24h

[Windows - New Added Services]
search = `windowsindex` `windowssourcetype` NOT SYSTEM ( EventCode=601 OR EventCode=4697 ) | table _time host User Service_Name Service_File_Name | rename _time AS Time | convert timeformat="%H:%M:%S %d.%m.%Y." ctime(Time) | rename User AS Username Service_Name AS "Service Name" Service_File_Name AS "Service File" host AS "Server"
dispatch.earliest_time = -24h

[Windows - Installation History]
search = `windowsindex` sourcetype="*wineventlog:application" SourceName=MsiInstaller EventCode=11707 | dedup _raw | rex field=Message "(?s)Product: (?<product_name>.*) --" | table _time host User product_name | rename _time AS Time host AS Server product_name AS "Product Installed" | convert timeformat="%d.%m.%Y. %H:%M:%S" ctime(Time)
dispatch.earliest_time = -24h

[Windows - Firewall Configuration Changes]
search = `windowsindex` `windowssourcetype` EventCode=4946 OR EventCode=4947 OR EventCode=4948 | rex field=Message "A rule was (?<temp>[^\.]+)" | eval Action=case(temp == "added", "Rule added", temp == "modified", "Rule modified", temp == "deleted", "Rule deleted")
dispatch.earliest_time = -24h

[Windows - Firewall Allowed Binds]
search = `windowsindex` `windowssourcetype` EventCode=5159
dispatch.earliest_time = -24h

[Windows - Firewall Allowed Connections]
search = `windowsindex` `windowssourcetype` EventCode=5156
dispatch.earliest_time = -24h

[Windows - Firewall Blocked Binds]
search = `windowsindex` `windowssourcetype` EventCode=5158
dispatch.earliest_time = -24h

[Windows - Firewall Blocked Connections]
search = `windowsindex` `windowssourcetype` EventCode=5157
dispatch.earliest_time = -24h

