[MSAD:NT5:DNS-Health]
SHOULD_LINEMERGE = false
CHECK_FOR_HEADER = false
REPORT-mvcheck = DNSHealth_ServerAddress_MV, DNSHealth_ListenAddress_MV, DNSHealth_Forwarder_MV, DNSHealth_LogIPFilterList_MV

[MSAD:NT5:DNS-Zone-Information]
SHOULD_LINEMERGE = false
CHECK_FOR_HEADER = false

[MSAD:NT5:DNS]
SHOULD_LINEMERGE = false
CHECK_FOR_HEADER = false
EXTRACT-threadid = (?<threadid>[0-9A-Fa-f]+)\s+(?<context>PACKET)
EXTRACT-protocol = (?<packetid>[0-9A-Fa-f]*) (?<protocol>UDP|TCP) (?<direction>\w+) (?<src_ip>[0-9A-Fa-f\.\:]+)\s+
EXTRACT-opcode = (?<operation>[ R]) (?<opcode>.) \[(?<hexflags>[0-9A-Fa-f]+) (?<flags>....) (?<response>[^\]]+)\]
EXTRACT-question1 = \] (?<questiontype>\w+)\s+(?<questionname>.*)
EXTRACT-question2 = \] (?<questionname>[^\s]*)$

[MSAD:NT5:Health]
SHOULD_LINEMERGE = false
CHECK_FOR_HEADER = false

[MSAD:NT5:Netlogon]
EXTRACT-subnetaffinity = \s(?<src_domain>[^:]+): (?<msad_affinity>NO_CLIENT_SITE): (?<src_host>[^\s]+) (?<src_ip>[0-9A-Fa-f:\.]+)

[MSAD:NT5:SiteInfo]
SHOULD_LINEMERGE = false
CHECK_FOR_HEADER = false
REPORT-extractions = MSAD-SiteInfo-AdjacentSites, MSAD-SiteInfo-Sites, MSAD-SiteInfo-SiteLinks, MSAD-SiteInfo-Subnets

[MSAD:NT6:DNS-Health]
SHOULD_LINEMERGE = false
CHECK_FOR_HEADER = false
REPORT-mvcheck = DNSHealth_ServerAddress_MV, DNSHealth_ListenAddress_MV, DNSHealth_Forwarder_MV, DNSHealth_LogIPFilterList_MV

[MSAD:NT6:DNS-Zone-Information]
SHOULD_LINEMERGE = false
CHECK_FOR_HEADER = false

[MSAD:NT6:DNS]
SHOULD_LINEMERGE = false
CHECK_FOR_HEADER = false
EXTRACT-threadid = (?<threadid>[0-9A-Fa-f]+)\s+(?<context>PACKET)
EXTRACT-protocol = (?<packetid>[0-9A-Fa-f]*) (?<protocol>UDP|TCP) (?<direction>\w+) (?<src_ip>[0-9A-Fa-f\.\:]+)\s+
EXTRACT-opcode = (?<operation>[ R]) (?<opcode>.) \[(?<hexflags>[0-9A-Fa-f]+) (?<flags>....) (?<response>[^\]]+)\]
EXTRACT-question1 = \] (?<questiontype>\w+)\s+(?<questionname>.*)
EXTRACT-question2 = \] (?<questionname>[^\s]*)$

[MSAD:NT6:Health]
SHOULD_LINEMERGE = false
CHECK_FOR_HEADER = false

[MSAD:NT6:Netlogon]
EXTRACT-subnetaffinity = \s(?<src_domain>[^:]+): (?<msad_affinity>NO_CLIENT_SITE): (?<src_host>[^\s]+) (?<src_ip>[0-9A-Fa-f:\.]+)

[MSAD:NT6:SiteInfo]
SHOULD_LINEMERGE = false
CHECK_FOR_HEADER = false
REPORT-extractions = MSAD-SiteInfo-AdjacentSites, MSAD-SiteInfo-Sites, MSAD-SiteInfo-SiteLinks, MSAD-SiteInfo-Subnets

[MSAD:SubnetAffinity]
EXTRACT-subnetaffinity = (?<src_nt_domain>\w+): NO_CLIENT_SITE: (?<src_host>\w+) (?<src_ip>[0-9\.]+)

[WinEventLog:Security]
EXTRACT-nt5sessionid = (?ms)EventCode=(528|540)\s*\n.*?Logon ID:\s*(?<session_id>.*?)\s*\n
EXTRACT-566sessionid = (?ms)EventCode=566\s*\n.*?Client Logon ID:\s*(?<session_id>.*?)\s*\n
EXTRACT-nt5-fail-1   = (?ms)EventCode=675\s*\n.*?User ID:\s*(?<dest_nt_domain>[^\\]+)\\(?<src_user>.*?)\s*\n
EXTRACT-nt5-fail-2   = (?ms)EventCode=672\s*\n.*?Supplied Realm Name:\s*(?<dest_nt_domain>.*?)\s*\n
EXTRACT-nt5groupinfo = (?ms)EventCode=(631|634|635|638|639|641|648|649|652|653|654|657|658|659|662|663|664|667)\s*\n.*Message=Security (?<MSADGroupClassID>Enabled|Disabled) (?<MSADGroupType>\w+) Group (?<msad_action>.*?)[:\.]\s*\n.*(Target|New) Account Name:\s*(?<user_group>.*?)\s*\n
EXTRACT-grpattrchge  = (?ms)EventCode=(641|649|654|659|664)\s*\n.*Message=.*Changed Attributes:\s*\n(?<MSADChangedAttributes>.*)
EXTRACT-grptypechange = (?ms)EventCode=668\s*\n.*Message=Group Type Changed:\s*\n.*Security (?<MSADGroupClassID>Enabled|Disabled) (?<MSADGroupType>\w+) Group (?<msad_action>Changed) to Security (?<MSADNewGroupClassID>Enabled|Disabled) (?<MSADNewGroupType>\w+) Group[:\.]\s*\n.*(Target|New) Account Name:\s*(?<user_group>.*?)\s*\n
EXTRACT-nt5member-1  = (?ms)EventCode=(632|633|636|637|650|651|655|656|660|661|665|666)\s*\n.*Message=Security (?<MSADGroupClassID>Enabled|Disabled) (?<MSADGroupType>\w+) Group (?<msad_action>.*?)[:\.]\s*\n.*
EXTRACT-nt5member-2  = (?ms)EventCode=(632|633|636|637|650|651|655|656|660|661|665|666)\s*\n.*Message=.*?Member Name:\s*(?<member_dn>.*?)\s*\n
EXTRACT-nt5member-3  = (?ms)EventCode=(632|633|636|637|650|651|655|656|660|661|665|666)\s*\n.*Message=.*?Member ID:\s*(?<member_nt_domain>[^\\]+)\\(?<member_name>.*?)\s*\n
EXTRACT-nt5member-3a = (?ms)EventCode=(632|633|636|637|650|651|655|656|660|661|665|666)\s*\n.*Message=.*?Member ID:\s*(?<member_id>.*?)\s*\n
EXTRACT-nt5member-4  = (?ms)EventCode=(632|633|636|637|650|651|655|656|660|661|665|666)\s*\n.*Message=.*?Target Account Name:\s*(?<user_group>.*?)\s*\n.*?Target Domain:\s*(?<dest_nt_domain>.*?)\s*\n
EXTRACT-nt5member-5  = (?ms)EventCode=(632|633|636|637|650|651|655|656|660|661|665|666)\s*\n.*Message=.*?Caller User Name:\s*(?<src_user>.*?)\s*\n.*?Caller Domain:\s*(?<src_nt_domain>.*?)\s*\n
EXTRACT-nt5member-6  = (?ms)EventCode=(632|633|636|637|650|651|655|656|660|661|665|666)\s*\n.*Message=.*?Caller Logon ID:\s*(?<session_id>.*?)\s*\n
EXTRACT-644-fields   = (?ms)EventCode=644\s*\n.*Message=.*Target Account ID:\s*(?<dest_nt_domain>[^\\]+)\\(?<user>.*?)\s*\n.*Caller Machine Name:\s*(?<src_host>.*?)\s*\n
EXTRACT-645compchanges = (?ms)EventCode=645\s*\n.*Message=Computer Account (?<msad_action>.*?)[:\.]\s*\n.*Attributes:\s*\n(?<MSADChangedAttributes>.*)
EXTRACT-646compchanges = (?ms)EventCode=646\s*\n.*Message=Computer Account (?<msad_action>.*?)[:\.]\s*\n.*Changed Attributes:\s*\n(?<MSADChangedAttributes>.*)
EXTRACT-nt5userchanges = (?ms)EventCode=624\s*\n.*Message=User Account (?<msad_action>.*?)[:\.]\s*\n.*Caller Logon ID:\s*(?<session_id>.*?)\s*\n.*Attributes:\s*\n(?<MSADChangedAttributes>.*)
EXTRACT-nt5userchange2 = (?ms)EventCode=(625|626|628|629|630|671)\s*\n.*Message=User Account (?<msad_action>.*?)[:\.]\s*\n.*Caller Logon ID:\s*(?<session_id>.*?)\s*\n
EXTRACT-nt5userchange3 = (?ms)EventCode=(627|685)\s*\n.*Message=(?<msad_action>.*?)[:\.]\s*\n.*Caller Logon ID:\s*(?<session_id>.*?)\s*\n
EXTRACT-nt5userchange4 = (?ms)EventCode=642\s*\n.*Message=User Account (?<msad_action>.*?)[:\.]\s*\n.*Caller Logon ID:\s*(?<session_id>.*?)\s*\n.*Changed Attributes:\s*\n(?<MSADChangedAttributes>.*)
EXTRACT-nt5userchange5 = (?ms)EventCode=807\s*\n.*Message=(?<msad_action>.*?)[:\.]\s*\n.*Category Settings:\s*\n(?<MSADChangedAttributes>.*)
EXTRACT-nt6sessionid = (?ms)EventCode=4624\s*\n.*New Logon:\s*\n.*?Logon ID:\s*(?<session_id>.*?)\s*\n
EXTRACT-nt6groupinfo = (?ms)EventCode=(4727|4730|4731|4734|4735|4736|4737|4744|4745|4748|4750|4753|4754|4755|4758|4759|4760|4763)\s*\n.*Message=A security-(?<MSADGroupClassID>enabled|disabled) (?<MSADGroupType>\w+) group was (?<msad_action>.*?)[:\.]\s*\n.*Subject:\s*\n.*Account Name:\s*(?<src_user>.*?)\s*\n.*Account Domain:\s*(?<src_nt_domain>.*?)\s*\n.*Logon ID:\s*(?<session_id>.*?)\s*\n.*Group:\s*\n.*Group Name:\s*(?<user_group>.*?)\s*\n.*Group Domain:\s*(?<dest_nt_domain>.*?)\s*\n
EXTRACT-nt6grpchange = (?ms)EventCode=4764\s*\n.*Message=A group.s type was changed.\s*\n.*Subject:\s*\n.*Account Name:\s*(?<src_user>.*?)\s*\n.*Account Domain:\s*(?<src_nt_domain>.*?)\s*\n.*Logon ID:\s*(?<session_id>.*?)\s*\n.*Change Type:\s*Security[ -](?<MSADGroupClassID>[Ee]nabled|[Dd]isabled) (?<MSADGroupType>\w+) Group Changed to Security[ -](?<MSADNewGroupClassID>[Ee]nabled|[Dd]isabled) (?<MSADNewGroupType>\w+) Group[.:]\s*\n.*Group Name:\s*(?<user_group>.*?)\s*\n.*Group Domain:\s*(?<dest_nt_domain>.*?)\s*\n
EXTRACT-nt6member-1  = (?ms)EventCode=(4728|4729|4732|4733|4746|4747|4751|4752|4756|4757|4761|4762)\s*\n.*Message=A member was (?<msad_action>\w+) (to|from) a security-(?<MSADGroupClassID>enabled|disabled) (?<MSADGroupType>\w+) group[:\.]\s*\n
EXTRACT-nt6member-2  = (?ms)EventCode=(4728|4729|4732|4733|4746|4747|4751|4752|4756|4757|4761|4762)\s*\n.*Message=.*Subject:\s*\n.*?Account Name:\s*(?<src_user>.*?)\s*\n.*?Account Domain:\s*(?<src_nt_domain>.*?)\s*\n.*Logon ID:\s*(?<session_id>.*?)\s*\n
EXTRACT-nt6member-3  = (?ms)EventCode=(4728|4729|4732|4733|4746|4747|4751|4752|4756|4757|4761|4762)\s*\n.*Message=.*Member:\s*\n.*?Security ID:\s*(?<member_id>.*?)\s*\n.*?Account Name:\s*(?<member_dn>.*?)\s*\n
EXTRACT-nt6member-4  = (?ms)EventCode=(4728|4729|4732|4733|4746|4747|4751|4752|4756|4757|4761|4762)\s*\n.*Message=.*Member:\s*\n.*?Security ID:\s*(?<member_nt_domain>[^\\]+)\\(?<member_name>.*?)\s*\n
EXTRACT-nt6member-5  = (?ms)EventCode=(4728|4729|4732|4733|4746|4747|4751|4752|4756|4757|4761|4762)\s*\n.*Message=.*Group:\s*\n.*Group Name:\s*(?<user_group>.*?)\s*\n.*Group Domain:\s*(?<dest_nt_domain>.*?)\s*\n
EXTRACT-nt6member-6  = (?ms)EventCode=4756\s*\n.*Message=.*Group:\s*\n.*Account Name:\s*(?<user_group>.*?)\s*\n.*Account Domain:\s*(?<dest_nt_domain>.*?)\s*\n
EXTRACT-4740-fields  = (?ms)EventCode=4740\s*\n.*Message=.*Account That Was Locked Out:\s*\n.*?Security ID:\s*(?<dest_nt_domain>[^\\]+)\\(?<user>.*?)\s*\n.*Caller Computer Name:\s*(?<src_host>.*)
EXTRACT-4741compchanges = (?ms)EventCode=4741\s*\n.*Message=A computer account was (?<msad_action>.*?)[:\.]\s*\n.*Attributes:\s*\n(?<MSADChangedAttributes>.*?)\s*\n\s*Additional Information:
EXTRACT-4742compchanges = (?ms)EventCode=4742\s*\n.*Message=A computer account was (?<msad_action>.*?)[:\.]\s*\n.*Changed Attributes:\s*\n(?<MSADChangedAttributes>.*?)\s*\n\s*Additional Information:
EXTRACT-nt6userchanges = (?ms)EventCode=4720\s*\n.*Message=A user account was (?<msad_action>.*?)[:\.]\s*\n.*Attributes:\s*\n(?<MSADChangedAttributes>.*?)\s*\n\s*Additional Information:
EXTRACT-nt6userchange2 = (?ms)EventCode=(4722|4725|4726|4767)\s*\n.*Message=A user account was (?<msad_action>.*?)[:\.]\s*\n.*?Subject:\s*\n.*?Logon ID:\s*(?<session_id>.*?)\s*\n
EXTRACT-nt6userchange3 = (?ms)EventCode=4724\s*\n.*Message=An attempt was made to (?<msad_action>.*?)[:\.]\s*\n.*?Subject:\s*\n.*?Logon ID:\s*(?<session_id>.*?)\s*\n
EXTRACT-nt6userchange4 = (?ms)EventCode=4738\s*\n.*Message=A user account was (?<msad_action>.*?)[:\.]\s*\n.*?Subject:\s*\n.*?Logon ID:\s*(?<session_id>.*?)\s*\n.*Changed Attributes:\s*\n(?<MSADChangedAttributes>.*?)\s*\n\s*Additional Information:
EXTRACT-nt6userchange5 = (?ms)EventCode=4781\s*\n.*Message=(?<msad_action>.*?)[:\.]\s*\n.*?Subject:\s*\n.*?Logon ID:\s*(?<session_id>.*?)\s*\n
EXTRACT-nt6userchange6 = (?ms)EventCode=4912\s*\n.*Message=(?<msad_action>.*?)[:\.]\s*\n.*?Subject:\s*\n.*?Logon ID:\s*(?<session_id>.*?)\s*\n.*Policy Change Details:\s*\n(?<MSADChangedAttributes>.*)
EXTRACT-4662-fields = (?ms)EventCode=4662\s*\n.*Message=.*?\n.*?Subject\s*:.*?Account Name:\s*(?<src_user>.*?)\s*\n.*?Account Domain:\s*(?<src_nt_domain>.*?)\s*\n.*?Logon ID:\s*(?<session_id>.*?)\s*\n
EXTRACT-4768-fields = (?ms)EventCode=(?<Logon_Type>4768)\s*\n.*Account Information:\s*\n\s*Account Name:\s*(?<user>.*?)\s*\n\s*Supplied Realm Name:\s*(?<src_nt_domain>.*?)\s*\n.*\n\s*Client Address:\s*(?<src_ip>.*?)\s*\n
EXTRACT-4771-fields = (?ms)EventCode=(?<Logon_Type>4771)\s*\n.*Account Information:\s*\n\s*Security ID:\s*(?<src_nt_domain>[^\\]+)\\(?<user>.*?)\s*\n.*\n\s*Client Address:\s*(?<src_ip>.*?)\s*\n
LOOKUP-msadgroupclass = GroupType MSADGroupClassID OUTPUTNEW MSADGroupClass

