[DetectionInsight - All Saved Searches - Lookup Gen]
cron_schedule = 33 * * * *
description = Generates/maintains a lookup of all the saved searches based on the /services/saved/searches REST endpoint.\
\
This is used instead of the REST call as it's much faster (15-25x).
display.visualizations.show = 0
dispatch.earliest_time = -1m
dispatch.latest_time = now
display.general.timeRangePicker.show = 0
display.general.type = statistics
display.page.search.tab = statistics
enableSched = 1
request.ui_dispatch_app = Splunk_App_for_Detection_Insights
request.ui_dispatch_view = search
schedule_window = 5
search = | rest splunk_server=local count=0 add_orphan_field=yes /services/saved/searches `saved_search_field_list`\
| outputlookup di_all_saved_searches.csv

[DetectionInsight - All Datamodels - Lookup Gen]
cron_schedule = 54 * * * *
description = Generates/maintains a lookup of all the datamodels and some key statistics about them based on the /services/datamodel/model and /services/admin/summarization REST endpoints.\
\
This is used instead of the REST calls as it's much faster (15-25x).
display.visualizations.show = 0
dispatch.earliest_time = -1m
dispatch.latest_time = now
display.general.timeRangePicker.show = 0
display.general.type = statistics
display.page.search.tab = statistics
enableSched = 1
request.ui_dispatch_app = Splunk_App_for_Detection_Insights
request.ui_dispatch_view = search
schedule_window = 5
search = | rest /services/datamodel/model f=title f=acceleration f=cron_schedule splunk_server=local count=0 \
| spath input=acceleration \
| fields - acceleration \
| join type=outer title [ \
| rest /services/admin/summarization by_tstats=t splunk_server=local count=0 \
    | eval title=replace('summary.id',(("DM_" . 'eai:acl.app') . "_"),"") \
    | rex field=title "(?<title>.*?)(\.|$)" \
    | fields - summary.run_stats.* eai:acl.* \
    | rename summary.* as * \
    | fields title, access_count, access_time, complete, is_inprogress, mod_time, buckets, size, latest_run_duration, average_time, p90, last_error \
        ] \
| join title type=outer \
    [| inputlookup di_all_saved_searches.csv WHERE disabled=0 \
    | where isnotnull('action.correlationsearch.enabled') \
    | `get_detection_additional_data_formatting_no_trending` \
    | search datamodel=* \
    | stats count as detections by datamodel\
    | rename datamodel as title\
        ] \
| fillnull value=0 detections \
| join title type=outer \
    [| rest splunk_server=local /servicesNS/-/Splunk_SA_CIM/data/macros f=title f=definition \
    | search title=cim_*_indexes \
    | rex field=title "cim_(?<datamodel>.*?)_indexes" \
    | eval has_index_allowlist = if(definition=="()", "false", "true")\
    | rename datamodel as title\
        ]\
| table title, enabled, cron_schedule, detections, definition, has_index_allowlist, backfill_time, earliest_time, access_count, access_time, complete, is_inprogress, mod_time, buckets, size, latest_run_duration, average_time, p90, max_time, max_concurrent, manual_rebuilds, allow_old_summaries, allow_skew, schedule_priority, last_error \
| fillnull size, average_time, access_count, complete, is_inprogress, latest_run_duration, p90 \
| eval backfill_time = if(backfill_time == "" OR isnull(backfill_time), "<not set>", backfill_time) \
| eval earliest_time = if(earliest_time == "" OR isnull(earliest_time), "<not set>", earliest_time) \
| rename title as datamodel, enabled as accelerated \
| outputlookup di_all_datamodels.csv

[DetectionInsight - All Initial Checks - Lookup Gen]
description = Inserts the initial checks provided by the application, appending to any existing ones (key is the ID of the rule, with the default application having precedence in case of duplicates).
display.visualizations.show = 0
dispatch.earliest_time = -1m
dispatch.latest_time = now
display.general.timeRangePicker.show = 0
display.general.type = statistics
display.page.search.tab = statistics
request.ui_dispatch_app = Splunk_App_for_Detection_Insights
request.ui_dispatch_view = search
search = | inputlookup di_all_checks_lookup \
| append \
    [| inputlookup di_initial_checks.csv \
        ] \
| dedup id \
| outputlookup di_all_checks_lookup

[DetectionInsight - All Dispositions - Lookup Gen]
description = Generates/maintains a lookup of all the detection outcomes (dispositions, false_positives, trigger count) based on incident_review KV store.
dispatch.earliest_time = -90d@d
dispatch.latest_time = now
cron_schedule = 55 23 * * *
enableSched = 1
schedule_window = auto
display.general.type = statistics
display.page.search.tab = statistics
display.statistics.format.0 = color
display.statistics.format.0.colorPalette = minMidMax
display.statistics.format.0.colorPalette.maxColor = #9E2520
display.statistics.format.0.colorPalette.midColor = #E3723A
display.statistics.format.0.colorPalette.minColor = #118832
display.statistics.format.0.field = fp_ratio
display.statistics.format.0.scale = minMidMax
display.statistics.format.0.scale.midType = percent
display.statistics.format.0.scale.midValue = 50
display.visualizations.show = 0
request.ui_dispatch_app = Splunk_App_for_Detection_Insights
request.ui_dispatch_view = search
search = | inputlookup incident_review_lookup WHERE disposition=*\
| eval _time = time\
| fields _time, disposition, rule_name\
| lookup disposition_lookup status as disposition OUTPUT label as disposition_label\
| eventstats count(eval(match(disposition_label, "False Positive"))) as fp_count count as total by rule_name\
| stats count by disposition_label, rule_name, fp_count, total\
| eval disposition = disposition_label . " (" . round(count/total*100,2) . "%)"\
| eval fp_ratio = round(fp_count/total*100,2)\
| stats values(total) as triggered values(fp_ratio) as fp_ratio values(disposition) as dispositions by rule_name\
| eval dispositions = mvjoin(dispositions, "|")\
| outputlookup di_all_rules_dispositions.csv

[DetectionInsight - Data to Models and Allowlists - Lookup Gen]
alert.track = 0
cron_schedule = 48 23 * * *
description = Generates/maintains a lookup of the data seen in data models (index, sourcetypes) as well as indexes allowlist.  This is used to allow users to more easily see potential misconfigurations and how their data currently flows into data models.
dispatch.earliest_time = -7d@h
dispatch.latest_time = now
display.general.timeRangePicker.show = 0
display.general.type = statistics
display.page.search.mode = fast
display.page.search.tab = statistics
display.statistics.format.0 = color
display.statistics.format.0.colorPalette = map
display.statistics.format.0.colorPalette.colors = {"None":#118832,"Update Allowlist":#65778A}
display.statistics.format.0.field = suggested_action
display.visualizations.show = 0
enableSched = 1
request.ui_dispatch_app = Splunk_App_for_Detection_Insights
request.ui_dispatch_view = search
schedule_window = auto
search = | rest splunk_server=local count=0 /services/admin/datamodel-files f=acceleration f=title f=eai:* search="acceleration=1" search="eai:acl.app=Splunk_SA_CIM"\
| search NOT title IN("Splunk_CIM_Validation", "Splunk_Audit")\
| fields title \
| join title type=outer \
    [| rest splunk_server=local /servicesNS/-/Splunk_SA_CIM/data/macros f=title f=definition search="eai:acl.app=Splunk_SA_CIM"\
    | search title=cim_*_indexes \
    | rex field=title "cim_(?<datamodel>.*?)_indexes" \
    | eval has_index_allowlist = if(definition=="()", "false", "true")\
    | rename datamodel as title\
        ]\
| fields title definition\
| map maxsearches=100 search="| tstats summariesonly=true allow_old_summaries=true values(sourcetype) as sourcetype count from datamodel=\"$title$\" where (index=* OR index=_*) by index | eval datamodel=\"$title$\" | eval definition=\"$definition$\"" \
| stats values(index) as indexes values(sourcetype) as sourcetype values(definition) as definition by datamodel\
| eval suggested_allowlist = "(" . mvjoin(mvmap(indexes, "index=" . indexes), " OR ") . ")"\
| eval definition_indexes = mvsort(split(replace(definition, "\(|\)", ""), " OR "))\
| eval suggested_indexes = mvsort(split(replace(suggested_allowlist, "\(|\)", ""), " OR "))\
| eval suggested_action = if(definition_indexes = suggested_indexes, "None", "Update Allowlist")\
| fields - definition_indexes, suggested_indexes\
| outputlookup di_dm_st_index_allowlists.csv

[DetectionInsight - Incident Review Fields - Lookup Gen]
alert.track = 0
cron_schedule = 18 23 * * *
description = Generates/maintains a lookup of all the fields currently configured to be displayed in Incident Review findings.  This is used to allow users to more easily see potential misconfigurations and ensure their detection output fields are usable by analysts in findings.
dispatch.earliest_time = -1m
dispatch.latest_time = now
display.general.timeRangePicker.show = 0
display.general.type = statistics
display.page.search.mode = fast
display.page.search.tab = statistics
display.visualizations.show = 0
enableSched = 1
request.ui_dispatch_app = Splunk_App_for_Detection_Insights
request.ui_dispatch_view = search
schedule_window = auto
search = | rest splunk_server=local count=0 /services/alerts/log_review/incident_review f=event_attributes\
| eval fields = json_array_to_mv(event_attributes)\
| stats count by fields\
| eval field = json_extract(fields, "field")\
| eval label = json_extract(fields, "label")\
| fields - count, fields\
| outputlookup di_all_incident_review_fields.csv

[DetectionInsight - Auditing Report]
description = Master report for audit checks on all enabled Security Detections.
dispatch.earliest_time = 0
display.visualizations.show = 0
display.events.fields = ["host","source","sourcetype","tag"]
display.general.timeRangePicker.show = 0
display.general.type = statistics
display.page.search.mode = fast
display.page.search.tab = statistics
display.statistics.format.0 = color
display.statistics.format.0.colorPalette = minMidMax
display.statistics.format.0.colorPalette.maxColor = #118832
display.statistics.format.0.colorPalette.midColor = #CBA700
display.statistics.format.0.colorPalette.minColor = #D41F1F
display.statistics.format.0.field = Success Rate
display.statistics.format.0.scale = minMidMax
display.statistics.format.0.scale.midType = percentile
display.statistics.format.0.scale.midValue = 50
display.statistics.format.1 = number
display.statistics.format.1.field = Success Rate
display.statistics.format.1.unit = %
request.ui_dispatch_app = Splunk_App_for_Detection_Insights
request.ui_dispatch_view = search
search = | inputlookup di_all_saved_searches.csv WHERE disabled=0\
| `get_detection_additional_data_formatting_no_trending`\
`check_for_issues`\
`check_for_scheduling_issues`\
| eval total=0, pass=0, fail=0\
| foreach `check_id_prefix` [eval <<FIELD>> = if(isnull('<<FIELD>>') OR '<<FIELD>>' == "", "✅ PASS", "❌ FAIL") | eval total = total + 1 | eval pass = pass + if(match('<<FIELD>>', "PASS"), 1, 0) | eval fail = fail + if(match('<<FIELD>>', "FAIL"), 1, 0)]\
| eval ratio = round(pass/total * 100, 2)\
| table title, ratio, total, pass, fail, `check_id_prefix`\
| rename title as "Detection Name", ratio as "Success Rate", total as "Total Checks", pass as "Passed Checks", fail as "Failed Check"