{"basic_builder": {"appname": "TA-azure-log-analytics-kql-grabber", "friendly_name": "Azure Log Analytics KQL Grabber", "version": "1.1.6", "author": "Leonardo Armesto", "description": "With Azure Log Analytics, you can gather log data from all of your resources.  Why not inject all this data into Splunk?", "theme": "#c4dff6", "large_icon": "iVBORw0KGgoAAAANSUhEUgAAAEgAAABICAYAAABV7bNHAAAJM0lEQVR4XuWce1BTVx7Hz7k3IQ/eITzEAKa8H+owVm21oLZuRazstrNldyrOujvoTmW7lZ3RghbwMfjqrqLd2lHbLTOyD9FdKa4WrJYKXa2tlIq83yYlBtAAIQ9IcnN3khWXwA25N7k3QHr/I/d3vuf3++R3z/2dR4Bgll9bLvZHljcNrlJoMLAkhLtao8OTNDpjqEqHmz0X8BCAQ/ifaD92y5UW1depsXzwi2WCS7+K9XpMR2iQDhE6NXAcZ73wgSR6ZQQv8/1bih1avdEu+WAv1oBsSL/m7RXCRyd+GthnlwgAYFYButCoXr/p79LzGI57Ysb/ZYijF4rAscRgbu3dLPFKe7RmBaDgvTI+i6e+KxnSx9oTBJk2XBaiFfCR87LcqF+TsR+3mXFAvvtazwyOYlupOO2IrTsbGct70f+tnNV+Z8nozBigDcUPlshHsCu1stFAMo7SbRMhYBd17IzMtqU7I4CER1o8NWqg1Ng5ANsKiuz9UB925R/FERvS0yFmrY3TAXFyGiL0CNpqxHGEbCBM2vny0JrTMVFrrEFyKiDx0dakXqWxWofR84aiC5wpkyTvRKYQ6TkNUFmzamFW2cP6XqWerrho1Qn1ZhdJcqaOSU4DFHyo7aZMaUimNSqaxY6sC8p6Z7Xg1ERZpwDKKO09VVI3/CbN8dAu585G9Or9MW5OBWQqAvsNw30GDPegPSIGBIM8WMXyPf8vJhnPoFVnH1Tf7FInMRALI5JeXAQoC2KecmEUUPYV+cLjXynqGYmEQdH4IM6txrfDzXM3RgFtPv/Du+e+Vx5gMJbppJUEN73I+IJAOPZKAies/I1n+hgFxM9vwWesWj4UNzW23CbyBZgRTwBH4hsZA5R5Sb7to28Up8l8Y4zYOAgoyJM1IN8dFcAYIJDTuBdAWMBI8GREHQRk6uLgSyIhY4BCD3d8IxnWLSUTCyM2NABKWsDdyhggZHcTTtOioH38aAAEcMAcIEByQAz1ZsvcUPTGRAoaHbZcptJH2UfmSSsaAK0Ucz9mJIMuNaoyXi2RnCMTYLLYvbJ6W5jFTHrxiZ4/35Nrssi0t2pDA6AYf04rI4BSP+ndebVt+CiZAGczoBBvNjOF4paLsori2qF1cx0Ql4UwA+hnf+2tKGsYnvOAGJtqpJX0VpQ30g8oLpBT5emGjEzMzIY+3XNqHRYwJVtpGIMEPBYzGcQUIPCk/LeAkdtcAQA+NVtpALRMxKMPkGnLGEJoMDnvKoAS5/HKHXqLvXW1nXO7i9V0t1crXB7Cr7+zfYF53cdVAHFYyJuUAd2Ta8XJp6Ufogi+QqHBPMfTfamI9923WeIlrgQIhRQq6YiTD/2NOs3hHsXYb4imEK4I6L31Qa+QyqDFJzry7sl1+6era1wNEAuBwFAYC6cFdOyWlLe3Un1JqTParGlcDdCGaI+iK1tCs60Cev6YlNel1XT2qbB5ZCpiVwKEQABEXuwESU4k8Yri6g+7F/ygwro7FDoybMw2LgZI3bk1VigWw9EpGVTagHvsv97V3NA3JiJNx8UA7XhemFqUFvAZ4VQD3d30AYaD7VTguFIG+fLQ5sH86Ljx+C0yqPDLx/v3VPblUYXjCCDTy8KIA83EPiEEXBwHFlvAT+6rAACTT3XyAQAsAp/t2va5nhm2bG24+7eEgPgFLQManVHoTED29MVUG18eWjKYH73Z4ssa/yPpdM+pmh6N3QcM7B2kmQqWqm6YD7uvOF0Ys0bsOzQF0N7LMuGBr4elmBHnUhV2dKphb390tkMRCOZ7sJ+V5EbUTtY1j0HsvMZEvQF+50incziDjABDfMDRGIt1JosxiJ/f8lijNwp+bIBM2YHjxkhwOKHDWuzw9+WK0JO35Q+IDIhW8Ex2d6TatMn2cy2DvDgowDFD8siB+JrpEgPGHm/PbO7XEx+qJlrBM6kR7HnNJUD+7mh1xnL/3x3/ieC+racGgpymTADBjwIQC4HaV+M87l/YFLLcFpinY9Cqs5J/3uxSvUbYwIUyKNqfWzOEjazv27lYTRaOyQ4mvt+tqpNp3V0RkBsKQfICXp4OQz+t/m2IzceJiAEMOdyOS4etnF2egxkU4efWO6TF/hHux227sz3sDJVsIQQ03SmwpSLeZQGfZVFZmkQq20YsynHTZxMH6T3X+gtrerTm9WmmrwENdiMt2uvhkfXCEib6gv4H2vABjXm3xqFrIiCHhGZZY5h8pgev7raYTNvlossCWvcXyaeV7aophR9VSgI++kihxcqotiNrz4bAULU5dtcLMZBwSkBWh6rd9HUQVTVm7ZXgUJw3s11MVYcLj3duut8/xsgAR2cwQZ5suXx3JKkNBDr7ha+XlqIX6hIcH6WpeoWD1wCHbXH0ziyh0w8TSW1b4eN+ZmOw44MlRT/Nyx2LTnS21svHHDsTSLFjAI0p4GBC5ZRmBPM8f3cWGHg3itQmJ1U3bNmbO3XLa4zXGWCDLWNa71MAhCKwEiuMJfxFIK0+EYiZAd1V4N7P/anlocGI85ju8Kk+BUClGSEvpcd7fuE03yZ09DRtLzapsn9+TnLMaU6QBLQokHOjfkf4Wqf5Nakji+fad1/L/cFRY4JTnCEJqPBlYeKeNQHfO8Una4/Y+OcZpbKUkroh847itBfB8TbvgtbMYR1G6r8Z2JIfvx8bwClqzg63+eN/snr22E15M6QWSw5ebVXlzjSgRfO48mvp4oigIEhp/cYeCNO1IXx1vvjRg54vOtVhVhsynEHeXHQozpMffPsPIVq6A6aqRwhodUEVq507X9+rtFI/MghIwEfBIoHe88usBNM284xfVosvEyQoeqajqosgkxgClBDIBf58NKFqW1jjjJN54oDN6jSlWHKwYtKYlBzK2zc5AOkIltg9qLN7VSDcz62sKFW0a2Mct322wDH5YROQyej1v0lTrrer32OiBOCykOG1UR4n/71ZlD+bwIz7QgrQuPGxrwazd30mL6Sj4kYgHJ3v4/aJdFc45bNIzgRJCZDJsc87ce8NxU2iUG+3f3U8pv6jNx4L0bohIDk5GvZcfiP6kTODtacvyoAmdmJaKrnZlvjLfpWe96yItxEHeFqdbBSYzlHz2QgIF7CBDgNlvUrD51wU6MK8PK7V7pgvscfRmWrzX2/z8eM9wVnHAAAAAElFTkSuQmCC", "small_icon": "iVBORw0KGgoAAAANSUhEUgAAACQAAAAkCAYAAADhAJiYAAADAElEQVRYR2NkoCIwnvrA8f6bX23vfvyxQDc2QJtvrygXQ9bsIJlb+KxkpIZ75Ltub3/4/rcHsWZ5qfMkbUuQm49NPUUOWnXpi27Y8keXiHUIhrp2LQz7yXaQSOcN3jcf/n0i2zEwjWiOIstBHvMfO+y49Xk/xY7B4iiyHMRQee0/1RyD5iiSHSTYdOvr++9/uKjtoExz4abpAeL1JDno////LIxV139T2zFw89q1GElykNeCR3O23fySTLaDYAm44loKAyPDbHRzwvX51ElyEMVph4CDHJW59w4qB4FCjHIHQX3tNPOR8r4HX+7gjU4CITSyHFTrKOoA8nHz/tcHkHMRmI0jURMVQkL1t/nulqooCfIwXsCaqHFFGSx6kAtRcqOs/v9/pknNtx68//5XFuTqe6XKsUpC7Eto7SBDKQ7MRM1Tf2Pql1//spATJ70cJMHD5ISSywSabr768P2vKHpOoZeDGJBLasn226uef/odii3b0sNBQlxMO97VangiQghPDY7XQWTXI2gaoQke7CCmqmv//+FpUNDaQTnmQnpTAiQug7O93ewXiofuvbuHz6M0ddBfJj6GLo3PMPsZzafdv3jy8Xc9mACsQJty4l3p++9/vQlmewqiTEWI1fFOqSqi4ATXZehpB1Z4VV2bzfCfIYUWDmJjZvz2q0WTG5tf6OogQymOuX05ihmOjIx/cAUspoOwqISnIQqih1itg89BHLXX///4Q+VOBBsrP0OjKll9NkaGqivuDP+ZdhAbpCjqkDt52Gp1MgyFlNTk9rOwOIifg/nNx3p1jPqQWLeBHcRTf/Pql19/tYjVhNHgQvJUvZsma6Mj7lxEyA7cddl/hlSGDq05UAf///LrLyGzGFSE2TfcKVEOJKgQjwLURj5y1JHoIAFO5j8f6tRZKXEMuC7DMADmKBIc5KTE/WRfqjy4dUkpwNoN4q67efXrb+LS1KMqZV05XvYrlDoEph9/v6zqijsLI/OOP2htE2lelks2StyJKyOkz1HLITBzAIMymZTGop3QAAAAAElFTkSuQmCC", "visible": true, "tab_version": "4.0.0", "tab_build_no": "0", "build_no": 10}, "data_input_builder": {"datainputs": [{"index": "default", "sourcetype": "kql", "interval": "30", "use_external_validation": true, "streaming_mode_xml": true, "name": "azure_log_analytics", "title": "Azure Log Analytics", "description": "", "type": "customized", "parameters": [{"name": "tenant_id", "label": "Tenant ID", "help_string": "", "required": true, "format_type": "text", "default_value": "", "placeholder": "", "type": "text", "value": "7288177b-76ab-474e-8fd4-ea1afbe9ae68"}, {"name": "client_id", "label": "Client ID", "help_string": "", "required": true, "format_type": "text", "default_value": "", "placeholder": "", "type": "text", "value": "7533e56c-0751-4b62-b9e8-58a979e59e9a"}, {"name": "client_secret", "label": "Client Secret", "help_string": "", "required": true, "format_type": "password", "default_value": "", "placeholder": "", "type": "password", "value": ""}, {"name": "log_analytics_workspace_id", "label": "Log Analytics Workspace ID", "help_string": "", "required": true, "format_type": "text", "default_value": "", "placeholder": "", "type": "text", "value": "86414567-5563-4a04-9d2f-6547c4551b10"}, {"name": "log_analytics_query", "label": "Log Analytics Query", "help_string": " Kusto query language to retrieve log data.", "required": true, "format_type": "text", "default_value": "", "placeholder": "AzureMetrics | where TimeGenerated > now(-10m)", "type": "text", "value": "SigninLogs | where TimeGenerated > ago(1h) | project tostring(TimeGenerated), UserDisplayName, Identity,UserPrincipalName,  AppDisplayName, AppId, ResourceDisplayName, IPAddress, Location, tostring(DeviceDetail.deviceId), UserAgent, ClientAppUsed"}, {"name": "output_format", "label": "Output Format", "help_string": "Data ingestion format", "required": true, "possible_values": [{"value": "csv", "label": "CSV"}, {"value": "json", "label": "JSON"}], "format_type": "radiogroup", "default_value": "csv", "type": "radiogroup", "value": "csv"}, {"name": "cust_source_type", "label": "Custom Source Type", "help_string": "Default is kql", "required": false, "format_type": "text", "default_value": "", "placeholder": "kql", "type": "text", "value": ""}], "data_inputs_options": [{"type": "customized_var", "name": "tenant_id", "title": "Tenant ID", "description": "", "required_on_edit": false, "required_on_create": true, "format_type": "text", "default_value": "", "placeholder": ""}, {"type": "customized_var", "name": "client_id", "title": "Client ID", "description": "", "required_on_edit": false, "required_on_create": true, "format_type": "text", "default_value": "", "placeholder": ""}, {"type": "customized_var", "name": "client_secret", "title": "Client Secret", "description": "", "required_on_edit": false, "required_on_create": true, "format_type": "password", "default_value": "", "placeholder": ""}, {"type": "customized_var", "name": "log_analytics_workspace_id", "title": "Log Analytics Workspace ID", "description": "", "required_on_edit": false, "required_on_create": true, "format_type": "text", "default_value": "", "placeholder": ""}, {"type": "customized_var", "name": "log_analytics_query", "title": "Log Analytics Query", "description": " Kusto query language to retrieve log data.", "required_on_edit": false, "required_on_create": true, "format_type": "text", "default_value": "", "placeholder": "AzureMetrics | where TimeGenerated > now(-10m)"}, {"type": "customized_var", "name": "output_format", "title": "Output Format", "description": "Data ingestion format", "required_on_edit": false, "required_on_create": true, "possible_values": [{"value": "csv", "label": "CSV"}, {"value": "json", "label": "JSON"}], "format_type": "radiogroup", "default_value": "csv"}, {"type": "customized_var", "name": "cust_source_type", "title": "Custom Source Type", "description": "Default is kql", "required_on_edit": false, "required_on_create": false, "format_type": "text", "default_value": "", "placeholder": "kql"}], "code": "# encoding = utf-8\n\nimport os\nimport sys\nimport datetime\nimport time\nimport requests, urllib3\nimport json\n\ndef get_token(url, resource, username, password):\n    payload = {\n        'grant_type': 'client_credentials',\n        'client_id': username,\n        'client_secret': password,\n        'Content-Type': 'x-www-form-urlencoded',\n        'resource': resource,\n        }\n    \n    urllib3.disable_warnings(urllib3.exceptions.InsecureRequestWarning)\n    ApiReturn = requests.post(url, data=payload, verify=False)\n    ApiToken = json.loads(ApiReturn.content)[\"access_token\"]\n    \n    return {\n        'Authorization': 'Bearer ' + ApiToken, \n        'Content-Type': 'application/json'\n        }\n\ndef validate_input(helper, definition):\n    tenant_id = definition.parameters.get('tenant_id', None)\n    client_id = definition.parameters.get('client_id', None)\n    client_secret = definition.parameters.get('client_secret', None)\n    log_analytics_workspace_id = definition.parameters.get('log_analytics_workspace_id', None)\n    log_analytics_query = definition.parameters.get('log_analytics_query', None)\n    cust_source_type = definition.parameters.get('cust_source_type', None)\n    output_format = definition.parameters.get('output_format', None)\n\ndef collect_events(helper, ew):\n    opt_tenant_id = helper.get_arg('tenant_id')\n    opt_client_id = helper.get_arg('client_id')\n    opt_client_secret = helper.get_arg('client_secret')\n    opt_log_analytics_workspace_id = helper.get_arg('log_analytics_workspace_id')\n    opt_log_analytics_query = helper.get_arg('log_analytics_query')\n    opt_cust_source_type = helper.get_arg('cust_source_type')\n    opt_output_format = helper.get_arg('output_format')\n    \n    if opt_cust_source_type == '':\n        opt_cust_source_type = 'kql'\n    \n    try:\n        loginURL = \"https://login.microsoftonline.com/\" + opt_tenant_id + \"/oauth2/token\"\n        resource = \"https://api.loganalytics.io\"\n        url = \"https://api.loganalytics.io/v1/workspaces/\" + opt_log_analytics_workspace_id + \"/query\"\n        \n        Headers = get_token(loginURL, resource, opt_client_id, opt_client_secret)\n        params = {\n            \"query\": opt_log_analytics_query\n            }\n        \n        result = requests.get(url, params=params, headers=Headers, verify=False)\n        \n        if opt_output_format == 'csv':\n        \n            rows = len(result.json()[\"tables\"][0][\"rows\"])\n        \n            for row in range(0, rows):\n                data = json.dumps(result.json()[\"tables\"][0][\"rows\"][row]).strip(\"[]\").replace(\"'\",\"\")\n                \n                event = helper.new_event(data, host=None, source=None, sourcetype=opt_cust_source_type, done=True, unbroken=True)\n        \n                try:\n                    ew.write_event(event)\n                except Exception as e:\n                    raise e\n        \n        elif opt_output_format == 'json':\n            columns = result.json()[\"tables\"][0][\"columns\"]\n            column_length = len(result.json()[\"tables\"][0][\"columns\"])\n            \n            for row in result.json()[\"tables\"][0][\"rows\"]:\n                data = {}\n                \n                for i in range(0,column_length):\n                    data[columns[i]['name']] = row[i]\n                \n                data = json.dumps(data)\n\n                event = helper.new_event(data, host=None, source=None, sourcetype=opt_cust_source_type, done=True, unbroken=True)\n                try:\n                    ew.write_event(event)\n                except Exception as e:\n                    raise e        \n\n    except Exception as e:\n        raise e", "customized_options": [{"name": "tenant_id", "value": ""}, {"name": "client_id", "value": ""}, {"name": "log_analytics_workspace_id", "value": ""}, {"name": "log_analytics_query", "value": ""}, {"name": "output_format", "value": "json"}, {"name": "cust_source_type", "value": ""}], "uuid": "9db37af1ef1d4e2f858bc5c28752a647", "sample_count": 0}]}, "field_extraction_builder": {"kql": {"data_format": "tabular", "table_results": {"delim": ","}}}, "global_settings_builder": {"global_settings": {"proxy_settings": {"proxy_type": "http"}, "log_settings": {}}}, "sourcetype_builder": {"kql": {"metadata": {"event_count": 0, "data_input_name": "azure_log_analytics", "extractions_count": 0, "cims_count": 0}}}, "validation": {"validators": ["best_practice_validation", "data_model_mapping_validation", "field_extract_validation", "app_cert_validation"], "status": "job_started", "validation_id": "v_1642623432_68", "progress": 0.5}}