[ipfix_idx]
definition = eventtype=ipfix_idx

[gigamon_stream_bad_vocab_mc_hc]
definition = eventtype=gigamon_bad_vocab | rex field=_raw "stream\.main\s-\s(?<message>[^\n\r]+)"  |stats count AS total_failures, latest(message) as message values(is_recent) as ir values(_time) as time by host | eval severity_level = case(total_failures == 0, 1, total_failures > 0, 3)| rename host AS instance | fields instance total_failures message severity_level

[gigamon_top_field(1)]
args = f
definition = top limit=10 $f$

[gig_convert_hex_to_ascii(1)]
args = f
definition = rex mode=sed field=$f$ "s/([0-9A-Fa-f]{2})/%\1/g" | rex mode=sed field=$f$ "s/%[890ABCDEDFabcdef][\d\w]/-/g" | eval $f$_1=urldecode($f$)

[ipfix_events]
definition = sourcetype=cefevents OR eventtype=ipfix_events

[gigamon_stream_unable_start_mc_hc]
definition = eventtype=gigamon_no_fwd_start |rex field=_raw "NetflowManager\s+-\s+(?<message>[^\r\n]+)" |stats count AS total_failures, latest(message) as message values(is_recent) as ir values(_time) as time by host | eval severity_level = case(total_failures == 0, 1, total_failures > 0, 3)| rename host AS instance | fields instance total_failures message severity_level

[gigamon_stream_vocab_mapping_mc_hc]
definition = eventtype=gigamon_vocab_mapping|  rex field=_raw "::setConfig(?<message>[^\r\n]+)" |stats count AS total_failures, values(is_recent) as ir values(_time) as time by host message | eval severity_level = case(total_failures == 0, 1, total_failures > 0, 3)| rename host AS instance | fields instance total_failures message severity_level

[gigamon_unknown_event_type_mc_hc]
definition = eventtype=gigamon_unknown_event_type | rex field=_raw "stream\.CaptureServer - (?<message>[^\r\n]+)" | stats count AS total_failures, values(_time) as time by host message | eval severity_level = case(total_failures==0, 0, total_failures > 0 2)| rename host as instance | fields instance total_failures message severity_level

[gigamon_invalid_stream_mc_hc]
definition = eventtype=gigamon_invalid_stream | rex field=_raw "with id (?<stream>[^-]+)\s*--\s*(?<message>[^\n\r]+)" |eval message = stream." - ".message | stats count AS total_failures, values(_time) as time by host message | eval severity_level = case(total_failures==0, 1, total_failures > 0, 3)| rename host as instance | fields instance total_failures message severity_level

[ipfix_http_events]
definition = eventtype=ipfix_http_events

[ipfix_http_events_detail]
definition = eventtype=ipfix_http_events | eval port_list=mvzip(src_port,dest_port) | dedup src_ip,dest_ip,port_list sortby -_time | mvexpand port_list | eval port_list_split=split(port_list,","), src_port=mvindex(port_list_split,0), dest_port=mvindex(port_list_split,1)

[ipfix_dns_events]
definition = eventtype=ipfix_dns_events | eval port_list=mvzip(src_port,dest_port) | dedup src_ip,dest_ip,port_list sortby -_time | mvexpand port_list | eval port_list_split=split(port_list,","), src_port=mvindex(port_list_split,0), dest_port=mvindex(port_list_split,1)


[confusionmatrix(2)]
args = a, p
definition = rename "$a$" as actual, "$p$" as predicted\
| stats count by actual predicted\
| appendpipe [ eval predicted=actual, count=0 ]\
| stats sum(count) as count by actual predicted\
| xyseries actual predicted count\
| rename * as "Predicted *"\
| rename "Predicted $a$" as "Actual $a$"\
| fillnull value=0
iseval = 0


[classificationstatistics(2)]
args = a, p
definition = `classificationreport("$a$", "$p$")`\
| tail 1\
| eval precision=round(precision, 2), recall=round(recall, 2), accuracy=round(accuracy, 2), f1=round(2*precision*recall/(precision+recall), 2)
iseval = 0

[classificationreport(2)]
args = a, p
definition = rename "$a$" as actual, "$p$" as predicted\
| stats count by actual predicted\
| xyseries actual predicted count\
| fillnull\
| untable actual predicted count\
| stats sum(eval(if(actual == predicted, count, 0))) as t sum(eval(if(actual != predicted, count, 0))) as f by actual predicted\
| eventstats sum(eval(if(actual==predicted, t, 0))) as tp sum(eval(if(actual!=predicted, f, 0))) as fn by actual\
| eventstats sum(eval(if(actual!=predicted, f, 0))) as fp by predicted\
| eval count=if(actual==predicted,t,f), fp=if(actual==predicted, fp, 0), fn=if(actual==predicted, fn,0), tp=if(actual==predicted, tp, 0)\
| stats sum(count) as count sum(t) as t sum(f) as f sum(tp) as tp sum(fn) as fn sum(fp) as fp by actual\
| eventstats sum(count) as total\
| eval precision=tp/(tp+fp)\
| eval recall=tp/(tp+fn)\
| eval f1=2*precision*recall/(precision+recall)\
| eval accuracy=t/count\
| fillnull\
| appendpipe [ stats sum(count) as count sum(eval(accuracy*count/total)) as accuracy sum(eval(precision*count/total)) as precision sum(eval(recall*count/total)) as recall sum(eval(f1*count/total)) as f1 | eval actual="Weighted Average" ]\
| rename actual as class\
| table class accuracy precision recall f1 count
iseval = 0

