[ipfix_idx]
definition = eventtype=ipfix_idx

[gigamon_stream_bad_vocab_mc_hc]
definition = eventtype=gigamon_bad_vocab | rex field=_raw "stream\.main\s-\s(?<message>[^\n\r]+)"  |stats count AS total_failures, latest(message) as message values(is_recent) as ir values(_time) as time by host | eval severity_level = case(total_failures == 0, 1, total_failures > 0, 3)| rename host AS instance | fields instance total_failures message severity_level

[gigamon_top_field(1)]
args = f
definition = top limit=10 $f$

[gig_convert_hex_to_ascii(1)]
args = f
definition = rex mode=sed field=$f$ "s/([0-9A-Fa-f]{2})/%\1/g" | rex mode=sed field=$f$ "s/%[890ABCDEDFabcdef][\d\w]/-/g" | eval $f$_1=urldecode($f$)

[ipfix_events]
definition = sourcetype=cefevents OR eventtype=ipfix_events

[gigamon_stream_unable_start_mc_hc]
definition = eventtype=gigamon_no_fwd_start |rex field=_raw "NetflowManager\s+-\s+(?<message>[^\r\n]+)" |stats count AS total_failures, latest(message) as message values(is_recent) as ir values(_time) as time by host | eval severity_level = case(total_failures == 0, 1, total_failures > 0, 3)| rename host AS instance | fields instance total_failures message severity_level

[gigamon_stream_vocab_mapping_mc_hc]
definition = eventtype=gigamon_vocab_mapping|  rex field=_raw "::setConfig(?<message>[^\r\n]+)" |stats count AS total_failures, values(is_recent) as ir values(_time) as time by host message | eval severity_level = case(total_failures == 0, 1, total_failures > 0, 3)| rename host AS instance | fields instance total_failures message severity_level

[gigamon_unknown_event_type_mc_hc]
definition = eventtype=gigamon_unknown_event_type | rex field=_raw "stream\.CaptureServer - (?<message>[^\r\n]+)" | stats count AS total_failures, values(_time) as time by host message | eval severity_level = case(total_failures==0, 0, total_failures > 0 2)| rename host as instance | fields instance total_failures message severity_level

[gigamon_invalid_stream_mc_hc]
definition = eventtype=gigamon_invalid_stream | rex field=_raw "with id (?<stream>[^-]+)\s*--\s*(?<message>[^\n\r]+)" |eval message = stream." - ".message | stats count AS total_failures, values(_time) as time by host message | eval severity_level = case(total_failures==0, 1, total_failures > 0, 3)| rename host as instance | fields instance total_failures message severity_level

[ipfix_http_events]
definition = eventtype=ipfix_http_events

[ipfix_http_events_detail]
definition = eventtype=ipfix_http_events | eval port_list=mvzip(src_port,dest_port) | dedup src_ip,dest_ip,port_list sortby -_time | mvexpand port_list | eval port_list_split=split(port_list,","), src_port=mvindex(port_list_split,0), dest_port=mvindex(port_list_split,1)

[ipfix_dns_events]
definition = eventtype=ipfix_dns_events | eval port_list=mvzip(src_port,dest_port) | dedup src_ip,dest_ip,port_list sortby -_time | mvexpand port_list | eval port_list_split=split(port_list,","), src_port=mvindex(port_list_split,0), dest_port=mvindex(port_list_split,1)
