[mcafee:firecore]
TIME_PREFIX=^
MAX_TIMESTAMP_LOOKAHEAD=24
TIME_FORMAT=%m/%d/%Y %H:%M:%S.%3N
SHOULD_LINEMERGE=false
LINE_BREAKER=([\r\n]+)
TRUNCATE=10000
EVENT_BREAKER_ENABLE=true
EVENT_BREAKER=([\r\n]+)
CHARSET = AUTO

# remove trailing \x00\x00 
SEDCMD-remove_null_ending = s/\\x00\\x00//

# 10/24/2019 23:30:35.376 INFO Connection opened IN  006 127.0.0.1:51709 127.0.0.1:51710 PID 4044 MCPSERVICE.EXE\x00\x00 
# 10/24/2019 23:43:18.699 INFO Connection closed OUT 017 fe80:0:0:0:409:a5ee:5270:45c7:546 ff02:0:0:0:0:0:1:2:547 PID 724 SVCHOST.EXE\x00\x00 
#EXTRACT-info_connection_closed_opened = ^\d+/\d+/\d+\s+\d\d:\d\d:\d\d\.\d\d\d\s+(?<fc_log_level>[A-Z]{2,10})\s+(?<fc_connection_action>Connection \w+)\s+(?<fc_connection_direction>[A-Z]{2,10})\s+(?<fc_proto>\d{1,10})\s+(?<fc_src>(\d+\.\d+\.\d+\.\d+)|([a-f0-9:]+[a-f0-9])):(?<fc_src_port>\d{1,5})\s+(?<fc_dest>(\d+\.\d+\.\d+\.\d+)|([a-f0-9:]+[a-f0-9])):(?<fc_dest_port>\d{1,5})\s*(?:PID)?\s*(?<fc_pid>\d+)?\s*(?<fc_process>[\w\.-_ ]+)?\\?
EXTRACT-info_connection_closed_opened = ^\d+/\d+/\d+\s+\d\d:\d\d:\d\d\.\d\d\d\s+(?<fc_log_level>[A-Z]{2,10})\s+(?<fc_connection_action>Connection \w+)\s+(?<fc_connection_direction>[A-Z]{2,10})\s+(?<fc_proto>\d{1,10})\s+(?<fc_src>(\d+\.\d+\.\d+\.\d+)|([a-f0-9:]+[a-f0-9])):(?<fc_src_port>\d{1,5})\s+(?<fc_dest>(\d+\.\d+\.\d+\.\d+)|([a-f0-9:]+[a-f0-9])):(?<fc_dest_port>\d{1,5})\s*(?:PID)?\s*(?<fc_pid>\d+)?\s*(?<fc_process>[^\\]+)?


# 10/24/2019 23:58:20.227 INFO Process started PID 6584 SEARCHPROTOCOLHOST.EXE\x00\x00 
# 10/24/2019 23:58:02.242 INFO Process terminated PID 2360 SPLUNK-WINPRINTMON.EXE\x00\x00
EXTRACT-info_process_started_terminated = ^\d+/\d+/\d+\s+\d\d:\d\d:\d\d\.\d\d\d\s+(?<fc_log_level>[A-Z]{2,10})\s+(?<fc_process_action>Process [a-z]+)\s+PID\s+(?<fc_pid>\d{1,5})\s+(?<fc_process>[^\\]+)

# 10/24/2019 23:54:19.547 INFO Endpoint opened 017 0.0.0.0:68 PID 724 SVCHOST.EXE\x00\x00 
# 10/24/2019 23:53:56.842 INFO Endpoint closed 017 0:0:0:0:0:0:0:0:52249 PID 1412 SVCHOST.EXE\x00\x00 
# 10/24/2019 23:55:35.377 INFO Endpoint opened 017 fe80:0:0:0:e546:631a:b4e3:9a21:546 PID 724 SVCHOST.EXE\x00\x00 
EXTRACT-info_endpoint_opened_closed = ^\d+/\d+/\d+\s+\d\d:\d\d:\d\d\.\d\d\d\s+(?<fc_log_level>[A-Z]{2,10})\s+(?<fc_endpoint_action>Endpoint [a-z]+)\s+(?<fc_proto>\d{1,10})\s+(?<fc_endpoint_addr>[^ ]+):(?<fc_endpoint_port>\d{1,5})\s+PID\s+(?<fc_pid>\d{1,5})\s+(?<fc_process>[^\\]+)

# 10/23/2019 16:33:38.402 FW_ACTION_ALLOW OUT 0806 00-0c-29-ef-2e-a4 ff-ff-ff-ff-ff-ff {145CE739-CB40-494A-A1-2A-B7-1B-88-CA-DA-B5} PID 0 \x00\x00 
# 10/23/2019 16:33:37.120 FW_ACTION_ALLOW OUT 006 192.168.111.114:3389 192.168.111.1:47390  {145CE739-CB40-494A-A1-2A-B7-1B-88-CA-DA-B5} PID 0 \x00\x00
# 10/28/2019 21:43:03.808 FW_ACTION_ALLOW IN  006 192.168.111.1:7519 192.168.111.114:3389  {564BAE49-C375-4A7C-89-54-4A-B8-B6-5E-8A-40} PID 788 SVCHOST.EXE\x00\x00 
EXTRACT-1-fw_action = ^\d+/\d+/\d+\s+\d\d:\d\d:\d\d\.\d\d\d\s+(?<fw_action>FW_ACTION_[A-Z_]+)\s+(?<fc_connection_direction>[A-Z]{2,10})\s+(?<fc_fw_proto>\d+)\s+(?<fc_fw_src>[^ ]+)\s+(?<fc_fw_dest>[^ ]+)\s+\{(?<fc_fw_action_unknown_guid>[A-Z0-9-]{10,45})\}\s+PID\s+(?<fc_pid>\d{1,5})\s*(?<fc_process>[^\\]+)?

# extract IPv4 or IPv6 and a port 
EXTRACT-2-fw_action_fc_fw_src  = (?<fc_src>(\d+\.\d+\.\d+\.\d+)|([a-f0-9:]+[a-f0-9])):(?<fc_src_port>\d{1,5}) in fc_fw_src
EXTRACT-3-fw_action_fc_fw_dest  = (?<fc_dest>(\d+\.\d+\.\d+\.\d+)|([a-f0-9:]+[a-f0-9])):(?<fc_dest_port>\d{1,5}) in fc_fw_dest

# extract MAC
# TODO: dest_mac / src_mac, 06:10:9f:eb:8f:14
EXTRACT-5-fw_action_fc_fw_src  = (?<fc_src_mac>[a-f0-9]{2}-[a-f0-9]{2}-[a-f0-9]{2}-[a-f0-9]{2}-[a-f0-9]{2}-[a-f0-9]{2}) in fc_fw_src
EXTRACT-6-fw_action_fc_fw_dest  = (?<fc_dest_mac>[a-f0-9]{2}-[a-f0-9]{2}-[a-f0-9]{2}-[a-f0-9]{2}-[a-f0-9]{2}-[a-f0-9]{2}) in fc_fw_dest

# 10/25/2019 14:29:24.829 INFO Policy added {E94A82E4-8E59-45D9-8E-E4-91-AA-23-9C-DF-D0}  PP Uid {F2BF4633-6C74-458B-8A-F3-83-DA-8D-DB-D9-52} 
# 10/25/2019 14:29:24.829 INFO Policy deleted {E9E44D20-2404-401A-B8-DB-1B-03-5D-A3-79-34}  
EXTRACT-policy_added_deleted = ^\d+/\d+/\d+\s+\d\d:\d\d:\d\d\.\d\d\d\s+(?<fc_log_level>[A-Z]{2,10})\s+(?<fc_policy_action>Policy \w+)\s+\{(?<fc_policy_guid>[A-Z0-9]+\-[A-Z0-9-]+[A-Z0-9]{2})\}\s*(PP)?\s*([Uu][Ii][Dd])?\s*\{?(?<fc_pp_guid>[A-Z0-9]+\-[A-Z0-9-]+[A-Z0-9]{2})?\}?

# 10/25/2019 14:28:25.004 Service is starting
# 10/25/2019 01:12:49.473 Service is stopping
EXTRACT-service_starting_stopping = ^\d+/\d+/\d+\s+\d\d:\d\d:\d\d\.\d\d\d\s+Service is (?<fc_service_action>(start|stop))(ing|ping) 

# CIM Mapping to Network Traffic https://docs.splunk.com/Documentation/CIM/latest/User/NetworkTraffic
# action (allowed, blocked, teardown), dest, dest_ip, dest_mac, dest_port, direction (inbound, outbound), protocol (L3, like ip), 
# response_time, src, src_ip, src_mac, src_port, tcp_flag, transport (icmp, tcp, udp), user
# Check with:
# | datamodel Network_Traffic All_Traffic  search | search sourcetype="mcafee:firecore" | table All_Traffic.action , All_Traffic.dest, All_Traffic.dest_ip, All_Traffic.dest_mac, All_Traffic.dest_port, All_Traffic.direction , All_Traffic.protocol  All_Traffic.src, All_Traffic.src_ip, All_Traffic.src_mac, All_Traffic.src_port, All_Traffic.transport
#
#
# CIM Mapping to Endpoint https://docs.splunk.com/Documentation/CIM/latest/User/Endpoint
# process_exec, process_id, ??? service:description,service_exec,service_name/service, ??
# Check with:
# | datamodel Endpoint Processes search | search sourcetype="mcafee:firecore" | table Processes.action Processes.process_exec, Processes.process_id 
# 
FIELDALIAS-src_ip       = fc_src       AS src_ip
FIELDALIAS-src_port     = fc_src_port  AS src_port
FIELDALIAS-dest_ip      = fc_dest      AS dest_ip
FIELDALIAS-dest_port    = fc_dest_port AS dest_port
FIELDALIAS-process_id   = fc_pid       AS process_id
FIELDALIAS-process_exec = fc_process   AS process_exec

EVAL-action = CASE ( fc_connection_action = "Connection opened"       , "allowed",  \
                     fc_connection_action = "Connection closed"       , "teardown", \
                     fc_process_action    = "Process started"         , "started",  \
                     fc_process_action    = "Process terminated"      , "stopped",  \
                     fw_action            = "FW_ACTION_ALLOW"         , "allowed",  \
                     fw_action            = "FW_ACTION_BLOCK_HOST"    , "blocked",  \
                     fw_action            = "FW_ACTION_BLOCK_AND_RESET_CONNECTION", "blocked", \
                     fw_action            = "FW_ACTION_BLOCK_PACKET"  , "blocked" )

EVAL-dest      = coalesce(dest, dest_ip)

EVAL-dest_mac  = lower ( replace ( fc_dest_mac, "(\w{2})-(\w{2})-(\w{2})-(\w{2})-(\w{2})-(\w{2})", "\1:\2:\3:\4:\5:\6" ) )

EVAL-direction = CASE ( fc_connection_action = "Connection opened" AND fc_connection_direction = "IN" , "inbound" , \
                        fc_connection_action = "Connection opened" AND fc_connection_direction = "OUT", "outbound", \
                        fw_action = "FW_ACTION_ALLOW" AND fc_connection_direction              = "IN" , "inbound" , \
                        fw_action = "FW_ACTION_ALLOW" AND fc_connection_direction              = "OUT", "outbound" )

EVAL-protocol  = CASE ( fc_fw_proto = "0806" , "arp" ,      \
                        fc_fw_proto = "058"  , "ipv6-icmp", \
                        fc_fw_proto = "02"   , "igmp",      \
                        fc_fw_proto = "01"   , "icmp",      \
                        fc_proto    = "001"  , "icmp" )

EVAL-src       = coalesce ( src, src_ip )

EVAL-src_mac   = lower ( replace ( fc_src_mac, "(\w{2})-(\w{2})-(\w{2})-(\w{2})-(\w{2})-(\w{2})", "\1:\2:\3:\4:\5:\6" ) )

EVAL-transport = CASE ( fc_proto    = "006" , "tcp", \
                        fc_proto    = "017" , "udp", \
                        fc_fw_proto = "006" , "tcp", \
                        fc_fw_proto = "017" , "udp"  )





