[save_exporters_with_nfo]
is_visible = false
enableSched = 1
run_on_startup = true
cron_schedule = */30 * * * *
dispatch.earliest_time = -32m@m
dispatch.latest_time = -2m@m
search = `netflow_search_all_ddos_rules` | inputlookup nfo_exp_lookup append=t | dedup exp_ip nfo_hostname | sort exp_ip | table nfo_hostname exp_ip | outputlookup nfo_exp_lookup

[ddos_alert]
disabled = 1
action.email = 1
action.email.include.view_link = 0
action.email.message.alert = NetFlow Optimizer detected a possible $result.indicator_description$ attack. $action.email.hostname$/en-US/app/ddos_detector/ddos_details?earliest=$result.info_min_time$&latest=$result.info_max_time$&form.confidence=$result.alerting_level$&form.exp_ip=*
action.email.subject.alert = Possible DDoS attack detected
action.email.useNSSubject = 1
alert.suppress = 0
alert.track = 0
counttype = number of events
cron_schedule = */1 * * * *
dispatch.earliest_time = -2m@m
dispatch.latest_time = -1m@m
enableSched = 1
quantity = 0
relation = greater than
search = `ddos_alert_search(High and above)`


[ddos_20196_20064]
disabled = 1
is_visible = false
enableSched = 1
cron_schedule = * * * * *
realtime_schedule = 0
dispatch.earliest_time = -10m@m
dispatch.latest_time = now
action.summary_index = 1
action.summary_index._name = summary
action.summary_index.report = ddos_20196_20064
action.summary_index.version = 2
search = `netflow_search_rule_20196` \
    | rex field=confidence "(?<confidence_value>\d+)\/(?<confidence_threshold>\d+)" \
    | eval exporter = exp_ip \
    | eval nfo = nfo_hostname \
    | eval timestamp_20196 = _time \
    | append [ | stats count \
        | eval nfc_id = 20196 \
        | eval t_first = 0 \
        | eval t_last = 0 \
        | eval confidence_value = 0 \
        | eval exporter = 0 \
        | eval nfo = 0 \
        | eval timestamp_20196 = 0 ] \
    | map maxsearches=50000 search="search `netflow_search_rule_20064` \
        | where (_time >= $t_first$) AND (_time - round(t_int/1000) <= $t_last$) AND (exp_ip == $exporter$) AND (nfo_hostname == $nfo$) \
        | eval conf = $confidence_value$ \
        | eval report_time = $timestamp_20196$" \
    | dedup _time nfo_hostname exp_ip protocol dest_ip src_ip packets_in bytes_in packets_out bytes_out bytes flow_count percent_of_total t_int report_time conf \
    | eval left_host = if(src_ip < dest_ip, src_ip, dest_ip) \
    | eval right_host = if(src_ip < dest_ip, dest_ip, src_ip) \
    | eval bytes_sent_by_left = if(left_host == src_ip, bytes_in, bytes_out) \
    | eval bytes_sent_by_right = if(right_host == src_ip, bytes_in, bytes_out) \
    | stats sum(bytes_sent_by_left) as TrafficLR sum(bytes_sent_by_right) as TrafficRL by left_host right_host nfo_hostname exp_ip conf report_time src_ip dest_ip  flow_smpl_id \
    | eval _time = report_time \
    | eval priority = 0 \
    | rename conf as confidence \
    | table _time src_ip dest_ip left_host right_host confidence nfo_hostname exp_ip TrafficLR  TrafficRL priority flow_smpl_id report_time 


[ddos_20196_20067]
is_visible = false
enableSched = 1
cron_schedule = * * * * *
realtime_schedule = 0
dispatch.earliest_time = -10m@m
dispatch.latest_time = now
action.summary_index = 1
action.summary_index._name = summary
action.summary_index.report = ddos_20196_20067
action.summary_index.version = 2
search = `netflow_search_rule_20196` \
    | rex field=confidence "(?<confidence_value>\d+)\/(?<confidence_threshold>\d+)" \
    | eval exporter = exp_ip \
    | eval nfo = nfo_hostname \
    | eval timestamp_20196 = _time \
    | append [ | stats count \
        | eval nfc_id = 20196 \
        | eval t_first = 0 \
        | eval t_last = 0 \
        | eval confidence_value = 0 \
        | eval exporter = 0 \
        | eval nfo = 0 \
        | eval timestamp_20196 = 0 ] \
    | map maxsearches=50000 search="search `netflow_search_rule_20067` \
    | where (_time >= $t_first$) AND (_time - round(t_int/1000) <= $t_last$) AND (exp_ip == $exporter$) AND (nfo_hostname == $nfo$) \
    | eval conf = $confidence_value$ \
    | eval report_time = $timestamp_20196$" \
    | dedup _time nfo_hostname exp_ip transport dest_ip src_ip packets_in bytes_in flow_count percent_of_total t_int report_time conf \
    | stats sum(bytes) as total_traffic by src_ip dest_ip dest_port transport nfo_hostname exp_ip conf report_time flow_smpl_id  \
    | eval _time = report_time \
    | eval priority = 0 \
    | rename conf as confidence \
    | table _time src_ip dest_ip dest_port transport confidence nfo_hostname exp_ip total_traffic priority  flow_smpl_id

[ddos_20196_20195]
is_visible = false
enableSched = 1
cron_schedule = * * * * *
realtime_schedule = 0
dispatch.earliest_time = -10m@m
dispatch.latest_time = now
action.summary_index = 1
action.summary_index._name = summary
action.summary_index.report = ddos_20196_20195
action.summary_index.version = 1
search = `netflow_search_rule_20196` \
    | rex field=confidence "(?<confidence_value>\d+)\/(?<confidence_threshold>\d+)" \
    | eval exporter = exp_ip \
    | eval nfo = nfo_hostname \
    | eval timestamp_20196 = _time \
    | append [ | stats count \
        | eval nfc_id = 20196 \
        | eval t_first = 0 \
        | eval t_last = 0 \
        | eval confidence_value = 0 \
        | eval exporter = 0 \
        | eval nfo = 0 \
        | eval timestamp_20196 = 0 ] \
    | map maxsearches=50000 search="search `netflow_search_rule_20195` \
        | where (last_seen >= $t_first$) AND (first_seen <= $t_last$) AND (exp_ip == $exporter$) AND (nfo_hostname == $nfo$) \
        | eval conf = $confidence_value$ \
        | eval _time = $timestamp_20196$" \
    | eval total_traffic = 0 \
    | eval priority = 10 \
    | rename conf as confidence \
    | table _time src_ip dest_ip confidence nfo_hostname exp_ip total_traffic priority 

[ddos_20196_20198]
is_visible = false
enableSched = 1
cron_schedule = * * * * *
realtime_schedule = 0
dispatch.earliest_time = -10m@m
dispatch.latest_time = now
action.summary_index = 1
action.summary_index._name = summary
action.summary_index.report = ddos_20196_20198
action.summary_index.version = 1
search = `netflow_search_rule_20196` \
    | rex field=confidence "(?<confidence_value>\d+)\/(?<confidence_threshold>\d+)" \
    | eval exporter = exp_ip \
    | eval nfo = nfo_hostname \
    | eval timestamp_20196 = _time \
    | append [ | stats count \
        | eval nfc_id = 20196 \
        | eval t_first = 0 \
        | eval t_last = 0 \
        | eval confidence_value = 0 \
        | eval exporter = 0 \
        | eval nfo = 0 \
        | eval timestamp_20196 = 0 ] \
    | map maxsearches=50000 search="search `netflow_search_rule_20198` \
        | where (_time >= $t_first$) AND (_time <= $t_last$) AND (exp_ip == $exporter$) AND (nfo_hostname == $nfo$) \
        | eval conf = $confidence_value$ \
        | eval _time = $timestamp_20196$" \
    | eval total_traffic = 0 \
    | eval priority = 10 \
    | rename conf as confidence \
    | table _time src_ip dest_ip confidence nfo_hostname exp_ip total_traffic priority

[ddos_20196_20200]
is_visible = false
enableSched = 1
cron_schedule = * * * * *
realtime_schedule = 0
dispatch.earliest_time = -10m@m
dispatch.latest_time = now
action.summary_index = 1
action.summary_index._name = summary
action.summary_index.report = ddos_20196_20200
action.summary_index.version = 1
search = `netflow_search_rule_20196` \
    | rex field=confidence "(?<confidence_value>\d+)\/(?<confidence_threshold>\d+)" \
    | eval exporter = exp_ip \
    | eval nfo = nfo_hostname \
    | eval timestamp_20196 = _time \
    | append [ | stats count \
        | eval nfc_id = 20196 \
        | eval t_first = 0 \
        | eval t_last = 0 \
        | eval confidence_value = 0 \
        | eval exporter = 0 \
        | eval nfo = 0 \
        | eval timestamp_20196 = 0] \
    | map maxsearches=50000 search="search `netflow_search_rule_20200` \
        | where (last_seen >= $t_first$) AND (first_seen <= $t_last$) AND (exp_ip == $exporter$) AND (nfo_hostname == $nfo$) \
        | eval conf = $confidence_value$ \
        | eval _time = $timestamp_20196$" \
    | eval total_traffic = 0 \
    | eval priority = 10 \
    | rename conf as confidence \
    | table _time src_ip dest_ip confidence nfo_hostname exp_ip total_traffic priority

[set_default_sampling_lookup]
is_visible = false
enableSched = 1
cron_schedule = 1 1 1 1 1
run_on_startup = true
search = | makeresults \
         | eval nfo_hostname="*" \
         | eval exp_ip="*" \
         | eval flow_smpl_id="*" \
         | eval smpl_int="*" \
         | eval _time="*" \
         | inputlookup sampling_lookup  append=t \
         | dedup nfo_hostname,exp_ip,flow_smpl_id,smpl_int,_time \
         | table nfo_hostname,exp_ip,flow_smpl_id,smpl_int,_time \
         | outputlookup sampling_lookup

[set_default_my_subnets_lookup]
is_visible = false
enableSched = 1
cron_schedule = 1 1 1 1 1
run_on_startup = true
search = | makeresults \
         | eval raw="subnet=\"10.0.0.0/8\",description=\"ClassA\"### \
                     subnet=\"172.16.0.0/12\",description=\"ClassB\" ### \
                     subnet=\"192.168.0.0/16\",description=\"ClassC\" " \
        | makemv delim="###" raw \
        | mvexpand raw \
        | rename raw  as  _raw \
        | extract \
        | table subnet description \
        | inputlookup my_subnets_lookup  append=t \
        | dedup subnet description \
        | outputlookup my_subnets_lookup

[save_interfaces_20003]
is_visible = false
enableSched = 1
run_on_startup = true
cron_schedule = */30 * * * *
dispatch.earliest_time = -32m@m
dispatch.latest_time = -2m@m
search = `netflow_index` (nfc_id=20003 OR nfc_id=20067 OR nfc_id=20267 OR nfc_id=20367 OR nfc_id=20467) \
         | eval SNMPDeviceName=case(nfc_id=20003,sysName,nfc_id=20267,vpc_name,nfc_id=20367,gcp_exp,nfc_id=20467,case(direction=="inbound", dest_vnet_name, direction=="outbound", src_vnet_name)) \
         | eval input_snmp=if(isnull(input_snmp),ifIndex,input_snmp) \
         | eval input_snmp=if(nfc_id==20267,interface_id,input_snmp) \
         | fields exp_ip nfo_hostname input_snmp output_snmp ifIndex SNMPDeviceName ifSpeed ifName ifAlias  \
         | eval ifIndex=mvappend(input_snmp,output_snmp,ifIndex) \
         | mvexpand ifIndex \
         | dedup exp_ip nfo_hostname ifIndex \
         | table exp_ip nfo_hostname ifIndex SNMPDeviceName ifSpeed ifName ifAlias\
         | inputlookup interfaces_20003.csv append=t \
         | stats first(SNMPDeviceName) as SNMPDeviceName first(ifSpeed) as ifSpeed first(ifName) as ifName first(ifAlias) as ifAlias by nfo_hostname exp_ip ifIndex \
         | dedup  exp_ip nfo_hostname ifIndex sortby ifName \
         | outputlookup interfaces_20003_lookup
