# #::HDR:: ;; # App: IA-sentinelone_app_for_splunk ;; # File: props.conf ;; # Updated: 2023-07-03 15:57:16
# ORDER OF OPERATIONS: EXTRACT -> REPORT -> KV_MODE -> FIELDALIAS -> EVAL -> LOOKUP

[groups]
MAX_TIMESTAMP_LOOKAHEAD = 30
TIME_PREFIX             = "_time":
SHOULD_LINEMERGE        = 0
KV_MODE                 = json
EVAL-vendor_product     = "SentinelOne"
TRUNCATE                = 0

[sentinelone:input:sentinelone_core]
EXTRACT-message   = error_message="(?<message>.+?)(?=[\w_]+=)
EVAL-input_source = mvindex(split(sourcetype,":"), -1)

[source::...IA-sentinelone_app_for_splunk/modularinput.log]
priority   = 100
sourcetype = sentinelone:modularinput

[source::...IA-sentinelone_app_for_splunk/sentinelone-modularinput*.log]
priority = 100
sourcetype = sentinelone:modularinput

[source::...IA-sentinelone_app_for_splunk/utilities.log]
sourcetype = sentinelone:utilities
priority   = 100

[source::...IA-sentinelone_app_for_splunk/s1-instantiation-logger.log]
sourcetype = sentinelone:instantiation
priority   = 100

[source::...sentinelone-core-modularinput.log]
sourcetype = sentinelone:input:sentinelone_core
priority   = 100

[source::...IA-sentinelone_app_for_splunk/sentinelone-system-upgrader.log]
sourcetype = sentinelone:upgrade_script
priority   = 100

[source::...IA-sentinelone_app_for_splunk/sentineloneagentaction.log]
sourcetype = sentinelone:cmd:agent_action

[mgmt_sdk.log-too_small]
EXTRACT-rc  = Response Code: (?<response_code>\d+)
EXTRACT-mth = Method:\s*(?<method>\w+)
EXTRACT-url = URL:\s*(?<url_path>[^?\s]+)\??(?<url_query>[^\s]*)

[sentinelone:management_sdk]
EXTRACT-rc        = Response Code: (?<response_code>\d+)
EXTRACT-mth       = Method:\s*(?<method>\w+)
EXTRACT-url       = URL:\s*(?<url_path>[^?\s]+)\??(?<url_query>[^\s]*)
EVAL-url          = coalesce(url, URL)
EXTRACT-log_level = \[MgmtSdk\.?(?<mgmt_sdk>[^\]]+)\]\[[^\]]+\]\s\[(?<log_level>\w+)\]

[source::...mgmt_sdk.log]
sourcetype       = sentinelone:management_sdk
priority         = 100
LINE_BREAKER     = ([\r\n]+)\[MgmtSdk
SHOULD_LINEMERGE = false
TIME_FORMAT      = %Y-%m-%d %H:%M:%S,%3N
TRUNCATE         = 0
EXTRACT-rc       = Response Code: (?<response_code>\d+)
EXTRACT-mth      = Method:\s*(?<method>\w+)
EXTRACT-url      = URL:\s*(?<url_path>[^?\s]+)\??(?<url_query>[^\s]*)

[sentinelone:channel:groups]
SHOULD_LINEMERGE                     = false
TRUNCATE                             = 0
LINE_BREAKER                         = ([\r\n]+)
MAX_TIMESTAMP_LOOKAHEAD              = 40
TIME_PREFIX                          = "timestamp"
TIME_FORMAT                          = %Y-%m-%d %H:%M:%S.%6NZ
KV_MODE                              = JSON
LOOKUP-sentinelone_lookup_definition = sentinelone_lookup siteId OUTPUTNEW siteName
EVAL-vendor_product                  = "SentinelOne"

[sentinelone:channel:threats]
# Reviewed for CIM 5.1 Feb 9, 2023
SHOULD_LINEMERGE                = false
TRUNCATE                        = 0
LINE_BREAKER                    = ([\r\n]+)
MAX_TIMESTAMP_LOOKAHEAD         = 40
TIME_PREFIX                     = "timestamp"
TIME_FORMAT                     = %Y-%m-%d %H:%M:%S.%6NZ
KV_MODE                         = JSON
EVAL-action                     = case('threatInfo.mitigationStatus'=="mitigated", "blocked", 'threatInfo.mitigationStatus'=="blocked", "blocked", 'threatInfo.incidentStatus'=="resolved", "allowed", true(), "deferred")
EVAL-app                        = "SentinelOne-". case('threatInfo.classificationSource'=="Engine","Agent", 'threatInfo.classificationSource' == "null" , "Agent" , true(), replace('threatInfo.classificationSource'," ","-") )
EVAL-body                       = json_object("threat_id", mvindex(id,0), "Mitigation Status", mvindex('threatInfo.mitigationStatus', 0), "Incident Status", mvindex('threatInfo.incidentStatus', 0), "Latest Mitigation Status", mvindex(mvjoin(mvindex(split(mvindex(mvzip('mitigationStatus{}.lastUpdate', mvzip('mitigationStatus{}.action', 'mitigationStatus{}.status', ":::"), ":::"), 0), ":::"),1,2)," "), 0))
EVAL-description                = 'threatInfo.mitigationStatusDescription' .", ".'threatInfo.incidentStatusDescription'. ", ". 'threatInfo.analystVerdictDescription'
EVAL-file_hash                  = if(isnull(fileSha256), fileSha1, fileSha256)
EVAL-date                       = strftime(strptime(updatedAt, "%Y-%m-%dT%H:%M:%S.%3NZ"), "%m-%d-%Y")
EVAL-workflow_url               = host."/analyze/threats/".id."/overview"
EVAL-vendor_product             = "SentinelOne"
FIELDALIAS-cats                 = threatInfo.classification AS category
FIELDALIAS-src                  = threatInfo.classificationSource AS src
FIELDALIAS-type                 = threatInfo.detectionType AS type
FIELDALIAS-version              = agentRealtimeInfo.agentVersion AS version
FIELDALIAS-product_version      = agentRealtimeInfo.agentVersion AS product_version
EVAL-severity                   = case('threatInfo.confidenceLevel' == "malicious", "critical", 'threatInfo.confidenceLevel'=="suspicious", "medium", true(), "low")
FIELDALIAS-file                 = threatInfo.threatName AS file_name
FIELDALIAS-user                 = threatInfo.processUser AS user threatInfo.processUser AS user_name
FIELDALIAS_threatinfo_storyline = threatInfo.storyline AS storyline
FIELDALIAS-agents               = agentRealtimeInfo.agentComputerName AS dest agentRealtimeInfo.agentDomain AS dest_nt_domain
FIELDALIAS-files                = threatInfo.filePath AS file_path
FIELDALIAS-sig                  = threatInfo.sha1 as signature_id threatInfo.threatName AS signature
FIELDALIAS-engine               = threatInfo.detectionEngines{}.title AS engine
EVAL-siteName                   = coalesce(siteName, 'agentRealtimeInfo.siteName')
LOOKUP-sites                    = sentinelone_lookup_max_1 siteName OUTPUTNEW siteId AS siteIdNEW host AS management

[sentinelone:channel:applications:cve]
SHOULD_LINEMERGE        = false
TRUNCATE                = 0
LINE_BREAKER            = ([\r\n]+)
MAX_TIMESTAMP_LOOKAHEAD = 40
TIME_PREFIX             = "timestamp"
TIME_FORMAT             = %Y-%m-%d %H:%M:%S.%6NZ
KV_MODE                 = JSON
FIELDALIAS-cve          = cveId AS cve
FIELDALIAS-severity     = riskLevel AS severity
FIELDALIAS-signature    = cveId as signature
FIELDALIAS-score        = score AS cvss
FIELDALIAS-xref         = link AS xref
FIELDALIAS-dest         = endpointId AS dest
EVAL-vendor_product     = "SentinelOne"

[sentinelone:channel:application_management:risks]
SHOULD_LINEMERGE        = false
KV_MODE                 = JSON
TRUNCATE                = 0
LINE_BREAKER            = ([\r\n]+)
MAX_TIMESTAMP_LOOKAHEAD = 40
TIME_PREFIX             = "timestamp"
TIME_FORMAT             = %Y-%m-%d %H:%M:%S.%6NZ
FIELDALIAS-cve          = cveId AS cve
FIELDALIAS-score        = riskScore AS cvss
FIELDALIAS-dest         = endpointId AS dest
FIELDALIAS-signature    = cveId as signature
FIELDALIAS-sev          = severity AS s1_severity
EVAL-severity           = lower(s1_severity)
EVAL-vendor_product     = "SentinelOne"

[sentinelone:channel:threats:event]
SHOULD_LINEMERGE           = false
TRUNCATE                   = 0
LINE_BREAKER               = ([\r\n]+)
MAX_TIMESTAMP_LOOKAHEAD    = 40
TIME_PREFIX                = "timestamp"
TIME_FORMAT                = %Y-%m-%d %H:%M:%S.%6NZ
KV_MODE                    = JSON
EVAL-action                = case('threatInfo.mitigationStatus'=="mitigated", "blocked", 'threatInfo.mitigationStatus'=="blocked", "blocked", 'threatInfo.incidentStatus'=="resolved", "allowed", true(), "deferred")
EVAL-app                   = "SentinelOne ". case('threatInfo.classificationSource'=="Engine","Agent", 'threatInfo.classificationSource' == "null" , "Agent" , true(), 'threatInfo.classificationSource' )
#EVAL-body                 = "SentinelOne Threat ".'threatInfo.threatId'." Mitigated:". 'threatInfo.mitigationStatus'." Status:".action.if(resolved == "true", " Resolved ", " Unresolved ").description." is ".if('mitigationReport.kill.status' == "success", " Kill " , " ").if('mitigationReport.quarantine.status' == "success", " Quarantine", " ").if('mitigationReport.remediate.status' == "success" ," Remediate" ," ").if('mitigationReport.rollback.status' == "success" ," Rollback ", " ").if('mitigationReport.network_quarantine.status' == "success" ,"Network Disconnected", " ")
EVAL-body                  = json_object("threat_id", mvindex(id,0), "Mitigation Status", mvindex('threatInfo.mitigationStatus', 0), "Incident Status", mvindex('threatInfo.incidentStatus', 0), "Latest Mitigation Status", mvindex(mvjoin(mvindex(split(mvindex(mvzip('mitigationStatus{}.lastUpdate', mvzip('mitigationStatus{}.action', 'mitigationStatus{}.status', ":::"), ":::"), 0), ":::"),1,2)," "), 0))
EVAL-description           = 'threatInfo.mitigationStatusDescription' .", ".'threatInfo.incidentStatusDescription'. ", ". 'threatInfo.analystVerdictDescription'
FIELDALIAS-cats            = threatInfo.classification AS category
EVAL-date                  = updatedAt
EVAL-vendor_product        = "SentinelOne"
FIELDALIAS-version         = agentRealtimeInfo.agentVersion AS version
FIELDALIAS-product_version = agentRealtimeInfo.agentVersion AS product_version
# EVAL-file_name           = mvindex(split(mvindex(split('threatInfo.filePath', "/"), -1), "\\"), -1)
FIELDALIAS-file            = threatInfo.threatName AS file_name
FIELDALIAS-user            = threatInfo.processUser AS user
FIELDALIAS-agents          = agentRealtimeInfo.agentComputerName AS dest agentRealtimeInfo.agentDomain AS dest_nt_domain
EVAL-siteName              = coalesce(siteName, 'agentRealtimeInfo.siteName')
#LOOKUP-sites              = sentinelone_lookup_max_1 siteName OUTPUTNEW siteId host AS management
FIELDALIAS-files           = threatInfo.filePath AS file_path
FIELDALIAS-sig             = indicators{}.ids{} as signature_id indicators{}.description AS signature

[sentinelone:channel:activities]
# Reviewed for CIM 5.1 Feb 9, 2023
# Updated "src_user", "user", and "dest"
# Index Time
SHOULD_LINEMERGE        = false
TRUNCATE                = 0
LINE_BREAKER            = ([\r\n]+)
MAX_TIMESTAMP_LOOKAHEAD = 40
TIME_PREFIX             = "timestamp"
TIME_FORMAT             = %Y-%m-%d %H:%M:%S.%6NZ
# Search Time
KV_MODE                 = JSON
EXTRACT-tmp_username    = username\":\s+\"(?P<tmp_username>[^\"]+)
EXTRACT-tmp_byuser      = byUser\":\s+\"(?P<tmp_byuser>[^\"]+)
EVAL-app                = "SentinelOne"
EVAL-vendor             = "SentinelOne"
EVAL-domain             = src_nt_domain
EVAL-dvc                = if(isnull(data.computerName), host, data.computerName)
EVAL-file_hash          = data.fileContentHash
EVAL-file_name          = data.fileDisplayName
EVAL-file_path          = data.filePath
EVAL-object             = if(primaryDescription == "null", "SentinelOne Activity", primaryDescription)
# EVAL-object_attrs     = untable name key value
EVAL-object_category    = activityType
EVAL-object_id          = id
EVAL-object_path        = if( secondaryDescription == "null","",  secondaryDescription)
EVAL-src_host           = if(isnull(data.computerName)," ", data.computerName)
EVAL-src_name           = siteName.data.computerName
EVAL-src_user           = case(isnotnull('data.username'), 'data.username', true(), "sentinelone")
EVAL-user               = case(isnotnull('data.username'), 'data.username', true(), "sentinelone")
EVAL-dest               = case(isnotnull(dest), dest, in(activityType,27,33,133), 'data.siteName', true(), 'data.siteName')
EVAL-status             = if(match(primaryDescription,"(?i)\s(fail|failed|failure|error|err|unauthorized)\s") ,"failure" ,"success")
EVAL-vendor_product     = "SentinelOne Management"
FIELDALIAS-description  = primaryDescription AS reason activityType AS signature_id
FIELDALIAS-users        = userId as user_id data.role AS user_role data.byUser AS src_user
FIELDALIAS-src          = data.ipAddress as src
LOOKUP-activityTypes    = sentinelone_activity_types id AS activityType OUTPUT activity_action AS signature action change_type template AS activity_message_template

[sentinelone:channel:agents]
# Reviewed for CIM 5.1 Feb 9, 2023
SHOULD_LINEMERGE                     = false
KV_MODE                              = JSON
TRUNCATE                             = 0
LINE_BREAKER                         = ([\r\n]+)
MAX_TIMESTAMP_LOOKAHEAD              = 40
TIME_PREFIX                          = "timestamp"
TIME_FORMAT                          = %Y-%m-%d %H:%M:%S.%6NZ
LOOKUP-sentinelone_lookup_definition = sentinelone_lookup siteId OUTPUTNEW siteName AS agentSiteName
EVAL-agentSiteName                   = coalesce(agentSiteName, siteName)
EVAL-cpu_cores                       = coreCount
EVAL-cpu_count                       = cpuCount
EVAL-description                     = "SentinelOne Agent (".if(osType == "macos","macOS" ,upper(substr(osType,1,1)).substr(osType,2) ).")"
EVAL-dest                            = computerName
EVAL-dest_host                       = computerName
EVAL-dest_name                       = if( isnull(siteName), computerName, siteName.".".computerName)
EVAL-dest_nt_domain                  = domain
EVAL-dest_user                       = lastLoggedInUserName
EVAL-dns                             = computerName.".".domain
EVAL-enabled                         = if(isActive == "true", "true", "false")
EVAL-family                          = osArch
EVAL-ip                              = 'networkInterfaces{}.inet{}'
EVAL-lastActive                      = lastActiveDate
EVAL-mac                             = 'networkInterfaces{}.physical'
EVAL-mem                             = totalMemory
EVAL-object_path                     = "https://".host.".".s1domain."/network/overview?filter=%7B%22query%22:%22".computerName."2%22%7D"
EVAL-os                              = osName." ".osRevision
EVAL-src_host                        = computerName
EVAL-src_ip                          = externalIp
EVAL-src_name                        = if( isnull(siteName), computerName, siteName.".".computerName)
EVAL-src_nt_domain                   = domain
EVAL-src_user                        = lastLoggedInUserName
EVAL-status                          = networkStatus.":".if(infected=="true","Infected","Healthy")
EVAL-time                            = updatedAt
EVAL-user                            = lastLoggedInUserName
EVAL-vendor                          = "SentinelOne"
EVAL-action                          = "read"
EVAL-app                             = "SentinelOne"
EVAL-vendor_product                  = "SentinelOne Agent (".osType." ".agentVersion.")"
EVAL-version                         = agentVersion
FIELDALIAS-aob_gen_agents_alias_1    = computerName AS dest
FIELDALIAS-aob_gen_agents_alias_2    = osArch AS family
FIELDALIAS-aob_gen_agents_alias_3    = uuid AS serial
FIELDALIAS-aob_gen_agents_alias_4    = agentVersion AS version
FIELDALIAS-aob_gen_agents_alias_49   = 'updated' AS action
FIELDALIAS-aob_gen_agents_alias_5    = cpuCount AS cpu_count
FIELDALIAS-aob_gen_agents_alias_50   = 'Endpoint' AS change_type
FIELDALIAS-aob_gen_agents_alias_51   = "SentinelOne Agent" AS object
FIELDALIAS-aob_gen_agents_alias_52   = uuid AS object_id
FIELDALIAS-aob_gen_agents_alias_6    = coreCount AS cpu_cores
FIELDALIAS-aob_gen_agents_alias_7    = totalMemory AS mem
FIELDALIAS-aob_gen_agents_alias_8    = lastLoggedInUserName AS user
FIELDALIAS-aob_gen_agents_alias_9    = updatedAt AS time

[sentinelone:channel:applications]
SHOULD_LINEMERGE        = false
TRUNCATE                = 0
LINE_BREAKER            = ([\r\n]+)
MAX_TIMESTAMP_LOOKAHEAD = 40
TIME_PREFIX             = "timestamp"
KV_MODE                 = JSON
TIME_FORMAT             = %Y-%m-%d %H:%M:%S.%6NZ
EVAL-vendor_product     = "SentinelOne"
FIELDALIAS-os           = osType AS os
FIELDALIAS-src          = agentComputerName AS src
FIELDALIAS-cve          = cves{}.cveId as cve
FIELDALIAS-dest         = agentId AS dest
FIELDALIAS-severity     = cves{}.riskLevel AS severity
FIELDALIAS-signature    = cves{}.cveId as signature
FIELDALIAS-score        = cves{}.score AS cvss
FIELDALIAS-xref         = cves{}.link AS xref

[sentinelone:debug:script:sensitive]
DATETIME_CONFIG = NONE
LINE_BREAKER    = ([\r\n]+)
NO_BINARY_CHECK = true
category        = Custom
pulldown_type   = true
TRUNCATE        = 10000

[source::...debug_s1_threats_*.log]
sourcetype = sentinelone:debug:script:sensitive

[source::...sentinelone_alert_action_st]
EVAL-vendor_product     = "SentinelOne"
EVAL-vendor             = "SentinelOne"
HEADER_MODE             = firstline
LEARN_MODEL             = false
SHOULD_LINEMERGE        = false
BREAK_ONLY_BEFORE_DATE  = false
LINE_BREAKER            = (\r?\n==##~~##~~  1E8N3D4E6V5E7N2T9 ~~##~~##==\r?\n)
SEDCMD-removeCAM        = s/^\*\*\*Common Action Model\*\*\*[^\r\n]+[\r\n]+(.*)/\1/g
TIME_PREFIX             = device_timestamp":
MAX_TIMESTAMP_LOOKAHEAD = 50
TIME_FORMAT             = %Y-%m-%dT%H:%M:%S.%3NZ

[sentinelone:alert_action:sentinelone-network-control]
EVAL-vendor_product     = "SentinelOne"
EVAL-vendor             = "SentinelOne"
HEADER_MODE             = firstline
LEARN_MODEL             = false
SHOULD_LINEMERGE        = false
BREAK_ONLY_BEFORE_DATE  = false
LINE_BREAKER            = (\r?\n==##~~##~~  1E8N3D4E6V5E7N2T9 ~~##~~##==\r?\n\*\*\*Common Action Model\*\*\*[^\r\n]+[\r\n]+)
SEDCMD-removeCAM        = s/^\*\*\*Common Action Model\*\*\*[^\r\n]+[\r\n]+(.*)/\1/g
TIME_PREFIX             = device_timestamp":
MAX_TIMESTAMP_LOOKAHEAD = 50
TIME_FORMAT             = %Y-%m-%dT%H:%M:%S.%3NZ
TZ                      = UTC
TRUNCATE                = 0
EXTRACT-message         = error_message="(?<message>.+?)(?=[\w_]+=)
EVAL-alert_action       = mvindex(split(sourcetype,":"), -1)

[sentinelone:alert_action:sentinelone-threat-control]
EVAL-vendor_product     = "SentinelOne"
EVAL-vendor             = "SentinelOne"
HEADER_MODE             = firstline
LEARN_MODEL             = false
SHOULD_LINEMERGE        = false
BREAK_ONLY_BEFORE_DATE  = false
LINE_BREAKER            = (\r?\n==##~~##~~  1E8N3D4E6V5E7N2T9 ~~##~~##==\r?\n\*\*\*Common Action Model\*\*\*[^\r\n]+[\r\n]+)
SEDCMD-removeCAM        = s/^\*\*\*Common Action Model\*\*\*[^\r\n]+[\r\n]+(.*)/\1/g
TIME_PREFIX             = device_timestamp":
MAX_TIMESTAMP_LOOKAHEAD = 50
TIME_FORMAT             = %Y-%m-%dT%H:%M:%S.%3NZ
TZ                      = UTC
TRUNCATE                = 0
EXTRACT-message         = error_message="(?<message>.+?)(?=[\w_]+=)
EVAL-alert_action       = mvindex(split(sourcetype,":"), -1)

[source::...IA-sentinelone_app_for_splunk/sentinelone-network-control.log]
sourcetype = sentinelone:action:network-control
priority   = 100

[source::...IA-sentinelone_app_for_splunk/sentinelone-threat-control.log]
sourcetype = sentinelone:action:threat-control
priority   = 100
### Below here are older sourcetypes for the SentinelOne data. These can be deleted if this is a fresh install

[agents]
KV_MODE                            = json
TIME_PREFIX                        = "_time":
MAX_TIMESTAMP_LOOKAHEAD            = 30
EVAL-cpu_cores                     = coreCount
EVAL-cpu_count                     = cpuCount
EVAL-description                   = "SentinelOne Agent (".if(osType == "macos","macOS" ,upper(substr(osType,1,1)).substr(osType,2) ).")"
EVAL-dest                          = computerName
EVAL-dest_host                     = computerName
EVAL-dest_name                     = if( isnull(siteName), computerName, siteName.".".computerName)
EVAL-dest_nt_domain                = domain
EVAL-dest_user                     = lastLoggedInUserName
EVAL-dns                           = computerName.".".domain
EVAL-enabled                       = if(isActive == "true", "true", "false")
EVAL-family                        = osArch
EVAL-ip                            = 'networkInterfaces{}.inet{}'
EVAL-lastActive                    = lastActiveDate
EVAL-mac                           = 'networkInterfaces{}.physical'
EVAL-mem                           = totalMemory
EVAL-object_path                   = "https://".host.".".s1domain."/network/overview?filter=%7B%22query%22:%22".computerName."2%22%7D"
EVAL-os                            = osName." ".osRevision
EVAL-src_host                      = computerName
EVAL-src_ip                        = externalIp
EVAL-src_name                      = if( isnull(siteName), computerName, siteName.".".computerName)
EVAL-src_nt_domain                 = domain
EVAL-src_user                      = lastLoggedInUserName
EVAL-status                        = networkStatus.":".if(infected=="true","Infected","Healthy")
EVAL-time                          = updatedAt
EVAL-user                          = lastLoggedInUserName
EVAL-vendor_product                = "SentinelOne Agent (".osType." ".agentVersion.")"
EVAL-version                       = agentVersion
FIELDALIAS-aob_gen_agents_alias_1  = computerName AS dest
FIELDALIAS-aob_gen_agents_alias_2  = osArch AS family
FIELDALIAS-aob_gen_agents_alias_3  = uuid AS serial
FIELDALIAS-aob_gen_agents_alias_4  = agentVersion AS version
FIELDALIAS-aob_gen_agents_alias_49 = 'updated' AS action
FIELDALIAS-aob_gen_agents_alias_5  = cpuCount AS cpu_count
FIELDALIAS-aob_gen_agents_alias_50 = 'Endpoint' AS change_type
FIELDALIAS-aob_gen_agents_alias_51 = "SentinelOne Agent" AS object
FIELDALIAS-aob_gen_agents_alias_52 = uuid AS object_id
FIELDALIAS-aob_gen_agents_alias_6  = coreCount AS cpu_cores
FIELDALIAS-aob_gen_agents_alias_7  = totalMemory AS mem
FIELDALIAS-aob_gen_agents_alias_8  = lastLoggedInUserName AS user
FIELDALIAS-aob_gen_agents_alias_9  = updatedAt AS time
SHOULD_LINEMERGE                   = 0
TRUNCATE                           = 0

[activities]
KV_MODE                 = json
TIME_PREFIX             = "_time":
MAX_TIMESTAMP_LOOKAHEAD = 30
EVAL-action             = "updated"
EVAL-change_type        = "audit"
EVAL-command            = primaryDescription
EVAL-domain             = src_nt_domain
EVAL-dvc                = if(isnull(data.computerName), host, data.computerName)
EVAL-file_hash          = data.fileContentHash
EVAL-file_name          = data.fileDisplayName
EVAL-file_path          = data.filePath
EVAL-object             = if(primaryDescription == "null", "SentinelOne Activity", primaryDescription)
EVAL-object_category    = activityType
EVAL-object_id          = id
EVAL-object_path        = if( secondaryDescription == "null","",  secondaryDescription)
EVAL-src_host           = if(isnull(data.computerName)," ", data.computerName)
EVAL-src_name           = siteName.data.computerName
EVAL-src_user           = if(isnull(data.username), "sentinelone", data.username)
EVAL-status             = if(match(primaryDescription,"(?i)\s(fail|failed|failure|error|err|unauthorized)\s") ,"failure" ,"success")
EVAL-user               = if(isnull(data.username),  "sentinelone" , data.username)
EVAL-vendor_product     = "SentinelOne Management ".data.buildVersion
SHOULD_LINEMERGE        = 0
TRUNCATE                = 0

[threats]
KV_MODE                             = json
TIME_PREFIX                         = "_time":
MAX_TIMESTAMP_LOOKAHEAD             = 30
EVAL-action                         = case(mitigationStatus=="mitigated", "blocked", mitigationStatus=="blocked", "blocked", resolved=="true", "allowed", true(), "deferred")
EVAL-app                            = "SentinelOne ".if(classificationSource == "Engine" OR classificationSource == "null" , "Agent" ,classificationSource )
EVAL-body                           = "SentinelOne Threat ".id." Mitigated:".mitigationStatus." Status:".action.if(resolved == "true", " Resolved ", " Unresolved ").description." is ".if('mitigationReport.kill.status' == "success", " Kill " , " ").if('mitigationReport.quarantine.status' == "success", " Quarantine", " ").if('mitigationReport.remediate.status' == "success" ," Remediate" ," ").if('mitigationReport.rollback.status' == "success" ," Rollback ", " ").if('mitigationReport.network_quarantine.status' == "success" ,"Network Disconnected", " ")
EVAL-category                       = classification
EVAL-date                           = updatedAt
EVAL-dest                           = agentComputerName
EVAL-dest_host                      = agentComputerName
EVAL-dest_nt_domain                 = agentDomain
EVAL-file_hash                      = fileContentHash
EVAL-file_name                      = fileDisplayName
EVAL-mitigationStatus               = case( isnull(mitigation_status), mitigationStatus ,mitigation_status==0, "mitigated", mitigation_status==1, "active", mitigation_status==2, "blocked", mitigation_status==3, "suspicious", mitigation_status==4, "pending")
EVAL-product_version                = agentOsType.agentVersion
EVAL-severity                       = if(action != "blocked" AND mitigationStatus != "mitigated" AND resolved != "true", "critical" ,if( mitigationStatus == "active" AND resolved != "true", "high",  if (mitigationStatus == "suspicious" OR mitigationStatus == "blocked", "medium", if (resolved=="true" ,"informational", "low"))))
EVAL-severity_id                    = if(action != "blocked" AND mitigationStatus != "mitigated" AND resolved != "true", 10 ,if( mitigationStatus == "active" AND resolved != "true", 7,  if (mitigationStatus == "suspicious" OR mitigationStatus == "blocked", 5, if (resolved=="true" ,1, 3))))
EVAL-signature                      = if( threatName == "null" and classification != "null", classification ,if( threatName != "null" and classification == "null", threatName, if(threatName != "null" and classification != "null", classification.".".threatName, " ")))
EVAL-signature_version              = agentVersion
EVAL-src                            = agentComputerName
EVAL-src_host                       = agentComputerName
EVAL-src_name                       = if( isnull(siteName), computerName, siteName.".".computerName)
EVAL-src_nt_domain                  = domain
EVAL-src_user                       = lastLoggedInUserName
EVAL-subject                        = description
EVAL-time                           = updatedAt
EVAL-url                            = "https://".host.".".s1domain."/analyze/threats/".id."/overview"
EVAL-vendor_product                 = "SentinelOne"
FIELDALIAS-aob_gen_threats_alias_1  = classifierName AS category
FIELDALIAS-aob_gen_threats_alias_10 = agentIp AS dest_ip
FIELDALIAS-aob_gen_threats_alias_11 = updatedAt AS time
FIELDALIAS-aob_gen_threats_alias_2  = fileContentHash AS file_hash
FIELDALIAS-aob_gen_threats_alias_22 = username AS sender
FIELDALIAS-aob_gen_threats_alias_26 = 'Threat/Mitigation' AS change_type
FIELDALIAS-aob_gen_threats_alias_27 = 'SentinelOne' AS object
FIELDALIAS-aob_gen_threats_alias_28 = uuid AS object_id
FIELDALIAS-aob_gen_threats_alias_3  = filePath AS file_path
FIELDALIAS-aob_gen_threats_alias_4  = fileDisplayName AS file_name
FIELDALIAS-aob_gen_threats_alias_5  = username AS user
FIELDALIAS-aob_gen_threats_alias_6  = agentComputerName AS dest
FIELDALIAS-aob_gen_threats_alias_7  = agentDomain AS dest_nt_domain
FIELDALIAS-aob_gen_threats_alias_8  = updatedAt AS date
FIELDALIAS-aob_gen_threats_alias_9  = computerName AS dest_host
SHOULD_LINEMERGE                    = 0
TRUNCATE                            = 0