[Endpoint - Malicious PowerShell Encoded Commands - Rule]
action.correlationsearch.enabled = 1
action.correlationsearch.label = Malicious PowerShell Encoded Commands
action.customsearchbuilder.enabled = false
action.customsearchbuilder.spec = {}
action.notable = 1
action.notable.param.drilldown_name = Show All Processes on $dest$
action.notable.param.drilldown_search = | from datamodel Endpoint.Processes | search dest=$dest$
action.notable.param.rule_description = The system $dest$ executed a PowerShell process that has an encoded command on the command-line
action.notable.param.rule_title = PowerShell process with an encoded command detected on $dest$
action.notable.param.security_domain = endpoint
action.notable.param.severity = high
action.notable.param.verbose = 0
alert.suppress = 1
alert.suppress.fields = dest,process
alert.suppress.period = 86400s
alert.track = 1
counttype = number of events
cron_schedule = */60 * * * *
description = This search looks for PowerShell processes that have encoded the script within the command-line. Malware has been seen using this parameter, as it obfuscates the code and makes it relatively easy to pass a script on the command-line. This search uses the Malicious PowerShell Process - Encoded Command from ESCU PowerShell Analytic Story as a starting point and adapts it to provide further detection and visibility.  It requires the Decrypt app https://splunkbase.splunk.com/app/2655/ to view base64 encoded outputs.
dispatch.earliest_time = -65m@m
dispatch.latest_time = -5m@m
dispatch.rt_backfill = 1
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = SplunkEnterpriseSecuritySuite
search = | tstats summariesonly=true count min(_time) AS firstTime max(_time) AS lastTime values(Processes.parent_process) AS parent_process values(Processes.parent_process_exec) AS parent_process_exec values(Processes.process_current_directory) AS process_current_directory values(Processes.process_exec) AS process_exec values(Processes.process_path) AS process_path values(Processes.vendor_product) AS vendor_product from datamodel=Endpoint.Processes where Processes.process_exec=*powershell* Processes.process IN (*-EC*,*-EncodedCommand*,*-EncodedComman*,*-EncodedComma*,*-EncodedComm*,*-EncodedCom*,*-EncodedCo*,*-EncodedC*,*-Encoded*,*-Encode*,*-Encod*,*-Enco*,*-Enc*,*-En*,*-E*) by Processes.dest Processes.user Processes.process_name Processes.process  \
| `ctime(firstTime)` | `ctime(lastTime)`\
| `drop_dm_object_name(Processes)`\
| rex field=process "\-(?i)e(!p|c|ncodedcommand|ncodedcomman|ncodedcomma|ncodedcomm|ncodedcom|ncodedco|ncodedc|ncoded|ncode|ncod|nco|nc|n|\s)\s*(?<process_encoded>\S*)" \
| rex field=parent_process "\-(?i)e(!p|c|ncodedcommand|ncodedcomman|ncodedcomma|ncodedcomm|ncodedcom|ncodedco|ncodedc|ncoded|ncode|ncod|nco|nc|n|\s)\s*(?<parent_encoded>\S*)"\
| decrypt f=process_encoded atob emit('process_decoded') | decrypt f=parent_encoded atob emit('parent_decoded')\
| rename process_decoded AS process | rename parent_decoded AS parent_process | fields - process_encoded parent_encoded | eval techID="T1086" | lookup mitreattack ID as techID OUTPUT Tactic Technique Description

[Endpoint - Execution of a renamed psexec.exe to avoid detection - Rule]
action.correlationsearch.enabled = 1
action.correlationsearch.label = Execution of a renamed psexec.exe to avoid detection
action.customsearchbuilder.enabled = false
action.customsearchbuilder.spec = {}
action.notable = 1
action.notable.param.drilldown_name = View process creation events in Microsoft Sysmon on $dest$
action.notable.param.drilldown_search = sourcetype=xmlwineventlog:microsoft-windows-sysmon/operational EventCode=1 dest=$dest$
action.notable.param.rule_description = A renamed version of psexec.exe, called $process_name$, was executed by $user$ on $dest$. This technique is often used by attackers or malware.
action.notable.param.rule_title = A renamed version of psexec.exe was executed on $dest$ by $user$
action.notable.param.security_domain = endpoint
action.notable.param.severity = high
action.notable.param.verbose = 0
alert.suppress = 1
alert.suppress.fields = dest
alert.suppress.period = 86400s
alert.track = 1
counttype = number of events
cron_schedule = */60 * * * *
description = psexe.exe may be renamed to hide use of the executable in a malicious manner. Based on Sigma detection: https://github.com/Neo23x0/sigma/blob/master/rules/windows/sysmon/sysmon_renamed_psexec.yml\

dispatch.earliest_time = -65m@m
dispatch.latest_time = -5m@m
dispatch.rt_backfill = 1
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = SplunkEnterpriseSecuritySuite
search = sourcetype=xmlwineventlog:microsoft-windows-sysmon/operational Product="Sysinternals PsExec" Description="Execute processes remotely" NOT (Image="*\PsExec.exe" OR Image="*\PsExec64.exe")\
| table dest parent_process parent_process_exec parent_process_id parent_process_guid parent_process_name parent_process_path process process_current_directory process_exec process_hash process_guid process_id process_integrity_level process_name process_path user vendor_product | eval techID="T1036" | lookup mitreattack ID as techID OUTPUT Tactic Technique Description

[Endpoint - Indicator of mimikatz Activity using Microsoft Sysmon - Rule]
action.correlationsearch.enabled = 1
action.correlationsearch.label = Indicator of mimikatz Activity using Microsoft Sysmon
action.customsearchbuilder.enabled = false
action.customsearchbuilder.spec = {}
action.notable = 1
action.notable.param.drilldown_name = View Microsoft Sysmon Events on $dvc$
action.notable.param.drilldown_search = sourcetype="xmlwineventlog:microsoft-windows-sysmon/operational" dvc="$dvc$"
action.notable.param.rule_description = Microsoft Sysmon logged activity consistent with mimikatz activity on $dvc$. Investigate to determine if other indicators exist to confirm this.
action.notable.param.rule_title = Indicator of mimikatz Activity on $dvc$
action.notable.param.security_domain = endpoint
action.notable.param.severity = high
action.notable.param.verbose = 0
alert.suppress = 1
alert.suppress.fields = dvc
alert.suppress.period = 86400s
alert.track = 1
counttype = number of events
cron_schedule = */60 * * * *
description = This detection is inspired by work from the following blog post: https://www.eideon.com/2017-09-09-THL01-Mimikatz/
dispatch.earliest_time = -65m@m
dispatch.latest_time = -5m@m
dispatch.rt_backfill = 1
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = SplunkEnterpriseSecuritySuite
search = sourcetype="xmlwineventlog:microsoft-windows-sysmon/operational" EventCode=10 TargetImage="*lsass.exe" GrantedAccess=0x1010 | rename CallTrace AS command | rename TargetImage AS ResourceId  | table _time signature process_name SourceImage dvc vendor_product  ResourceId command | eval techID="T1003" | lookup mitreattack ID as techID OUTPUT Tactic Technique Description

[Endpoint - Mimikatz Detection LSASS Access - Rule]
action.correlationsearch.enabled = 1
action.correlationsearch.label = Mimikatz Detection LSASS Access
action.customsearchbuilder.enabled = false
action.customsearchbuilder.spec = {}
action.notable = 1
action.notable.param.drilldown_name = View additional Microsoft Sysmon events on $dvc$
action.notable.param.drilldown_search = sourcetype=xmlwineventlog:microsoft-windows-sysmon/operational dvc=$dvc$
action.notable.param.rule_description = Detects process access to LSASS on $dvc$ by $process_exec$ which is typical for Mimikatz.
action.notable.param.rule_title = Mimikatz Detection LSASS Access on $dvc$
action.notable.param.security_domain = endpoint
action.notable.param.severity = high
action.notable.param.verbose = 0
alert.suppress = 1
alert.suppress.fields = dvc
alert.suppress.period = 86400s
alert.track = 1
counttype = number of events
cron_schedule = */60 * * * *
description = Detects process access to LSASS which is typical for Mimikatz.\
Based on Sigm detection: https://github.com/Neo23x0/sigma/blob/master/rules/windows/sysmon/sysmon_mimikatz_detection_lsass.yml
dispatch.earliest_time = -65m@m
dispatch.latest_time = -5m@m
dispatch.rt_backfill = 1
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = SplunkEnterpriseSecuritySuite
search = sourcetype=xmlwineventlog:microsoft-windows-sysmon/operational EventID=10 TargetImage="C:\\Windows\\system32\\lsass.exe" (GrantedAccess=0x1410 OR GrantedAccess=0x1010) | table dvc process_exec SourceImage EventDescription vendor_product | eval techID="T1003" | lookup mitreattack ID as techID OUTPUT Tactic Technique Description

[Endpoint - Scheduled Task Creation - Rule]
action.correlationsearch.enabled = 1
action.correlationsearch.label = Scheduled Task Creation
action.customsearchbuilder.enabled = false
action.customsearchbuilder.spec = {}
action.notable = 1
action.notable.param.drilldown_name = View all processes by $user$ on $dest$
action.notable.param.drilldown_search = | from datamodel Endpoint.Processes | search dest=$dest$ user=$user$
action.notable.param.rule_description = A scheduled task was created on $dest$ by $user$.
action.notable.param.rule_title = Scheduled Task Creation - $dest$
action.notable.param.security_domain = endpoint
action.notable.param.severity = medium
action.notable.param.verbose = 0
alert.suppress = 1
alert.suppress.fields = dest
alert.suppress.period = 86400s
alert.track = 1
counttype = number of events
cron_schedule = */60 * * * *
description = Detect when scheduled tasks are created by users other than System. Based on Sigma Detection: https://github.com/Neo23x0/sigma/blob/master/rules/windows/process_creation/win_susp_schtask_creation.yml
dispatch.earliest_time = -65m@m
dispatch.latest_time = -5m@m
dispatch.rt_backfill = 1
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = SplunkEnterpriseSecuritySuite
search = | tstats summariesonly=true count from datamodel=Endpoint.Processes where Processes.process_path="*\schtasks.exe" \
Processes.process="* /create *" Processes.user!=*system*\
by Processes.dest Processes.parent_process Processes.parent_process_exec Processes.parent_process_id Processes.parent_process_guid \
Processes.parent_process_name Processes.parent_process_path Processes.process Processes.process_current_directory Processes.process_exec \
Processes.process_hash Processes.process_guid Processes.process_id Processes.process_integrity_level Processes.process_name \
Processes.process_path Processes.user Processes.vendor_product\
| `drop_dm_object_name("Processes")` | eval techID="T1053" | lookup mitreattack ID as techID OUTPUT Tactic Technique Description

[Endpoint - ntdsutil.exe Invocation - Rule]
action.correlationsearch.enabled = 1
action.correlationsearch.label = ntdsutil.exe Invocation
action.customsearchbuilder.enabled = false
action.customsearchbuilder.spec = {}
action.notable = 1
action.notable.param.drilldown_name = View all processes on $dest$
action.notable.param.drilldown_search = | from datamodel Endpoint.Processes | search dest=$dest$
action.notable.param.rule_description = Invocation of ntdsutil.exe was detected on $dest$ through $process$
action.notable.param.rule_title = Invocation of ntdsutil.exe was detected on $dest$
action.notable.param.security_domain = endpoint
action.notable.param.severity = high
action.notable.param.verbose = 0
alert.suppress = 1
alert.suppress.fields = dest
alert.suppress.period = 86400s
alert.track = 1
counttype = number of events
cron_schedule = */5 * * * *
description = Invocation of Active Directory Diagnostic Tool (ntdsutil.exe). Based on Sigma detection: https://github.com/Neo23x0/sigma/blob/master/rules/windows/process_creation/win_susp_ntdsutil.yml
dispatch.earliest_time = -10m@m
dispatch.latest_time = -5m@m
dispatch.rt_backfill = 1
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = SplunkEnterpriseSecuritySuite
search = | tstats summariesonly=true count from datamodel=Endpoint.Processes where Processes.process_path="*\ntdsutil*"\
by Processes.dest Processes.parent_process Processes.parent_process_exec Processes.parent_process_id Processes.parent_process_guid Processes.parent_process_name Processes.parent_process_path Processes.process Processes.process_current_directory Processes.process_exec Processes.process_hash Processes.process_guid Processes.process_id Processes.process_integrity_level Processes.process_name Processes.process_path Processes.user Processes.vendor_product | `drop_dm_object_name("Processes")` | eval techID="T1003" | lookup mitreattack ID as techID OUTPUT Tactic Technique Description\


[Threat - Network Traffic Communications over Port 4444 (Metasploit Default) - Rule]
action.correlationsearch.enabled = 1
action.correlationsearch.label = Network Traffic Communications over Port 4444 (Metasploit Default)
action.customsearchbuilder.enabled = false
action.customsearchbuilder.spec = {}
action.notable = 1
action.notable.param.drilldown_name = Drill down on all destination port 4444 traffic between $src$ and $dest$
action.notable.param.drilldown_search = src=$src$ dest=$dest$ dest_port=4444
action.notable.param.rule_description = Port 4444 is being used between $src$ and $dest$
action.notable.param.rule_title = Suspicious Activity Seen - Port 4444 Usage between $src$ and $dest$
action.notable.param.security_domain = network
action.notable.param.severity = high
action.notable.param.verbose = 0
alert.suppress = 1
alert.suppress.fields = src,dest
alert.suppress.period = 86400s
alert.track = 1
counttype = number of events
cron_schedule = */10 * * * *
description = Detect port 4444 as destination. 4444 is the default port for Metasploit modules. krb524 was assigned by default to run on that port but that service is very infrequently seen now.
dispatch.earliest_time = -15m@m
dispatch.latest_time = -5m@m
dispatch.rt_backfill = 1
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = SplunkEnterpriseSecuritySuite
search = | tstats summariesonly=true count sum(All_Traffic.bytes_in) AS bytes_in sum(All_Traffic.bytes_out) AS bytes_out from datamodel=Network_Traffic where All_Traffic.dest_port=4444 by All_Traffic.src All_Traffic.dest All_Traffic.dest_port All_Traffic.app All_Traffic.user\
| `drop_dm_object_name("All_Traffic")`\
| eval techID="T1065" | lookup mitreattack ID as techID OUTPUT Tactic Technique Description

[Endpoint - Detection of whoami using Microsoft Sysmon - Rule]
action.correlationsearch.enabled = 1
action.correlationsearch.label = Detection of whoami using Microsoft Sysmon
action.customsearchbuilder.enabled = false
action.customsearchbuilder.spec = {}
action.notable = 1
action.notable.param.drilldown_name = View process creation events in Microsoft Sysmon on $dest$
action.notable.param.drilldown_search = sourcetype=xmlwineventlog:microsoft-windows-sysmon/operational EventCode=1 dest=$dest$
action.notable.param.rule_description = Whoami.exe is often used by attackers after exploitation or privilege escalation but rarely used by administrators.
action.notable.param.rule_title = Whoami.exe was executed on $dest$ by $user$
action.notable.param.security_domain = endpoint
action.notable.param.severity = medium
action.notable.param.verbose = 0
alert.suppress = 1
alert.suppress.fields = dest,user
alert.suppress.period = 86400s
alert.track = 1
counttype = number of events
cron_schedule = */60 * * * *
description = Execution of whoami.exe which is often used by attackers after exploitation or privilege escalation but rarely used by administrators.\
 Based on Sigma detection: https://github.com/Neo23x0/sigma/blob/master/rules/windows/process_creation/win_susp_whoami.yml
dispatch.earliest_time = -65m@m
dispatch.latest_time = -5m@m
dispatch.rt_backfill = 1
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = SplunkEnterpriseSecuritySuite
search = sourcetype=xmlwineventlog:microsoft-windows-sysmon/operational Image="*\\whoami.exe" OR OriginalFileName=whoami.exe\
| table dest user parent_process_exec parent_process parent_process_id parent_process_guid parent_process_name parent_process_path process process_current_directory process_exec process_hash process_guid process_id process_integrity_level process_name process_path vendor_product\
| eval techID="T1033" | lookup mitreattack ID as techID OUTPUT Tactic Technique Description