
[CbResponse New Binaries]
disabled = 1
search = `cb` type=binaryinfo.observed

[Executable without EXE/DLL extension]
disabled = 1
counttype = number of events
description = Searches for executable images that do not have a .EXE or .DLL at the end of the observed filename.
dispatch.earliest_time = -1h@h
dispatch.latest_time = now
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
quantity = 0
relation = greater than
search = `cb` "docs{}.is_executable_image"=true\
docs{}.os_type="Windows"\
NOT docs{}.observed_filename="*.exe" \
NOT docs{}.observed_filename="*.dll" \
NOT docs{}.observed_filename="*.sys" \
NOT docs{}.observed_filename="*Library/Application Support/Spigot/ApplicationManager"\
| stats count by cb_server, docs{}.md5, watchlist_name, docs{}.observed_filename

[POWERSHELL-DOWNLOAD-HUNT]
disabled = 1
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
dispatchAs = user
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = bar
display.visualizations.show = 0
search = `cb`  process=powershell.exe (command_line=*DownloadFile* OR command_line=*invoke-webrequest*) | stats values(command_line) as "commands" by computer_name

[BCDEDIT-OFF-HUNT]
disabled = 1
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
dispatchAs = user
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = bar
display.visualizations.show = 0
search = `cb` process=bcdedit.exe command_line=*off | stats values(command_line) as "commands" by computer_name

[WIN-REG-ADD-HUNT]
disabled = 1
dispatch.earliest_time = @w0
dispatch.latest_time = now
dispatchAs = user
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = bar
display.visualizations.show = 0
search = `cb` process=cmd.exe command_line=*reg add* NOT citrix NOT dinocapture| stats values(command_line) as "commands" by computer_name

[SCHEDULED-TASK-CREATION-HUNT]
disabled = 1
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
dispatchAs = user
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = bar
display.visualizations.show = 0
search = `cb` process=cmd.exe command_line=*schtasks* NOT WizMouse| stats values(command_line) as "commands" by computer_name

[SCHEDULED-TASK-CREATION-USER-PROFILE-HUNT]
disabled = 1
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
dispatchAs = user
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = bar
display.visualizations.show = 0
search = `cb` process=cmd.exe command_line=*schtasks* *appdata* NOT WizMouse| stats values(command_line) as "commands" by computer_name

[WIN-MSHTA-USAGE-HUNT]
disabled = 1
dispatch.earliest_time = -7d@h
dispatch.latest_time = now
dispatchAs = user
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = bar
display.visualizations.show = 0
search = `cb` process=mshta.exe NOT command_line=*.hta| stats values(command_line) as "commands" by computer_name

[CLI-NET-HIDDENSHARE-HUNT]
disabled = 1
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
dispatchAs = user
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = bar
display.visualizations.show = 0
search = `cb` process=net.exe command_line=*ipc$*| stats values(command_line) as "commands" by computer_name

[CLI-NETVIEW-USAGE-HUNT]
disabled = 1
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
dispatchAs = user
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = line
display.visualizations.show = 0
search = `cb` process=netview.exe | stats values(command_line) as "commands" by computer_name

[WIN-NTDSUTIL-USAGE-HUNT]
disabled = 1
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
dispatchAs = user
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = bar
display.visualizations.show = 0
search = `cb` process=ntdsutil.exe NOT svcdsrm| stats values(command_line) as "commands" by computer_name

[WIN-QWINSTA-USAGE-HUNT]
disabled = 1
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
dispatchAs = user
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = line
display.visualizations.show = 0
search = `cb` process=qwinsta.exe | stats values(command_line) as "commands" by computer_name

[WIN-REGSVR32-NOT-DLL-HUNT]
disabled = 1
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
dispatchAs = user
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = bar
display.visualizations.show = 0
search = `cb` process=regsvr32.exe command_line=*.jpg* | stats values(command_line) as "commands" by computer_name

[WIN-REGSVR32-PROGRAMDATA-HUNT]
disabled = 1
description = Regsvr32.exe executing file out of programdata directory path.
dispatch.earliest_time = @d
dispatch.latest_time = now
dispatchAs = user
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = bar
display.visualizations.show = 0
search = `cb` process=regsvr32.exe command_line="\\programdata\\"| stats  values(command_line) as "commands" by computer_name

[WIN-RUNDLL32-SCROBJ-APPBYPASS-HUNT]
disabled = 1
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
dispatchAs = user
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = bar
display.visualizations.show = 0
search = `cb` process=rundll32.exe command_line=*scrobj.dll* | stats values(command_line) as "commands" by _time,computer_name

[PROC-WATCHDOG-CLI-HUNT]
disabled = 1
dispatch.earliest_time = -7d@h
dispatch.latest_time = now
dispatchAs = user
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = bar
display.visualizations.show = 0
search = `cb` command_line=watchdogproc*| stats values(command_line) as "commands" by computer_name

[WINWORD-INVOICE-HUNT]
disabled = 1
dispatch.earliest_time = -7d@h
dispatch.latest_time = now
dispatchAs = user
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = line
display.visualizations.show = 0
search = `cb` process=winword.exe Outlook\\ \\invoice*.doc  | bucket _time span=1d | stats values(command_line) as "comamnds" by computer_name

[WIN-WSCRIPT-VBS-VBE-HUNT]
disabled = 1
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
dispatchAs = user
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = bar
display.visualizations.show = 0
search = `cb` process=wscript.exe command_line=*..vbs* OR command_line=*.vbe* NOT SUBSCRIPTS NOT Loginscript.vbe | stats values(command_line) as "commands" by _time,computer_name

[Total Agents Seen]
disabled = 1
dispatch.earliest_time = @d
dispatch.latest_time = now
dispatchAs = user
display.general.type = visualizations
display.page.search.mode = verbose
display.page.search.tab = visualizations
display.statistics.show = 0
search = `cb` earliest=-7h |timechart dc(computer_name) |streamstats max("Total Agents Seen") as "Max Agents Seen"

[WIN-REGSVR32-USER-PROFILE-HUNT]
disabled = 1
dispatch.earliest_time = -7d@h
dispatch.latest_time = now
dispatchAs = user
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = bar
display.visualizations.show = 0
search = `cb` process=regsvr32.exe command_line="\\AppData\\"| stats  values(command_line) as "commands" by computer_name

[CbResponse Alert Activity]
disabled = 1
auto_summarize.dispatch.earliest_time = 0
cron_schedule = 0 0 * * *
dispatch.earliest_time = -4h@m
dispatch.latest_time = now
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.show = 0
alert.digest_mode = True
alert.suppress = 0
alert.track = 0
search = | tstats count from datamodel=CbResponse.CbR_Alert by  CbR_Alert.computer_name\
| rename CbR_Alert.computer_name as HostName\
| stats count(alert_type) as A, count(eventtype) as E, latest(_time) as Latest, earliest(_time) as Earliest by HostName \
| eval Secs=Latest-Earliest \
| eval Ds=ceiling(Secs/(60*60*24)) \
| eval D=max(Ds,1) \
| eval AB=(round(A/D,0)) \
| eval EV=(round(E/D,0)) \
| eval HostNum=1 \
| table HostName, AB, EV, HostNum \
| rename AB as "File activity per day", EV as "Events per day", HostName as Computer \
| addcoltotals labelfield=Computer label=TOTALOFALLCOMPUTERS HostNum

[WIN-RUNDLL32-CONTROL-RUNDLL-HUNT]
disabled = 1
dispatch.earliest_time = -7d@h
dispatch.latest_time = now
dispatchAs = user
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = bar
display.visualizations.show = 0
search = `cb` process=rundll32.exe command_line="*,Control_RunDLL" | bucket _time span=1d | stats values(command_line) as "comamnds" by computer_name

[BINARY-SIGNED-EXECUTION-HUNT]
disabled = 1
dispatch.earliest_time = @d
dispatch.latest_time = now
dispatchAs = user
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = line
display.visualizations.show = 0
search = `cb` ioc_type=md5 | stats  values("docs{}.digsig_sign_time")  by "docs{}.last_seen","docs{}.alliance_score_virustotal","docs{}.alliance_link_virustotal"

[WIN-RUNDLL32-DLLREGISTERSERVER-HUNT]
disabled = 1
dispatch.earliest_time = @w0
dispatch.latest_time = now
dispatchAs = user
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = bar
display.visualizations.show = 0
search = `cb` process=rundll32.exe command_line=*DllRegisterServer NOT command_line="*xapauthenticodesip.dll*" | bucket _time span=1d | stats values(command_line) as "comamnds" by computer_name

[WIN-PROGRAMDATA-BAT-HUNT]
disabled = 1
dispatch.earliest_time = -7d@h
dispatch.latest_time = now
dispatchAs = user
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = bar
display.visualizations.show = 0
search = `cb` process=cmd.exe command_line=*\\programdata\\* AND command_line=*.bat NOT bginfo NOT onconnect NOT biomedical NOT goloader NOT kace| stats values(command_line) by computer_name

[BITSADMIN-USAGE-HUNT]
disabled = 1
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
dispatchAs = user
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = bar
display.visualizations.show = 0
search = `cb` process=bitsadmin.exe | stats values(command_line) by computer_name

[BITSADMIN-DOWNLOAD-ALERT]
disabled = 1
dispatch.earliest_time = -1h:
dispatch.latest_time = now
dispatchAs = user
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = bar
display.visualizations.show = 0
search = `cb` process=bitsadmin.exe command_line:"*//transfer //Download" | table computer_name, username, command_line, link_process, _time

[POWERSHELL-ENC-HUNT]
disabled = 1
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
dispatchAs = user
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = line
display.visualizations.show = 0
search = `cb` process=powershell.exe (base64 OR -enc OR -ec OR -en OR -enco OR -encod OR -encode OR -encoded OR -encodedC OR -encodedco OR -encodedcom OR -encodedcomm OR -encodedcomma OR -encodedcomman OR -encodedcommand)| stats values(command_line) as "commands" by computer_name

[WIN-NETSH-OPMODE-HUNT]
disabled = 1
dispatch.earliest_time = @w0
dispatch.latest_time = now
dispatchAs = user
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = bar
display.visualizations.show = 0
search = `cb` process=netsh.exe command_line="*opmode*"| stats values(command_line) as "commands" by computer_name

[WIN-PSEXEC-USAGE-HUNT]
disabled = 1
dispatch.earliest_time = @w0
dispatch.latest_time = now
dispatchAs = user
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = line
display.visualizations.show = 0
search = `cb` process=psexec.exe OR process=psexesvc.exe | stats values(command_line) as "commands" by computer_name

[WIN-RUNDLL32-ROAMINGDIR-HUNT]
disabled = 1
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
dispatchAs = user
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = bar
display.visualizations.show = 0
search = `cb` process=rundll32.exe Roaming NOT shopenverbshortcut | stats values(command_line) as "commands" by computer_name


[WIN-DNSUNLOCKER-IOC-HUNT]
disabled = 1
dispatch.earliest_time = -30d@d
dispatch.latest_time = now
dispatchAs = user
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = bar
display.visualizations.show = 0
search = `cb` "dns unlocker" OR "dnsunlocker"  type="ingress.event.procstart" OR type="ingress.event.filemod" | stats  values(process) by computer_name

[SUSP-MAIL-SPAMMING-HUNT]
disabled = 1
dispatch.earliest_time = @d
dispatch.latest_time = now
dispatchAs = user
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = bar
display.visualizations.show = 0
search = `cb` port=25 OR port=587  direction=outbound |stats count values(port) by computer_name

[WIN-CSCRIPT-URL-HUNT]
disabled = 1
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
dispatchAs = user
display.general.type = statistics
display.page.search.mode = fast
display.page.search.tab = statistics
display.visualizations.charting.chart = line
display.visualizations.show = 0
search = `cb` process=cscript.exe http | stats values(command_line) as commands by computer_name

[Cb-Susp indicator report]
disabled = 1
dispatch.earliest_time = -7d@h
dispatch.latest_time = now
dispatchAs = user
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = bar
display.visualizations.show = 0
search = `cb` feed_name=bit9suspiciousindicators   ioc_value="{\"index_type\": \"events\", \"search_query\": \"cb.urlver=1&q=(childproc_name%3Asvchost.exe%20digsig_result%3Aunsigned)&cb.q.os_type=(os_type%3A%22windows%22)\"}"| stats values("docs{}.cmdline") by computer_name

[VSS-DELETE-CLI-HUNT]
disabled = 1
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
dispatchAs = user
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.show = 0
search = `cb` process=vssadmin.exe command_line=*delete* | stats values(command_line) as "commands" by computer_name parent_path

[WIN-POWERSHELL-INVOKE-EXPRESSION-HUNT]
disabled = 1
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
dispatchAs = user
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = bar
display.visualizations.show = 0
search = `cb` process=powershell.exe iex  earliest = -1h| stats values(command_line) as "commands" by computer_name

[WIN-NET-USER-HUNT]
disabled = 1
dispatch.earliest_time = -7d@h
dispatch.latest_time = now
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.patterns.sensitivity = 0.6
display.page.search.tab = statistics
display.visualizations.charting.chart = bar
display.visualizations.show = 0
search = `cb` process=net.exe net use user| stats count values(command_line) by computer_name,username

[WIN-WSCRIPT-JS-HUNT]
disabled = 1
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.patterns.sensitivity = 0.6
display.page.search.tab = statistics
display.visualizations.charting.chart = bar
display.visualizations.show = 0
search = `cb` process=wscript.exe \\Rar$*\\  OR ".zip" \\appdata\\ | stats values(command_line) by computer_name

[WIN-WMIC-SHADOWCOPY-DELETE-ALERT]
disabled = 1
dispatch.earliest_time = -7d@h
dispatch.latest_time = now
dispatchAs = user
display.page.search.mode = verbose
display.page.search.patterns.sensitivity = 0.6
display.visualizations.charting.chart = bar
display.visualizations.show = 0
search = `cb` process=wmic.exe shadowcopy OR delete | table computer_name, username, command_line, link_process, _time

[CBER Risky Assets]
disabled = 1
dispatch.earliest_time = -4h@m
dispatch.latest_time = now
dispatchAs = user
display.general.type = visualizations
display.page.search.mode = verbose
display.page.search.patterns.sensitivity = 0.6
display.page.search.tab = visualizations
display.visualizations.charting.chart = line
search = | tstats latest(_time) as _time, values(CbR_Alert.watchlist_name) as watchlist, values(CbR_Alert.feed_name) as feed, values(CbR_Alert.ioc_value) as ioc from datamodel=CbResponse by CbR_Alert.computer_name\
| eval risk = 1\
| eval risk = case(count>0,risk+10, 1==1, risk)\
| eval risk = case(count>3,risk+10, 1==1, risk)\
| eval risk = case(count>5,risk+10, 1==1, risk)\
| eval risk = case(count>10,risk+10, 1==1, risk)\
| eval risk = case(count>15,risk+10, 1==1, risk)\
| eval risk = case(count>20,risk+10, 1==1, risk)\
| eval risk = case(count>25,risk+10, 1==1, risk)\
| eval risk = case(count>30,risk+10, 1==1, risk)\
| eval risk = case(count>35,risk+10, 1==1, risk)\
| eval risk = case(count>40,risk+10, 1==1, risk)\
| eval risk = case(feed=="virustotal", risk+1, 1==1, risk)\
| eval risk = case(watchlist=="Regsvr32 w/Netconns", risk+15, 1==1, risk)\
| eval risk = case(watchlist=="process_blocking", risk+100, 1==1, risk)\
| eval risk = case(watchlist=="zbot - powershell iex", risk+30, 1==1, risk)\
| eval risk = case(feed=="alienvault", risk+5, 1==1, risk)\
| eval risk = case(feed=="bit9endpointvisibility", risk+5, 1==1, risk)\
| eval risk = case(feed=="bit9suspiciousindicators", risk+5, 1==1, risk)\
| eval risk = case(feed=="tor", risk+10, 1==1, risk)\
| eval risk = case(feed=="iconmatching", risk+1, 1==1, risk)\
| streamstats count(feed) as feed_count by CbR_Alert.computer_name\
| streamstats count(watchlist) as wl_count by CbR_Alert.computer_name\
| streamstats count(ioc) as ioc_count by CbR_Alert.computer_name

[Risky Systems - 70+]
disabled = 1
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
dispatchAs = user
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.patterns.sensitivity = 0.6
display.page.search.tab = statistics
display.visualizations.charting.chart = line
display.visualizations.show = 0
search = | tstats latest(_time) as _time, values(CbR_Alert.watchlist_name) as watchlist, values(CbR_Alert.feed_name) as feed, values(CbR_Alert.ioc_value) as ioc from datamodel=CbResponse by CbR_Alert.computer_name\
| eval risk = 1\
| eval risk = case(count>0,risk+10, 1==1, risk)\
| eval risk = case(count>3,risk+10, 1==1, risk)\
| eval risk = case(count>5,risk+10, 1==1, risk)\
| eval risk = case(count>10,risk+10, 1==1, risk)\
| eval risk = case(count>15,risk+10, 1==1, risk)\
| eval risk = case(count>20,risk+10, 1==1, risk)\
| eval risk = case(count>25,risk+10, 1==1, risk)\
| eval risk = case(count>30,risk+10, 1==1, risk)\
| eval risk = case(count>35,risk+10, 1==1, risk)\
| eval risk = case(count>40,risk+10, 1==1, risk)\
| eval risk = case(feed=="virustotal", risk+1, 1==1, risk)\
| eval risk = case(watchlist=="Regsvr32 w/Netconns", risk+15, 1==1, risk)\
| eval risk = case(watchlist=="process_blocking", risk+100, 1==1, risk)\
| eval risk = case(watchlist=="zbot - powershell iex", risk+30, 1==1, risk)\
| eval risk = case(feed=="alienvault", risk+5, 1==1, risk)\
| eval risk = case(feed=="bit9endpointvisibility", risk+5, 1==1, risk)\
| eval risk = case(feed=="bit9suspiciousindicators", risk+5, 1==1, risk)\
| eval risk = case(feed=="tor", risk+10, 1==1, risk)\
| eval risk = case(feed=="iconmatching", risk+1, 1==1, risk)\
| streamstats count(feed) as feed_count by CbR_Alert.computer_name\
| streamstats count(watchlist) as wl_count by CbR_Alert.computer_name\
| streamstats count(ioc) as ioc_count by CbR_Alert.computer_name\
|where risk>70

[WIN-WSCRIPT-VBS-VBE-ALERT]
disabled = 1
counttype = number of events
dispatch.earliest_time = -1h
dispatch.latest_time = now
dispatchAs = user
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = bar
display.visualizations.show = 0
quantity = 0
relation = greater than
search = `cb` process=wscript.exe command_line=*..vbs* OR command_line=*.vbe* NOT SUBSCRIPTS NOT Loginscript.vbe | table computer_name, username, command_line, link_process, _time

[DNS Unlocker]
disabled = 1
counttype = number of events
dispatch.earliest_time = -1d
dispatch.latest_time = now
dispatchAs = user
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = bar
display.visualizations.show = 0
quantity = 0
relation = greater than
search = `cb` "dns unlocker" OR "dnsunlocker"  type="ingress.event.procstart" OR type="ingress.event.filemod" | table computer_name, username, path, link_process, _time

[WIN-BAT-PROGRAMDATA-ALERT]
disabled = 1
counttype = number of events
dispatch.earliest_time = -1h
dispatch.latest_time = now
dispatchAs = user
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = bar
display.visualizations.show = 0
quantity = 0
relation = greater than
search = `cb` process=cmd.exe command_line=\\programdata\\ AND command_line=*x.bat NOT bginfo NOT onconnect NOT biomedical NOT goloader NOT kace | table computer_name, username, command_line, link_process, _time

[VSS-DELETE-CLI-ALERT]
disabled = 1
counttype = number of events
dispatch.earliest_time = -1h
dispatch.latest_time = now
dispatchAs = user
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.show = 0
quantity = 0
relation = greater than
search = `cb` command_line="vssadmin.exe Delete Shadows /All /Quiet" OR command_line="\"C:\\Windows\\System32\\vssadmin.exe\"  Delete Shadows /All /Quiet " | table computer_name, username, command_line, link_process, _time

[WIN-WSCRIPT-ZIP-RAR-JS-ALERT]
disabled = 1
counttype = number of events
dispatch.earliest_time = -1h
dispatch.latest_time = now
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.patterns.sensitivity = 0.6
display.page.search.tab = statistics
display.visualizations.charting.chart = bar
display.visualizations.show = 0
quantity = 0
relation = greater than
search = `cb` process=wscript.exe \\Rar$*\\  OR ".zip" \\appdata\\ | table computer_name, username, command_line, link_process, _time

[WIN-RUNDLL32-DLLREGISTERSERVER-ALERT]
disabled = 1
counttype = number of events
dispatch.earliest_time = -1h
dispatch.latest_time = now
dispatchAs = user
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = bar
display.visualizations.show = 0
quantity = 0
relation = greater than
search = `cb` process=rundll32.exe command_line=*DllRegisterServer NOT command_line="*xapauthenticodesip.dll*" NOT veraport20.dll NOT \\devmcopy\\| table computer_name, username, command_line, link_process, _time

[WIN-WSCRIPT-USAGE-HUNT]
disabled = 1
counttype = number of events
dispatch.earliest_time = -1h
dispatch.latest_time = now
dispatchAs = user
display.page.search.mode = verbose
display.visualizations.charting.chart = bar
display.visualizations.show = 0
quantity = 0
relation = greater than
search = `cb` process=wscript.exe command_line=*..vbs* OR command_line=*.vbe* NOT SUBSCRIPTS NOT Loginscript.vbe

[WIN-MSHTA-JAVASCRIPT-ALERT]
disabled = 1
counttype = number of events
dispatch.earliest_time = -1h
dispatch.latest_time = now
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.patterns.sensitivity = 0.6
display.page.search.tab = statistics
display.visualizations.charting.chart = bar
quantity = 0
relation = greater than
search = `cb` process=mshta.exe command_line=*javascript:* | table computer_name, username, command_line, link_process, _time

[POWERSHELL-ENCODEDCOMMAND-ALERT]
disabled = 1
counttype = number of events
description = A Powershell Encoded Command was executed
dispatch.earliest_time = -1h
dispatch.latest_time = now
dispatchAs = user
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.charting.chart = line
display.visualizations.show = 0
quantity = 0
relation = greater than
search = `cb` process=powershell.exe (base64 OR -enc OR -ec OR -en OR -enco OR -encod OR -encode OR -encoded OR -encodedC OR -encodedco OR -encodedcom OR -encodedcomm OR -encodedcomma OR -encodedcomman OR -encodedcommand) | table computer_name, username, command_line, link_process, _time
