# docs here
# https://docs.freebsd.org/en/books/handbook/audit/
# someone wrote a decent doc on it
# https://crucialsecurity.wordpress.com/tag/praudit/

[openbsm]
REPORT-openbsmaudit = openbsmaudit1, openbsmaudit2, openbsmaudit3, openbsmaudit4, openbsmaudit5, openbsmaudit6, openbsmaudit7
LINE_BREAKER = ([\r\n]+)header\,
SHOULD_LINEMERGE = false
TRUNCATE = 999999
MAX_TIMESTAMP_LOOKAHEAD = 40
TIME_PREFIX = ^[^\,]+\,[^\,]+\,[^\,]+\,[^\,]+\,[^\,]+\,
TIME_FORMAT = %a %b %d %H:%M:%S %Y
EVENT_BREAKER_ENABLE = true
EVENT_BREAKER = ([\r\n]+)header\,
CHARSET = UTF-8
NO_BINARY_CHECK = true

FIELDALIAS-app = signing_id AS app
FIELDALIAS-dest = host AS dest
FIELDALIAS-user = Audit_ID AS user
EVAL-action = case(return_value != "0" AND vendor_action == "login - local", "failure", return_value == "0" AND vendor_action == "login - local", "success", return_value == "0" AND vendor_action == "user authentication", "success", return_value != "0" AND vendor_action == "user authentication", "failure", return_value == "0" AND vendor_action == "OpenSSH login", "success", return_value != "0" AND vendor_action == "OpenSSH login", "failure", vendor_action == "modify user", "modified", vendor_action == "modify group", "modified", vendor_action = "modify password", "modified", vendor_action = "create user", "created", vendor_action = "create group", "created", vendor_action = "add to group", "acl_modified", vendor_action = "remove from group", "acl_modified", vendor_action = "delete group", "deleted")
EVAL-change_type = case(vendor_action == "modify user", "AAA", vendor_action == "modify group", "AAA", vendor_action = "modify password", "AAA", vendor_action = "create user", "AAA", vendor_action = "create group", "AAA", vendor_action = "add to group", "AAA", vendor_action = "remove from group", "AAA", vendor_action = "delete group", "AAA")
EVAL-command = case(vendor_action == "modify user", vendor_action, vendor_action == "modify group", vendor_action, vendor_action = "modify password", vendor_action, vendor_action = "create user", vendor_action, vendor_action = "create group", vendor_action, vendor_action = "add to group", vendor_action, vendor_action = "remove from group", vendor_action, vendor_action = "delete group", vendor_action)
EVAL-dvc = case(vendor_action == "modify user", host, vendor_action == "modify group", host, vendor_action = "modify password", host, vendor_action = "create user", host, vendor_action = "create group", host, vendor_action = "add to group", host, vendor_action = "remove from group", host, vendor_action = "delete group", host)
EVAL-object_category = case(vendor_action == "modify user", "user", vendor_action == "modify group", "group", vendor_action = "modify password", "user", vendor_action = "create user", "user", vendor_action = "create group", "group", vendor_action = "add to group", "group", vendor_action = "remove from group", "group", vendor_action = "delete group", "group")
EVAL-result = case(vendor_action == "modify user", return_value, vendor_action == "modify group", return_value, vendor_action = "modify password", return_value, vendor_action = "create user", return_value, vendor_action = "create group", return_value, vendor_action = "add to group", return_value, vendor_action = "remove from group", return_value, vendor_action = "delete group", return_value)
EVAL-src = case(vendor_action == "OpenSSH login", Terminal_Machine_Address, vendor_action != "OpenSSH login", "unknown")
EVAL-status = case(vendor_action == "modify user" AND return_value == "0", "success", vendor_action == "modify group" AND return_value == "0", "success", vendor_action = "modify password" AND return_value == "0", "success", vendor_action == "modify user" AND return_value != "0", "failure", vendor_action == "modify group" AND return_value != "0", "failure", vendor_action = "modify password" AND return_value != "0", "failure", vendor_action = "create user" AND return_value == "0", "success", vendor_action = "create group" AND return_value == "0", "success", vendor_action = "create user" AND return_value != "0", "failure", vendor_action = "create group" AND return_value != "0", "failure", vendor_action = "add to group" AND return_value == "0", "success", vendor_action = "remove from group" AND return_value == "0", "success", vendor_action = "add to group" AND return_value != "0", "failure", vendor_action = "remove from group" AND return_value != "0", "failure", vendor_action = "delete group" AND return_value == "0", "success", vendor_action = "delete group" AND return_value != "0", "failure")
EVAL-user_name = case(vendor_action == "modify user", Audit_ID, vendor_action == "modify group", Audit_ID, vendor_action = "modify password", Audit_ID, vendor_action = "create user", Audit_ID, vendor_action = "create group", Audit_ID, vendor_action = "add to group", Audit_ID, vendor_action = "remove from group", Audit_ID, vendor_action = "delete group", Audit_ID)
EVAL-vendor_product = "openbsm"

# OCSF Settings here
FIELDALIAS-metadata.name = source AS metadata.name
FIELDALIAS-metadata.log_provider = source AS metadata.log_provider
FIELDALIAS-metadata.log_version = source AS metadata.log_version
FIELDALIAS-metadata.name = source AS metadata.name
FIELDALIAS-metadata.log_provider = source AS metadata.log_provider
FIELDALIAS-metadata.log_version = source AS metadata.log_version
FIELDALIAS-actor.user = Audit_ID AS actor.user
EVAL-metadata.product = "OpenBSM"
EVAL-metadata.version = "1.2.0"
LOOKUP-type_name = nix_ocsf_type_name type_uid OUTPUT type_name type_uid_description
LOOKUP-auth_proto_id = nix_authentication_id_to_protocol auth_protocol OUTPUT auth_protocol_id
LOOKUP-logontypeid = nix_authentication_logon_type_id_to_type logon_type OUTPUT logon_type_description logon_type_id
LOOKUP-status_id = nix_account_change_status_id status OUTPUT status_id
LOOKUP-nix_class_uid_activity_id_details = nix_class_uid_activity_id_details activity_id class_uid OUTPUT category_name category_uid class_name activity_name activity_description type_uid type_name type_uid_description severity_id severity

# Account Change [3001] Class
FIELDALIAS-status_detail = return as status_detail
FIELDALIAS-actor.app_name = signing_id as actor.app_name
EVAL-actor.authorizations.decision = case(return_value != "0" AND vendor_action == "login - local", "failure", return_value == "0" AND vendor_action == "login - local", "success", return_value == "0" AND vendor_action == "user authentication", "success", return_value != "0" AND vendor_action == "user authentication", "failure", return_value == "0" AND vendor_action == "OpenSSH login", "success", return_value != "0" AND vendor_action == "OpenSSH login", "failure", vendor_action == "modify user", "modified", vendor_action == "modify group", "modified", vendor_action = "modify password", "modified", vendor_action = "create user", "created", vendor_action = "create group", "created", vendor_action = "add to group", "acl_modified", vendor_action = "remove from group", "acl_modified", vendor_action = "delete group", "deleted")
EVAL-actor.idp.name = case(vendor_action == "user authentication", signing_id, vendor_action == "login - local", signing_id, vendor_action == "OpenSSH login", signing_id, vendor_action == "loginwindow login", signing_id, like(vendor_action, "session%"), signing_id, like(vendor_action, "modify%"), signing_id, like(vendor_action, "remove%"), signing_id, like(vendor_action, "add%"), signing_id)
EVAL-activity_id=case(vendor_action == "modify password", "3", vendor_action == "modify user", "7", vendor_action == "modify group", "7", vendor_action == "remove from group", "8", vendor_action == "add to group", "7", vendor_action == "user authentication", "1", vendor_action == "logout - local", "2", vendor_action == "create user", "1", vendor_action == "create group", "1", vendor_action == "delete group", "6", vendor_action == "OpenSSH login", "1")
EVAL-category_uid = case(vendor_action == "modify password", "3", vendor_action == "modify user", "3", vendor_action == "modify group", "3", vendor_action == "remove from group", "3", vendor_action == "add to group", "3", vendor_action == "user authentication", "3", vendor_action == "logout - local", "3", vendor_action == "create user", "3", vendor_action == "create group", "3", vendor_action == "delete group", "3", vendor_action == "OpenSSH login", "3002")
EVAL-class_uid = case(vendor_action == "modify password", "3001", vendor_action == "modify user", "3001", vendor_action == "modify group", "3001", vendor_action == "remove from group", "3001", vendor_action == "add to group", "3001", vendor_action == "user authentication", "3002", vendor_action == "logout - local", "3002", vendor_action == "create user", "3001", vendor_action == "create group", "3001", vendor_action == "delete group", "3001", vendor_action == "OpenSSH login", "3002")
EVAL-status=if(return_value == "0", "success", "failure")
EVAL-user_result.account=case(vendor_action == "modify password", object, vendor_action == "modify user", object, vendor_action == "modify group", object, vendor_action == "remove from group", object, vendor_action == "add to group", object, vendor_action == "create user", object, vendor_action == "create group", object, vendor_action == "delete group", object)
EVAL-user_result.name=case(vendor_action == "modify password", object, vendor_action == "modify user", object, vendor_action == "modify group", object, vendor_action == "remove from group", object, vendor_action == "add to group", object, vendor_action == "create user", object, vendor_action == "create group", object, vendor_action == "delete group", object)
EVAL-severity_id = case(vendor_action == "modify password", "1", vendor_action == "modify user", "1", vendor_action == "modify group", "1", vendor_action == "remove from group", "1", vendor_action == "add to group", "1", vendor_action == "user authentication", "1", vendor_action == "logout - local", "1", vendor_action == "create user", "1", vendor_action == "create group", "1", vendor_action == "delete group", "1", vendor_action == "OpenSSH login", "2")

# Authentication [3002] Class
EVAL-auth_protocol = case(vendor_action == "OpenSSH login", signing_id, vendor_action == "user authentication", signing_id)
EVAL-auth_protocol_id = case(vendor_action == "OpenSSH login", "99", vendor_action == "user authentication", "99")
EVAL-dst_endpoint = case(vendor_action == "OpenSSH login", host, vendor_action == "user authentication", host)
EVAL-logon_type_id = case(vendor_action == "OpenSSH login", "10", vendor_action == "user authentication", "2")
EVAL-logon_process.user = case(vendor_action == "OpenSSH login", Effective_User_ID, vendor_action == "user authentication", Effective_User_ID)
EVAL-service.name = case(vendor_action == "OpenSSH login", signing_id, vendor_action == "user authentication", signing_id)
EVAL-is_cleartext = case(like(exe, "OpenSSH%"), "false")
EVAL-logon_type = case(vendor_action == "OpenSSH login", "Remote Interactive", vendor_action == "user authentication", "Interactive")
EVAL-is_remote = if(like(exe, "OpenSSH%"), "true", "false")
EVAL-session.is_remote = if(like(exe, "OpenSSH%"), "true", "false")
EVAL-src_endpoint = case(vendor_action == "modify password", host, vendor_action == "modify user", host, vendor_action == "modify group", host, vendor_action == "remove from group", host, vendor_action == "add to group", host, vendor_action == "user authentication", host, vendor_action == "logout - local", host, vendor_action == "create user", host, vendor_action == "create group", host, vendor_action == "delete group", host, vendor_action == "OpenSSH login", Terminal_Machine_Address)
EVAL-user.account = case(vendor_action == "OpenSSH login", Effective_User_ID, vendor_action == "user authentication", Effective_User_ID)
EVAL-user.name = case(vendor_action == "OpenSSH login", Effective_User_ID, vendor_action == "user authentication", Effective_User_ID)

