#[security_content_summariesonly]
#definition = summariesonly=false allow_old_summaries=true fillnull_value=null
#description = search data model's summaries only (copied from Splunk's ES support app "DA-ESS-ContentUpdate"

[security_content_ctime(1)]
args = fieldName_INPUT_OUTPUT
definition = rename TRACE AS "BEGIN MACRO 'security_content_ctime(1)'"\
| fieldformat $fieldName_INPUT_OUTPUT$=strftime($fieldName_INPUT_OUTPUT$,"%Y-%m-%dT%H:%M:%S %Z")\
| rename TRACE AS "END MACRO 'security_content_ctime(1)'"
errormsg = DESCRIPTION: The orignal version uses 'eval', but the right thing to do is to use 'fieldformat'.
iseval = 0

[history(2)]
args = searchRegExFilter_INPUT, userFilter_INPUT
definition = index="_audit" AND sourcetype="audittrail" AND "action=search" AND user="$userFilter_INPUT$"\
| rename COMMENT1of2 AS "DO NOT trust the default search extraction!"\
| rename COMMENT2of2 AS "Yes, this is 'too greedy' sometimes but that is better than chancing clippping off actrual search string"\
| rex "(?ms),\ssearch='(?<search>.+)'(?:,\s?|\s?\])"\
| eval len=len(search)\
| regex search="$searchRegExFilter_INPUT$"\
| stats max(_time) AS _time count first(len) AS len values(savedsearch_name) AS savedsearch_name BY search user\
| sort 0 - _time
errormsg = DESCRIPTION: Author = Gregg Woodcock <woodcock@Splunxter.com>
iseval = 0

[history(1)]
args = searchRegExFilter_INPUT
definition = `history("$searchRegExFilter_INPUT$", "*")`
errormsg = DESCRIPTION: Author = Gregg Woodcock <woodcock@Splunxter.com>
iseval = 0

[history]
definition = `history(".*", "*")`
errormsg = DESCRIPTION: Author = Gregg Woodcock <woodcock@Splunxter.com>
iseval = 0

[CIM_Toolkit_SETTING_Curation_Search_AppName]
definition = "CIM_Toolkit"
errormsg = DESCRIPTION: This is used by the "CIM_Toolkit: Poorly-Curated Scheduled Search Content - Rule" search
iseval = 0

[CIM_Toolkit_SETTING_Curation_Search_Rule_Prefix_RegEx]
definition = "^CIM_Toolkit: "
errormsg = DESCRIPTION: This is used by the "CIM_Toolkit: Poorly-Curated Scheduled Search Content - Rule" search
iseval = 0

[CIM_Toolkit_SETTING_Curation_Search_Rule_Prefix_String]
definition = "CIM_Toolkit: *"
errormsg = DESCRIPTION: This is used by the "CIM_Toolkit: Poorly-Curated Scheduled Search Content - Rule" search
iseval = 0

[CIM_Toolkit_SETTING_False_Positive_Tag_Exclusions]
definition = "AND NOT (index=\"_*\" AND sourcetype IN(\"splunkd_remote_searches\", \"cloud_monitoring_console\", \"scheduler\", \"splunk_resource_usage\", \"incident_review\", \"splunk_cloud_telemetry\", \"splunk_telemetry\"))"
errormsg = DESCRIPTION: This is used by the "CIM_Toolkit: Datamodel index macros validator - Rule" search
iseval = 0

[CIM_Toolkit_SETTING_SplitBy_index_OR_index_sourcetype]
definition = index sourcetype
errormsg = DESCRIPTION: There are only 2 valid/expected settings here: EITHER "index" OR "index sourcetype".
iseval = 0

[CIM_Toolkit_SETTING_Unaccelerate_Text]
definition = "UNACCELERATE ME (NO DATA MATCHES)!!!!"
errormsg = DESCRIPTION: Author = Gregg Woodcock <woodcock@Splunxter.com>
iseval = 0

[CIM_Toolkit_SETTING_Splunk_Infrastructure_host_values]
definition = [|tstats count\
WHERE index="_internal" AND source="*license_usage.log*" earliest=-24h latest=now\
BY host splunk_server\
| rename COMMENT AS "Feel free to replace this with a simple hard-coded list"\
| eval host = mvappend(host, splunk_server)\
| mvexpand host\
| stats sum(count) BY host\
| table host\
| format]
errormsg = DESCRIPTION: This is used by the "CIM_Toolkit: Splunk Infrastructure Communication/Connection Breakdown/Outage - Rule" search
iseval = 0

[CIM_Toolkit_SETTING_REST_API_Port]
definition = [|rest/services/server/settings splunk_server=local | search mgmtHostPort="*"\
| head 1\
| return $mgmtHostPort]
errormsg = DESCRIPTION: Author = Gregg Woodcock <woodcock@Splunxter.com>
iseval = 0

[CIM_Toolkit_SETTING_My_URL_Prefix]
definition = [ |rest/services/server/settings splunk_server=local\
| search httpport="*"\
| head 1\
| eval URLprefix = "\"" . if(enableSplunkWebSSL==0, "http", "https") . "://" . host . if(httpport IN("443","8443"), "", ":" . httpport) . "\""\
| return $URLprefix ]
errormsg = DESCRIPTION: Author = Gregg Woodcock <woodcock@Splunxter.com>
iseval = 0

[CIM_Toolkit_addinfo]
definition = rename TRACE AS "BEGIN MACRO 'CIM_Toolkit_addinfo'"\
| addinfo\
| rename COMMENT AS "Convert '+Infinity' to an actual number and strip subseconds"\
| replace "+Infinity" WITH "2147483647" IN info_max_time\
```| foreach info_min_time info_max_time [rex field=<<FIELD>> mode=sed "s/\.\d+//"]```\
| fields - info_sid info_search_time\
| rename TRACE AS "END MACRO 'CIM_Toolkit_addinfo'"
errormsg = DESCRIPTION: This normalizes the 'info_max_time` value so that it can always be safely used with 'latest='
iseval = 0

[addinfo]
definition = `CIM_Toolkit_addinfo`
errormsg = DESCRIPTION: Author = Gregg Woodcock <woodcock@Splunxter.com>
iseval = 0

[CIM_Toolkit_duration(2)]
args = fieldName_INPUT, fieldName_OUTPUT
definition = rename TRACE AS "BEGIN MACRO 'CIM_Toolkit_duration(2)'"\
| fieldformat $fieldName_OUTPUT$ = if($fieldName_INPUT$<0, "-", "+") . tostring(abs($fieldName_INPUT$), "duration")\
| rename TRACE AS "END MACRO 'CIM_Toolkit_duration(2)'"
errormsg = DESCRIPTION: The built-in 'tostring($fieldName_INPUT$, "duration")' function does not handle negative numbers
iseval = 0

[CIM_Toolkit_duration(1)]
args = fieldName_INPUT_OUTPUT
definition = `CIM_Toolkit_duration($fieldName_INPUT_OUTPUT$, $fieldName_INPUT_OUTPUT$)`
errormsg = DESCRIPTION: The built-in 'tostring($fieldName_INPUT$, "duration")' function does not handle negative numbers
iseval = 0

[CIM_Toolkit_Datamodel_Search(2)]
args = datamodelName_INPUT, nodeName_INPUT
definition = [|`CIM_Toolkit_Get_Datamodel_SPL($datamodelName_INPUT$, $nodeName_INPUT$, search)`\
| rename COMMENT AS "Escape double-quote characters or ERROR for outer 'eval' happens"\
| rex field=DRILLDOWN_SPL mode=sed "s/\"/\\\"/g"\
| return $search]
errormsg = DESCRIPTION: Author = Gregg Woodcock <woodcock@Splunxter.com>
iseval = 0

[CIM_Toolkit_Datamodel_Search(3)]
args = datamodelName_INPUT, nodeName_INPUT, fieldName_OUTPUT
definition = eval [|`CIM_Toolkit_Get_Datamodel_SPL($datamodelName_INPUT$, $nodeName_INPUT$, $fieldName_OUTPUT$)`\
| rename COMMENT AS "Escape double-quote characters or ERROR for outer 'eval' happens"\
| rex field=DRILLDOWN_SPL mode=sed "s/\"/\\\"/g"\
| return $fieldName_OUTPUT$]
errormsg = DESCRIPTION: Author = Gregg Woodcock <woodcock@Splunxter.com>
iseval = 0

[CIM_Toolkit_Get_Datamodel_SPL(3)]
args = datamodelName_INPUT, nodeName_INPUT, SPLfieldName_OUTPUT
definition = datamodel $datamodelName_INPUT$ $nodeName_INPUT$\
| rename TRACE AS "BEGIN MACRO 'CIM_Toolkit_Get_Datamodel_SPL(3)'"\
| spath path=constraints{}.search output=constraint\
| spath path=baseSearch           output=baseSearch\
| foreach baseSearch constraint [rex field=<<FIELD>> mode=sed "s/^/(/ s/$/)/" | eval <<FIELD>> = mvjoin(<<FIELD>>, " AND ")]\
| eval search = coalesce(constraint, baseSearch)\
| table search\
\
| rename COMMENT1of2 AS "The rest of the code expands the macro because otherwise we get this error:"\
| rename COMMENT2of2 AS "Error in 'SearchParser': The search specifies a macro 'cim_DataModelNameHere_indexes' that cannot be found"\
\
| rex field=search "[^`]+`(?<macro_name>[^`]+)"\
| map search="\
|makeresults\
| eval [\
|rest/servicesNS/-/Splunk_SA_CIM/admin/macros splunk_server=local\
| search title=$macro_name$\
| rex field=definition mode=sed \"s/\\\"/\\\\\\\"/g\"\
| eval definition=if(len(definition)>=5, definition, \"(index=* OR index=_*)\")\
| rename definition AS macro_definition\
| return macro_definition\
]\
| nomv search\
| eval search = replace(\"$search$\", \"`$macro_name$`\", \" \" . macro_definition . \" \")\
| table search\
"\
| rename search AS $SPLfieldName_OUTPUT$\
| rename TRACE AS "END MACRO 'CIM_Toolkit_Get_Datamodel_SPL(3)'"
errormsg = DESCRIPTION: Author = Gregg Woodcock <woodcock@Splunxter.com>
iseval = 0

[CIM_Toolkit_Escape_Backslashes(2)]
args = SPLfieldName_INPUT_OUTPUT, stringFieldName_INPUT
definition = rename TRACE AS "BEGIN MACRO 'CIM_Toolkit_Escape_Backslashes(2)'"\
| rename COMMENT AS "Replace single-backslashes in '$stringFieldName_INPUT$=value' w/ backslashes"\
| rex field=$SPLfieldName_INPUT_OUTPUT$ mode=sed "s/($stringFieldName_INPUT$=\"?[^\\\]+)\\\([^\\\])/\1\\\\\\\\\2/g"\
| rename TRACE AS "END MACRO 'CIM_Toolkit_Escape_Backslashes(2)'"
errormsg = DESCRIPTION: Author = Gregg Woodcock <woodcock@Splunxter.com>
iseval = 0

[CIM_Toolkit_Escape_Backslashes(1)]
args = SPLfieldName_INPUT
definition = replace($SPLfieldName_INPUT$, "\\\\", "\\\\\\")
errormsg = DESCRIPTION: Author = Gregg Woodcock <woodcock@Splunxter.com>
iseval = 0

[CIM_Toolkit_Fix_unknowns_in_SPL(1)]
args = SPLfieldName_INPUT_OUTPUT
definition = rename TRACE AS "BEGIN MACRO 'CIM_Toolkit_Fix_unknowns_in_SPL(1)'"\
| `CIM_Toolkit_Fix_unknowns_in_SPL($SPLfieldName_INPUT_OUTPUT$, "unknown")`\
| rename TRACE AS "END MACRO 'CIM_Toolkit_Fix_unknowns_in_SPL(1)'"
errormsg = DESCRIPTION: Author = Gregg Woodcock <woodcock@Splunxter.com>
iseval = 0

[CIM_Toolkit_Fix_unknowns_in_SPL(2)]
args = SPLfieldName_INPUT_OUTPUT, SPLfieldName_INPUT
definition = rename TRACE AS "BEGIN MACRO 'CIM_Toolkit_Fix_unknowns_in_SPL(2)'"\
| rename COMMENT1of4 AS "Inside of a datamodel, certain fields are given a value of 'unknown'"\
| rename COMMENT2of4 AS "whenever it does not have a value, and yet 'unknown' may also be a real value!"\
| rename COMMENT3of4 AS "Therefore, we must check for this and accommodate it, if it happens to occur,"\
| rename COMMENT4of4 AS "by changing 'foo=unkownn' into '(NOT foo=* OR foo=unknown OR foo="")' everywhere."\
| rex field=$SPLfieldName_INPUT_OUTPUT$ mode=sed "s/([^=\s]+)(\s*=\s*\"?$SPLfieldName_INPUT$\"?)(?=$|[\s\|])/(NOT \1=\"*\" OR \1=\"\" OR \1=\"$SPLfieldName_INPUT$\")/g"\
| rename TRACE AS "END MACRO 'CIM_Toolkit_Fix_unknowns_in_SPL(2)'"
errormsg = DESCRIPTION: Author = Gregg Woodcock <woodcock@Splunxter.com>
iseval = 0

[CIM_Toolkit_Extract_BaseSearch_SPL]
definition = rest/servicesNS/-/Splunk_SA_CIM/data/models splunk_server=local\
| rename TRACE AS "BEGIN MACRO 'CIM_Toolkit_Extract_BaseSearch_SPL'"\
| search acceleration=1 AND eai:acl.app="Splunk_SA_CIM" AND NOT title="Splunk_Audit"\
| dedup id\
| table eai:acl.app eai:acl.owner eai:acl.sharing disabled title acceleration acceleration.backfill_time eai:data\
| rename eai:acl.* AS * eai:data AS constraint\
| sort 0 title\
| table title constraint\
| rename constraint AS _raw\
| spath path=objects{}.constraints{}.search output=constraint\
| spath path=objects{}.baseSearch           output=baseSearch\
| eval baseSearch = coalesce(mvindex(constraint, 0), mvindex(baseSearch, 0))\
| table title baseSearch\
| rename COMMENT AS "Replace the existing macro call with the broadest possible net to search for events we might be missing now"\
| rex field=baseSearch mode=sed "s/`cim_.+?_indexes`/(index=* OR index=_*)/g"\
| rename COMMENT AS "Some DMs have extra stuff in the baseSearch that should not be there (e.g. 'Endpoint' has '| eval ...'); strip it"\
| rex field=baseSearch mode=sed "s/\|.*$// s/^/(/ s/$/)/"\
| rename TRACE AS "END MACRO 'CIM_Toolkit_Extract_BaseSearch_SPL'"
errormsg = DESCRIPTION: Author = Gregg Woodcock <woodcock@Splunxter.com>
iseval = 0

[CIM_Toolkit_Extract_Node_List]
definition = rest /servicesNS/-/Splunk_SA_CIM/data/models splunk_server=local\
| rename TRACE AS "BEGIN MACRO 'CIM_Toolkit_Extract_Node_List'"\
| search eai:acl.app="Splunk_SA_CIM" AND NOT title="Splunk_Audit"\
| dedup id\
| rename eai:acl.* AS * eai:data AS constraint\
| sort 0 title\
| rename constraint AS _raw\
| fields _raw eai:acl.app eai:acl.owner eai:acl.sharing disabled title acceleration acceleration.backfill_time eai:data *\
| table _raw title\
| rex mode=sed "s/\"fields\":\s*\[[^]]+\]//g"\
| rex max_match=0 "(?ms)(?<keepers>\"objectName\": .*?\"parentName\": [^\r\n]+)"\
| table keepers title\
| mvexpand keepers\
| rename keepers AS _raw\
| rex mode=sed "s/\":\s*/=/g s/[\r\n\s]+\"/ /g s/^\"//"\
| kv\
| rename TRACE AS "END MACRO 'CIM_Toolkit_Extract_Node_List'"
errormsg = DESCRIPTION: Author = Gregg Woodcock <woodcock@Splunxter.com>
iseval = 0

[CIM_Toolkit_Normalize_Fieldnames]
definition = rename TRACE AS "BEGIN MACRO 'CIM_Toolkit_Normalize_Fieldnames'"\
| rename COMMENT AS "BE SURE TO START at the leaves (maximum depth) of the DM tree nodes *FIRST*!"\
| rename Web.Storage.* AS *\
| rename Web.Proxy.* AS *\
| rename Web.* AS *\
| rename Vulnerabilities.Medium_Vulnerabilities.* AS *\
| rename Vulnerabilities.Low_Informational_Vulnerabilities.* AS *\
| rename Vulnerabilities.High_Critical_Vulnerabilities.* AS *\
| rename Vulnerabilities.* AS *\
| rename Updates.Restart_Required_Updates.* AS *\
| rename Updates.Installed_Updates.* AS *\
| rename Updates.Available_Updates.* AS *\
| rename Updates.* AS *\
| rename Update_Errors.* AS *\
| rename Untagged_Events.* AS *\
| rename Ticket_Management.* AS *\
| rename Splunk_Audit.* AS *\
| rename Signatures.* AS *\
| rename Services.* AS *\
| rename Registry.* AS *\
| rename Processes.* AS *\
| rename Ports.* AS *\
| rename Performance.* AS *\
| rename Network_Traffic.* AS *\
| rename Network_Sessions.* AS *\
| rename Network_Resolution.* AS *\
| rename Malware_Operations.* AS *\
| rename Malware_Attacks.Deferred_Malware.* AS *\
| rename Malware_Attacks.Blocked_Malware.* AS *\
| rename Malware_Attacks.Allowed_Malware.* AS *\
| rename Malware_Attacks.* AS *\
| rename Malware.* AS *\
| rename JVM.Threading.* AS *\
| rename JVM.Runtime.* AS *\
| rename JVM.OS.* AS *\
| rename JVM.Memory.* AS *\
| rename JVM.Compilation.* AS *\
| rename JVM.Classloading.* AS *\
| rename JVM.* AS *\
| rename Intrusion_Detection.* AS *\
| rename Interprocess_Messaging.* AS *\
| rename IDS_Attacks.Network_IDS_Attacks.* AS *\
| rename IDS_Attacks.Host_IDS_Attacks.* AS *\
| rename IDS_Attacks.Application_IDS_Attacks.* AS *\
| rename IDS_Attacks.* AS *\
| rename Filesystem.* AS *\
| rename Email.* AS *\
| rename Databases.* AS *\
| rename Data_Access.* AS *\
| rename DNS.* AS *\
| rename DLP_Incidents.* AS *\
| rename Compute_Inventory.* AS *\
| rename Change_Analysis.* AS *\
| rename Certificates.* AS *\
| rename Authentication.Successful_Authentication.* AS *\
| rename Authentication.Privileged_Authentication.Successful_Privileged_Authentication.* AS *\
| rename Authentication.Privileged_Authentication.Failed_Privileged_Authentication.* AS *\
| rename Authentication.Privileged_Authentication.* AS *\
| rename Authentication.Insecure_Authentication.* AS *\
| rename Authentication.Failed_Authentication.* AS *\
| rename Authentication.Default_Authentication.Successful_Default_Authentication.* AS *\
| rename Authentication.Default_Authentication.Failed_Default_Authentication.* AS *\
| rename Authentication.Default_Authentication.* AS *\
| rename Authentication.* AS *\
| rename Application_State.* AS *\
| rename All_Traffic.Traffic_By_Action.Blocked_Traffic.* AS *\
| rename All_Traffic.Traffic_By_Action.Allowed_Traffic.* AS *\
| rename All_Traffic.Traffic_By_Action.* AS *\
| rename All_Traffic.* AS *\
| rename All_Ticket_Management.Problem.* AS *\
| rename All_Ticket_Management.Incident.* AS *\
| rename All_Ticket_Management.Change.* AS *\
| rename All_Ticket_Management.* AS *\
| rename All_Sessions.VPN.* AS *\
| rename All_Sessions.Session_Start.* AS *\
| rename All_Sessions.Session_End.* AS *\
| rename All_Sessions.DHCP.* AS *\
| rename All_Sessions.* AS *\
| rename All_Performance.Storage.* AS *\
| rename All_Performance.OS.Uptime.* AS *\
| rename All_Performance.OS.Timesync.* AS *\
| rename All_Performance.OS.* AS *\
| rename All_Performance.Network.* AS *\
| rename All_Performance.Memory.* AS *\
| rename All_Performance.Facilities.* AS *\
| rename All_Performance.CPU.* AS *\
| rename All_Performance.* AS *\
| rename All_Messaging.* AS *\
| rename All_Inventory.Virtual_OS.Tools.* AS *\
| rename All_Inventory.Virtual_OS.Snapshot.* AS *\
| rename All_Inventory.Virtual_OS.* AS *\
| rename All_Inventory.User.Default_Accounts.* AS *\
| rename All_Inventory.User.Cleartext_Passwords.* AS *\
| rename All_Inventory.User.* AS *\
| rename All_Inventory.Storage.* AS *\
| rename All_Inventory.OS.* AS *\
| rename All_Inventory.Network.* AS *\
| rename All_Inventory.Memory.* AS *\
| rename All_Inventory.CPU.* AS *\
| rename All_Inventory.* AS *\
| rename All_Email.Filtering.* AS *\
| rename All_Email.Delivery.* AS *\
| rename All_Email.Content.* AS *\
| rename All_Email.* AS *\
| rename All_Databases.Database_Query.Tablespace.* AS *\
| rename All_Databases.Database_Query.Query_Stats.* AS *\
| rename All_Databases.Database_Query.* AS *\
| rename All_Databases.Database_Instance.Session_Info.* AS *\
| rename All_Databases.Database_Instance.Lock_Info.* AS *\
| rename All_Databases.Database_Instance.Instance_Stats.* AS *\
| rename All_Databases.Database_Instance.* AS *\
| rename All_Databases.* AS *\
| rename All_Changes.Network_Changes.Device_Restarts.* AS *\
| rename All_Changes.Network_Changes.* AS *\
| rename All_Changes.Instance_Changes.* AS *\
| rename All_Changes.Endpoint_Changes.Registry_Changes.* AS *\
| rename All_Changes.Endpoint_Changes.Other_Endpoint_Changes.* AS *\
| rename All_Changes.Endpoint_Changes.Filesystem_Changes.* AS *\
| rename All_Changes.Endpoint_Changes.Endpoint_Restarts.* AS *\
| rename All_Changes.Endpoint_Changes.* AS *\
| rename All_Changes.Auditing_Changes.* AS *\
| rename All_Changes.Account_Management.Accounts_Updated.* AS *\
| rename All_Changes.Account_Management.Accounts_Deleted.* AS *\
| rename All_Changes.Account_Management.Accounts_Created.* AS *\
| rename All_Changes.Account_Management.Account_Lockouts.* AS *\
| rename All_Changes.Account_Management.* AS *\
| rename All_Changes.* AS *\
| rename All_Certificates.SSL.* AS *\
| rename All_Certificates.* AS *\
| rename All_Application_State.Services.* AS *\
| rename All_Application_State.Processes.* AS *\
| rename All_Application_State.Ports.* AS *\
| rename All_Application_State.* AS *\
| rename Alerts.* AS *\
| rename TRACE AS "END MACRO 'CIM_Toolkit_Normalize_Fieldnames'"
errormsg = DESCRIPTION: NOTE! This macro was automatically generated by "CIM_Toolkit_Generate_Renames" macro!

[drop_dm_object_name]
definition = `CIM_Toolkit_Normalize_Fieldnames`
errormsg = DESCRIPTION: Original macro requires an argument specifying a datamodel prefix; this one does not.
iseval = 0

[CIM_Toolkit_Generate_Renames]
definition = `CIM_Toolkit_Generate_Renames(*)`
errormsg = DESCRIPTION: Author = Gregg Woodcock <woodcock@Splunxter.com>
iseval = 0

[CIM_Toolkit_Generate_Renames(1)]
args = datamodelFilterCIM_INPUT
definition = `CIM_Toolkit_Extract_Node_List`\
| rename TRACE AS "BEGIN MACRO 'CIM_Toolkit_Generate_Renames(1)'"\
| search title IN("$datamodelFilterCIM_INPUT$")\
| search parentName = "Base*"\
| fields - _raw displayName\
| appendpipe [\
| map maxsearches=999 search="\
| `CIM_Toolkit_Extract_Node_List`\
| search title=\"$title$\" AND parentName=\"$objectName$\"\
| stats values(objectName) AS child1 BY title parentName\
| eval parentName=\"$parentName$\"\
| eval objectName=\"$objectName$\"\
"]\
| fillnull value="" child1\
| mvexpand child1\
| appendpipe [\
| map maxsearches=999 search="\
| `CIM_Toolkit_Extract_Node_List`\
| search title=\"$title$\" AND parentName=\"$child1$\"\
| stats values(objectName) AS child2 BY title parentName\
| eval parentName=\"$parentName$\"\
| eval objectName=\"$objectName$\"\
| eval child1=\"$child1$\"\
"]\
| reverse\
| dedup title parentName objectName child1\
| fillnull value="" child2\
| mvexpand child2\
| appendpipe [\
| map maxsearches=999 search="\
| `CIM_Toolkit_Extract_Node_List`\
| search title=\"$title$\" AND parentName=\"$child2$\"\
| stats values(objectName) AS child3 BY title parentName\
| eval parentName=\"$parentName$\"\
| eval objectName=\"$objectName$\"\
| eval child1=\"$child1$\"\
| eval child2=\"$child2$\"\
"]\
| reverse\
| dedup title parentName objectName child1 child2\
| fillnull value="" child3\
| mvexpand child3\
| eventstats dc(child1) AS dc_child1 BY title parentName objectName\
| where len(child1)>0 OR dc_child1==1\
| fields - keep_triple_null dc_child1\
| foreach child* [ eval <<FIELD>> = if(len(<<FIELD>>)>1, <<FIELD>>, null()) ]\
| eval rename = mvappend(\
"| rename " . objectName . "." . child1 . "." . child2 . "." . child3 . ".* AS *",\
"| rename " . objectName . "." . child1 . "." . child2 . ".* AS *",\
"| rename " . objectName . "." . child1 . ".* AS *",\
"| rename " . objectName . ".* AS *")\
| eval rename = if(parentName=="BaseSearch", "| rename " . objectName . ".* AS *", rename)\
| stats values(rename) AS rename ```BY title <- DO NOT DO THIS!  Remain agnostic, in case of doubles (e.g. Change vs. Change_Analysis)```\
| mvexpand rename\
| eval _len=len(rename)\
| sort 0 - _len + rename\
| sort 0 - rename - _len\
| reverse\
| append [\
| makeresults\
| eval rename = mvappend(\
"| rename COMMENT AS \"BE SURE TO START at the leaves (maximum depth) of the DM tree nodes *FIRST*!\"",\
"| rename CREATED AS \"SPL auto-generated against CIM version " . [\
| rest /services/apps/local splunk_server=local\
| search title="Splunk_SA_CIM"\
| appendpipe [ stats count AS version | where version==0 ]\
| table label title version\
| eval version = "\"" . version . "\""\
| return $version\
] . " by `CIM_Toolkit_Generate_Renames` macro on " . strftime(now(), "%F %T %z") . ".\"",\
"rename TRACE AS \"BEGIN MACRO 'CIM_Toolkit_Normalize_Fieldnames'\"")\
| fields - _time\
| mvexpand rename ]\
| reverse\
| append [\
| makeresults\
| eval rename = "| rename TRACE AS \"END MACRO 'CIM_Toolkit_Normalize_Fieldnames'\""\
| fields - _time\
| mvexpand rename ]\
| streamstats count\
| eval rename = printf("%03d", count) . "::" . rename\
| stats values(rename) AS rename\
| rex field=rename mode=sed "s/^\d+:://"\
| nomv rename\
| eval rename = replace(rename, " \| ", "\
| ")\
| rename TRACE AS "END MACRO 'CIM_Toolkit_Generate_Renames(1)'"
errormsg = DESCRIPTION: This is the main guts for the "CIM_Toolkit_Normalize_Fieldnames" macro

[CIM_Toolkit_isempty(1)]
args = fieldName_INPUT
definition = (isnull($fieldName_INPUT$) OR $fieldName_INPUT$=="")
errormsg = DESCRIPTION: Author = Gregg Woodcock <woodcock@Splunxter.com>
iseval = 0

[isnull(1)]
args = fieldName_INPUT
definition = `CIM_Toolkit_isempty($fieldName_INPUT$)`
errormsg = DESCRIPTION: The built in 'isnull' function does not handle the "empty" case; it would be better to use this macro.
iseval = 0
