####################################
#          Base Macro              #
####################################
[ns_index]
definition = index=netscaler

[ns_appflow]
definition = `ns_index` sourcetype=ipfix OR sourcetype=appflow

[ns]
definition = `ns_index` sourcetype=ns_log

[ns_aaa]
definition = `ns` AAA

[ns_ui]
definition = `ns` UI

[ns_sslvpn]
definition = `ns` SSLVPN

[ns_event]
definition = `ns` EVENT

[ns_ssllog]
definition = `ns` SSLLOG

[ns_appfw]
definition = `ns` APPFW

[ns_tcp]
definition = `ns` TCP

[ns_routing]
definition = `ns` ROUTING

[ns_pitboss]
definition = `ns` PITBOSS

[ns_cvpn]
definition = `ns` CVPN

####################################
#         DataCube Macros          #
####################################
[NetScaler-Syslog-LB-DataCube]
definition = `ns_tcp` | bin _time span=5m | convert timeformat="%m/%d/%Y:%T" mktime(start_time) as start mktime(end_time) as end | eval duration=end-start | fields src_ip, dst_ip, dst_port, total_bytes_recv, total_bytes_send, duration, _time
