
[Apple Airport - Host - Ping Test (Runs every 10 mins)]
action.email.show_password = 1
action.email.useNSSubject = 1
alert.track = 0
cron_schedule = */10 * * * *
description = Pings all Apple Airport base stations that have been observed in the last 30 days.
enableSched = 1
search = | inputlookup access_points.csv \
| map search="| ping host=$host$ count=1 | eval dest=if(isnull(dest),host,dest) | fields dest sent received packet_loss min_ping avg_ping max_ping jitter | eval row="Value" | join [| makeresults | eval time=now()]" \
| rename time as "_time"\
| table _time dest avg_ping *\
\
| collect `airport_collection_indexes` sourcetype=ping_stats

[Apple Airport - Hosts - Generate Host Lists]
action.email.show_password = 1
action.email.useNSSubject = 1
alert.track = 0
cron_schedule = 30 * * * *
description = Analyses indexes for apple airport hosts
dispatch.earliest_time = -30d
dispatch.latest_time = now
enableSched = 1
search = `appleairportindexes` \
 sourcetype="appleairport"\
| table host \
| dedup host \
| outputlookup access_points.csv

[Apple Airport - Hosts - Obtain IP Address]
action.email.show_password = 1
action.email.useNSSubject = 1
alert.track = 0
cron_schedule = 0 3 * * *
description = Obtains the latest IP Address for access points.
dispatch.earliest_time = -24h
dispatch.latest_time = now
enableSched = 1
search = | inputlookup access_points.csv \
| map search="| nslookup $host$  |  eval filler="No IP Listed" | eval a=if(isnull(a),filler,a) | fields query a" \
| rename time as "_time" query as host a as src_ip\
| table host src_ip\
| outputlookup access_point_ipaddress.csv

[Apple Airport - Inventory Lookup]
action.email.show_password = 1
action.email.useNSSubject = 1
alert.track = 0
cron_schedule = 0 */6 * * *
description = This search merges two lookups together that can be quickly referenced by dashboards.
display.general.timeRangePicker.show = 0
enableSched = 1
search = index=main source="airport_assets" sourcetype="airport_assets" \
| stats first(*) by basestation\
| rename \
"first(Active_Service)" as active_service \
 basestation as host\
"first(comments_content)" as comments\
"first(contactname_content)" as "contact_details"\
"first(mgmt_content)" as "remote_managed"\
"first(physicalarea_content)" as "physical_location"\
"first(sitename_content)" as "site_name"\
"first(submitting_username)" as "updated_by"\
| lookup access_point_ipaddress.csv host OUTPUT src_ip\
| table\
 host \
 site_name \
 physical_location \
 active_service \
 remote_managed \
 contact_details \
 updated_by\
 src_ip\
 | outputlookup asset_inventory_lookup.csv
