[cimindexfilter-mapmacro(2)]
args = filter,title
definition = $filter$ |   append [| makeresults |  eval index="empty_index" | eval title="$title$"]
iseval = 0
[cim_indexfiltering_title(1)]
args = title
definition = eval title="$title$"
iseval = 0
[cim_indexfiltering_mapmacro(3)]
args = dmzero,dmone,title
definition = from datamodel=$dmzero$ where nodename=$dmone$ by index | eval title="$title$"
iseval = 0
