[SYSMON Integration Framework - 10 files or more creation per 1 min alert]
action.email.useNSSubject = 1
action.logevent = 1
action.logevent.param.event = $result._time$ Name="Huge count of new files" Image=$result.Image$ Computer=$result.Computer$ Count=$result.count$
action.logevent.param.index = sif
action.logevent.param.source = sif
action.logevent.param.sourcetype = sif
alert.digest_mode = 0
alert.suppress = 0
alert.track = 0
counttype = number of events
cron_schedule = */5 * * * *
dispatch.earliest_time = -5m
dispatch.latest_time = now
display.general.type = statistics
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = SOCPrimeSYSMONIntegrationFrameworkBasic
request.ui_dispatch_view = search
search = index=*  sourcetype="xmlwineventlog:microsoft-windows-sysmon/operational" EventDescription="File Create Time" | streamstats time_window=1m count(EventDescription) AS "new_files" by Computer | search new_files>10 | fields + Image Computer | bin _time span=1m | stats count by _time Image Computer

[SYSMON Integration Framework - Long commands detection]
action.email.useNSSubject = 1
action.logevent = 1
action.logevent.param.event = $result._time$ Name="Long commands running"   Image="$result.Image$"  CommandLine="$result.CommandLine$" ParentImage="$result.ParentImage$" ParentCommandLine="$result.ParentCommandLine$" c_length=$result.c_length$ Computer="$result.Computer$"
action.logevent.param.index = sif
action.logevent.param.source = sif
action.logevent.param.sourcetype = sif
alert.digest_mode = 0
alert.suppress = 0
alert.track = 0
counttype = number of events
cron_schedule = */5 * * * *
description = Detect long  commands that most probably will include obfuscated malicious code by length of command
dispatch.earliest_time = -5m
dispatch.latest_time = now
display.general.type = statistics
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = SOCPrimeSYSMONIntegrationFrameworkBasic
request.ui_dispatch_view = search
search = index =* sourcetype="xmlwineventlog:microsoft-windows-sysmon/operational" EventCode=1 (Image="*cmd.exe" OR Image="*powershell.exe") | eval   c_length=len(CommandLine) | where c_length>500 | table _time, Computer, User, Image, CommandLine, ParentImage, ParentCommandLine c_length

[SYSMON Ingegration Farmework - Suspicious child process running]
action.email.useNSSubject = 1
action.logevent = 1
action.logevent.param.event = $result._time$ Name="Suspicious child process running"   Image="$result.Image$" CommandLine="$result.CommandLine$" ParentImage="$result.ParentImage$" Computer="$result.Computer$"
action.logevent.param.index = sif
action.logevent.param.source = sif
action.logevent.param.sourcetype = sif
alert.digest_mode = 0
alert.suppress = 0
alert.track = 0
counttype = number of events
cron_schedule = */5 * * * *
dispatch.earliest_time = -5m
dispatch.latest_time = now
display.general.type = statistics
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = SOCPrimeSYSMONIntegrationFrameworkBasic
request.ui_dispatch_view = search
search = index=* source="WinEventLog:Microsoft-Windows-Sysmon/Operational"  EventCode=1  ( ParentImage="*winword.exe" OR ParentImage="*outlook.exe" OR ParentImage="*excel.exe" OR ParentImage="*powerpnt.exe" OR ParentImage="*iexplore.exe" OR ParentImage="*firefox.exe" OR ParentImage="*chrome.exe") AND (Image="*powershell.exe" OR Image="*cmd.exe" OR Image="*cscript.exe" OR Image="*wscript.exe" OR Image="*rundll32.exe") | table _time ParentImage Image CommandLine Computer

[SYSMON Integration Framework - Non- browsers executables direct connections to Internet]
action.email.useNSSubject = 1
action.logevent = 1
action.logevent.param.event = $result._time$ Name="Non- browsers executables direct connections to Internet"   Image="$result.Image$"  SourceIp="$result.SourceIp$"  DestinationIp="$result.DestinationIp$" action=$result.action$ Computer=$result.Computer$
action.logevent.param.index = sif
action.logevent.param.source = sif
action.logevent.param.sourcetype = sif
alert.digest_mode = 0
alert.suppress = 0
alert.track = 0
counttype = number of events
cron_schedule = */5 * * * *
dispatch.earliest_time = -5m
dispatch.latest_time = now
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.charting.chart = line
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = SOCPrimeSYSMONIntegrationFrameworkBasic
request.ui_dispatch_view = search
search = index=* source="WinEventLog:Microsoft-Windows-Sysmon/Operational"  EventCode=3  (Image!="*firefox.exe" OR Image!="*iexplore.exe" OR Image!="chrome.exe") | lookup ipdomain clientip as DestinationIp OUTPUT class | fillnull class | where class=0 |  table _time Image Computer SourceIp DestinationIp action

[Files with the same hash but different names (StickyKeys backdoor detection)]
alert.track = 0
cron_schedule = 0 0 * * *
dispatch.earliest_time = -7d@h
dispatch.latest_time = now
display.general.type = statistics
display.page.search.tab = statistics
enableSched = 1
request.ui_dispatch_view = search
search = index=* source="WinEventLog:Microsoft-Windows-Sysmon/Operational"  EventCode=1  | dedup host,Image | stats dc(Image) AS different_names,values(Image),values(Computer) BY Hashes | sort -different_names | where different_names>0 |  rex field=Hashes mode=sed "s/SHA256=//g" | rex field=Hashes mode=sed "s/SHA1=//g" | rex field=Hashes mode=sed "s/MD5=//g" | rename different_names as "Different Names Count" values(Image) as Image values(Computer) as Host

[Executable files, identify system files that are unique on your environment (Black Sheep detection)]
alert.track = 0
cron_schedule = 0 0 * * *
dispatch.earliest_time = -7d@h
dispatch.latest_time = now
display.general.type = statistics
enableSched = 1
search = index=* source="WinEventLog:Microsoft-Windows-Sysmon/Operational"  EventCode=1  | dedup Computer ,Image | rex field=Image "(?<Executable>[^\\\]+)$" | eval Executable=lower(Executable) | stats count by Executable,Hashes | sort +count | rename count as Count Computer as Host | table Executable Hashes Count |   rex field=Hashes mode=sed "s/SHA256=//g" | rex field=Hashes mode=sed "s/SHA1=//g" | rex field=Hashes mode=sed "s/MD5=//g"

[SYSMON Integration Framework - Potential RDP hijacking detection]
action.email.useNSSubject = 1
action.logevent = 1
action.logevent.param.event = $result._time$ Name="Potential RDP hijacking"   Image='$result.Image$'  CommandLine='$result.CommandLine$' ParentImage='$result.ParentImage$' ParentCommandLine='$result.ParentCommandLine$' Computer='$result.Computer$'
action.logevent.param.index = sif
action.logevent.param.source = sif
action.logevent.param.sourcetype = sif
alert.digest_mode = 0
alert.suppress = 0
alert.track = 0
counttype = number of events
cron_schedule = */5 * * * *
description = Potential RDP hijacking detection
dispatch.earliest_time = -5m
dispatch.latest_time = now
display.general.type = statistics
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = SOCPrimeSYSMONIntegrationFrameworkBasic
request.ui_dispatch_view = search
search = index=* source="WinEventLog:Microsoft-Windows-Sysmon/Operational" CommandLine=*tscon* EventCode=1 | table _time, Computer, User, Image, CommandLine, ParentImage, ParentCommandLine
