FIELDALIAS-dest = Endpoint AS dest
FIELDALIAS-user = User AS user
FIELDALIAS-vendor_product = sourcetype AS vendor_product
FIELDALIAS-category = Description AS category
FIELDALIAS-signature = Description AS signature
FIELDALIAS-name = Description AS name
FIELDALIAS-query = Domain AS query
FIELDALIAS-answer = Domain AS answer
FIELDALIAS-src_nt_domain = Domain AS src_nt_domain
FIELDALIAS-dest_nt_domain = Domain AS dest_nt_domain
FIELDALIAS-dest_port = DstPort AS dest_port
FIELDALIAS-SrcIP = SrcIP AS src
FIELDALIAS-src_ip = src_ip AS src
FIELDALIAS-SrcIp = SrcIp AS src
FIELDALIAS-bytes = TotalBytes AS bytes
FIELDALIAS-file_path = FilePath AS file_path
FIELDALIAS-file_name = FileName AS file_name
FIELDALIAS-status = StatusCode AS status
FIELDALIAS-file_hash = SHA256 AS file_hash
FIELDALIAS-file_size = FileSize AS file_size
FIELDALIAS-status = StatusCode AS status
FIELDALIAS-http_method = Method AS http_method
FIELDALIAS-http_referrer = Referer AS http_referrer
FIELDALIAS-src = WebSite AS src
FIELDALIAS-app = Protocol AS app
FIELDALIAS-status_detail = Detail AS status
FIELDALIAS-DstIp = DstIp AS dst

LOOKUP-authentication_event_action = authentication_action eventName OUTPUTNEW action
LOOKUP-eventtype_mapping = event_category_map eventName OUTPUTNEW event_category
