[Splunk_Health_Baseline_Ingestion_Drop]
action.email = 0
action.email.include.view_link = 0
action.email.inline = 0
action.email.sendresults = 0
action.email.show_password = 0
action.email.subject.report = 
action.email.to = 
action.email.useNSSubject = 0
alert.track = 0
cron_schedule = 0 23 * * *
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
display.events.fields = ["date_hour","date_mday","date_minute","date_month","date_second","date_wday","date_year","date_zone","host","index","linecount","punct","source","sourcetype","splunk_server","timeendpos","timestartpos","alert_type","time","eventtype","tag","tag::eventtype","error_msg","Relative_Target_Name","abandoned_channels","active_hist_searches","active_realtime_searches","average_kbps","avg_age","avg_time_spent_in_queue","bundle_dir_reaper_max_ms","bundle_dir_reaper_mean_ms","component","compute_search_quota_max_ms","compute_search_quota_mean_ms","cpu_seconds","cumulative_hits","current_queue_size","current_size","current_size_kb","destHost","destIp","destPort","dispatch_dir_reaper_max_ms","dispatch_dir_reaper_mean_ms","drop_count","enqueue_seaches_count","eps","ev","eventType","executes","fd_cache_size","files_queued","group","idx","inactive_channels","instantaneous_eps","instantaneous_kbps","kb","kbps","largest_queue_size","largest_size","log_level","max_age","max_queue_size","max_size","max_size_kb","max_time_spent_in_queue","message","mgmt_httpd","min_queue_size","name","nCurrent","new_channels","new_files_queued","processor","publisher","qsize","qwork_units","reaper","reclaimed_channels","removed_channels","series","smallest_size","sourcePort","statusee","tail","tcp_avg_thruput","tcp_Bps","tcp_eps","tcp_KBps","tcp_Kprocessed","timedout_channels","total_k_processed","udpin","workers","action","action_flags","action_source","app","app:able_to_transfer_file","app:category","app:default_ports","app:evasive","app:excessive_bandwidth","app:has_known_vulnerability","app:is_saas","app:is_sanctioned_saas","app:pervasive_use","app:prone_to_misuse","app:risk","app:subcategory","app:technology","app:tunnels_other_application","app:used_by_malware","application","bytes","bytes_in","bytes_out","client_ip","client_location","dest","dest_class","dest_interface","dest_ip","dest_location","dest_port","dest_translated_ip","dest_translated_port","dest_zone","devicegroup_level1","devicegroup_level2","devicegroup_level3","devicegroup_level4","duration","dvc","dvc_name","flags","future_use1","future_use2","future_use3","future_use4","future_use5","generated_time","http_category","log_forwarding_profile","log_subtype","packets","packets_in","packets_out","product","receive_time","repeat_count","rule","sequence_number","serial_number","server_ip","server_location","session_end_reason","session_flags","session_id","src","src_class","src_interface","src_ip","src_location","src_port","src_translated_ip","src_translated_port","src_user","src_zone","start_time","transport","type","user","vendor","vendor_action","vendor_product","virtual_system","vsys","active_searches","apiEndTime","apiStartTime","autojoin","buckets","clientip","count","elapsedTime","enable_lookups","extra_fields","file","ident","info","max_count","max_time","maxtime","method","other","output_mode","prefix","referer","remote_ttl","req_time","root","savedsearch_name","search","search_id","server","spent","status","timestamp","ttl","uri","uri_path","uri_query","use_cache","useragent","version","datasetCustomer","datasetSourceType","date","elasticInfo.date","elasticInfo.file_url","elasticInfo.filename","elasticInfo.flow_endtime","elasticInfo.flow_file_url","elasticInfo.flow_filename","elasticInfo.flow_filesize","elasticInfo.flow_length","elasticInfo.flow_starttime","elasticInfo.flowPackets","elasticInfo.mime_type","elasticInfo.orig_h","elasticInfo.orig_h_username","elasticInfo.orig_p","elasticInfo.original_file_name","elasticInfo.protocol","elasticInfo.resp_h","elasticInfo.resp_h_username","elasticInfo.resp_p","elasticInfo.size","elasticInfo.src_pcap","elasticInfo.src_pcap_url","filenameFromDataset","filenameFromPcapTraffic","filePathFromPcapTraffic","id","rank"]
display.events.maxLines = 20
display.events.type = raw
display.general.timeRangePicker.show = 0
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.patterns.sensitivity = 0.3
display.page.search.tab = statistics
display.visualizations.chartHeight = 775
display.visualizations.charting.chart = area
display.visualizations.custom.horizon_chart_app.horizon_chart.relative = 1
display.visualizations.custom.horizon_chart_app.horizon_chart.showChangeInPercent = 1
display.visualizations.custom.horizon_chart_app.horizon_chart.smoothen = 1
display.visualizations.show = 0
enableSched = 1
request.ui_dispatch_app = search
request.ui_dispatch_view = search
search = | tstats count as "old_count" where index=* AND earliest=-7d@d latest=-1d@d by index,sourcetype | join index,sourcetype type=left [ | tstats count as "new_count" where index=* AND earliest=@d latest=now by index,sourcetype] | fillnull value="n/a" | eval old_count=round((old_count/7),0)  | where old_count > new_count
