[Threat - Threat_Notable - Rule]
action.correlationsearch.enabled = 1
action.correlationsearch.label = Threat_Notable
action.customsearchbuilder.enabled = false
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable = 1
action.notable.param.rule_description = $title$
action.notable.param.rule_title = $description$
action.notable.param.security_domain = threat
action.notable.param.severity = high
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.forceCsvResults = 1
action.risk.param._risk_score = 0
action.risk = 1
action.risk.param._risk = [{"risk_object_field":"src_asset_id","risk_object_type":"network_artifacts","risk_score":4},{"threat_object_field":"dest_ip","threat_object_type":"ip_address"}]
action.risk.param._risk_message = Risk of Cyber Attack
action.risk.param.verbose = 0
action.send2uba.param.verbose = 0
action.threat_add.param.verbose = 0
action.webhook.enable_allowlist = 0
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = */5 * * * *
description = A correlational search for the Radiflow alerts which creates Threat notables
dispatch.earliest_time = -5m
dispatch.latest_time = now
dispatch.rt_backfill = 1
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = SplunkEnterpriseSecuritySuite
search = (`radiflow_alert_macro`) eventtype=CYBER_ATTACK | eval severity=case(severity=="Critical","critical",severity=="High","high",severity=="Medium","medium",serverity=="Low","low")


[Network - Network_Notable - Rule]
action.correlationsearch.enabled = 1
action.correlationsearch.label = Network_Notable
action.customsearchbuilder.enabled = false
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable = 1
action.notable.param.rule_description = $title$
action.notable.param.rule_title = $description$
action.notable.param.security_domain = network
action.notable.param.severity = medium
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.forceCsvResults = 1
action.risk = 1
action.risk.param._risk = [{"risk_object_field":"src_asset_id","risk_object_type":"network_artifacts","risk_score":2},{"threat_object_field":"dest_ip","threat_object_type":"ip_address"}]
action.risk.param._risk_message = Risk obtained for Network Alert
action.risk.param._risk_score = 0
action.risk.param.verbose = 0
action.send2uba.param.verbose = 0
action.threat_add.param.verbose = 0
action.webhook.enable_allowlist = 0
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = */5 * * * *
description = A correlational search for the Radiflow alerts which creates network notables
dispatch.earliest_time = -5m
dispatch.latest_time = now
dispatch.rt_backfill = 1
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = SplunkEnterpriseSecuritySuite
search = (`radiflow_alert_macro`) \
eventtype=NETWORK_VISIBILITY OR \
eventtype=THIRD_PARTY \
|  eval severity=case(severity=="Critical","critical",severity=="High","high",severity=="Medium","medium",serverity=="Low","low")

[Audit - Audit_Notable - Rule]
action.correlationsearch.enabled = 1
action.correlationsearch.label = Audit_Notable
action.customsearchbuilder.enabled = false
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable = 1
action.notable.param.rule_description = $title$
action.notable.param.rule_title = $description$
action.notable.param.security_domain = audit
action.notable.param.severity = low
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.forceCsvResults = 1
action.risk = 1
action.risk.param._risk = [{"risk_object_field":"src_asset_id","risk_object_type":"system","risk_score":1},{"threat_object_field":"dest_ip","threat_object_type":"ip_address"}]
action.risk.param._risk_message = Risk Analysis for System
action.risk.param._risk_score = 0
action.risk.param.verbose = 0
action.send2uba.param.verbose = 0
action.threat_add.param.verbose = 0
action.webhook.enable_allowlist = 0
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = */5 * * * *
description = A correlational search for the Radiflow alerts which creates audit notables
dispatch.earliest_time = -5m
dispatch.latest_time = now
dispatch.rt_backfill = 1
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = SplunkEnterpriseSecuritySuite
search = (`radiflow_alert_macro`) eventtype=SYSTEM |  eval severity=case(severity=="Critical","critical",severity=="High","high",severity=="Medium","medium",serverity=="Low","low")


[Audit - Audit_Policy_Notable - Rule]
action.correlationsearch.enabled = 1
action.correlationsearch.label = Audit_Policy_Notable
action.customsearchbuilder.enabled = false
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable = 1
action.notable.param.rule_description = $title$
action.notable.param.rule_title = $description$
action.notable.param.security_domain = audit
action.notable.param.severity = medium
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.forceCsvResults = 1
action.risk = 1
action.risk.param._risk = [{"risk_object_field":"src_asset_id","risk_object_type":"network_artifacts","risk_score":2},{"threat_object_field":"dest_ip","threat_object_type":"ip_address"}]
action.risk.param._risk_message = Risk Analysis for Policy Monitor
action.risk.param._risk_score = 0
action.risk.param.verbose = 0
action.send2uba.param.verbose = 0
action.threat_add.param.verbose = 0
action.webhook.enable_allowlist = 0
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = */5 * * * *
description = a correlational search for the Radiflow alerts which creates Policy Monitoring notables
dispatch.earliest_time = -5m
dispatch.latest_time = now
dispatch.rt_backfill = 1
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = SplunkEnterpriseSecuritySuite
search = (`radiflow_alert_macro`) eventtype=POLICY_MONITOR | eval severity=case(severity=="Critical","critical",severity=="High","high",severity=="Medium","medium",serverity=="Low","low")


[Radiflow- Populate OT Asset Lookup]
action.email.useNSSubject = 1
action.keyindicator.invert = 0
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.forceCsvResults = 1
action.risk.param.verbose = 0
action.send2uba.param.verbose = 0
action.threat_add.param.verbose = 0
action.webhook.enable_allowlist = 0
alert.track = 0
cron_schedule = 0 * * * *
description = This search runs daily and generates a list of assets in the last 30 days. This list can then be exported and used in Enterprise Security and the OT Security Add-on for Splunk.
dispatch.earliest_time = -30d@d
dispatch.latest_time = now
enableSched = 1
search = index="radiflow" sourcetype="Radiflow:Assets" category="*ot*"\
| eval ip=if(ip="255.255.255.255", "", ip)\
| dedup asset_id\
| eval hw_join=((lower(nt_host)+":")+asset_id)\
| eval category = "ot"\
| table  asset_id,asset_model,asset_status,asset_system,asset_type,asset_vendor,asset_version,asset_criticality,bunit,category,city,classification,country,dns,end_of_support,exposure,hw_join,ip,is_expected,lat,lon,location,mac,nt_host,owner,parent_asset_id,pci_domain,priority,product_details,requires_av,serial,should_timesync,should_update,site_id,vlan,zone\
| outputlookup append=T ot_asset_lookup.csv


[Radiflow- Populate OT Software Asset Lookup]
action.email.useNSSubject = 1
action.keyindicator.invert = 0
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.forceCsvResults = 1
action.risk.param.verbose = 0
action.send2uba.param.verbose = 0
action.threat_add.param.verbose = 0
action.webhook.enable_allowlist = 0
alert.track = 0
cron_schedule = 0 * * * *
description = This search runs daily and generates a list of assets in the last 30 days. This list can then be exported and used in Enterprise Security and the OT Security Add-on for Splunk.
dispatch.earliest_time = -30d@d
dispatch.latest_time = now
enableSched = 1
search = index="radiflow" sourcetype="Radiflow:SoftwareAssets" category="*OperatingSystem*"\
| eval ip=if(ip="255.255.255.255", "", ip)\
| eval asset_id=nt_host\
| eval hw_join=((lower(nt_host)+":")+asset_id)\
| eval asset_name = operating_system\
| eval category = "ot"\
| table  asset_id,asset_model,asset_status,asset_system,asset_type,asset_vendor,asset_version,asset_criticality,bunit,category,city,classification,country,dns,end_of_support,exposure,hw_join,ip,is_expected,lat,lon,location,mac,nt_host,owner,parent_asset_id,pci_domain,priority,product_details,requires_av,serial,should_timesync,should_update,site_id,vlan,zone\
| outputlookup append=T ot_asset_lookup.csv


[Radiflow Populate ot_asset_pri_matrix]
action.email.useNSSubject = 1
action.keyindicator.invert = 0
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.forceCsvResults = 1
action.risk.param.verbose = 0
action.send2uba.param.verbose = 0
action.threat_add.param.verbose = 0
action.webhook.enable_allowlist = 0
alert.track = 0
cron_schedule = 0 * * * *
description = This search runs daily and generates a list of assets in the last 30 days.  This list can then be exported and used in Enterprise Security and the OT Security Add-on for Splunk.
dispatch.earliest_time = -30d@d
dispatch.latest_time = now
enableSched = 1
search = index="radiflow" sourcetype="Radiflow:Assets" \
| eval ip=if(ip="255.255.255.255", "", ip)\
| dedup asset_id\
| eval asset_criticality=case(asset_criticality == 1 OR asset_criticality == 2 OR asset_criticality == 3,"low",asset_criticality == 4 OR asset_criticality == 5 OR asset_criticality == 6 OR asset_criticality == 7,"medium",asset_criticality == 8 OR asset_criticality == 9 OR asset_criticality == 10,"high",asset_criticality == "","unknown")\
| eval priority_join= if(isnull(asset_type),"",lower(asset_type))+":"+if(isnull(exposure),"",lower(exposure))+":"+if(isnull(location),"",lower(location))\
| table  asset_type,exposure,location,asset_count,asset_criticality,priority_join\
| outputlookup ot_asset_pri_matrix.csv

[Audit - User_Activity_Audit - Rule]
action.correlationsearch.enabled = 1
action.correlationsearch.label = User_Activity_Audit
action.customsearchbuilder.enabled = false
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable = 1
action.notable.param.rule_description = $action$
action.notable.param.rule_title = $title$
action.notable.param.security_domain = audit
action.notable.param.severity = low
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk = 1
action.risk.forceCsvResults = 1
action.risk.param._risk = [{"risk_object_field":"src_asset_id","risk_object_type":"system","risk_score":2},{"threat_object_field":"dest_ip","threat_object_type":"ip_address"}]
action.risk.param._risk_message = Risk Analysis for User Activity
action.risk.param._risk_score = 0
action.risk.param.verbose = 0
action.send2uba.param.verbose = 0
action.threat_add.param.verbose = 0
action.webhook.enable_allowlist = 0
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = */5 * * * *
description = A correlational search for the Radiflow User Activity which creates audit notables
dispatch.earliest_time = -5m
dispatch.latest_time = now
dispatch.rt_backfill = 1
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = SplunkEnterpriseSecuritySuite
search = index="radiflow" sourcetype="Radiflow:Syslog" eventtype=User_Activity_Event

[Endpoint - Endpoint_Notable - Rule]
action.correlationsearch.enabled = 1
action.correlationsearch.label = Endpoint_Notable
action.customsearchbuilder.enabled = false
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable = 1
action.notable.param.rule_description = $title$
action.notable.param.rule_title = $description$
action.notable.param.security_domain = endpoint
action.notable.param.severity = medium
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk = 1
action.risk.forceCsvResults = 1
action.risk.param._risk = [{"risk_object_field":"src_asset_id","risk_object_type":"other","risk_score":2},{"threat_object_field":"dest_ip","threat_object_type":"ip_address"}]
action.risk.param._risk_message = Risk Analysis for Asset Management
action.risk.param._risk_score = 0
action.risk.param.verbose = 0
action.send2uba.param.verbose = 0
action.threat_add.param.verbose = 0
action.webhook.enable_allowlist = 0
alert.suppress = 0
alert.track = 1
counttype = number of events
cron_schedule = */5 * * * *
description = A correlational search for the Radiflow alerts which creates identity notables
dispatch.earliest_time = -5m
dispatch.latest_time = now
dispatch.rt_backfill = 1
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = SplunkEnterpriseSecuritySuite
search = (`radiflow_alert_macro`) eventtype=ASSET_MANAGEMENT | eval severity=case(severity=="Critical","critical",severity=="High","high",severity=="Medium","medium",serverity=="Low","low")
