




	[Group Policy Changed]
	[Audit - Group Policy Changed]
	action.email = 0
	action.email.inline = 1
	action.email.sendresults = 1
	action.email.useNSSubject = 1
	action.keyindicator.invert = 0
	action.makestreams.param.verbose = 0
	action.nbtstat.param.verbose = 0
	action.notable.param.verbose = 0
	action.nslookup.param.verbose = 0
	action.ping.param.verbose = 0
	action.risk.forceCsvResults = 1
	action.risk.param.verbose = 0
	action.threat_add.param.verbose = 0
	alert.suppress = 0
	alert.track = 0
	counttype = number of events
	cron_schedule = 0 0 * * *
	dispatch.earliest_time = -1d
	dispatch.latest_time = now
	display.general.type = statistics
	display.page.search.mode = verbose
	display.page.search.tab = statistics
	enableSched = 1
	quantity = 0
	relation = greater than
	request.ui_dispatch_app =Domain-Controller-Monitoring 
	request.ui_dispatch_view = search
	search = |tstats count  from datamodel=Group_Policy by _time gpo.Account_Name  gpo.ComputerName gpo.Name gpo.Object_Server gpo.Object_Name|rename gpo.Account_Name as "Account Name" gpo.ComputerName as "Computer Name" gpo.Name as "GPO Name" gpo.Object_Server as "Object Server" gpo.Object_Name as "Object Name"
	[Threat - Login from Disabled Account]
	action.email = 0
	action.email.allow_empty_attachment = 0
	action.email.inline = 1
	action.email.sendresults = 1
	action.email.useNSSubject = 1
	action.keyindicator.invert = 0
	action.makestreams.param.verbose = 0
	action.nbtstat.param.verbose = 0
	action.notable.param.verbose = 0
	action.nslookup.param.verbose = 0
	action.ping.param.verbose = 0
	action.risk.forceCsvResults = 1
	action.risk.param.verbose = 0
	action.threat_add.param.verbose = 0
	alert.digest_mode = 0
	alert.suppress = 0
	alert.track = 0
	counttype = number of events
	cron_schedule = 0 1 * * *
	dispatch.earliest_time = -1d
	dispatch.latest_time = now
	display.general.type = statistics
	display.page.search.tab = statistics
	enableSched = 1
	quantity = 0
	relation = greater than
	request.ui_dispatch_app = Domain-Controller-Monitoring
	request.ui_dispatch_view = search
	search = | tstats count from datamodel=Login_Failures where "Disabled" by _time Loginfailed.Account_Name Loginfailed.Source_Network_Address Loginfailed.ComputerName Loginfailed.Failure_Reason \
 		| search Loginfailed.Account_Name!="-" \
 		| rename Loginfailed.* as *  Source_Network_Address as "Source IP"
	[Threat - Login from Locked out Account]
	action.email = 0
	action.email.inline = 1
	action.email.sendresults = 1
	action.email.useNSSubject = 1
	action.keyindicator.invert = 0
	action.makestreams.param.verbose = 0
	action.nbtstat.param.verbose = 0
	action.notable.param.verbose = 0
	action.nslookup.param.verbose = 0
	action.ping.param.verbose = 0
	action.risk.forceCsvResults = 1
	action.risk.param.verbose = 0
	action.threat_add.param.verbose = 0
	alert.suppress = 0
	alert.track = 0
	counttype = number of events
	cron_schedule = 0 0 * * *
	dispatch.earliest_time = -1d
	dispatch.latest_time = now
	display.general.type = statistics
	display.page.search.mode = verbose
	display.page.search.tab = statistics
	enableSched = 1
	quantity = 0
	relation = greater than
	request.ui_dispatch_app = Domain-Controller-Monitoring
	request.ui_dispatch_view = search
	search = | tstats count from datamodel=Login_Failures where "locked" by _time Loginfailed.Account_Name Loginfailed.Source_Network_Address Loginfailed.ComputerName Loginfailed.Failure_Reason \
 		| search Loginfailed.Account_Name!="-" \
 		| rename Loginfailed.* as *  Source_Network_Address as "Source IP"
	[Audit - Avo User Modified]
	action.email = 0
	action.email.useNSSubject = 1
	action.keyindicator.invert = 0
	action.makestreams.param.verbose = 0
	action.nbtstat.param.verbose = 0
	action.notable.param.verbose = 0
	action.nslookup.param.verbose = 0
	action.ping.param.verbose = 0
	action.risk.forceCsvResults = 1
	action.risk.param.verbose = 0
	action.threat_add.param.verbose = 0
	alert.suppress = 0
	alert.track = 0
	counttype = number of events
	cron_schedule = 0 * * * *
	dispatch.earliest_time = -1h
	dispatch.latest_time = now
	display.general.type = statistics
	display.page.search.mode = fast
	display.page.search.tab = statistics
	enableSched = 1
	quantity = 0
	relation = greater than
	request.ui_dispatch_app = Domain-Controller-Monitoring
	request.ui_dispatch_view = search
	search = | from datamodel:"User_Detail".Changes \
 	| rex field=_raw "EventCode=(?<result_id>\d+)" \
 	| where result_id IN (4726, 4720, 4738, 4725, 4722) \
 	| stats count by _time, Src_Account, Dest_Account, ComputerName, Domain, Msg
[Audit - Commands Ran on AD/DC]
action.email.useNSSubject = 1
action.keyindicator.invert = 0
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.forceCsvResults = 1
action.risk.param.verbose = 0
action.threat_add.param.verbose = 0
alert.suppress = 0
alert.track = 0
counttype = number of events
cron_schedule = 0 0 * * *
dispatch.earliest_time = -1d
dispatch.latest_time = now
display.general.type = statistics
display.page.search.mode = fast
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = Domain-Controller-Monitoring
request.ui_dispatch_view = search
search = `Domain-Controller-Security-index` source="*Power*" "ComputerName"="*"\
	| rex field=_raw "User =\s+.*\\\(?<Username>.*)" \
	| search Username!="SYSTEM" \
	| rex field=_raw "Message=(?<Inputs>[\D\d\n]*)Context" \
	| rex field=_raw "User =\s+.*\\\(?<Username>.*)" \
	| search Username!="SYSTEM" \
	| rex field=_raw "Message=(?<Inputs>[\D\d\n]*)Context"  \
	| rex field=Message mode=sed "s/CommandInvocation\(//g" \
	| rex field=Message mode=sed "s/\)://g" \
	| rex field=_raw "Host\s+Application\s+=\s+.*\\\(?<Application>.*)" \
	| stats c by _time Username ComputerName Message Inputs Application

[Audit - Failed RDP Sessions]
action.email.useNSSubject = 1
action.keyindicator.invert = 0
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.forceCsvResults = 1
action.risk.param.verbose = 0
action.threat_add.param.verbose = 0
alert.suppress = 0
alert.track = 0
counttype = number of events
cron_schedule = 0 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = now
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.charting.chart = area
display.visualizations.custom.type = Splunk_ML_Toolkit.ForecastViz
display.visualizations.show = 0
display.visualizations.type = singlevalue
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = Domain-Controller-Monitoring
request.ui_dispatch_view = search
search = | tstats  count from datamodel=Remote_Access_Authentication.Authentication where Authentication.EventCode="4625" by _time Authentication.EventCode Authentication.src_nt_domain Authentication.src_user Authentication.src Authentication.user Authentication.dest_nt_domain Authentication.dest Authentication.action Authentication.signature Authentication.Process_Name Authentication.Source_Port Authentication.Logon_Type Authentication.ComputerName \
	| `Drop_dm_object_name(Authentication)` \
	| rename src_nt_domain as Source_Domain src_user as Source_System src as Src_Host user as Src_Account dest_nt_domain as Domain dest as Dest_Host signature as Failure_Reason Process_Name as ProcessName Source_Port as Port Logon_Type as LogonType action as Action count as Count |bin _time span=5m|where count > 3\
	| eval Event_Time=strftime(_time,"%Y-%m-%d %H:%M:%S") \
	| search ProcessName IN ("-","C:\\Windows\\System32\\svchost.exe") ComputerName="*DC*" Port IN ("-",0) \
	| search LogonType!="4" Src_Host!="unknown" \
	| table Event_Time Src_Account Src_Host Domain Dest_Host Action LogonType Failure_Reason Count|search "Dest_Host"="*DC*"

[Successful RDP Sessions]
action.email.useNSSubject = 1
action.keyindicator.invert = 0
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.forceCsvResults = 1
action.risk.param.verbose = 0
action.threat_add.param.verbose = 0
alert.track = 0
cron_schedule = 0 0 * * 1
dispatch.earliest_time = -7d@h
dispatch.latest_time = now
display.general.type = statistics
display.page.search.mode = fast
display.page.search.tab = statistics
display.visualizations.charting.chart = area
display.visualizations.custom.type = Splunk_ML_Toolkit.ForecastViz
display.visualizations.show = 0
display.visualizations.type = singlevalue
enableSched = 1
request.ui_dispatch_app = Domain-Controller-Monitoring
request.ui_dispatch_view = search
search = | tstats  count from datamodel=Remote_Access_Authentication.Authentication where Authentication.EventCode="4648" by _time Authentication.EventCode Authentication.ComputerName Authentication.Process_Name Authentication.src_nt_domain Authentication.src_user Authentication.user Authentication.dest_nt_domain Authentication.dest Authentication.action \
	| `Drop_dm_object_name(Authentication)` \
	| rename src_nt_domain as Domain src_user as Dest_Host user as Src_Account dest_nt_domain as Source_System_Name dest as Target action as Action count as Count ComputerName as Src_Host \
	| eval Event_Time=strftime(_time,"%Y-%m-%d %H:%M:%S") \
	| search Src_Host="*DC*" Process_Name="C:\\Windows\\System32\\svchost.exe" |search Dest_Host="*DC*" |join Src_Account [|inputlookup Asset_Identity|rename user as Src_Account |stats c by  Src_Account Src_Host | sort - c |fields - c]\
	\
	| table Event_Time Src_Account Src_Host Domain Dest_Host Target Action Count

[Failed RDP Sessions]
action.email.useNSSubject = 1
action.keyindicator.invert = 0
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.forceCsvResults = 1
action.risk.param.verbose = 0
action.threat_add.param.verbose = 0
alert.track = 0
cron_schedule = 0 0 * * 1
dispatch.earliest_time = -7d@h
dispatch.latest_time = now
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.charting.chart = area
display.visualizations.custom.type = Splunk_ML_Toolkit.ForecastViz
display.visualizations.show = 0
display.visualizations.type = singlevalue
enableSched = 1
request.ui_dispatch_app = Domain-Controller-Monitoring
request.ui_dispatch_view = search
search = | tstats  count from datamodel=Remote_Access_Authentication.Authentication where Authentication.EventCode="4625" by _time Authentication.EventCode Authentication.src_nt_domain Authentication.src_user Authentication.src Authentication.user Authentication.dest_nt_domain Authentication.dest Authentication.action Authentication.signature Authentication.Process_Name Authentication.Source_Port Authentication.Logon_Type Authentication.ComputerName \
	| `Drop_dm_object_name(Authentication)` \
	| rename src_nt_domain as Source_Domain src_user as Source_System src as Src_Host user as Src_Account dest_nt_domain as Domain dest as Dest_Host signature as Failure_Reason Process_Name as ProcessName Source_Port as Port Logon_Type as LogonType action as Action count as Count \
	| eval Event_Time=strftime(_time,"%Y-%m-%d %H:%M:%S") \
	| search ProcessName IN ("-","C:\\Windows\\System32\\svchost.exe") ComputerName="*DC*" Port IN ("-",0) \
	| search LogonType!="4" Src_Host!="unknown" \
	| table Event_Time Src_Account Src_Host Domain Dest_Host Action LogonType Failure_Reason Count|search "Dest_Host"="*DC*"

[User Audit Report]
action.email.useNSSubject = 1
action.keyindicator.invert = 0
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.forceCsvResults = 1
action.risk.param.verbose = 0
action.threat_add.param.verbose = 0
alert.track = 0
cron_schedule = 0 6 * * 1
dispatch.earliest_time = -7d@h
dispatch.latest_time = now
display.general.type = statistics
display.page.search.mode = fast
display.page.search.tab = statistics
display.visualizations.show = 0
enableSched = 1
request.ui_dispatch_app = Domain-Controller-Monitoring
request.ui_dispatch_view = search
search = | from datamodel:"User_Detail" | eval Event_Time=strftime(_time,"%Y-%m-%d %H:%M:%S") |stats count by Event_Time Src_Account Dest_Account ComputerName Domain Msg|rename Src_Account as "Source Account"  Dest_Account as "Destination Account" Msg as "Message"|search "Source Account"!="*$"|search "Destination Account"!="*$"

[Domain Controller List]
action.email.useNSSubject = 1
action.keyindicator.invert = 0
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.forceCsvResults = 1
action.risk.param.verbose = 0
action.threat_add.param.verbose = 0
alert.track = 0
cron_schedule = 0 0 * * *
dispatch.earliest_time = -1d@d
dispatch.latest_time = @d
display.general.type = statistics
display.page.search.mode = fast
display.page.search.tab = statistics
display.visualizations.charting.chart = area
display.visualizations.custom.type = Splunk_ML_Toolkit.ForecastViz
display.visualizations.show = 0
display.visualizations.type = singlevalue
enableSched = 1
request.ui_dispatch_app = Domain-Controller-Monitoring
request.ui_dispatch_view = search
search = | tstats values(host) as host where `Domain-Controller-Security-index`\
	| mvexpand host \
	| rename host as "Domain Controller" \
	| join type=left "Domain Controller" \
	[| inputlookup Domain-Controller-List.csv \
	| eval matched=1] \
	| fillnull value="-" \
	| search matched="-" \
	| fields - matched c \
	| outputlookup append=true Domain-Controller-List.csv

[Audit-Local Account Logins]
action.email.useNSSubject = 1
action.keyindicator.invert = 0
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.forceCsvResults = 1
action.risk.param.verbose = 0
action.threat_add.param.verbose = 0
alert.digest_mode = 0
alert.suppress = 0
alert.track = 0
counttype = number of events
cron_schedule = 0 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = now
display.general.type = statistics
display.page.search.mode = fast
display.page.search.tab = statistics
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = Domain-Controller-Monitoring
request.ui_dispatch_view = search
search = `Domain-user` EventCode=4624 \
	| eval matched="0" \
	| stats c by  Account_Name ComputerName src_ip Account_Domain action matched \
	|search ComputerName="*" AND Account_Name!="*$"| join type=left Account_Name \
	[| inputlookup User_list.csv \
	| eval matched="1" \
	| table Account_Name matched] \
	| search matched!="1" AND Account_Name!="-" AND Account_Name!="*$" AND Account_Name!="system" AND Account_Name!="*firewall*" AND Account_Name!="*ldap*" AND Account_Name!="UMFD*" AND Account_Name!="admin*" AND Account_Name!="DWM*" AND Account_Domain!="-" AND Account_Name!="*logon*" AND Account_Domain!=`domain`|fields - matched c|rename Account_Name as "Acount Name" ComputerName as "Computer Name" src_ip as "IP" Account_Domain as "Account Domain" action as Action

[Total User's List]
action.email.useNSSubject = 1
action.keyindicator.invert = 0
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.forceCsvResults = 1
action.risk.param.verbose = 0
action.threat_add.param.verbose = 0
alert.track = 0
cron_schedule = 0 0 * * *
dispatch.earliest_time = -1d@d
dispatch.latest_time = @d
display.general.type = statistics
display.page.search.mode = fast
display.page.search.tab = statistics
display.visualizations.charting.chart = area
display.visualizations.custom.type = Splunk_ML_Toolkit.ForecastViz
display.visualizations.show = 0
display.visualizations.type = singlevalue
enableSched = 1
request.ui_dispatch_app = Domain-Controller-Monitoring
request.ui_dispatch_view = search
search = `Domain-user`  EventCode=4624 Account_Domain=`domain`.*|stats c by Account_Name|search Account_Name!="-" AND Account_Name!="*$"|fields - c|join type=left  Account_Name [|inputlookup  User_list.csv|eval matched=1]|fillnull value="-"|search matched="-"|fields - matched|outputlookup append=true User_list.csv

[CMDs Executed]
action.email.useNSSubject = 1
action.keyindicator.invert = 0
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.forceCsvResults = 1
action.risk.param.verbose = 0
action.threat_add.param.verbose = 0
alert.track = 0
cron_schedule = 0 6 * * 1
dispatch.earliest_time = -7d@h
dispatch.latest_time = now
display.general.type = statistics
display.page.search.mode = fast
display.page.search.tab = statistics
display.visualizations.show = 0
disabled = 1
enableSched = 1
request.ui_dispatch_app = Domain-Controller-Monitoring
request.ui_dispatch_view = search
search = `Domain-Controller-Security-index` source="*Power*" "ComputerName" IN (*)\
	| rex field=_raw "User =\s+.*\\\(?<Username>.*)" \
	| search Username!="SYSTEM" \
	| rex field=_raw "Message=(?<Inputs>[\D\d\n]*)Context" \
	| rex field=_raw "User =\s+.*\\\(?<Username>.*)" \
	| search Username!="SYSTEM" \
	| rex field=_raw "Message=(?<Inputs>[\D\d\n]*)Context"  \
	| rex field=Message mode=sed "s/CommandInvocation\(//g" \
	| rex field=Message mode=sed "s/\)://g" \
	| rex field=_raw "Host\s+Application\s+=\s+.*\\\(?<Application>.*)" | eval Event_Time=strftime(_time,"%Y-%m-%d %H:%M:%S") \
	| stats count by Event_Time  Username ComputerName Message Inputs Application

[GPO Name list]
action.email.useNSSubject = 1
action.keyindicator.invert = 0
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.forceCsvResults = 1
action.risk.param.verbose = 0
action.threat_add.param.verbose = 0
alert.track = 0
cron_schedule = 0 0 * * *
dispatch.earliest_time = -1d@d
dispatch.latest_time = @d
display.general.type = statistics
display.page.search.mode = fast
display.page.search.tab = statistics
display.visualizations.show = 0
enableSched = 1
request.ui_dispatch_app = Domain-Controller-Monitoring
request.ui_dispatch_view = search
search = |ldapsearch domain=default search="(objectclass=organizationalUnit)"\
	attrs="ou,description,gPLink,gPOptions"\
	|sort ou\
	|rex field=gPLink max_match=10 "\[LDAP://(?<gpo>[^;]+);\d+\]"\
	|ldapfetch dn=gpo attrs=displayName\
	|table ou,description,displayName,gpo|rex field=gpo "cn=(?<GUID>\{.*\}),cn"|stats c by GUID displayName|rename displayName as "GPOName"|join type=left "GPOName" [|inputlookup GpoName.csv|eval matched=1]|fillnull value="-" |search matched="-"|fields - c matched |outputlookup append=true GpoName.csv

[Restricted Logins Report]
action.email.useNSSubject = 1
action.keyindicator.invert = 0
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.forceCsvResults = 1
action.risk.param.verbose = 0
action.threat_add.param.verbose = 0
alert.track = 0
cron_schedule = 0 6 * * 1
dispatch.earliest_time = -7d@h
dispatch.latest_time = now
display.general.type = statistics
display.page.search.mode = fast
display.page.search.tab = statistics
display.visualizations.show = 0
enableSched = 1
request.ui_dispatch_app = Domain-Controller-Monitoring
request.ui_dispatch_view = search
search = | tstats count from datamodel=Login_Failures  by _time Loginfailed.Account_Name Loginfailed.Source_Network_Address Loginfailed.ComputerName Loginfailed.Failure_Reason \
	| search Loginfailed.Account_Name!="-" | eval Event_Time=strftime(_time,"%Y-%m-%d %H:%M:%S") \
	| rename Loginfailed.* as *  Source_Network_Address as "Source IP"|rename Account_Name as "Account Name" Failure_Reason as "Failure Reason" c as count|fields - _time| table Event_Time  "Account Name" "Source IP" "ComputerName" "Failure Reason"|search "Failure Reason"="Account currently disabled*" OR  "Failure Reason"="user is currently locked out"

[Asset_Identity_Report]
action.email.useNSSubject = 1
action.keyindicator.invert = 0
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.forceCsvResults = 1
action.risk.param.verbose = 0
action.threat_add.param.verbose = 0
alert.track = 0
cron_schedule = 0 1 * * *
dispatch.earliest_time = -1d@d
dispatch.latest_time = @d
display.general.type = statistics
display.page.search.mode = fast
display.page.search.tab = statistics
display.visualizations.show = 0
disabled = 1
enableSched = 1
request.ui_dispatch_app = Domain-Controller-Monitoring
request.ui_dispatch_view = search
search = `Domain-user` EventCode=4624 user!="*$*" user!="*SYSTEM*" user!="*firewall*" user!="*ldap*" user!="*logon*" user!="*admin*" user!="*DWM*" user!="*service*" user!="*UMFD*" ComputerName!="*Dc*" latest=now earliest=-30d \
	| stats c by user ComputerName \
	| rename ComputerName as "Src_Host" |sort - c|dedup user|fields - c\
	| outputlookup append=true asset_identity.csv

