
[CC Vuln - Average Vulnerability Age]
action.email.reportServerEnabled              = 0
alert.track                                   = 0
action.keyindicator                           = 1
action.keyindicator.title                     = Vulnerability Age
action.keyindicator.subtitle                  = Average days
action.keyindicator.value                     = current_avg
action.keyindicator.threshold                 =
action.keyindicator.delta                     =
action.keyindicator.invert                    = false
# | tstats `summariesonly` min(_time) as firstTime,max(_time) as lastTime,count from datamodel=Vulnerabilities.Vulnerabilities by Vulnerabilities.signature,Vulnerabilities.dest | `cc_drop_dm_object_name("Vulnerabilities")` | where firstTime!=lastTime AND (now()-lastTime)<2592000
action.keyindicator.drilldown_uri             = search?q=%7C%20tstats%20%60summariesonly%60%20min(_time)%20as%20firstTime%2Cmax(_time)%20as%20lastTime%2Ccount%20from%20datamodel%3DVulnerabilities.Vulnerabilities%20by%20Vulnerabilities.signature%2CVulnerabilities.dest%20%7C%20%60cc_drop_dm_object_name(%22Vulnerabilities%22)%60%20%7C%20where%20firstTime!%3DlastTime%20AND%20(now()-lastTime)%3C2592000
action.keyindicator.group.0.name              = vuln_center
action.keyindicator.group.0.order             = 4
dispatch.earliest_time                        = -90d@d
dispatch.latest_time                          = now
display.general.enablePreview                 = 1
display.general.type                          = visualizations
display.statistics.rowNumbers                 = 0
display.statistics.wrap                       = 0
display.visualizations.charting.drilldown     = all
display.visualizations.singlevalue.underLabel = Average Vulnerability Age
display.visualizations.show                   = 1
display.visualizations.type                   = singlevalue
request.ui_dispatch_app                       = campus_compliance
search                                        = | `cc_vulnerability_tracker(lastTime)` | where firstTime!=lastTime | eval dayDiff=(lastTime-firstTime)/86400 | stats avg(dayDiff) as current_avg
# CC-34

###### Generating Searches ######
[CC Network - Vulnerability Tracker - Lookup Gen]
action.customsearchbuilder.enabled = 1
action.customsearchbuilder.routine = make_lookup_generating_search:makeLookupGeneratingSearch
action.customsearchbuilder.spec    = {\
    "version":      "1.0", \
    "search": {\
        "datamodel":     "Vulnerabilities",\
        "object":        "Vulnerabilities",\
        "earliest":      "-70m@m",\
        "latest":        "-10m@m",\
        "eventFilter":   "'Vulnerabilities.severity' != \"informational\" AND 'Vulnerabilities.severity' != \"low\"",\
        "aggregates":    [{"function":"min","attribute":"_time","alias":"firstTime"},\
                          {"function":"max","attribute":"_time","alias":"lastTime"}],\
        "splitby":       [{"attribute":"Vulnerabilities.signature","alias":"signature"},\
                          {"attribute":"Vulnerabilities.dest","alias":"dest"}],\
        "summariesonly": true,\
        "outputlookup":  "cc_vulnerability_tracker",\
        "retention":     {\
            "earliestTime":"-5y",\
            "timeField":"lastTime",\
            "timeFormat":"%s"\
        }\
    }\
}
cron_schedule                      = 50 * * * *
description                        = Maintains a list of Vulnerabilities by signature, destination and the first and last time they were seen.
dispatch.earliest_time             = -70m@m
dispatch.latest_time               = -10m@m
enableSched                        = true
is_visible                         = false
request.ui_dispatch_app            = campus_compliance
schedule_window                    = 5
search                             = | tstats summariesonly=true allow_old_summaries=true min(_time) as "firstTime",max(_time) as "lastTime" from datamodel=Vulnerabilities.Vulnerabilities where    "Vulnerabilities.severity" != "informational" AND "Vulnerabilities.severity" != "low" by "Vulnerabilities.signature","Vulnerabilities.dest"  | rename "Vulnerabilities.signature" as "signature","Vulnerabilities.dest" as "dest" | inputlookup append=T "cc_vulnerability_tracker" | stats min(firstTime) as "firstTime",max(lastTime) as "lastTime" by "signature","dest" | where strptime('lastTime', "%s")>=relative_time(now(), "-5y") | outputlookup "cc_cc_vulnerability_tracker" | stats count

[Simple User Tracker - Lookup Gen]
action.email.useNSSubject = 1
alert.track = 0
cron_schedule = 43 0 * * *
dispatch.earliest_time = -1d@d
dispatch.latest_time = @d
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.visualizations.show = 0
enableSched = 1
request.ui_dispatch_app = campus_compliance
request.ui_dispatch_view = search
search = |tstats summariesonly=true allow_old_summaries=true earliest(_time) as firstTime latest(_time) as lastTime from datamodel=Authentication by Authentication.user | `cc_drop_dm_object_name("Authentication")` | inputlookup append=T cc_user_tracker | stats min(firstTime) as firstTime max(lastTime) as lastTime by user |lookup cc_priv_users user OUTPUT is_privileged |fillnull value="false" is_privileged | outputlookup cc_user_tracker| stats count
