################################
##
## Collecting
##
################################

[BlueCoat - Stats - Collect]
cron_schedule = */5 * * * *
dispatch.earliest_time = -5m@m
displayview = flashtimeline
enableSched = 1
realtime_schedule = 0
request.ui_dispatch_view = flashtimeline
search = `bcoat_request` | table _time action bytes_in bytes_out category cs_uri_path cs_uri_scheme dest_host filter_result http_content_type http_referrer http_user_agent src_ip src_user x_bluecoat_application_name x_virus_id | tscollect namespace=bluecoat_stats
disabled = 0


##############################################################################
##
## Traffic Dashboard Searches
##
##############################################################################
[BlueCoat Traffic - Requests Over Time]
cron_schedule = 0 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = +0s
displayview = flashtimeline
enableSched = 0
request.ui_dispatch_view = flashtimeline
search = `bcoat_request` | timechart count by dest_host 
vsid = fx3mgenj


[BlueCoat Traffic - Top Categories]
cron_schedule = 0 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = +0s
displayview = flashtimeline
enableSched = 0
request.ui_dispatch_view = flashtimeline
search = `bcoat_request` filter_result!="DENIED" | top category | rename category as "Category"
vsid = fx3mgenj


[BlueCoat Traffic - Top Clients by IP Address]
cron_schedule = 0 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = +0s
displayview = flashtimeline
enableSched = 0
request.ui_dispatch_view = flashtimeline
search = `bcoat_request` src_ip != "-" | top src_ip limit=10 | rename src_ip as "Client IP"
vsid = fx3mgenj


[BlueCoat Traffic - Top Clients by Username]
dispatch.earliest_time = -4h
dispatch.latest_time = +0s
displayview = flashtimeline
enableSched = 0
request.ui_dispatch_view = flashtimeline
search = `bcoat_request` src_user!="-" | top src_user limit=10 | rename src_user as "User"
vsid = fx3mgenj


[BlueCoat Traffic - Cache Efficiency]
dispatch.earliest_time = -4h
dispatch.latest_time = +0s
displayview = flashtimeline
enableSched = 0
request.ui_dispatch_view = flashtimeline
search = `bcoat_request` | replace *_HIT with CACHE_HIT in action | replace *_MISS* with CACHE_MISS in action | timechart count by action
vsid = fx3mgenj


[BlueCoat Traffic - Top Websites]
cron_schedule = 0 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = +0s
displayview = flashtimeline
enableSched = 0
request.ui_dispatch_view = flashtimeline
search = `bcoat_request` dest_host!="-" filter_result!="DENIED" | top dest_host limit=10 | rename dest_host as "Site"
vsid = fx3mgenj

##############################################################################
##
## Bandwidth Reports
##
##############################################################################
[BlueCoat Bandwidth - Proxy Bandwidth]
cron_schedule = 0 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = +0s
displayview = flashtimeline
enableSched = 0
request.ui_dispatch_view = flashtimeline
search = `bcoat_request` | eval bandwidth=(bytes_in/1048576) | timechart sum(bandwidth) as "Bytes Received"
vsid = fx3mgenj


[BlueCoat Bandwidth - Top Websites]
cron_schedule = 0 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = +0s
displayview = flashtimeline
enableSched = 0
request.ui_dispatch_view = flashtimeline
search = `bcoat_request` | eval mb=round((bytes_in+bytes_out)/1048576,2) | stats sum(mb) as "Data Transferred (mb)" by dest_host | sort -"Data Transferred (mb)" | rename dest_host as "Site"
vsid = fx3mgenj


[BlueCoat Bandwidth - Top Users]
cron_schedule = 0 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = +0s
displayview = flashtimeline
enableSched = 0
request.ui_dispatch_view = flashtimeline
search = `bcoat_request` src_user != "-" | eval mb=round((bytes_in+bytes_out)/1048576,2) | stats sum(mb) as "Data Transferred (mb)" by src_user | sort -"Data Transferred (mb)" | rename src_user as "User"
vsid = fx3mgenj

[BlueCoat Bandwidth - Top Client IP]
cron_schedule = 0 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = +0s
displayview = flashtimeline
enableSched = 0
request.ui_dispatch_view = flashtimeline
search = `bcoat_request` | eval mb=round((bytes_in+bytes_out)/1048576,2) | stats sum(mb) as "Data Transferred (mb)" by src_ip | sort -"Data Transferred (mb)" | rename src_ip as "Client IP"
vsid = fx3mgenj

##############################################################################
##
## Security Searches
##
##############################################################################
[BlueCoat Security - Top Blocked Sites]
dispatch.earliest_time = -4h
dispatch.latest_time = +0s
is_visible = true
search = `bcoat_request` filter_result="DENIED" | top dest_host | rename dest_host as "Site"

[BlueCoat Security - Top Malware Sites]
dispatch.earliest_time = -4h
dispatch.latest_time = +0s
is_visible = true
search = `bcoat_request` `potential_infection_categories` | top dest_host | rename dest_host as "Site"

[BlueCoat Security - Top Malware Clients by Username]
dispatch.earliest_time = -4h
dispatch.latest_time = +0s
is_visible = true
search = `bcoat_request` src_user != "-" `potential_infection_categories` | top src_user | rename src_user as "Username"

[BlueCoat Security - Top Malware Clients by IP Address]
dispatch.earliest_time = -4h
dispatch.latest_time = +0s
is_visible = true
search = `bcoat_request` `potential_infection_categories` | stats count by category src_ip cs_uri | rename src_ip as "Client IP"

[BlueCoat Security - Top Viruses Found]
dispatch.earliest_time = -4h
dispatch.latest_time = +0s
is_visible = true
search = `bcoat_request` | top x_virus_id

[BlueCoat Security - Blocked Web Browsing by User Agent]
dispatch.earliest_time = -4h
dispatch.latest_time = +0s
is_visible = true
search = `bcoat_request` filter_result="DENIED" | top http_user_agent countfield="Request" limit=10 | rename http_user_agent as "User Agent"

[BlueCoat Security - Blocked Web Sites]
dispatch.earliest_time = -4h
dispatch.latest_time = +0s
is_visible = true
search = `bcoat_request` filter_result="DENIED" | top dest_host countfield="Requests" limit=10 | rename dest_host as "Site"


#############################################################################
##
## Reporter Searches
##
#############################################################################
[BlueCoat Base Reports - Category]
cron_schedule = 0 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = +0s
displayview = flashtimeline
enableSched = 0
request.ui_dispatch_view = flashtimeline
search = `bcoat_request` filter_result != "DENIED" | makemv delim=";" allowempty=false setsv=true http_content_type | makemv delim=";" allowempty=false setsv=true category | eval mb_bytes_in = bytes_in/1048576 | eval mb_bytes_out = bytes_out/1048576 | eval mb_bytes_total = mb_bytes_in + mb_bytes_out | stats count as "Requests" count(eval(http_response=200 and http_content_type="text/html")) as "Page Views" sum(mb_bytes_in) as "MB Received" sum(mb_bytes_out) as "MBs Sent" sum(mb_bytes_total) as "Total MB" by category | sort -"Requests"
vsid = fx3mgenj


[BlueCoat Base Reports - Client IP]
cron_schedule = 0 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = +0s
displayview = flashtimeline
enableSched = 0
request.ui_dispatch_view = flashtimeline
search = `bcoat_request` filter_result!="DENIED" | makemv delim=";" allowempty=false setsv=true http_content_type | makemv delim=";" allowempty=false setsv=true category | eval mb_bytes_in = bytes_in/1048576 | eval mb_bytes_out = bytes_out/1048576 | eval mb_bytes_total = mb_bytes_in + mb_bytes_out | stats count as "Requests" count(eval(http_response=200 and http_content_type="text/html")) as "Page Views" sum(mb_bytes_in) as "Bytes Received" sum(mb_bytes_out) as "Bytes Sent" sum(mb_bytes_total) as "Total Bytes" by src_ip | rename src_ip as "Client IP" | sort -"Requests"
vsid = fx3mgenj


[BlueCoat Base Reports - Malware]
cron_schedule = 0 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = +0s
displayview = flashtimeline
enableSched = 0
request.ui_dispatch_view = flashtimeline
search = `bcoat_request` filter_result!="DENIED" | makemv delim=";" allowempty=false setsv=true http_content_type | makemv delim=";" allowempty=false setsv=true category | eval mb_bytes_in = bytes_in/1048576 | eval mb_bytes_out = bytes_out/1048576 | eval mb_bytes_total = mb_bytes_in + mb_bytes_out | stats count as "Requests" count(eval(http_response=200 and http_content_type="text/html")) as "Page Views" sum(mb_bytes_in) as "Bytes Received" sum(mb_bytes_out) as "Bytes Sent" sum(mb_bytes_total) as "Total Bytes" by malware | sort -"Requests"
vsid = fx3mgenj


[BlueCoat Base Reports - Site]
cron_schedule = 0 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = +0s
displayview = flashtimeline
enableSched = 0
request.ui_dispatch_view = flashtimeline
search = `bcoat_request` filter_result!="DENIED" | makemv delim=";" allowempty=false setsv=true http_content_type | makemv delim=";" allowempty=false setsv=true category | eval mb_bytes_in = bytes_in/1048576 | eval mb_bytes_out = bytes_out/1048576 | eval mb_bytes_total = mb_bytes_in + mb_bytes_out | stats count as "Requests" count(eval(http_response=200 and http_content_type="text/html")) as "Page Views" sum(mb_bytes_in) as "Bytes Received" sum(mb_bytes_out) as "Bytes Sent" sum(mb_bytes_total) as "Total Bytes" by dest_host | rename dest_host as "Site" | sort -"Requests"
vsid = fx3mgenj


[BlueCoat Base Reports - User]
cron_schedule = 0 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = +0s
displayview = flashtimeline
enableSched = 0
request.ui_dispatch_view = flashtimeline
search = `bcoat_request` filter_result!="DENIED" | makemv delim=";" allowempty=false setsv=true http_content_type | makemv delim=";" allowempty=false setsv=true category | eval mb_bytes_in = bytes_in/1048576 | eval mb_bytes_out = bytes_out/1048576 | eval mb_bytes_total = mb_bytes_in + mb_bytes_out | stats count as "Requests" count(eval(http_response=200 and http_content_type="text/html")) as "Page Views" sum(mb_bytes_in) as "Bytes Received" sum(mb_bytes_out) as "Bytes Sent" sum(mb_bytes_total) as "Total Bytes" by src_user | rename src_user as "Username" | sort -"Requests"
vsid = fx3mgenj


[BlueCoat Base Reports - Blocked Web Browsing per User]
cron_schedule = 0 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = +0s
displayview = flashtimeline
enableSched = 0
request.ui_dispatch_view = flashtimeline
search = `bcoat_request` filter_result="DENIED" src_user!="-" | top src_user limit=10 countfield="Requests" | rename src_user as "Username"
vsid = fx3mgenj

[BlueCoat Base Reports - Blocked Web Browsing per Client IP]
cron_schedule = 0 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = +0s
displayview = flashtimeline
enableSched = 0
request.ui_dispatch_view = flashtimeline
search = `bcoat_request` filter_result="DENIED" src_ip != "-" | top src_ip limit=10 countfield="Requests" | rename src_ip as "Client IP"
vsid = fx3mgenj


[BlueCoat Base Reports - Requests per Content Type]
cron_schedule = 0 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = +0s
displayview = flashtimeline
enableSched = 0
search = `bcoat_request` filter_result!="DENIED" | makemv delim=";" allowempty=false setsv=true http_content_type | makemv delim=";" allowempty=false setsv=true category | eval mb_bytes_in = bytes_in/1048576 | eval mb_bytes_out = bytes_out/1048576 | eval mb_bytes_total = mb_bytes_in + mb_bytes_out | stats count as "Requests" count(eval(http_response=200 and http_content_type="text/html")) as "Page Views" sum(mb_bytes_in) as "Bytes Received" sum(mb_bytes_out) as "Bytes Sent" sum(mb_bytes_total) as "Total Bytes" by http_content_type | rename http_content_type as "Content Type" | sort -"Requests"
vsid = fx3mgenj


[BlueCoat Base Reports - Requests per Protocol]
cron_schedule = 0 * * * *
dispatch.earliest_time = -1h
dispatch.latest_time = +0s
displayview = flashtimeline
enableSched = 0
request.ui_dispatch_view = flashtimeline
search = `bcoat_request` filter_result!="DENIED" | makemv delim=";" allowempty=false setsv=true http_content_type | makemv delim=";" allowempty=false setsv=true category | eval mb_bytes_in = bytes_in/1048576 | eval mb_bytes_out = bytes_out/1048576 | eval mb_bytes_total = mb_bytes_in + mb_bytes_out | stats count as "Requests" count(eval(http_response=200 and http_content_type="text/html")) as "Page Views" sum(mb_bytes_in) as "Bytes Received" sum(mb_bytes_out) as "Bytes Sent" sum(mb_bytes_total) as "Total Bytes" by cs_uri_scheme | sort -"Requests"
vsid = fx3mgenj
