
[Summary Page:  Record Count Over Time by Country]
action.email.useNSSubject = 1
alert.track = 0
cron_schedule = 0 * * * *
dispatch.earliest_time = -30d@d
dispatch.latest_time = now
display.general.timeRangePicker.show = 0
display.general.type = visualizations
display.page.search.mode = fast
display.page.search.tab = visualizations
display.statistics.show = 0
display.visualizations.charting.axisTitleX.text = Time
display.visualizations.charting.axisTitleY.text = Record Count
enableSched = 1
request.ui_dispatch_app = bazze
request.ui_dispatch_view = search
schedule_priority = higher
schedule_window = 60
search = | pivot Bazze_Records Bazze_Record count(Bazze_Record) AS "Record Count" SPLITROW _time AS Time SPLITCOL country FILTER country isNotNull SORT 0 _time ROWSUMMARY 0 COLSUMMARY 0 NUMCOLS 15 SHOWOTHER 1
disabled = 0

[Lookup Table: Summary Statistics by Country]
action.email.useNSSubject = 1
alert.track = 0
cron_schedule = 0 * * * *
dispatch.earliest_time = 0
display.general.timeRangePicker.show = 0
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.show = 0
enableSched = 1
request.ui_dispatch_app = bazze
request.ui_dispatch_view = search
schedule_priority = higher
schedule_window = 60
search = | tstats summariesonly=true distinct_count(Bazze_Record.bazze_event_id) AS records, distinct_count(Bazze_Record.wifi_ssid) AS wifi_count, distinct_count(Bazze_Record.bazze_device_id) AS device_count from datamodel=Bazze_Records by Bazze_Record.country | outputlookup summaryPageStats.csv append=false
disabled = 0

[Lookup Table: Distinct Buckets by Device]
action.email.useNSSubject = 1
alert.track = 0
cron_schedule = 15 * * * *
dispatch.earliest_time = -30d@d
dispatch.latest_time = now
display.general.timeRangePicker.show = 0
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.custom.type = leaflet_maps_app.maps-plus
display.visualizations.show = 0
enableSched = 1
request.ui_dispatch_app = bazze
request.ui_dispatch_view = search
search = | tstats summariesonly=true distinct_count(Bazze_Record.bucket) AS buckets from datamodel=Bazze_Records by Bazze_Record.bazze_device_id | rename Bazze_Record.bazze_device_id AS id | outputlookup distinctBuckets.csv append=false
disabled = 0

[Clear Cache: Global WiFi]
action.email.useNSSubject = 1
alert.track = 0
cron_schedule = 30 * * * *
dispatch.earliest_time = -30d@d
dispatch.latest_time = now
display.general.timeRangePicker.show = 0
display.general.type = statistics
display.page.search.mode = fast
display.page.search.tab = statistics
display.visualizations.show = 0
enableSched = 1
request.ui_dispatch_app = bazze
request.ui_dispatch_view = search
schedule_priority = highest
schedule_window = 480
search = index="cache" type="wifi" NOT ([search index="cache" type="wifi" | stats count by add_time | sort - add_time | fields add_time | mvcombine add_time | eval add_time=mvindex(add_time,0)]) | delete
disabled = 0

[Clear Cache: Global Location Buckets]
action.email.useNSSubject = 1
alert.track = 0
cron_schedule = 30 * * * *
dispatch.earliest_time = -30d@d
dispatch.latest_time = now
display.general.timeRangePicker.show = 0
display.general.type = statistics
display.page.search.mode = fast
display.page.search.tab = statistics
display.visualizations.show = 0
enableSched = 1
request.ui_dispatch_app = bazze
request.ui_dispatch_view = search
schedule_priority = highest
schedule_window = 480
search = index="cache" type="device" NOT ([search index="cache" type="device" | stats count by add_time | sort - add_time | fields add_time | mvcombine add_time | eval add_time=mvindex(add_time,0)]) | delete
disabled = 0

[Cache: Global Location Buckets]
action.email.useNSSubject = 1
alert.track = 0
cron_schedule = 0 0 * * *
dispatch.earliest_time = -30d@d
dispatch.latest_time = now
display.general.timeRangePicker.show = 0
display.general.type = statistics
display.page.search.mode = fast
display.page.search.tab = statistics
display.visualizations.show = 0
enableSched = 1
request.ui_dispatch_app = bazze
request.ui_dispatch_view = search
schedule_priority = highest
schedule_window = 480
search = | tstats summariesonly=true latest(_time) AS _time,latest(Bazze_Record.ip_address) AS ip_address,latest(Bazze_Record.bazze_geohash) AS geohash,latest(Bazze_Record.latitude) AS latitude,latest(Bazze_Record.longitude) AS longitude,distinct_count(Bazze_Record.day) AS d_count,count AS r_count from datamodel=Bazze_Records by Bazze_Record.bazze_device_id,Bazze_Record.country,Bazze_Record.bucket | rename Bazze_Record.bazze_device_id AS id,Bazze_Record.country AS country,Bazze_Record.bucket AS bucket | lookup distinctBuckets.csv id OUTPUT buckets | eval type="device",add_time=now(),icon="mobile-alt",iconColor="white",markerColor="lightblue",markerType="png",prefix="fa" | eval tooltip="<b>Observed Locations:</b> "+buckets+"<br/><b>Number of Days Here:</b> "+d_count+"<br/><b>Total Records Here:</b> "+r_count+"<br/><b>Device ID:</b> "+id | summaryindex index="cache"
disabled = 0

[Cache: Global WiFi]
action.email.useNSSubject = 1
alert.track = 0
cron_schedule = 0 21 * * *
dispatch.earliest_time = -30d@d
dispatch.latest_time = now
display.general.timeRangePicker.show = 0
display.general.type = statistics
display.page.search.mode = fast
display.page.search.tab = statistics
display.visualizations.show = 0
enableSched = 1
request.ui_dispatch_app = bazze
request.ui_dispatch_view = search
schedule_priority = higher
search = | tstats summariesonly=true latest(_time) AS _time,latest(Bazze_Record.ip_address) AS ip_address,latest(Bazze_Record.latitude) AS latitude,latest(Bazze_Record.longitude) AS longitude,latest(Bazze_Record.bazze_geohash) AS geohash,distinct_count(Bazze_Record.bazze_device_id) AS d_count,count AS r_count from datamodel=Bazze_Records where Bazze_Record.wifi_ssid!="" by Bazze_Record.country,Bazze_Record.wifi_ssid,Bazze_Record.bucket | rename Bazze_Record.country AS country,Bazze_Record.wifi_ssid AS id,Bazze_Record.bucket AS bucket | eval buckets=1,type="wifi",add_time=now(),icon="wifi",iconColor="black",markerColor="lightgreen",markerType="png",prefix="fa"| eval tooltip="<b>Number of Devices Connected:</b> "+d_count+"<br/><b>IP Address:</b> "+ip_address+"<br/><b>Number of Records:</b> "+r_count+"<br/><b>WiFI SSID:</b> "+id | summaryindex index="cache"
disabled = 0
