[fsctcenter_json]
category = Structured
description = JSON sent by CounterACT
SHOULD_LINEMERGE = false
DATETIME_CONFIG = CURRENT
KV_MODE = json

[fsctcenter_avp]
category = Structured
description = Syslog sent by CounterACT
SEDCMD-strip_prefix = s/^[^{]+//g
SHOULD_LINEMERGE = false
DATETIME_CONFIG = CURRENT
KV_MODE = json
# Similar size as set on the EM which is 212992(208K) 215040 is 210K
TRUNCATE = 215040

[counteract_alerts]
BREAK_ONLY_BEFORE = .*<ACTION_RESPONSE>
MUST_BREAK_AFTER = </ACTION_RESPONSE>
NO_BINARY_CHECK = true
category = StructuredAccess denied
disabled = false
pulldown_type = true
KV_MODE = xml
REPORTS-status = extract_response_status_field
REPORTS-message = extract_response_message_field
REPORTS-search_id = extract_response_search_id_field
REPORTS-row_id = extract_response_row_id_field
REPORTS-message-ip = extract_response_message_ip_field
EVAL-orig_action_name=trim(orig_action_name)

[counteract_orig_event]
EVAL-orig_action_name=trim(orig_action_name)



[source::CounterACT*]


REPORT-fields = host_properties.sw_ipport{}.value

#
# CIM Intrusion Detection
EVAL-category = case(malic="*ProbeEvent", "ScanEvent", malic="*ByteEvent", "BiteEvent", malic="FSMail*", "MailAnomalyEvent")
EVAL-ids_type = case(malic="*Event", "host")
EVAL-ip = coalesce(ip,dest,dest_ip)
FIELDALIAS-ids = malic AS signature
FIELDALIAS-dvc = host AS dvc



#
# CIM Malware
# FIELDALIAS-malware = pan_apt_detected_ioc AS severity
FIELDALIAS-threat_file = Threat_File_MD5 AS file_hash Threat_File_Name AS file_name
FIELDALIAS-host = host AS sender

# CIM Performance & Inventory
FIELDALIAS-cpu_mapping = Number_Of_Cores AS cpu_cores Family AS family Load_Percentage AS cpu_load_percent
FIELDALIAS-disk_mapping = Size__Megabytes_ AS storage Free_Space__Megabytes_ AS storage_free
FIELDALIAS-memory_mapping = Capacity AS mem

#
# CIM Certificate
FIELDALIAS-certificate-name = Name AS ssl_name
FIELDALIAS-certificate-serial-number = Serial_Number AS ssl_serial
FIELDALIAS-certificate-status = Status AS ssl_isvalid
FIELDALIAS-certificate-subject = CN AS ssl_issuer_common_name
FIELDALIAS-certificate-subject-unit = OU AS ssl_subject_unit
FIELDALIAS-certificate-subject-locality = L AS ssl_subject_locality
FIELDALIAS-certificate-subject-state = S AS ssl_subject_state
FIELDALIAS-certificate-issuer = Issuer AS ssl_issuer
FIELDALIAS-certificate-start-time = Not_Before AS ssl_start_time
FIELDALIAS-certificate-end-time = Not_After AS ssl_end_time

# CIM aliasing CounterACT properties as CIM tags
#category = Structured
FIELDALIAS-supportedip = dest_ip AS ip dest_host AS ip dest_name AS ip dest AS ip
FIELDALIAS-allip = ip AS dest ip AS dest_ip
FIELDALIAS-domain = nbtdomain AS dest_nt_domain
FIELDALIAS-mac = mac AS dest_mac
FIELDALIAS-nbthost = nbthost AS dest_nt_host

#CIM Endpoint
#Ports
FIELDALIAS-sw_ip = host_properties.sw_ip{}.value AS src
FIELDALIAS-sw_port = sw_port AS src_port
FIELDALIAS-sw_port_status = host_properties.sw_port_status{}.value as state

#Process
FIELDALIAS-allVendor = host_properties.classification_source_vendor{}.value as vendor_product
FIELDALIAS-appstate_process_windows =  host_properties.process_no_ext{}.value AS win_process
FIELDALIAS-appstate_process_linux = host_properties.linux_process_running{}.value AS linux_process
FIELDALIAS-appstate_process_mac = host_properties.mac_process_running{}.value AS mac_process
EVAL-process = coalesce(win_process,linux_process,mac_process)
EVAL-parent_process = if(isnotnull(process),"unknown","unknown")
EVAL-parent_process_name = if(isnotnull(process),"unknown","unknown")
EVAL-process_exec = if(isnotnull(process),"unknown","unknown")




#Service
FIELDALIAS-full_service_name = host_properties.service_installed{}.value as service
FIELDALIAS-service_name = host_properties.service_installed{}.value as service_name
EVAL-service_id = if(isnotnull(service),"unknown","unknown")
EVAL-service_path = if(isnotnull(service),"unknown","unknown")
EVAL-start_mode = if(isnotnull(service),"unknown","unknown")
EVAL-status = if(isnotnull(service),"unknown","unknown")

#File


FIELDALIAS-file_access_time_windows =  host_properties.file_attr_date_1{}.value as file_access_time_windows
FIELDALIAS-file_access_time_linux = host_properties.linux_file_date{}.value as file_access_time_linux
FIELDALIAS-file_access_time_mac = host_properties.mac_file_date{}.value as file_access_time_mac
EVAL-file_access_time = coalesce(file_access_time_windows,file_access_time_linux,file_access_time_mac)

EVAL-file_modify_time = coalesce(file_access_time_windows,file_access_time_linux,file_access_time_mac)

FIELDALIAS-file_size_windows =  host_properties.file_attr_size{}.value as file_size_windows
FIELDALIAS-file_size_linux = host_properties.linux_file_size{}.value as file_size_linux
FIELDALIAS-file_size_mac = host_properties.mac_file_size{}.value as file_size_mac
EVAL-file_size = coalesce(file_size_windows, file_size_linux, file_size_mac)

FIELDALIAS-file_hash_1 =  host_properties.md5sum{}.value as file_hash_1
FIELDALIAS-file_hash_2  = host_properties.md5sum_1{}.value as file_hash_2
EVAL-file_hash = coalesce(file_hash_1,file_hash_2)

EVAL-file_name = if(isnotnull(file_access_time) or isnotnull(file_size) or isnotnull(file_hash) ,"unknown","unknown")
EVAL-file_path = if(isnotnull(file_access_time) or isnotnull(file_size) or isnotnull(file_hash) ,"unknown","unknown")
EVAL-file_acl = if(isnotnull(file_access_time) or isnotnull(file_size) or isnotnull(file_hash) ,"unknown","unknown")




#Registry
FIELDALIAS-registry = host_properties.registry{}.value as registry_path
FIELDALIAS-registry1 = host_properties.registry_1{}.value as registry_path


#CIM Inventory
FIELDALIAS-inventory_family = host_properties.nc_family{}.value as family
FIELDALIAS-inventory_hypervisor =host_properties.aci_ep_vmm_hv_name{}.value as hypervior_id
FIELDALIAS-inventory_serial_cisco =host_properties.aci_node_serialnum{}.value as cisco_serial
FIELDALIAS-inventory_serial_otsm = host_properties.otsm_details_serial_number{}.value as otsm_serial
#This is Wrong Assumption
EVAL-serial = coalesce(cisco_serial,otsm_serial)
FIELDALIAS-inventory_hardware_memory =host_properties.hwi_physical_memory{}.value as mem
FIELDALIAS-inventory_otsm_version = host_properties.otsm_details_hardware_version{}.value as version


#CIM Authentication
FIELDALIAS-Authentication_src_domain = host_properties.dot1x_domain{}.value as src_nt_domain
FIELDALIAS-Authentication_src = host_properties.dot1x_auth_appliance{}.value as src
FIELDALIAS-Authentication_src_user =host_properties.dot1x_user{}.value as src_user







