[meraki_date_clipper]
DEST_KEY = _raw
REGEX = (.*\s1\s)\d{8,10}\.\d{9}\s(.*)
FORMAT = $1$2

[meraki_dvc]
REGEX = \d+\.\d+\.\d+\.\d+\s1\s\d+\.\d+\s(\w+)\s
FORMAT = dvc::$1

[meraki_dvc2]
REGEX = \d+\.\d+\.\d+\.\d+\s1\s(\w+)\s 
FORMAT = dvc::$1

[meraki_app]
REGEX = \d+\.\d+\.\d+\.\d+\s1\s\d+\.\d+\s\w+\s(\S+)\s[^tpP][^yo][^pr]
FORMAT = meraki_app::$1

[meraki_app2]
REGEX = \d+\.\d+\.\d+\.\d+\s1\s\w+\s(\S+)\s
FORMAT = meraki_app::$1

[meraki_dvc_ip]
REGEX = (\d+\.\d+\.\d+\.\d+)\s1\s\d+\.\d+\s\w+\s
FORMAT = dvc_ip::$1

[meraki_dvc_ip2]
REGEX = (\d+\.\d+\.\d+\.\d+)\s1\s\w+\s
FORMAT = dvc_ip::$1

[meraki_content_filtering_generic]
REGEX = events\scontent_filtering_block\s\S+.*\sserver\='(\d+\.\d+\.\d+\.\d+)\:(\d+)'
FORMAT = meraki_action::1 blockid::10 dest_ip::$1 dest_port::$2 meraki_app::events-content_filtering_block

[meraki_events_wireless]
REGEX = \S+\sevents\stype\=(\S+)\s
FORMAT = wireless_event_type::$1 meraki_app::events-wireless

[meraki_wireless_action]
REGEX = events\stype\=(association|disassociation)\s
FORMAT = meraki_wireless_action::$1

[meraki_events_ad]
REGEX = events\sActive\sDirectory\:\s(unable|connected)
FORMAT = meraki_action::$1 meraki_app::events-ad meraki_ad_priority::4

#Tag network sessions DNS
#2016-03-16T10:52:22-08:00 10.62.25.1 1 1458154342.559728842 MX60_TownUS events dhcp lease of ip 1.1.1.1 from server mac DD:DD:DD:DD:DD:DD for client mac AA:AA:AA:AA:AA:AA from router 10.100.10.100 on subnet 255.255.255.240 with dns 10.100.10.102
# https://technet.microsoft.com/en-us/library/dd759178(v=ws.11).aspx 10 A new IP address was leased to a client.
[meraki_dhcp_lease_added]
REGEX = events\sdhcp\slease\sof\sip\s(\d+\.\d+\.\d+\.\d+)\sfrom\sserver\smac\s([0-9A-F]{2}:[0-9A-F]{2}:[0-9A-F]{2}:[0-9A-F]{2}:[0-9A-F]{2}:[0-9A-F]{2})\sfor\sclient\smac\s([0-9A-F]{2}:[0-9A-F]{2}:[0-9A-F]{2}:[0-9A-F]{2}:[0-9A-F]{2}:[0-9A-F]{2})\sfrom\srouter\s(\d+\.\d+\.\d+\.\d+).*\ssubnet\s(\d+\.\d+\.\d+\.\d+)\swith\sdns\s(\d+\.\d+\.\d+\.\d+)
FORMAT = dest_ip::$1 src_mac::$2 dest_mac::$3 src_ip::$4 lease_scope_subnet::$5 src_dns::$6 dhcpsignature_id::10 dhcpsignature::DHCPOFFER meraki_app::events-dhcp meraki_dhcp_priority::4 meraki_dhcp_action::2 protocol::dhcp

#2016-10-04T14:15:05-08:00 3.3.3.3 1 1475619305.377955445 MX60_TownUS events dhcp release for mac A4:EE:36:EE:AA:B4
#https://technet.microsoft.com/en-us/library/dd759178(v=ws.11).aspx 12 A lease was released by a client.
[meraki_dhcp_lease_release]
REGEX = events\sdhcp\srelease\sfor\smac\s([0-9A-Fa-f]{2}:[0-9A-Fa-f]{2}:[0-9A-Fa-f]{2}:[0-9A-Fa-f]{2}:[0-9A-Fa-f]{2}:[0-9A-Fa-f]{2})
FORMAT = dest_mac::$1 dhcpsignature_id::12 dhcpsignature::DHCPRELEASE meraki_app::events-dhcp meraki_dhcp_priority::4 meraki_dhcp_action::0 protocol::dhcp

#2016-09-06T12:00:13-08:00 10.238.35.241 1 1473192013.455149110 MX60_TownUS events DHCP: no free DHCP leases to give 00:0d:71:04:a0:ae  on network 10.10.10.10/24
#meraki_action 1 = blocked
#https://technet.microsoft.com/en-us/library/dd759178(v=ws.11).aspx 14 A lease request could not be satisfied because the address pool of the scope was exhausted.
[meraki_dhcp_lease_fail]
REGEX = events\sDHCP\:\sno\sfree\sDHCP\sleases\sto\sgive\s([0-9A-Fa-f]{2}:[0-9A-Fa-f]{2}:[0-9A-Fa-f]{2}:[0-9A-Fa-f]{2}:[0-9A-Fa-f]{2}:[0-9A-Fa-f]{2}).*\snetwork\s(\d+\.\d+\.\d+\.\d+\/\d+)
FORMAT = dest_mac::$1 lease_scope::$2 dhcpsignature_id::14 dhcpsignature::DHCPNAK meraki_app::events-dhcp meraki_dhcp_priority::2 meraki_dhcp_action::1 protocol::dhcp

##https://technet.microsoft.com/en-us/library/dd759178(v=ws.11).aspx 15 A lease was denied.
[meraki_dhcp_lease_fail2]
REGEX = events\sdhcp\sno\soffers\sfor\smac\s([0-9A-F]{2}:[0-9A-F]{2}:[0-9A-F]{2}:[0-9A-F]{2}:[0-9A-F]{2}:[0-9A-F]{2})
FORMAT = dest_mac::$1 dhcpsignature_id::15 dhcpsignature::DHCPNAK meraki_app::events-dhcp meraki_dhcp_priority::2 meraki_dhcp_action::1 protocol::dhcp

#2016-04-27T09:10:49-08:00 10.35.66.1 1 1461777049.583347324 MX60_TownUS events MAC 00:26:B9:F5:9E:AA and MAC 00:00:85:DC:17:AA both claim IP: 10.33.22.11
#this is a data link problem;  just dumped the traffic into protocol::MAC (media access control), but this is probably dhcp related?  just a guess.
#https://technet.microsoft.com/en-us/library/dd759178(v=ws.11).aspx 13 An IP address was found in use on the network.
[meraki_dhcp_conflict]
REGEX = events\sMAC\s([0-9A-F]{2}:[0-9A-F]{2}:[0-9A-F]{2}:[0-9A-F]{2}:[0-9A-F]{2}:[0-9A-F]{2})\sand\sMAC\s([0-9A-F]{2}:[0-9A-F]{2}:[0-9A-F]{2}:[0-9A-F]{2}:[0-9A-F]{2}:[0-9A-F]{2})\sboth\sclaim\sIP:\s(\d+\.\d+\.\d+\.\d+)
FORMAT = src_mac::$1 dest_mac::$2 dest_ip::$3 dhcpsignature_id::13 dhcpsignature::DHCPCONFLICT meraki_app::events-dhcp meraki_dhcp_priority::2 meraki_dhcp_action::1 protocol::dhcp

#2016-09-27T10:31:29-08:00 10.229.68.2 1 1475001088.244700511 MXSwitch events Port 4 changed STP role from disabled to designated
#2016-09-27T10:31:29-08:00 10.229.68.2 1 1475001088.244151612 MXSwitch events port 4 status changed from down to 100fdx
[meraki_port]
REGEX = events\s[Pp]ort\s(\S+)\s(.*)\sfrom\s(\S+)\sto\s(\S+)
FORMAT = object_category::port object_id::$1 result::$2 object_path::$3 object_attrs::$4 meraki_app::events-port meraki_port_priority::4 meraki_action::0

#2016-09-27T19:54:20-08:00 10.254.22.17 1 1475034860.093136746 MXSwitch events authentication on DE:11:11:11:11:11 for user username as CN=username,OU=XYZ,OU=Users,OU=ABC,OU=KIO,OU=A Ou with some space,DC=subdomain,DC=example,DC=com with no group policy
#this is a successful authentication
[meraki_authentication]
REGEX = events\sauthentication\son\s([0-9A-F]{2}:[0-9A-F]{2}:[0-9A-F]{2}:[0-9A-F]{2}:[0-9A-F]{2}:[0-9A-F]{2})\sfor\suser\s(\S+)\sas\sCN
FORMAT = src::$1 user::$2 dest_nt_domain::$3 meraki_app::events-authentication meraki_ad_priority::4 meraki_action::0

[meraki_transport]
REGEX = protocol\=(udp|tcp|icmp)
FORMAT = protocol::ip transport::$1

[meraki_url_protocol]
REGEX = urls\s.*\s(https|http)
FORMAT = url_protocol::$1 connect_protocol::HTTP

[meraki_http_user_agent]
REGEX = \ agent\=\'([^']+)\'
FORMAT = http_user_agent::$1

[meraki_src]
REGEX = src\=([^\'\:\s]+)[\s\:]
FORMAT = src::$1

[meraki_src_port]
REGEX = \ssrc\=\d+\.\d+\.\d+\.\d+:(\d+)\s
FORMAT = src_port::$1

[meraki_src_port2]
REGEX = \ssport\=(\d+)\s
FORMAT = src_port::$1

[meraki_dst]
REGEX = dst\=([^\:\'\s]+)[\s\:\r\n]
FORMAT = dst::$1

[meraki_src_mac]
REGEX = ([0-9A-F]{2}:[0-9A-F]{2}:[0-9A-F]{2}:[0-9A-F]{2}:[0-9A-F]{2}:[0-9A-F]{2})
FORMAT = src_mac::$1

[air_src_mac]
REGEX = events.*\ssrc\=\'([0-9A-F]{2}:[0-9A-F]{2}:[0-9A-F]{2}:[0-9A-F]{2}:[0-9A-F]{2}:[0-9A-F]{2})\'
FORMAT = src_mac::$1

[air_dest_mac]
REGEX = events.*dst\=\'([0-9A-F]{2}:[0-9A-F]{2}:[0-9A-F]{2}:[0-9A-F]{2}:[0-9A-F]{2}:[0-9A-F]{2})\'
FORMAT = dest_mac::$1

[air_wired_mac]
REGEX = .*wired_mac\=\'([0-9A-F]{2}:[0-9A-F]{2}:[0-9A-F]{2}:[0-9A-F]{2}:[0-9A-F]{2}:[0-9A-F]{2})\'
FORMAT = wired_mac::$1

[air_vlan_id]
REGEX = \svlan_id\=\'(\d+)\'
FORMAT = vlan_id::$1

[air_channel]
REGEX = \schannel\=\'(\d+)\'
FORMAT = channel::$1

[air_rssi]
REGEX = \srssi\=\'(\d+)\'
FORMAT = rssi::$1

[air_fc_type]
REGEX = \sfc_type\=\'(\d+)\'
FORMAT = fc_type::$1

[air_fc_subtype]
REGEX = \sfc_subtype\=\'(\d+)\'
FORMAT = fc_subtype::$1

[air_inter_arrival]
REGEX = \sinter_arrival=\'(\d+)\'
FORMAT = inter_arrival::$1

[air_dos_count]
REGEX = dos_count\=\'(\d+)\'
FORMAT = dos_count::$1

[air_alarm_id]
REGEX = \salarm_id\=\'(\d+)\'
FORMAT = alarm_id::$1

[air_state]
REGEX = \sstate=\'(start|end)\'
FORMAT = state::$1

[meraki_http_method]
REGEX = urls.*request:\s([A-Z]+)
FORMAT = http_method::$1

[meraki_icmp_type]
REGEX = protocol\=icmp\stype\=(\d+)\s
FORMAT = icmp_type::$1

[meraki_user]
REGEX = for\suser\s(\w+)\s
FORMAT = user::$1

[meraki_user2]
REGEX = \suser=CN=(\w+),\S+\s
FORMAT = user::$1

[meraki_url]
REGEX = url\=\'(\S+)\'\s
FORMAT = url::$1

[meraki_url2]
#REGEX = url\=\'(\S+)\'\s|urls.*request:\s\w+\s(\S+)
REGEX = urls.*request:\s\w+\s(http\S+)
FORMAT = url::$1 meraki_action::0 meraki_url_priority::4

[meraki_uri_host]
REGEX = url\=\'(\S+)\'\s|urls.*request:\s\w+\s\S+
FORMAT = uri_host::$1

[meraki_uri_host2]
REGEX = url\=\'\S+\'\s|urls.*request:\s\w+\s(\S+)
FORMAT = uri_host::$1

[meraki_category]
REGEX = category0\=\'([^\']+)\'
FORMAT = category::$1

[meraki_signature_id]
REGEX = ids-alerts\s.*signature\=\d+:(\d+):
FORMAT = signature_id::$1

[meraki_signature]
REGEX = ids-alerts\s.*message:\s(.*)\s,
FORMAT = signature::$1

[air_signature]
REGEX = airmarshal_events\stype\=(\S+)\s
FORMAT = signature::$1

# adding everything as blocked until definitions are received
[air_type]
REGEX = airmarshal_events\stype\=(\S+)\s
FORMAT = wireless_event_type::$1 meraki_app::events-airmarshal meraki_airmarshal_action::blocked meraki_priority::4

[air_ssid]
REGEX = \w\sssid\=\'(.+)\'\sbssid
FORMAT = ssid::$1

[air_bssid]
REGEX = \'\sbssid\=\'(\S+)\'
FORMAT = bssid::$1

[air_radio]
REGEX = \sradio\=\'(\d+)\'
FORMAT = radio::$1

[air_packet]
REGEX = \spacket=\'(\S+)\'
FORMAT = packet::$1

[air_reason]
REGEX = \sreason\=\'(\S+)\'
FORMAT = reason::$1

[air_vap]
REGEX = \svap\=\'(\d+)\'
FORMAT = vap::$1

[air_client_mac]
REGEX = client_mac\=\'([0-9A-F]{2}:[0-9A-F]{2}:[0-9A-F]{2}:[0-9A-F]{2}:[0-9A-F]{2}:[0-9A-F]{2})\'
FORMAT = client_mac::$1

[air_client_ip]
REGEX = client_ip\=\'(\d+\.\d+\.\d+\.\d+)\'
FORMAT = client_ip::$1

[air_instigator]
REGEX = instigator\=\'(\d+)\'
FORMAT = instigator::$1

[air_duration]
REGEX = duration\=\'(\d+\.\d+)\'
FORMAT = duration::$1

[air_last_auth_ago]
REGEX = last_auth_ago\=\'(\d+\.\d+)\'
FORMAT = last_auth_ago::$1

[air_is_wpa]
REGEX = is_wpa\=\'(\d+)\'
FORMAT = is_wpa::$1

[air_full_conn]
REGEX = full_conn\=\'(\d+\.\d+)\'
FORMAT = full_conn::$1

[air_ip_resp]
REGEX = ip_resp\=\'(\d+\.\d+)\'
FORMAT = ip_resp::$1

[air_ip_src]
REGEX = ip_src\=\'(\d+\.\d+\.\d+\.\d+)\'
FORMAT = src::$1

[air_http_resp]
REGEX = http_resp\=\'(\d+\.\d+)\'
FORMAT = http_resp::$1

[air_arp_resp]
REGEX = arp_resp\=\'(\d+\.\d+)\'
FORMAT = arp_resp::$1

[air_arp_src]
REGEX = arp_src\=\'(\d+\.\d+)\'
FORMAT = arp_src::$1

[air_dns_server]
REGEX = dns_server\=\'(\d+\.\d+\.\d+\.\d+)\'
FORMAT = dns_server::$1

[air_dns_req_rtt]
REGEX = dns_req_rtt\=\'(\d+\.\d+)\'
FORMAT = dns_req_rtt::$1

[air_dns_resp]
REGEX = dns_resp\=\'(\d+\.\d+)\'
FORMAT = dns_resp::$1

[air_dhcp_lease_completed]
REGEX = dhcp_lease_completed\=\'(\d+\.\d+)\'
FORMAT = dhcp_lease_completed::$1

[air_dhcp_ip]
REGEX = dhcp_ip\=\'(\d+\.\d+\.\d+\.\d+)\'
FORMAT = dhcp_ip::$1

[air_dhcp_server]
REGEX = dhcp_server\=\'(\d+\.\d+\.\d+\.\d+)\'
FORMAT = dhcp_server::$1

[air_dhcp_server_mac]
REGEX = dhcp_server_mac\=\'([0-9A-F]{2}:[0-9A-F]{2}:[0-9A-F]{2}:[0-9A-F]{2}:[0-9A-F]{2}:[0-9A-F]{2})\'
FORMAT = dhcp_server_mac::$1

[air_dhcp_resp]
REGEX = dhcp_resp\=\'(\d+\.\d+)\'
FORMAT = dhcp_resp::$1

[air_aid]
REGEX = aid\=\'(\d+)\'
FORMAT = aid::$1

[air_info]
REGEX = events.*\'\sinfo\=\'([^\']+)\'
FORMAT = info::$1

[meraki_dest_port]
#REGEX = (?:dst\=\d+\.\d+\.\d+\.\d+:(\d+)\s|dport\=(\d+)\ )
REGEX = \sdst\=\d+\.\d+\.\d+\.\d+:(\d+)\s
FORMAT = dest_port::$1

[meraki_dest_port2]
REGEX = \sdport\=(\d+)
FORMAT = dest_port::$1

[meraki_action]
REGEX = \spattern:\s(\w+)\s
FORMAT = meraki_action::$1

# This is the flows_action format for OLDER flows reporting, new flow reporting use a different format
[meraki_flows_old_action]
REGEX = \s\S+\sflows\s(allow|deny)\ssrc
FORMAT = meraki_flows_old_action::$1

# This is the NEW flows action format
[meraki_flows_action]
REGEX = \s\S+\sflows.*pattern\:\s(allow|deny) 
FORMAT = meraki_flows_action::$1

# This is the NEW flows rule definition
[meraki_flows_rule]
REGEX = \s\S+\sflows.*pattern\:\s\S+\s(.*)
FORMAT = meraki_flows_rule::$1

[meraki_priority]
REGEX = ids-alerts\s.*\spriority=(1|2|3|4)\s
FORMAT = meraki_priority::$1

[meraki_vendor_info_lookup]
filename = meraki_vendor_info.csv

[meraki_action_lookup]
filename = meraki_action_info.csv

[meraki_severity_lookup]
filename = meraki_severities.csv

[meraki_icmp_code_lookup]
filename = meraki_icmp.csv

[meraki_status_code_lookup]
filename = meraki_status_code.csv
