[imperva:waf]
KV_MODE = none
SHOULD_LINEMERGE = false
# for load balancing on UF
EVENT_BREAKER_ENABLE = true

#https://docs.imperva.com/bundle/cloud-application-security/page/more/log-file-structure.htm

REPORT-cef_extract_additional_fields = cef_format_extract_field_6, cef_format_extract_field_7
REPORT-ccx_field_parsing = ccx_imperva_cef_format_field_ext, ccx_imperva_cef_extract_field_header_ext, ccx_imperva_cef_fieldlabel_parse, ccx_imperva_cef_kv_parse, ccx_imperva_uri_capture

FIELDALIAS-bytes_out = out as bytes_out
FIELDALIAS-category = event_name AS category
FIELDALIAS-bytes_in = in AS bytes_in
FIELDALIAS-status = cn1 AS status
FIELDALIAS-dest_dns = dhost as dest_dns
FIELDALIAS-dest_mac = dmac as dest_mac
FIELDALIAS-dest_nt_domain = dntdom as dest_nt_domain
FIELDALIAS-end_time = end as end_time
FIELDALIAS-file_size = fsize as file_size
FIELDALIAS-file_name = fname as file_name
FIELDALIAS-http_referrer = ref AS http_referrer
FIELDALIAS-http_user_agent = requestClientApplication AS http_user_agent
FIELDALIAS-process = dproc as process
FIELDALIAS-server_group = ServerGroup as server_group
FIELDALIAS-service_name = ServiceName as service_name
FIELDALIAS-src_dns = shost as src_dns
FIELDALIAS-src_ip = src as src_ip
FIELDALIAS-src_mac = smac as src_mac
FIELDALIAS-src_nt_domain = srcntdom as src_nt_domain
FIELDALIAS-start_time = start as start_time
FIELDALIAS-user_id = suid as user_id
FIELDALIAS-app_proto = app as proto

EVAL-action = case(match(act,".*BLOCKED|BAD"),"blocked",1=1,"allowed")
EVAL-app = coalesce('clapp','vendor')
EVAL-body = if(isnotnull(event_name), tostring('act')." - ".tostring('event_name'), message)
EVAL-description = if(isnotnull(event_name), tostring('act')." - ".tostring('event_name'), message)
EVAL-bytes = if(isnotnull(bytes_out),'bytes_in'+'bytes_out','bytes_in')
EVAL-cached = if(act == "REQ_CACHED_X","true","false")
EVAL-dest = if(sip != "0.0.0.0" and sip != "",coalesce(sip,sourceServiceName),sourceServiceName)
EVAL-dest_ip = if(sip != "0.0.0.0" and sip != "",sip,null())
EVAL-dest_port = 'spt'
EVAL-http_method = 'requestMethod'
EVAL-http_referrer_domain = if(isnotnull(ref), replace(ref, "^(?:https?:)?(?:\/\/)?(?:[^@\n]+@)?(?:www\.)?([^:\/\n]+)|\:|\/|.*","\1"), null())
EVAL-ids_type = if(event_code IN("11","12") OR 'event_name'="Normal", null(),"application")
EVAL-policy = if(isnotnull(Policy), Policy, policyName)
EVAL-protocol = if(event_name == "Firewall", "ip", lower('proto'))
EVAL-rule = if(isnotnull(rule), rule, policy)
EVAL-signature = if(isnotnull(cs9) AND (cs9!="N/A" OR cs9!="NA"),split(replace(ltrim(cs9,","),"^[,]|[ ,]*$",""),","), if(isnotnull(cs11),replace('cs11', "\[\{\"[^\"]+\"\:\"([^\"]+)\"\}\]", "\1"),'event_name'))
EVAL-src_port = 'cpt'
EVAL-type = if(cat == "SystemEvent", "event", type)
EVAL-uri_path = if(isnotnull(postbody), tostring(uri_path)+"/"+tostring(postbody),uri_path)
EVAL-uri_query = 'qstr'
EVAL-url = if(isnotnull(url), url, request)
EVAL-url_domain = if(isnotnull(request), replace(request, "^(?:https?:)?(?:\/\/)?(?:[^@\n]+@)?(?:www\.)?([^:\/\n]+)|\:|\/|.*","\1"), null())
EVAL-url_length = if(isnotnull(if(isnotnull(url), url, request)), len(if(isnotnull(url), url, request)), url_length)
EVAL-user = if(isnotnull(suser), suser, if(isnotnull(username), username, duser))
EVAL-vendor = "Imperva"
EVAL-vendor_action = if(isnotnull(act), act, disposition)
EVAL-vendor_product = "Imperva:Incapsula"
EVAL-type = if(event_code IN("11","12"),"alert",null())
EVAL-severity = if(event_code IN("11","12"),"unknown",null())
EVAL-subject = if(isnotnull(event_name) AND event_code IN("11","12"), tostring('act')." - ".tostring(coalesce(replace('cs11', "\[\{\"[^\"]+\"\:\"([^\"]+)\"\}\]", "\1"),'event_name')), null())


[incapsula:cef]
SHOULD_LINEMERGE=false
LINE_BREAKER=([\n\r]+)(?:CEF|accountId)
NO_BINARY_CHECK=true
TIME_FORMAT=%s%3Q
TIME_PREFIX=start\=
MAX_TIMESTAMP_LOOKAHEAD=13

KV_MODE = none
AUTO_KV_JSON = false

#https://docs.imperva.com/bundle/cloud-application-security/page/more/log-file-structure.htm

REPORT-cef_extract_additional_fields3 = cef_format_extract_field_6
REPORT-cef_extract_additional_fields4 = cef_format_extract_field_7
REPORT-ccx_field_parsing = ccx_imperva_cef_format_field_ext, ccx_imperva_cef_extract_field_header_ext, ccx_imperva_cef_fieldlabel_parse, ccx_imperva_cef_kv_parse, ccx_imperva_uri_capture

FIELDALIAS-bytes_out = out as bytes_out
FIELDALIAS-category = event_name AS category
FIELDALIAS-bytes_in = in AS bytes_in
FIELDALIAS-status = cn1 AS status
FIELDALIAS-dest_dns = dhost as dest_dns
FIELDALIAS-dest_mac = dmac as dest_mac
FIELDALIAS-dest_nt_domain = dntdom as dest_nt_domain
FIELDALIAS-end_time = end as end_time
FIELDALIAS-file_size = fsize as file_size
FIELDALIAS-file_name = fname as file_name
FIELDALIAS-http_referrer = ref AS http_referrer
FIELDALIAS-http_user_agent = requestClientApplication AS http_user_agent
FIELDALIAS-process = dproc as process
FIELDALIAS-server_group = ServerGroup as server_group
FIELDALIAS-service_name = ServiceName as service_name
FIELDALIAS-src_dns = shost as src_dns
FIELDALIAS-src_ip = src as src_ip
FIELDALIAS-src_mac = smac as src_mac
FIELDALIAS-src_nt_domain = srcntdom as src_nt_domain
FIELDALIAS-start_time = start as start_time
FIELDALIAS-user_id = suid as user_id
FIELDALIAS-app_proto = app as proto

EVAL-action = case(match(act,".*BLOCKED|BAD"),"blocked",1=1,"allowed")
EVAL-app = coalesce('clapp','vendor')
EVAL-body = if(isnotnull(event_name), tostring('act')." - ".tostring('event_name'), message)
EVAL-description = if(isnotnull(event_name), tostring('act')." - ".tostring('event_name'), message)
EVAL-bytes = if(isnotnull(bytes_out),'bytes_in'+'bytes_out','bytes_in')
EVAL-cached = if(act == "REQ_CACHED_X","true","false")
EVAL-dest = if(sip != "0.0.0.0" and sip != "",coalesce(sip,sourceServiceName),sourceServiceName)
EVAL-dest_ip = if(sip != "0.0.0.0" and sip != "",sip,null())
EVAL-dest_port = 'spt'
EVAL-http_method = 'requestMethod'
EVAL-http_referrer_domain = if(isnotnull(ref), replace(ref, "^(?:https?:)?(?:\/\/)?(?:[^@\n]+@)?(?:www\.)?([^:\/\n]+)|\:|\/|.*","\1"), null())
EVAL-ids_type = if(event_code IN("11","12") OR 'event_name'="Normal", null(),"application")
EVAL-policy = if(isnotnull(Policy), Policy, policyName)
EVAL-protocol = if(event_name == "Firewall", "ip", lower('proto'))
EVAL-rule = if(isnotnull(rule), rule, policy)
EVAL-signature = if(isnotnull(cs9) AND (cs9!="N/A" OR cs9!="NA"),split(replace(ltrim(cs9,","),"^[,]|[ ,]*$",""),","), if(isnotnull(cs11),replace('cs11', "\[\{\"[^\"]+\"\:\"([^\"]+)\"\}\]", "\1"),'event_name'))
EVAL-src_port = 'cpt'
EVAL-type = if(cat == "SystemEvent", "event", type)
EVAL-uri_path = if(isnotnull(postbody), tostring(uri_path)+"/"+tostring(postbody),uri_path)
EVAL-uri_query = 'qstr'
EVAL-url = if(isnotnull(url), url, request)
EVAL-url_domain = if(isnotnull(request), replace(request, "^(?:https?:)?(?:\/\/)?(?:[^@\n]+@)?(?:www\.)?([^:\/\n]+)|\:|\/|.*","\1"), null())
EVAL-url_length = if(isnotnull(if(isnotnull(url), url, request)), len(if(isnotnull(url), url, request)), url_length)
EVAL-user = if(isnotnull(suser), suser, if(isnotnull(username), username, duser))
EVAL-vendor = "Imperva"
EVAL-vendor_action = if(isnotnull(act), act, disposition)
EVAL-vendor_product = "Imperva:Incapsula"
EVAL-type = if(event_code IN("11","12"),"alert",null())
EVAL-severity = if(event_code IN("11","12"),"unknown",null())
EVAL-subject = if(isnotnull(event_name) AND event_code IN("11","12"), tostring('act')." - ".tostring(coalesce(replace('cs11', "\[\{\"[^\"]+\"\:\"([^\"]+)\"\}\]", "\1"),'event_name')), null())
