[Nessus Host Summary Index Search]
action.email.show_password = 1
action.email.useNSSubject = 1
action.keyindicator.invert = 0
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.forceCsvResults = 1
action.risk.param.verbose = 0
action.threat_add.param.verbose = 0
alert.track = 0
cron_schedule = 18 05 * * *
description = This search populates the summary index for Nessus.
dispatch.earliest_time = -24h@h
dispatch.latest_time = now
display.general.timeRangePicker.show = 0
display.general.type = statistics
display.page.search.mode = fast
display.page.search.tab = statistics
display.visualizations.charting.chart = bar
display.visualizations.show = 0
display.visualizations.type = singlevalue
enableSched = 0
request.ui_dispatch_app = nessus_security_scans_app
request.ui_dispatch_view = search
schedule_window = auto
search = `nessus_indexes` ((sourcetype=nessus:host NOT "Response code: 404") OR sourcetype=tenable:sc:vuln) \
| eval src=coalesce(src,ip), src_ip=coalesce(src_ip,ip), dest=coalesce(dest,ip), dest_ip=coalesce(dest_ip,ip), os=coalesce(os,operatingSystem), signature=coalesce(signature,synopsis), signature_id=coalesce(signature_id,plugin_id), category=coalesce(category,'family.name')\
| eval vulnerability=if(sourcetype="nessus:host",mvzip(mvzip(mvzip(mvzip(mvzip(severity, severity_id, "|"), signature, "|"), signature_id, "|"), category, "|"), cpe, "|"),"temp")\
| fields _time, src, src_ip, dest, dest_ip, os, vendor_product, scan_id, vulnerability, severity, severity_id, signature, signature_id, category, cpe\
| mvexpand vulnerability \
| rex field=vulnerability "^(?<severity>[^\|]*)\|(?<severity_id>[^\|]*)\|(?<signature>[^\|]*)\|(?<signature_id>[^\|]*)\|(?<category>[^\|]*)\|(?<cpe>[^\|]*)"\
| table _time, src, src_ip, dest, dest_ip, os, vendor_product, scan_id, severity, severity_id, signature, signature_id, category, cpe\
| fillnull value="unknown" src, src_ip, dest, dest_ip, os, scan_id, severity, severity_id, signature, signature_id, category, cpe\
| addinfo\
| collect index=nessus sourcetype=nessus:host:summary
