[Inbound message summary]
action.email.useNSSubject = 1
alert.track = 0
description = Message summary of inbound traffic.
dispatch.earliest_time = @d
dispatch.latest_time = now
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.show = 0
request.ui_dispatch_app = pps_ondemand
request.ui_dispatch_view = search
search = | tstats `summariesonly` latest(_time) as _time, values(Message_Log.msg_normalized_header_from) as Sender, values(Message_Log.msg_normalized_header_to) as Recipient, values(Message_Log.msg_normalized_header_subject) as Subject, values(Message_Log.filter.disposition) as "Filter Action" from datamodel=pps_ondemand where Message_Log.filter.routeDirection="inbound" by Message_Log.msg_normalized_header_message_id | sort 0 -_time | eval Date/Time = strftime(_time, "%m-%d-%Y %l:%M %p") | rename Message_Log.msg_normalized_header_message_id as "Message ID" | table "Message ID", Date/Time, Sender, Recipient, Subject, "Filter Action"

[Outbound message summary]
action.email.useNSSubject = 1
alert.track = 0
description = Message summary of outbound traffic.
dispatch.earliest_time = @d
dispatch.latest_time = now
display.general.type = statistics
display.page.search.tab = statistics
display.visualizations.show = 0
request.ui_dispatch_app = pps_ondemand
request.ui_dispatch_view = search
search = | tstats `summariesonly` latest(_time) as _time, values(Message_Log.msg_normalized_header_from) as Sender, values(Message_Log.msg_normalized_header_to) as Recipient, values(Message_Log.msg_normalized_header_subject) as Subject, values(Message_Log.filter.disposition) as "Filter Action" from datamodel=pps_ondemand where Message_Log.filter.routeDirection="outbound" by Message_Log.msg_normalized_header_message_id | sort 0 -_time | eval Date/Time = strftime(_time, "%m-%d-%Y %l:%M %p") | rename Message_Log.msg_normalized_header_message_id as "Message ID" | table "Message ID", Date/Time, Sender, Recipient, Subject, "Filter Action"

[DLP summary]
action.email.useNSSubject = 1
alert.track = 0
description = Message summary of module REGULATION.
dispatch.earliest_time = @d
dispatch.latest_time = now
display.general.type = statistics
display.page.search.mode = fast
display.page.search.tab = statistics
display.visualizations.show = 0
request.ui_dispatch_app = pps_ondemand
request.ui_dispatch_view = search
search = | tstats `summariesonly` latest(_time) as _time, values(Message_Log.msg_normalized_header_from) as Sender, values(Message_Log.msg_normalized_header_to) as Recipient, values(Message_Log.msg_normalized_header_subject) as Subject, values(Message_Log.filter.disposition) as "Filter Action" from datamodel=pps_ondemand where Message_Log.final_module=regulation by Message_Log.msg_normalized_header_message_id | sort 0 -_time | eval Date/Time = strftime(_time, "%m-%d-%Y %l:%M %p") | rename Message_Log.msg_normalized_header_message_id as "Message ID" | table "Message ID", Date/Time, Sender, Recipient, Subject, "Filter Action"

[Email Authentication Rule For SPF]
action.email.useNSSubject = 1
alert.track = 0
description = Distinct count of messages over time of module SPF by rule.
dispatch.earliest_time = @d
dispatch.latest_time = now
display.general.type = visualizations
display.page.search.tab = visualizations
display.statistics.show = 0
display.visualizations.charting.axisTitleX.text = Time
display.visualizations.charting.axisTitleY.text = Number Of Messages
display.visualizations.charting.chart = line
request.ui_dispatch_app = pps_ondemand
request.ui_dispatch_view = search
search = | tstats `summariesonly` values(Message_Log.msg_normalized_header_message_id) as message_id from datamodel=pps_ondemand by Message_Log.action_spf.rule, _time | rename Message_Log.action_spf.rule as Rule | timechart dc(message_id) as "Number Of Messages" by Rule

[Email Authentication Rule For DKIMV]
action.email.useNSSubject = 1
alert.track = 0
description = Distinct count of messages over time of module DKIMV by rule.
dispatch.earliest_time = @d
dispatch.latest_time = now
display.general.type = visualizations
display.page.search.tab = visualizations
display.statistics.show = 0
display.visualizations.charting.axisTitleX.text = Time
display.visualizations.charting.axisTitleY.text = Number Of Messages
display.visualizations.charting.chart = line
request.ui_dispatch_app = pps_ondemand
request.ui_dispatch_view = search
search = | tstats `summariesonly` values(Message_Log.msg_normalized_header_message_id) as message_id from datamodel=pps_ondemand by Message_Log.action_dkimv.rule, _time | rename Message_Log.action_dkimv.rule as Rule | timechart dc(message_id) as "Number Of Messages" by Rule

[Email Authentication Rule For DMARC]
action.email.useNSSubject = 1
alert.track = 0
description = Distinct count of messages over time of module DMARC by rule.
dispatch.earliest_time = @d
dispatch.latest_time = now
display.general.type = visualizations
display.page.search.tab = visualizations
display.statistics.show = 0
display.visualizations.charting.axisTitleX.text = Time
display.visualizations.charting.axisTitleY.text = Number Of Messages
display.visualizations.charting.chart = line
request.ui_dispatch_app = pps_ondemand
request.ui_dispatch_view = search
search = | tstats `summariesonly` values(Message_Log.msg_normalized_header_message_id) as message_id from datamodel=pps_ondemand by Message_Log.action_dmarc.rule, _time | rename Message_Log.action_dmarc.rule as Rule | timechart dc(message_id) as "Number Of Messages" by Rule

[TAP Dashboard Information]
action.email.useNSSubject = 1
alert.track = 0
description = Report from TAP Dashboard of incoming Threats.
dispatch.earliest_time = @d
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","to","from","qid","duration"]
display.general.type = statistics
display.page.search.tab = statistics
display.statistics.rowNumbers = 1
display.visualizations.chartHeight = 394
display.visualizations.show = 0
request.ui_dispatch_app = pps_ondemand
request.ui_dispatch_view = search
search = `pps_get_index` sourcetype="proofpoint_tap_siem" | rename eventType as ACTION, messageTime as "Message Time", messageID as "Message ID", sender as Sender, recipient{} as Recipient, senderIP as "Sender IP", spamScore as "Spam Score", malwareScore as "Malware Score", phishScore as "Phish Score" | table "Message Time", "Message ID", Sender, Recipient, QID, GUID, "Sender IP", "Spam Score", "Malware Score", "Phish Score", ACTION

[TAP Dashboard - Sender IP]
action.email.useNSSubject = 1
alert.track = 0
description = Top 20 Sender IP Addresses sending malware - Classified by TAP Dashboard
dispatch.earliest_time = @d
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","to","from","qid","duration"]
display.general.type = visualizations
display.page.search.mode = verbose
display.page.search.tab = visualizations
display.statistics.rowNumbers = 1
display.statistics.show = 0
display.visualizations.chartHeight = 394
display.visualizations.charting.chart = bar
request.ui_dispatch_app = pps_ondemand
request.ui_dispatch_view = search
search = `pps_get_index` sourcetype="proofpoint_tap_siem" | eval classification=if(isnotnull(classification), classification, 'threatsInfoMap{}.classification') | search classification=malware | top limit=20 senderIP

[TAP Dashboard Threats & Recipients]
action.email.useNSSubject = 1
alert.track = 0
dispatch.earliest_time = @d
dispatch.latest_time = now
display.events.fields = ["host","source","sourcetype","to","from","qid","duration","rule"]
display.general.type = statistics
display.page.search.mode = verbose
display.page.search.tab = statistics
display.statistics.rowNumbers = 1
display.visualizations.chartHeight = 394
display.visualizations.charting.chart = line
display.visualizations.show = 0
request.ui_dispatch_app = pps_ondemand
request.ui_dispatch_view = search
search = `pps_get_index` sourcetype="proofpoint_tap_siem" threatsInfoMap{}.threat=* | eval Date=strftime(_time, "%+") | rename threatsInfoMap{}.threat as Threats, recipient{} as Recipient, threatsInfoMap{}.campaignID as CampaignID | table Date, Threats, Recipient, CampaignID

[Email Volume by Recipient Domain Name]
action.email.useNSSubject = 1
alert.track = 0
description = Distinct count of received messages by Recipient domain name.
dispatch.earliest_time = @d
dispatch.latest_time = now
display.general.type = statistics
display.page.search.mode = fast
display.page.search.tab = statistics
display.visualizations.show = 0
request.ui_dispatch_app = pps_ondemand
request.ui_dispatch_view = search
search = | tstats `summariesonly` dc(Message_Log.msg_normalized_header_message_id) as Count from datamodel=pps_ondemand where Message_Log.filter.routeDirection="inbound" by Message_Log.msg_normalized_header_to | rex field=Message_Log.msg_normalized_header_to "(?<=@)(?<domain>([a-zA-z0-9.-]*))" | stats sum(Count) as "Messages Received" by domain | rename domain as "Domain Name" | sort 0 - "Messages Received"

[Email Volume by Sender Domain Name]
action.email.useNSSubject = 1
alert.track = 0
description = Distinct count of sent messages by Sender domain name.
dispatch.earliest_time = @d
dispatch.latest_time = now
display.general.type = statistics
display.page.search.mode = fast
display.page.search.tab = statistics
display.visualizations.show = 0
request.ui_dispatch_app = pps_ondemand
request.ui_dispatch_view = search
search = | tstats `summariesonly` dc(Message_Log.msg_normalized_header_message_id) as Count from datamodel=pps_ondemand where Message_Log.filter.routeDirection="outbound" by Message_Log.msg_normalized_header_from | rex field=Message_Log.msg_normalized_header_from "(?<=@)(?<domain>([a-zA-z0-9.-]*))" | stats sum(Count) as "Messages Sent" by domain | rename domain as "Domain Name" | sort 0 - "Messages Sent"