[Optiv - Decept - System Connections]
action.email.useNSSubject = 1
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
dispatch.earliest_time = -3d@h
dispatch.latest_time = now
request.ui_dispatch_app = optiv_decept_system
request.ui_dispatch_view = search
search = `optiv_index` sourcetype=optiv_TA_decept  \
| transaction host,sourcetype maxspan=2m maxpause=20s startswith=" Connection #" endswith="Bytes in" \
| search NOT [| inputlookup decept_known_src_ip_lookup.csv | fields src_ip] \
| search NOT [| inputlookup decept_known_dest_port_lookup.csv | fields dest_port] \
| lookup dnslookup clientip as src_ip OUTPUT clienthost as hostname \
| table _time src_ip hostname dest_port application bytes_in signature dest_host \

[Optiv - Decept - Username / Password Combo Used]
action.email.useNSSubject = 1
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
dispatch.earliest_time = -3d@h
dispatch.latest_time = now
request.ui_dispatch_app = optiv_decept_system
request.ui_dispatch_view = search
search = `optiv_index` sourcetype=optiv_TA_decept \
| transaction startswith="TCP Connection #" endswith="Closing connection" maxspan=140s \
| search user=* password=* src_ip=* dest_ip=* user!=SSH-* user!="\\x*" password!="\\x*" \
| lookup dnslookup clientip as src_ip OUTPUT clienthost as hostname | iplocation src_ip | fields - lat - lon

[Optiv - Decept - Passwords used 72h]
action.email.useNSSubject = 1
alert.suppress = 0
alert.track = 0
auto_summarize.dispatch.earliest_time = -1d@h
disabled = 0
dispatch.earliest_time = -3d@h
dispatch.latest_time = now
display.general.timeRangePicker.show = 0
display.visualizations.show = 0
request.ui_dispatch_app = optiv_decept_system
request.ui_dispatch_view = search
search = `optiv_index` sourcetype=optiv_TA_decept password=*

#[Optiv Decept - Alert on system connections - Email alert]
#disabled = 1
#action.email = 1
#action.email.priority = 2
#action.email.sendpdf = 1
#action.email.sendresults = 1
#action.email.to = security_team@example.com
#action.email.useNSSubject = 1
#alert.digest_mode = True
#alert.expires = 2d
#alert.suppress = 1
#alert.suppress.period = 10h
#alert.track = 0
#auto_summarize.dispatch.earliest_time = -1d@h
#counttype = number of events
#cron_schedule = 45 3,15 * * *
#description = Send email alert when a host has connected to the decept system
#dispatch.earliest_time = 0
#display.general.timeRangePicker.show = 0
#display.page.search.mode = fast
#display.visualizations.show = 0
#enableSched = 1
#quantity = 0
#relation = greater than
#request.ui_dispatch_app = optiv_decept_system
#request.ui_dispatch_view = search
#schedule_window = 30
#dispatch.earliest_time = -12h
#dispatch.latest_time = now
#search = `optiv_index` sourcetype=optiv_TA_decept \
#| transaction host,sourcetype maxspan=2m maxpause=20s startswith=" Connection #" endswith="Bytes in" \
#| search NOT \
#    [| inputlookup decept_known_src_ip_lookup.csv \
#    | fields src_ip] \
#| search NOT \
#    [| inputlookup decept_known_dest_port_lookup.csv \
#    | fields dest_port] \
#| lookup dnslookup clientip as src_ip

#[Optiv Decept - Potential honeypot problem (no longer running)]
#disabled = 1
#action.email = 1
#action.email.to = security_team@example.com
#action.email.useNSSubject = 1
#alert.digest_mode = True
#alert.suppress = 1
#alert.suppress.period = 12h
#alert.track = 0
#auto_summarize.dispatch.earliest_time = -1d@h
#counttype = number of events
#cron_schedule = 33 */12 * * *
#dispatch.earliest_time = -12h
#dispatch.latest_time = now
#display.general.timeRangePicker.show = 0
#display.general.type = statistics
#display.page.search.mode = fast
#display.page.search.tab = statistics
#display.visualizations.show = 0
#enableSched = 1
#quantity = 0
#relation = not equal to
#request.ui_dispatch_app = optiv_decept_system
#request.ui_dispatch_view = search
#schedule_window = 30
#search = `optiv_index` sourcetype=optiv_TA_decept "Splunk is running" | stats count | where count=0
